000010*****************************************************************
000020*   ŽóŽæŽèŒ`(D642UTG_TBL)
000030*****************************************************************
000040 01  ŽóŽæŽèŒ`.
000050     03  ‚c‚U‚S‚Q|‘ã•\Œ_–ñ”Ô†
000060                               PIC  X(010).
000070     03  ‚c‚U‚S‚Q|‘©”        PIC S9(003) PACKED-DECIMAL.
000080     03  ‚c‚U‚S‚Q|ŽæˆøæƒR[ƒh
000090                               PIC  X(009).
000100     03  ‚c‚U‚S‚Q|Œ_–ñæƒR[ƒh
000110                               PIC  X(005).
000120     03  ‚c‚U‚S‚Q|Œ_–ñæ–¼Ì  PIC  X(040).
000130     03  ‚c‚U‚S‚Q|Œ_–ñæ–¼ÌƒJƒi
000140                               PIC  X(040).
000150     03  ‚c‚U‚S‚Q|•”“XƒR[ƒh  PIC  X(004).
000160     03  ‚c‚U‚S‚Q|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
000170     03  ‚c‚U‚S‚Q|ŽèŒ`ó‘Ô    PIC  X(001).
000180     03  ‚c‚U‚S‚Q|Žæˆø“ú      PIC  X(008).
000190     03  ‚c‚U‚S‚Q|“`•[”­s“ú  PIC  X(008).
000200     03  ‚c‚U‚S‚Q|ŽèŒ`Ží—Þ    PIC  X(001).
000210     03  ‚c‚U‚S‚Q|Šú“úŠî€“ú  PIC  X(008).
000220     03  ‚c‚U‚S‚Q|Šú“úƒTƒCƒNƒ‹
000230                               PIC S9(002) PACKED-DECIMAL.
000240     03  ‚c‚U‚S‚Q|‘©‡Œv‹àŠz  PIC S9(013) PACKED-DECIMAL.
000250     03  ‚c‚U‚S‚Q|ŽèŒ`–‡”    PIC S9(004) PACKED-DECIMAL.
000260     03  ‚c‚U‚S‚Q|Žæ—§‹âsƒR[ƒh
000270                               PIC  X(007).
000280     03  ‚c‚U‚S‚Q|Žx•¥‹âsƒR[ƒh
000290                               PIC  X(007).
000300     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚P  PIC  X(010).
000310     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚Q  PIC  X(010).
000320     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚R  PIC  X(010).
000330     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚S  PIC  X(010).
000340     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚T  PIC  X(010).
000350     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚U  PIC  X(010).
000360     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚V  PIC  X(010).
000370     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚W  PIC  X(010).
000380     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚X  PIC  X(010).
000390     03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚P‚O
000400                               PIC  X(010).
000410     03  ‚c‚U‚S‚Q|”õl—“      PIC  X(040).
000420     03  ‚c‚U‚S‚Q|ŽèŒ`“à—eŽí•Ê
000430                               PIC  X(001).
000440     03  ‚c‚U‚S‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
000450     03  ‚c‚U‚S‚Q|“o˜^ŽžŠÔ    PIC  X(008).
000460     03  ‚c‚U‚S‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
000470     03  ‚c‚U‚S‚Q|XV”NŒŽ“ú  PIC  X(008).
000480     03  ‚c‚U‚S‚Q|XVŽžŠÔ    PIC  X(008).
000490     03  ‚c‚U‚S‚Q|XVŽÒ      PIC  X(008).
000500     03  ‚c‚U‚S‚Q|“ü—Í’S“–ŽÒƒR[ƒh
000510                               PIC  X(008).
000520     03  ‚c‚U‚S‚Q|”„‹p‘ã‹à‹æ•ª
000530                               PIC  X(001).
000540     03  ‚c‚U‚S‚Q|UolŽæˆøæƒR[ƒh
000550                               PIC  X(009).
000560     03  ‚c‚U‚S‚Q|UolŒ_–ñæƒR[ƒh
000570                               PIC  X(005).
000580     03  ‚c‚U‚S‚Q|Uol–¼Ì  PIC  X(040).
000590     03  ‚c‚U‚S‚Q|Uol–¼ÌƒJƒi
000600                               PIC  X(040).
