-- このアセンブリによって実装された異なる SQL オブジェクトを実行するクエリの例

-----------------------------------------------------------------------------------------
-- ストアド プロシージャ
-----------------------------------------------------------------------------------------
exec SP_SYAIN 200007,N'200007'

-----------------------------------------------------------------------------------------
-- ユーザー定義関数
-----------------------------------------------------------------------------------------
-- select dbo.FunctionName()


select 'プロジェクトを実行するには、プロジェクトの Test.sql ファイルを編集します。このファイルは、ソリューション エクスプローラの [Test Scripts] フォルダにあります。'

  
