000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CH101.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060       SELECT PRINT-FILE ASSIGN TO PRINTER.
000070 DATA DIVISION.
000080 FILE SECTION.
000090 FD PRINT-FILE LABEL RECORD IS OMITTED.
000100 01 P-REC PIC X(80).
000110 WORKING-STORAGE SECTION.
000120 01 STAR.
000130   03 S1 PIC X(7) VALUE "   *   ".
000140   03 S2 PIC X(7) VALUE "  ***  ".
000150   03 S3 PIC X(7) VALUE " ***** ".
000160   03 S4 PIC X(7) VALUE "*******".
000170 PROCEDURE DIVISION.
000180 G.      
000190       OPEN OUTPUT PRINT-FILE.
000200       MOVE S1 TO P-REC.
000210       WRITE      P-REC.
000220       MOVE S2 TO P-REC.
000230       WRITE      P-REC.
000240       MOVE S3 TO P-REC.
000250       WRITE      P-REC.
000260       MOVE S4 TO P-REC.
000270       WRITE      P-REC.
000280       CLOSE      PRINT-FILE.
000290       STOP RUN.