000010*--ÅÉÇrÇpÇkã§í ïœêîÅÑ
000030   01  SQLSTATE                      PIC  X(005).
000040   01  DB-STRING                     PIC  X(020).
000050   01  USERNAME                      PIC  X(010).
000060   01  PASSWD                        PIC  X(010).
000070*
