           09  PATTERN                PIC  X(004).
           09  OPTION                 PIC  X(006).
           09  PATTERN-FLG            PIC  X(001).
           09  SQLCODE-AREA           PIC S9(009)  COMP-4.
           09  KEY-LENGTH             PIC  9(003).
           09  TABLE-LENGTH           PIC  9(005).
           09  SQLCA-AREA             PIC  X(180).