000010*****************************************************************
000020*   Ž‘ŽYî•ñƒe[ƒuƒ‹(D921SIJ_TBL)
000030*****************************************************************
000040 01  Ž‘ŽYî•ñƒe[ƒuƒ‹.
000050     03  ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñ”Ô†
000060                               PIC  X(010).
000070     03  ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñŽí—Þ
000080                               PIC  X(003).
000090     03  ‚c‚X‚Q‚P|ƒL[î•ñ|•¨Œ”Ô†
000100                               PIC S9(004) PACKED-DECIMAL.
000110     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ÄƒŠ[ƒX‰ñ”
000120                               PIC S9(002) PACKED-DECIMAL.
000130     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŽåŒ_–ñ‹æ•ª
000140                               PIC  X(001).
000150     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñ‹æ•ª
000160                               PIC  X(001).
000170     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|‹¦’²‹æ•ª
000180                               PIC  X(001).
000190     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñŠJŽn“ú
000200                               PIC  X(008).
000210     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñI—¹“ú
000220                               PIC  X(008).
000230     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŠúŠÔ
000240                               PIC S9(003) PACKED-DECIMAL.
000250     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ˆø“n”NŒŽ“ú
000260                               PIC  X(008).
000270     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒŸŽûˆ—”NŒŽ
000280                               PIC  X(006).
000290     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñˆ—”NŒŽ
000300                               PIC  X(006).
000310     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|¬–ñ”NŒŽ“ú
000320                               PIC  X(008).
000330     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒŸŽûŽæÁ”NŒŽ“ú
000340                               PIC  X(008).
000350     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒŸŽûŽæÁˆ—”NŒŽ
000360                               PIC  X(006).
000370     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
000380                               PIC  X(008).
000390     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|’S“–•”‰ÛƒR[ƒh
000400                               PIC  X(004).
000410     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|’S“–ŽÒƒR[ƒh
000420                               PIC  X(008).
000430     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŽæˆøæƒR[ƒh
000440                               PIC  X(009).
000450     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñæƒR[ƒh
000460                               PIC  X(005).
000470     03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒÚ‹q‹æ•ª
000480                               PIC  X(002).
000490     03  ‚c‚X‚Q‚P|ÂŒ |Š¨’èˆ—ƒR[ƒh
000500                               PIC S9(002) PACKED-DECIMAL.
000510     03  ‚c‚X‚Q‚P|•¨Œ|Žæ“¾”NŒŽ“ú
000520                               PIC  X(008).
000530     03  ‚c‚X‚Q‚P|•¨Œ|ˆÚ“®”NŒŽ“ú
000540                               PIC  X(008).
000550     03  ‚c‚X‚Q‚P|•¨Œ|ó‘Ôƒtƒ‰ƒO
000560                               PIC  X(001).
000570     03  ‚c‚X‚Q‚P|•¨Œ|ˆÚ“®——R
000580                               PIC  X(002).
000590     03  ‚c‚X‚Q‚P|•¨Œ|•¨Œˆ•ª˜A”Ô
000600                               PIC S9(003) PACKED-DECIMAL.
000610     03  ‚c‚X‚Q‚P|•¨Œ|Žæ“¾‰¿Šz
000620                               PIC S9(013) PACKED-DECIMAL.
000630     03  ‚c‚X‚Q‚P|•¨Œ|ŽæÁŽæ“¾‰¿Šz
000640                               PIC S9(013) PACKED-DECIMAL.
000650     03  ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz
000660                               PIC S9(013) PACKED-DECIMAL.
000670     03  ‚c‚X‚Q‚P|•¨Œ|Žc‰¿‹æ•ª
000680                               PIC  X(001).
000690     03  ‚c‚X‚Q‚P|•¨Œ|Œ_–ñŽc‰¿Ý’èŠz
000700                               PIC S9(013) PACKED-DECIMAL.
000710     03  ‚c‚X‚Q‚P|•¨Œ|‘¼ŽÐw“üŠz
000720                               PIC S9(013) PACKED-DECIMAL.
000730     03  ‚c‚X‚Q‚P|•¨Œ|‘¼ŽÐŽc‰¿Ý’èŠz
000740                               PIC S9(013) PACKED-DECIMAL.
000750     03  ‚c‚X‚Q‚P|•¨Œ|’èŠz|ŒŽŠzž‹p”ï
000760                               PIC S9(013) PACKED-DECIMAL.
000770     03  ‚c‚X‚Q‚P|•¨Œ|’èŠz|ŒŽŠzž‹p”ï’[”
000780                               PIC S9(013) PACKED-DECIMAL.
000790     03  ‚c‚X‚Q‚P|•¨Œ|•¨ŒƒŠ[ƒX—¿
000800                               PIC S9(013) PACKED-DECIMAL.
000810     03  ‚c‚X‚Q‚P|•¨Œ|”—Ê  PIC S9(005) PACKED-DECIMAL.
000820     03  ‚c‚X‚Q‚P|•¨Œ|Ž‘ŽYŽí—Þ
000830                               PIC  X(007).
000840     03  ‚c‚X‚Q‚P|•¨Œ|‘Ï—p”N”
000850                               PIC S9(002) PACKED-DECIMAL.
000860     03  ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽí—Þ
000870                               PIC  X(002).
000880     03  ‚c‚X‚Q‚P|•¨Œ|Ž©‘¼ŽÐ‹æ•ª
000890                               PIC  X(001).
000900     03  ‚c‚X‚Q‚P|•¨Œ|ƒ\ƒtƒg‹æ•ª
000910                               PIC  X(001).
000920     03  ‚c‚X‚Q‚P|•¨Œ|­ŠzŽ‘ŽY‹æ•ª
000930                               PIC  X(001).
000940     03  ‚c‚X‚Q‚P|•¨Œ|’†ŒÃŽ‘ŽY‹æ•ª
000950                               PIC  X(001).
000960     03  ‚c‚X‚Q‚P|•¨Œ|‰ïŽÐž‹p‹æ•ª
000970                               PIC  X(001).
000980     03  ‚c‚X‚Q‚P|•¨Œ|ŒÅ’èŽ‘ŽYÅ‹æ•ª
000990                               PIC  X(001).
001000     03  ‚c‚X‚Q‚P|•¨Œ|ŠCŠOÝ’uêŠ‹æ•ª
001010                               PIC  X(001).
001020     03  ‚c‚X‚Q‚P|•¨Œ|‹ŒŒ_–ñ”Ô†
001030                               PIC  X(010).
001040     03  ‚c‚X‚Q‚P|•¨Œ|‹Œ•¨Œ”Ô†
001050                               PIC S9(004) PACKED-DECIMAL.
001060     03  ‚c‚X‚Q‚P|•¨Œ|•ªŠ„”NŒŽ“ú
001070                               PIC  X(008).
001080     03  ‚c‚X‚Q‚P|•¨Œ|•ªŠ„Œ³•¨Œ”Ô†
001090                               PIC S9(004) PACKED-DECIMAL.
001100     03  ‚c‚X‚Q‚P|•¨Œ|•¨Œ–¼Ì
001110                               PIC  X(060).
001120     03  ‚c‚X‚Q‚P|•¨Œ|‚eŒ^–¼
001130                               PIC  X(025).
001140     03  ‚c‚X‚Q‚P|•¨Œ|ƒfƒB[ƒ‰Žæˆøæ
001150                               PIC  X(009).
001160     03  ‚c‚X‚Q‚P|•¨Œ|ƒfƒB[ƒ‰ƒR[ƒh
001170                               PIC  X(005).
001180     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñ\¿ƒtƒ‰ƒO
001190                               PIC  X(001).
001200     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñƒtƒ‰ƒO
001210                               PIC  X(001).
001220     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñ”NŒŽ“ú
001230                               PIC  X(008).
001240     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñˆ—”NŒŽ
001250                               PIC  X(006).
001260     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñŽæÁˆ—”NŒŽ
001270                               PIC  X(006).
001280     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñ——R
001290                               PIC  X(002).
001300     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñ‹æ•ª
001310                               PIC  X(001).
001320     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñŒŽ”
001330                               PIC S9(003) PACKED-DECIMAL.
001340     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñŽæÁƒtƒ‰ƒO
001350                               PIC  X(001).
001360     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|ŽæÁ‰ð–ñ“ú
001370                               PIC  X(008).
001380     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|–ž—¹ˆ—”NŒŽ
001390                               PIC  X(006).
001400     03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|–ž—¹ŽæÁˆ—”NŒŽ
001410                               PIC  X(006).
001420     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pƒtƒ‰ƒO
001430                               PIC  X(001).
001440     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|•¨Œˆ•ª‹æ•ª
001450                               PIC  X(001).
001460     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|\¿ó‘Ôƒtƒ‰ƒO
001470                               PIC  X(001).
001480     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|•¨Œˆ•ª\¿˜A”Ô
001490                               PIC S9(002) PACKED-DECIMAL.
001500     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|ˆ•ªæŽæˆøæƒR[ƒh
001510                               PIC  X(009).
001520     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|ˆ•ªæƒR[ƒh
001530                               PIC  X(005).
001540     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”p”NŒŽ“ú
001550                               PIC  X(008).
001560     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pˆ—”NŒŽ
001570                               PIC  X(006).
001580     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pŒŽ”
001590                               PIC S9(003) PACKED-DECIMAL.
001600     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”p——R
001610                               PIC  X(002).
001620     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pŽæÁ‹æ•ª
001630                               PIC  X(001).
001640     03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pŽæÁˆ—”NŒŽ
001650                               PIC  X(006).
001660     03  ‚c‚X‚Q‚P|³Œp|³Œpƒtƒ‰ƒO
001670                               PIC  X(001).
001680     03  ‚c‚X‚Q‚P|³Œp|³Œp“ñŽŸÏƒtƒ‰ƒO
001690                               PIC  X(001).
001700     03  ‚c‚X‚Q‚P|³Œp|³ŒpŒ³Œ_–ñ”Ô†
001710                               PIC  X(010).
001720     03  ‚c‚X‚Q‚P|³Œp|³ŒpŒ³•¨Œ”Ô†
001730                               PIC S9(004) PACKED-DECIMAL.
001740     03  ‚c‚X‚Q‚P|³Œp|³Œpˆ—”NŒŽ
001750                               PIC  X(006).
001760     03  ‚c‚X‚Q‚P|³Œp|³Œp“ú
001770                               PIC  X(008).
001780     03  ‚c‚X‚Q‚P|³Œp|³ŒpŽž•ë‰¿
001790                               PIC S9(013) PACKED-DECIMAL.
001800     03  ‚c‚X‚Q‚P|³Œp|³ŒpŽžž‹p—ÝŒvŠz
001810                               PIC S9(013) PACKED-DECIMAL.
001820     03  ‚c‚X‚Q‚P|³Œp|³ŒpŽæÁ”NŒŽ“ú
001830                               PIC  X(008).
001840     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•t•Û‹æ•ª
001850                               PIC  X(001).
001860     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û“ú
001870                               PIC  X(008).
001880     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û“ú”
001890                               PIC S9(003) PACKED-DECIMAL.
001900     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•t•ÛŠJŽn”NŒŽ“ú
001910                               PIC  X(008).
001920     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•ÛŒ¯—¿
001930                               PIC S9(013) PACKED-DECIMAL.
001940     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ—L–³
001950                               PIC  X(001).
001960     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ“ú
001970                               PIC  X(008).
001980     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯Œp‘±
001990                               PIC  X(001).
002000     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯—¿—¦
002010                               PIC S9(002)V9(007) PACKED-DECIMAL.
002020     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯‰¿Ši
002030                               PIC S9(013) PACKED-DECIMAL.
002040     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•Ô–ß•ÛŒ¯—¿
002050                               PIC S9(013) PACKED-DECIMAL.
002060     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•ÛŒ¯ØŒ””Ô†
002070                               PIC  X(011).
002080     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û—¦
002090                               PIC S9(002) PACKED-DECIMAL.
002100     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz
002110                               PIC S9(013) PACKED-DECIMAL.
002120     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ý’uêŠ–¼ƒJƒi
002130                               PIC  X(080).
002140     03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|”…ž•ÛŒ¯‹æ•ª
002150                               PIC  X(001).
002160     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|M—p•ÛŒ¯‹æ•ª
002170                               PIC  X(001).
002180     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|•ÛŒ¯‰ïŽÐ‹æ•ª
002190                               PIC  X(004).
002200     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|M—p•ÛŒ¯‰ïŽÐƒR[ƒh
002210                               PIC  X(001).
002220     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|‹@ŠB—Þ•ª—ÞƒR[ƒh
002230                               PIC  X(002).
002240     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|’Ê’m‘”­‘—“ú
002250                               PIC  X(008).
002260     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|’Ê’m‘”Ô†
002270                               PIC S9(003) PACKED-DECIMAL.
002280     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|•ÛŒ¯—¿
002290                               PIC S9(013) PACKED-DECIMAL.
002300     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|•„†
002310                               PIC  X(005).
002320     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|Œ_–ñ‘Šz
002330                               PIC S9(013) PACKED-DECIMAL.
002340     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|Tœ‚·‚×‚«‹àŠz
002350                               PIC S9(013) PACKED-DECIMAL.
002360     03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|ˆÈ~‰ñŽûƒTƒCƒg
002370                               PIC S9(002) PACKED-DECIMAL.
002380     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|Žc‘¶—¦
002390                               PIC S9(002)V9(007) PACKED-DECIMAL.
002400     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x”[•tæƒR[ƒh
002410                               PIC  X(011).
002420     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|”[•tæƒR[ƒh
002430                               PIC  X(006).
002440     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|ŒÅ’èŽ‘ŽYÅ—¦
002450                               PIC S9(002)V9(007) PACKED-DECIMAL.
002460     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘ÎÛŽæ“¾‰¿Šz
002470                               PIC S9(013) PACKED-DECIMAL.
002480     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|”NÅŠz
002490                               PIC S9(013) PACKED-DECIMAL.
002500     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x•]‰¿Šz
002510                               PIC S9(013) PACKED-DECIMAL.
002520     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x—˜_•ë‰¿
002530                               PIC S9(013) PACKED-DECIMAL.
002540     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|“–”N“x•]‰¿Šz
002550                               PIC S9(013) PACKED-DECIMAL.
002560     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|“–”N“x—˜_•ë‰¿
002570                               PIC S9(013) PACKED-DECIMAL.
002580     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|Žc‘¶“ž’Bƒtƒ‰ƒO
002590                               PIC  X(001).
002600     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|Žc‘¶“ž’B”NŒŽ
002610                               PIC  X(006).
002620     03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|\ƒtƒ‰ƒO
002630                               PIC  X(001).
002640     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽó‘Ôƒtƒ‰ƒO
002650                               PIC  X(001).
002660     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽŒŸŽûˆ—”NŒŽ
002670                               PIC  X(006).
002680     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽŒ_–ñŠJŽn“ú
002690                               PIC  X(008).
002700     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽÄƒŠ[ƒX‰ñ”
002710                               PIC S9(002) PACKED-DECIMAL.
002720     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ‰ð–ñ“ú
002730                               PIC  X(008).
002740     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ‰ð–ñ”NŒŽ
002750                               PIC  X(006).
002760     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ”„”p“ú
002770                               PIC  X(008).
002780     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ”„”p”NŒŽ
002790                               PIC  X(006).
002800     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ”„”p——R
002810                               PIC  X(002).
002820     03  ‚c‚X‚Q‚P|‘OŒŽ|ŽæÁ‰ð–ñ——R
002830                               PIC  X(002).
002840     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŠú‰ð–ñ”NŒŽ“ú
002850                               PIC  X(008).
002860     03  ‚c‚X‚Q‚P|‘OŒŽ|‘k‹yˆ—‹æ•ª
002870                               PIC  X(001).
002880     03  ‚c‚X‚Q‚P|‘OŒŽ|‘k‹yˆ—”NŒŽ
002890                               PIC  X(006).
002900     03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽŒo‰ßŒŽ”
002910                               PIC S9(003) PACKED-DECIMAL.
002920     03  ‚c‚X‚Q‚P|‹¤’Ê|Šú––”NŒŽ
002930                               PIC  X(006).
002940     03  ‚c‚X‚Q‚P|‹¤’Ê|ŠúŽñ”NŒŽ
002950                               PIC  X(006).
002960     03  ‚c‚X‚Q‚P|‹¤’Ê|ŒŽŽŸ”NŒŽ
002970                               PIC  X(006).
002980     03  ‚c‚X‚Q‚P|‹¤’Ê|’Ç‰ÁŒ¸­ƒtƒ‰ƒO
002990                               PIC  X(001).
003000     03  ‚c‚X‚Q‚P|‹¤’Ê|Žæ“¾”N“x
003010                               PIC  X(004).
003020     03  ‚c‚X‚Q‚P|‹¤’Ê|ž‹pŒŽ”
003030                               PIC S9(003) PACKED-DECIMAL.
003040     03  ‚c‚X‚Q‚P|‹¤’Ê|“–ŒŽ–˜ž‹pŒo‰ßŒŽ”
003050                               PIC S9(003) PACKED-DECIMAL.
003060     03  ‚c‚X‚Q‚P|‹¤’Ê|“–Šúž‹pŒŽ”
003070                               PIC S9(013) PACKED-DECIMAL.
003080     03  ‚c‚X‚Q‚P|‹¤’Ê|ˆ—‹æ•ª
003090                               PIC  X(001).
003100     03  ‚c‚X‚Q‚P|‹¤’Ê|“–ŒŽž‹p‘ÎÛƒtƒ‰ƒO
003110                               PIC  X(001).
003120     03  ‚c‚X‚Q‚P|‹¤’Ê|’è—¦ž‹p’²®‰Â”\ƒtƒ‰ƒO
003130                               PIC  X(001).
003140     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|ž‹p’âŽ~ƒtƒ‰ƒO
003150                               PIC  X(001).
003160     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|ž‹p’âŽ~“ú
003170                               PIC  X(008).
003180     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú––•ë‰¿
003190                               PIC S9(013) PACKED-DECIMAL.
003200     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú–˜ž‹pŠz—ÝŒv
003210                               PIC S9(013) PACKED-DECIMAL.
003220     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|ž‹pŽc‰¿Ý’èŠz
003230                               PIC S9(013) PACKED-DECIMAL.
003240     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŒŽž‹pŠz
003250                               PIC S9(013) PACKED-DECIMAL.
003260     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŒŽ–˜ž‹pŠz—ÝŒv
003270                               PIC S9(013) PACKED-DECIMAL.
003280     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|Œ»Ý•ë‰¿
003290                               PIC S9(013) PACKED-DECIMAL.
003300     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|œ‹p•ë‰¿
003310                               PIC S9(013) PACKED-DECIMAL.
003320     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|“–ŒŽ–˜ž‹pŠz—ÝŒv
003330                               PIC S9(013) PACKED-DECIMAL.
003340     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|“–ŒŽž‹pŠz
003350                               PIC S9(013) PACKED-DECIMAL.
003360     03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|“–Šúž‹pŠz
003370                               PIC S9(013) PACKED-DECIMAL.
003380     03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú––•ë‰¿
003390                               PIC S9(013) PACKED-DECIMAL.
003400     03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú–˜ž‹pŠz—ÝŒv
003410                               PIC S9(013) PACKED-DECIMAL.
003420     03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŒŽž‹pŠz
003430                               PIC S9(013) PACKED-DECIMAL.
003440     03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŒŽ–˜ž‹pŠz—ÝŒv
003450                               PIC S9(013) PACKED-DECIMAL.
003460     03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|Œ»Ý•ë‰¿
003470                               PIC S9(013) PACKED-DECIMAL.
003480     03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽ–˜ž‹pŠz—ÝŒv
003490                               PIC S9(013) PACKED-DECIMAL.
003500     03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽž‹pŠz
003510                               PIC S9(013) PACKED-DECIMAL.
003520     03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–Šúž‹pŠz
003530                               PIC S9(013) PACKED-DECIMAL.
003540     03  ‚c‚X‚Q‚P|Å–±|ž‹p—¦
003550                               PIC S9(002)V9(007) PACKED-DECIMAL.
003560     03  ‚c‚X‚Q‚P|Å–±|Š„‘ž‹p
003570                               PIC  X(002).
003580     03  ‚c‚X‚Q‚P|Å–±|Š„‘ž‹p—¦
003590                               PIC S9(002)V9(007) PACKED-DECIMAL.
003600     03  ‚c‚X‚Q‚P|Å–±|Š„‘ž‹p”ï
003610                               PIC S9(013) PACKED-DECIMAL.
003620     03  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p—¦•ªŽq
003630                               PIC S9(002) PACKED-DECIMAL.
003640     03  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p—¦•ª•ê
003650                               PIC S9(003) PACKED-DECIMAL.
003660     03  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p”ï
003670                               PIC S9(013) PACKED-DECIMAL.
003680     03  ‚c‚X‚Q‚P|Å–±|‘OŠú––ŽÀŽ{Šz•ë‰¿
003690                               PIC S9(013) PACKED-DECIMAL.
003700     03  ‚c‚X‚Q‚P|Å–±|‘OŠúŽÀŽ{Šz—ÝŒv
003710                               PIC S9(013) PACKED-DECIMAL.
003720     03  ‚c‚X‚Q‚P|Å–±|‘OŠúŒJ‰z’´‰ßŠz
003730                               PIC S9(013) PACKED-DECIMAL.
003740     03  ‚c‚X‚Q‚P|Å–±|‘OŠúž‹p•s‘«Šz
003750                               PIC S9(013) PACKED-DECIMAL.
003760     03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŒÀ“xŠz
003770                               PIC S9(013) PACKED-DECIMAL.
003780     03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŽÀŽ{Šz
003790                               PIC S9(013) PACKED-DECIMAL.
003800     03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŽÀŽ{Šz—ÝŒv
003810                               PIC S9(013) PACKED-DECIMAL.
003820     03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹p•s‘«Šz
003830                               PIC S9(013) PACKED-DECIMAL.
003840     03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹p’´‰ßŠz
003850                               PIC S9(013) PACKED-DECIMAL.
003860     03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹p‚Ö‚ÌU‘ÖŠz
003870                               PIC S9(013) PACKED-DECIMAL.
003880     03  ‚c‚X‚Q‚P|Å–±|“–Šú––ŽÀŽ{Šz•ë‰¿
003890                               PIC S9(013) PACKED-DECIMAL.
003900     03  ‚c‚X‚Q‚P|Å–±|\Žc‘¶“ž’Bƒtƒ‰ƒO
003910                               PIC  X(001).
003920     03  ‚c‚X‚Q‚P|Å–±|Å–±\Žc‘¶“ž’B”NŒŽ
003930                               PIC  X(006).
003940     03  ‚c‚X‚Q‚P|Å–±|‘OŠú–––@’è•ë‰¿
003950                               PIC S9(013) PACKED-DECIMAL.
003960     03  ‚c‚X‚Q‚P|Å–±|“–Šú–––@’è•ë‰¿
003970                               PIC S9(013) PACKED-DECIMAL.
003980     03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|“o˜^”NŒŽ“ú
003990                               PIC  X(008).
004000     03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|“o˜^ŽžŠÔ
004010                               PIC  X(008).
004020     03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|“o˜^’S“–ŽÒ
004030                               PIC  X(008).
004040     03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|XV”NŒŽ“ú
004050                               PIC  X(008).
004060     03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|XVŽžŠÔ
004070                               PIC  X(008).
004080     03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|XVŽÒ
004090                               PIC  X(008).
004100     03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|“ü—Í’S“–ŽÒƒR[ƒh
004110                               PIC  X(008).
