       IDENTIFICATION DIVISION.
       PROGRAM-ID.   FILECOPY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
             SELECT TBL-CUSTOMER ASSIGN TO TBLCUSTOMER
             ORGANIZATION IS       INDEXED
             ACCESS MODE IS RANDOM
             RECORD KEY CUSTOMER OF TBL-CUSTOMER-REC
                FILE STATUS  SYS-FILE-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD TBL-CUSTOMER LABEL RECORD IS STANDARD .
       01 TBL-CUSTOMER-REC.
          COPY TBLCUSTOMER.
000191 WORKING-STORAGE SECTION.
000192 01 SYS-FILE-STATUS   PIC  X(2)  VALUE "00".
       01 TBL-CUSTOMER-DATA.
          03 REC1.
             05  CUSTOMER      PIC  X(4)  VALUE "1001".
             05  CUSTOMER-NAME PIC  X(10) VALUE "ZHANGSAN".
             05  CUSTOMER-ADDRESS   PIC  X(20) VALUE "AAAAAA".
             05  CITY          PIC  X(20) VALUE "NANJING".
          03 REC2.
             05  CUSTOMER      PIC  X(4)  VALUE "1002".
             05  CUSTOMER-NAME PIC  X(10) VALUE "ZHANGSAN".
             05  CUSTOMER-ADDRESS       PIC  X(20) VALUE "AAAAAA".
             05  CUSTOMER-CITY          PIC  X(20) VALUE "NANJING".
       01 TBL-CUSTOMER-RE REDEFINES  TBL-CUSTOMER-DATA.
          03 RECTABLE OCCURS  2 TIMES.
             COPY TBLCUSTOMER.
       01 WK-CNT.
          03 REC-CNT  PIC 99 VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN.
           OPEN OUTPUT TBL-CUSTOMER.
           DISPLAY "1" , SYS-FILE-STATUS.
           STOP 1.
           ADD 1 TO REC-CNT.
      *
           PERFORM L100 2 TIMES.
      *
           CLOSE TBL-CUSTOMER.
           STOP RUN.
       L100.
           MOVE RECTABLE(REC-CNT) TO TBL-CUSTOMER-REC.
           WRITE  TBL-CUSTOMER-REC.
           DISPLAY TBL-CUSTOMER-REC.
           ADD 1 TO REC-CNT.
           STOP 1.