000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   IF-PERFORM.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000080 77 PERFORM-N PIC 9 VALUE 9.
000090*
000100 01 COM-99.
000110     03 M1 PIC 99.
000111     03 FILLER PIC X VALUE "*".
000120 	   03 M2 PIC 99.
000121     03 FILLER PIC X VALUE "=".
000130 	   03 MM  PIC 99.
000140* 		
000150 01 SHOW-99.
000160 	  03 SHOW-M1 PIC 99.
000170 	  03 FILLER PIC X .
000180 	  03 SHOW-M2 PIC 99.
000190 	  03 FILLER PIC X .
000200    03 SHOW-MM  PIC 99.
000240 PROCEDURE DIVISION. 
000250* L-1
000260 S-MAIN.   
000270*  
000280		DISPLAY "HELLO PERFORM". 
000290*
000300		PERFORM S-PERFORM  THRU S-PERFORM-END 
000310			UNTIL PERFORM-N = 0.
000320*
000330		DISPLAY "99 SHOW END!".
000331          STOP 1.
000340		STOP RUN.
000350* L-2
000360 S-PERFORM.
000370      PERFORM MENU-SHOW.
000380      DISPLAY "PERFORM-N=" WITH NO ADVANCING.
000390      ACCEPT PERFORM-N.
000391	    DISPLAY " ".
000400      INITIALIZE COM-99.
000410      EVALUATE PERFORM-N 
000420          WHEN 1 PERFORM PERFORM-TIMES
000430		WHEN 2 PERFORM PERFORM-UNTIL    	
000440      	WHEN 3 PERFORM PERFORM-VARYING
000450		WHEN OTHER GO TO S-PERFORM-END
000460      END-EVALUATE.
000470 
000480 S-PERFORM-END.
000490 		EXIT.  
000500* L-3  
000510 MENU-SHOW.    
000520		DISPLAY "PERFORM-N=0 STOP RUN".     
000530     	DISPLAY "PERFORM-N=1 PERFORM TIMES".
000540     	DISPLAY "PERFORM-N=2 PERFORM UNTIL" .
000550     	DISPLAY "PERFORM-N=3 PERFORM VARYING".
000560*
000570 PERFORM-TIMES.
000580 		DISPLAY "PERFORM TIMES".
000590 		PERFORM PERFORM-TIMES-SUB THRU PERFORM-TIMES-END 9 TIMES.	
000600*
000610 PERFORM-UNTIL.
000620 		DISPLAY "PERFORM UNTIL".
000630 		PERFORM PERFORM-UNTIL-SUB THRU PERFORM-UNTIL-END 
000640 			UNTIL M1 > 8.		
000650*
000660 PERFORM-VARYING.
000670 		DISPLAY "PERFORM VARYING".
000680		PERFORM PERFORM-VARYING-SUB THRU PERFORM-VARYING-END
000690	        VARYING M1 FROM 1 BY 1 UNTIL M1 > 9 
000700          AFTER  M2 FROM 1 BY 1 UNTIL M2 > M1. 
000710* L-4
000720 PERFORM-TIMES-SUB.
000730 		ADD 1 TO M1.
000731		MOVE 1 TO M2.
000740 		PERFORM M1 TIMES
000750 			COMPUTE MM = M1 * M2
000770 			MOVE COM-99 TO SHOW-99
000780 			DISPLAY SHOW-99 WITH NO ADVANCING
000781			DISPLAY "  " WITH NO ADVANCING
000782                  ADD 1 TO M2
000791 		END-PERFORM.
000800 		DISPLAY "  ".
000810 PERFORM-TIMES-END.
000820 		EXIT.
000830*
000840 PERFORM-UNTIL-SUB.
000850 		ADD 1 TO M1.
000851          MOVE 1 TO M2.
000860 		PERFORM UNTIL M2 > M1
000870 			COMPUTE MM = M1 * M2
000890 			MOVE COM-99 TO SHOW-99
000900 			DISPLAY SHOW-99 WITH NO ADVANCING
000901                  DISPLAY "  " WITH NO ADVANCING
000902			ADD 1 TO M2
000910 		END-PERFORM.
000920 		DISPLAY "  ".
000930 PERFORM-UNTIL-END.
000940 		EXIT.     
000950*
000960 PERFORM-VARYING-SUB.
000970  	COMPUTE MM = M1 * M2.
000980 		MOVE COM-99 TO SHOW-99.
000990 		DISPLAY SHOW-99 WITH NO ADVANCING.
000991          DISPLAY "  " WITH NO ADVANCING.
001000 		IF M1 = M2   DISPLAY "  ".
001010 PERFORM-VARYING-END.
001020 END PROGRAM IF-PERFORM.
