000100 IDENTIFICATION DIVISION.                                         00010000
000200*                                                                 00020000
000300 PROGRAM-ID.    DYNAM3.                                           00030000
000400*                                                                 00040000
000500 ENVIRONMENT DIVISION.                                            00050000
000600*                                                                 00060000
000700 INPUT-OUTPUT SECTION.                                            00070000
000800*                                                                 00080000
000900 FILE-CONTROL.                                                    00090000
001000*                                                                 00100000
001100 DATA DIVISION.                                                   00110000
001200*                                                                 00120000
001300 FILE SECTION.                                                    00130000
001400*                                                                 00140000
001500 WORKING-STORAGE SECTION.                                         00150000
001600*                                                                 00160000
001700 01  SWITCHES.                                                    00170000
001800*                                                                 00180000
001900     05  END-OF-SELECTS-SW           PIC X    VALUE 'N'.          00190000
002000         88  END-OF-SELECTS                   VALUE 'Y'.          00200000
002100     05  END-OF-BROWSES-SW           PIC X    VALUE 'N'.          00210000
002200         88  END-OF-BROWSES                   VALUE 'Y'.          00220000
002300     05  END-OF-CUSTOMERS-SW         PIC X    VALUE 'N'.          00230000
002400         88  END-OF-CUSTOMERS                 VALUE 'Y'.          00240000
002500*                                                                 00250000
002600 01  WORK-FIELDS.                                                 00260000
002700*                                                                 00270000
002800     05  TABLE-NAME                  PIC X(18).                   00280000
002900     05  HIGH-CUSTOMER-NUMBER        PIC X(6).                    00290000
003000     05  LOW-CUSTOMER-NUMBER         PIC X(6).                    00300000
003100     05  SELECT-STATEMENT.                                        00310000
003200         49  SELECT-STATEMENT-LEN    PIC S9(4) COMP VALUE +320.   00320000
003300         49  SELECT-STATEMENT-TEXT   PIC X(320).                  00330000
003400     05  EDITED-SQLCODE              PIC -(4).                    00340000
003500     05  FNAME-STRING.                                            00350000
003600         10  FNAME-INITIAL           PIC X.                       00360000
003700         10  FILLER                  PIC X(19).                   00370000
003800*                                                                 00380000
003900     EXEC SQL                                                     00390000
004000         INCLUDE CUSTOMER                                         00400000
004100     END-EXEC.                                                    00410000
004200*                                                                 00420000
004300     EXEC SQL                                                     00430000
004400         INCLUDE SQLCA                                            00440000
004500     END-EXEC.                                                    00450000
004600*                                                                 00460000
004700     EXEC SQL                                                     00470000
004800         DECLARE SELCURS CURSOR FOR DYNAMSELECT                   00480000
004900     END-EXEC.                                                    00490000
005000*                                                                 00500000
005100 PROCEDURE DIVISION.                                              00510000
005200*                                                                 00520000
005300 000-BROWSE-CUSTOMER-TABLES.                                      00530000
005400*                                                                 00540000
005500     PERFORM 100-BROWSE-CUSTOMER-TABLE                            00550000
005600         UNTIL END-OF-SELECTS.                                    00560000
005700     STOP RUN.                                                    00570000
005800*                                                                 00580000
005900 100-BROWSE-CUSTOMER-TABLE.                                       00590000
006000*                                                                 00600000
006100     PERFORM 200-GET-TABLE-NAME.                                  00610000
006200     IF NOT END-OF-SELECTS                                        00620000
006300         MOVE 'N' TO END-OF-BROWSES-SW                            00630000
006400         PERFORM 300-PREPARE-SELECT-STATEMENT                     00640000
006500         PERFORM 400-PROCESS-RESULT-TABLE                         00650000
006600             UNTIL END-OF-BROWSES.                                00660000
006700*                                                                 00670000
006800 200-GET-TABLE-NAME.                                              00680000
006900*                                                                 00690000
007000     DISPLAY '--------------------------------------------------'.00700000
007100     DISPLAY ' ENTER THE TABLE NAME TO BROWSE OR 999999 TO QUIT.'.00710000
007200     ACCEPT TABLE-NAME.                                           00720000
007300     IF TABLE-NAME = '999999'                                     00730000
007400         MOVE 'Y' TO END-OF-SELECTS-SW.                           00740000
007500*                                                                 00750000
007600 300-PREPARE-SELECT-STATEMENT.                                    00760000
007700*                                                                 00770000
007800     MOVE SPACES TO SELECT-STATEMENT-TEXT.                        00780000
007900     STRING 'SELECT * FROM MM01.' TABLE-NAME                      00790000
008000            ' WHERE CUSTNO BETWEEN ? AND ?'                       00800000
008100            DELIMITED BY SIZE                                     00810000
008200            INTO SELECT-STATEMENT-TEXT.                           00820000
008300     EXEC SQL                                                     00830000
008400         PREPARE DYNAMSELECT FROM :SELECT-STATEMENT               00840000
008500     END-EXEC.                                                    00850000
008600*                                                                 00860000
008700 400-PROCESS-RESULT-TABLE.                                        00870000
008800*                                                                 00880000
008900     PERFORM 410-GET-SELECTION-RANGE.                             00890000
009000     IF NOT END-OF-BROWSES                                        00900000
009100         MOVE 'N' TO END-OF-CUSTOMERS-SW                          00910000
009200         PERFORM 420-OPEN-RESULT-TABLE-CURSOR                     00920003
009300         PERFORM 430-PROCESS-RESULT-TABLE-ROW                     00930000
009400             UNTIL END-OF-CUSTOMERS                               00940000
009500         PERFORM 460-CLOSE-RESULT-TABLE-CURSOR.                   00950000
009600*                                                                 00960000
009700 410-GET-SELECTION-RANGE.                                         00970000
009800*                                                                 00980000
009900     DISPLAY '--------------------------------------------------'.00990004
010000     DISPLAY ' ENTER THE STARTING CUSTOMER NUMBER OR 999999 '.    01000000
010100     DISPLAY ' TO QUIT OR BROWSE A DIFFERENT TABLE.'.             01010001
010200     ACCEPT LOW-CUSTOMER-NUMBER.                                  01020000
010300     IF LOW-CUSTOMER-NUMBER = '999999'                            01030000
010400         MOVE 'Y' TO END-OF-BROWSES-SW                            01040000
010500     ELSE                                                         01050000
010600         DISPLAY ' ENTER THE ENDING CUSTOMER NUMBER.'             01060003
010700         ACCEPT HIGH-CUSTOMER-NUMBER.                             01070003
010800*                                                                 01080000
010900 420-OPEN-RESULT-TABLE-CURSOR.                                    01090000
011000*                                                                 01100000
011100     EXEC SQL                                                     01110000
011200         OPEN SELCURS USING :LOW-CUSTOMER-NUMBER,                 01120000
011300                            :HIGH-CUSTOMER-NUMBER                 01130000
011400     END-EXEC.                                                    01140000
011500     IF SQLCODE NOT = 0                                           01150000
011600         MOVE 'Y' TO END-OF-CUSTOMERS-SW                          01160000
011700         MOVE SQLCODE TO EDITED-SQLCODE                           01170000
011800         DISPLAY ' PROCESSING ERROR - SQLCODE = ' EDITED-SQLCODE. 01180000
011900*                                                                 01190000
012000 430-PROCESS-RESULT-TABLE-ROW.                                    01200000
012100*                                                                 01210000
012200     PERFORM 440-FETCH-RESULT-TABLE-ROW.                          01220000
012300     IF NOT END-OF-CUSTOMERS                                      01230000
012400         PERFORM 450-DISPLAY-RESULT-TABLE-ROW.                    01240000
012500*                                                                 01250000
012600 440-FETCH-RESULT-TABLE-ROW.                                      01260000
012700*                                                                 01270000
012800     EXEC SQL                                                     01280000
012900         FETCH SELCURS INTO :CUSTOMER-ROW                         01290000
013000     END-EXEC.                                                    01300000
013100     IF SQLCODE = 100                                             01310000
013200         MOVE 'Y' TO END-OF-CUSTOMERS-SW                          01320000
013300         DISPLAY ' THAT IS THE LAST ROW.'                         01330000
013400     ELSE                                                         01340000
013500         IF SQLCODE NOT = 0                                       01350000
013600             MOVE 'Y' TO END-OF-CUSTOMERS-SW                      01360000
013700             MOVE SQLCODE TO EDITED-SQLCODE                       01370000
013800             DISPLAY ' PROCESSING ERROR - SQLCODE = '             01380002
013900                       EDITED-SQLCODE.                            01390000
014000*                                                                 01400000
014100 450-DISPLAY-RESULT-TABLE-ROW.                                    01410000
014200*                                                                 01420000
014300     MOVE FNAME TO FNAME-STRING.                                  01430000
014400     DISPLAY '   ' CUSTNO ' ' FNAME-INITIAL '. ' LNAME            01440000
014500             ' ' CITY ' ' STATE.                                  01450000
014600*                                                                 01460000
014700 460-CLOSE-RESULT-TABLE-CURSOR.                                   01470000
014800*                                                                 01480000
014900     EXEC SQL                                                     01490000
015000         CLOSE SELCURS                                            01500000
015100     END-EXEC.                                                    01510000
015200*                                                                 01520000
