 ALLOCATE F(SYSIN) DA(*)
 ALLOCATE F(SYSOUT) DA(*)
 DSN SYSTEM(DSN)
   RUN PROGRAM(DYNAM3)  -
       PLAN(MM01PLAN)   -
       LIBRARY('MM01.DB2.LOADLIB')
   END
 FREE F(SYSIN)
 FREE F(SYSOUT)
