000010******************************************************************
000020*         ƒŠC‹P“îŒ(‘å˜A)„                                     *
000030*      1. ƒvƒƒOƒ‰ƒ€–¼  : Ž‘ŽYî•ñˆÚs(SUMMIT)                   *
000040*      2. ƒvƒƒOƒ‰ƒ€ID  : COBIS770                               *
000050*      3. ˆ—ŠT—v      : Ž‘ŽYî•ñ‚ð‡ŽŸ“Ç‚Ýž‚Þ,Ž‘ŽY–¾×‚Ì“à—e  *
000060*                       ‚©‚çŽ‘ŽYî•ñ‚É‘Î‚µ‚ÄŠÖ˜A€–Ú‚ðXV‚·‚é,Œ»*
000070*	                      sDB‚æ‚èÚÍÞÙ±¯ÌßŽ‘ŽYî•ñÃ°ÌÞÙ‚ðì¬‚·‚é. *
000080*                                                                *
000090*      4. ì¬ŽÒ        : ÂiP                                 *
000100*      5. ì¬“ú        : 2005.04.01                             *
000110******************************************************************
000120*                                                                 
000130******************************************************************
000140*    ‚h‚c‚d‚m‚s‚h‚e‚h‚b‚`‚s‚h‚n‚m  ‚c‚h‚u‚h‚r‚h‚n‚m              *
000150******************************************************************
000160 IDENTIFICATION                       DIVISION.                   
000170*                                                                 
000180 PROGRAM-ID.                          COBIS770.                   
000190******************************************************************
000200*    ‚d‚m‚u‚h‚q‚n‚m‚l‚d‚m‚s        ‚c‚h‚u‚h‚r‚h‚n‚m              *
000210******************************************************************
000220 ENVIRONMENT                          DIVISION.                   
000230******************************************************************
000240*    ‚h‚m‚o‚t‚s|‚n‚t‚s‚o‚t‚s      ‚r‚d‚b‚s‚h‚n‚m                *
000250******************************************************************
000260 INPUT-OUTPUT                         SECTION.                    
000270 FILE-CONTROL.                                                    
000280*                                                                 
000290     SELECT         “ü—Íƒtƒ@ƒCƒ‹      ASSIGN    TO   U01          
000300     FILE STATUS    IS     ‚v|ó‘Ô                               
000310     ORGANIZATION   IS     LINE       SEQUENTIAL.                 
000320******************************************************************
000330*    ‚c‚`‚s‚`                      ‚c‚h‚u‚h‚r‚h‚n‚m              *
000340******************************************************************
000350 DATA                                 DIVISION.                   
000360******************************************************************
000370*    ‚e‚h‚k‚d                      ‚r‚d‚b‚s‚h‚n‚m                *
000380******************************************************************
000390 FILE                                 SECTION.                    
000400 FD  “ü—Íƒtƒ@ƒCƒ‹                                                 
000410     LABEL     RECORD     IS          STANDARD                    
000420     BLOCK     CONTAINS   0           RECORDS.                    
000430*                                                                 
000440 01  “ü—Í|ƒŒƒR[ƒh.                                              
000450     COPY  CPBIS165 REPLACING  ==()==  BY  ==“ü—Í|==.            
000460******************************************************************
000470*  ‚v‚n‚q‚j‚h‚m‚f|‚r‚s‚n‚q‚`‚f‚d  ‚r‚d‚b‚s‚h‚n‚m                *
000480******************************************************************
000490  WORKING-STORAGE                     SECTION.                    
000500*----------------------------------------------------------------*
000510*    ƒzƒXƒg•Ï”’è‹`ƒGƒŠƒA                                        *
000520*----------------------------------------------------------------*
000530     EXEC  SQL  BEGIN  DECLARE        SECTION  END-EXEC.          
000540*--< ’†ŠÔ[ƒR[ƒh >                                               
000550 01 ‚v‚r|’†ŠÔ[ƒR[ƒh•Ï”.                                       
000560    03  ‚v‚r|Œ_–ñ”Ô†                PIC  X(10).                 
000570    03  ‚v‚r|•¨Œ”Ô†                PIC  9(04).                 
000580    03  ‚v‚r|‰ð–ñ“ú                  PIC  X(07).                 
000590    03  ‚v‚r|‰ð–ñ‹æ•ª                PIC  X(01).                 
000600    03  ‚v‚r|ŒÀ“xŠz                  PIC  9(13).                 
000610    03  ‚v‚r|Å–@“–Šú––•ë‰¿          PIC  9(13).                 
000620    03  ‚v‚r|¢‹I                    PIC  9(02).                 
000630    03  ‚v‚r|Ž–ŒÌ“ú|¢‹I            PIC  9(02).                 
000640    03  ‚v‚r|•t•Û“ú|¢‹I            PIC  9(02).                 
000650    03  ‚v‚r|’Ê’m‘‘—•t“ú|¢‹I      PIC  9(02).                 
000660*--< ‚n‚q‚`‚b‚k‚d‹¤’Ê•Ï” >                                       
000670     EXEC  SQL  INCLUDE  SQLCOM.CBL            END-EXEC.          
000680*                                                                 
000690*--< ‚n‚q‚`‚b‚k‚d  ‚r‚p‚kŽÀsî•ñ >                               
000700     EXEC  SQL  INCLUDE  SQLCA.COB             END-EXEC.          
000710*                                                                 
000720*--< V•¨Œ”Ô†Ì”Ôƒe[ƒuƒ‹ >                                     
000730     EXEC  SQL  INCLUDE  IKOTBL010.CBL         END-EXEC.          
000740*                                                                 
000750*--< Ž‘ŽYî•ñƒe[ƒuƒ‹ >                                           
000760     EXEC  SQL  INCLUDE  D921SIJ.CBL           END-EXEC.          
000770*                                                                 
000780     EXEC  SQL  END      DECLARE      SECTION  END-EXEC.          
000790*----------------------------------------------------------------*
000800*   ì‹Æ—Ìˆæ’è‹`                                                 *
000810*----------------------------------------------------------------*
000820 01  ‚v‚n‚q‚j|ƒGƒŠƒA.     					
000830*--< ƒGƒ‰[ƒR[ƒh >                                               
000840     03  ‚v|ƒGƒ‰[ƒR[ƒh             PIC S9(04).                 
000850*                                                                 
000860*--< ƒtƒ@ƒCƒ‹ó‘Ô >                                               
000870     03  ƒtƒ@ƒCƒ‹ó‘Ô.                                            
000880        05 ‚v|ó‘Ô                   PIC  X(02).                 
000890*					         	         	
000900*--< Œ”ƒGƒŠƒA >                                                 
000910     03  Œ”ƒGƒŠƒA.                                              
000920         05  ‚v|“ü—Í|Œ”‚P         PIC  9(09).                 
000930         05  ‚v|“ü—Í|Œ”‚Q         PIC  9(09).                 
000940         05  ‚v|XV|Œ”           PIC  9(09).                 
000950*                                                                 
000960*--< ƒtƒ‰ƒOƒAƒŠƒA >                                               
000970     03  ƒtƒ‰ƒO|ƒGƒŠƒA.                                          
000980         05  ‚v|I—¹|ƒtƒ‰ƒO‚P       PIC  X(01).                 
000990         05  ‚v|I—¹|ƒtƒ‰ƒO‚Q       PIC  X(01).                 
001000         05  ‚v|ˆÙíI—¹|ƒtƒ‰ƒO     PIC  X(01).                 
001010*                                                                 
001020*--< ƒtƒ@ƒCƒ‹ó‘Ô >                                               
001030     03  ‚v|“K—p“ú                   PIC  X(08).                 
001040*----------------------------------------------------------------*
001050*    ƒTƒuƒ‹[ƒ`ƒ“–¼                                              *
001060*----------------------------------------------------------------*
001070 01  CALL-AREA.                                                   
001080*--< ‹¤’ÊƒƒOƒTƒuƒ‹[ƒ`ƒ“ >                                       
001090     03  CLOCO001                     PIC  X(08) VALUE "CLOCO001".
001100     03  COBCO001                     PIC  X(08) VALUE "COBCO001".
001110*----------------------------------------------------------------*
001120*    ‚b‚n‚o‚x—Ìˆæ                                                *
001130*----------------------------------------------------------------*
001140*--< ‹¤’ÊƒƒO—pƒpƒ‰ƒ[ƒ^ >                                       
001150 01  IF-CHOCO001.                                                 
001160     COPY  CHOCO001  REPLACING  ==()==  BY  ==‹¤‚P|==.           
001170*                                                                 
001180*----------------------------------------------------------------*
001190*    ‚h‚m‚hƒtƒ@ƒCƒ‹“ÇžƒTƒuƒ‹[ƒ`ƒ“—pƒpƒ‰ƒƒ^—Ìˆæ                *
001200*----------------------------------------------------------------*
001210 01  PARA-AREA.                                                   
001220     COPY CPBCO001.                                               
001230*----------------------------------------------------------------*
001240*    ’è”—pƒf[ƒ^’è‹`ƒGƒŠƒA                                      *
001250*----------------------------------------------------------------*
001260 CONSTANT                             SECTION.                    
001270 01  ’è”—Ìˆæ.                                                    
001280     03  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c         PIC  X(08) VALUE "COBIS770".
001290     03  ’è”|ƒvƒƒOƒ‰ƒ€–¼           PIC  X(80)                  
001300                                      VALUE  "Ž‘ŽYî•ñˆÚs ".     
001310     03  ’è”|‚r‚p‚k‚n‚j             PIC  9(04)  VALUE  ZERO.    
001320     03  ’è”|‚r‚p‚k‚d‚m‚c           PIC  9(04)  VALUE  0100.    
001330     03  ’è”|³íó‘Ô               PIC  9(04)  VALUE  ZERO.    
001340     03  ’è”|ˆÙíó‘Ô               PIC  9(04)  VALUE  0009.    
001350******************************************************************
001360*    ‚o‚q‚n‚b‚d‚c‚t‚q‚d            ‚c‚h‚u‚h‚r‚h‚n‚m              *
001370******************************************************************
001380 PROCEDURE                            DIVISION.                   
001390*                                                                 
001400     PERFORM   ‰Šúˆ—.                                          
001410*                                                                 
001420     PERFORM   Žåˆ—      UNTIL  (‚v|I—¹|ƒtƒ‰ƒO‚P = "Y")      
001430                           AND    (‚v|I—¹|ƒtƒ‰ƒO‚Q = "Y").     
001440*                                                                 
001450     PERFORM   I—¹ˆ—.                                          
001460*                                                                 
001470     STOP RUN.                                                    
001480*                                                                 
001490******************************************************************
001500*    ‰Šúˆ—                                                    *
001510******************************************************************
001520 ‰Šúˆ—                             SECTION.                    
001530 ‰Šúˆ—|‚r‚s‚`‚q‚s.                                            
001540*                                                                 
001550*----------------------------------------------------------------*
001560*    ŠJŽnƒƒbƒZ[ƒWo—Í                                          *
001570*----------------------------------------------------------------*
001580     INITIALIZE                       IF-CHOCO001.                
001590     MOVE  "3"                        TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê.     
001600     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c       TO  ‹¤‚P|ƒ\[ƒX‚h‚c.       
001610     MOVE  "0"                        TO  ‹¤‚P|•œ‹AƒR[ƒh.       
001620     MOVE  "START"                    TO  ‹¤‚P|ˆ—Ž¯•Ê.         
001630     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€–¼         TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW. 
001640     CALL  CLOCO001                USING  IF-CHOCO001.            
001650*                                                                 
001660*----------------------------------------------------------------*
001670*    ì‹Æ—Ìˆæ‚Ì‰Šú’lÝ’è                                        *
001680*----------------------------------------------------------------*
001690     MOVE  SPACE                      TO  ‚v‚n‚q‚j|ƒGƒŠƒA.       
001700     INITIALIZE                           ‚v‚n‚q‚j|ƒGƒŠƒA.       
001710*                                                                 
001720*----------------------------------------------------------------*
001730*    ‚n‚q‚`‚b‚k‚dÚ‘±                                            *
001740*----------------------------------------------------------------*
001750     PERFORM  ‚n‚q‚`‚b‚k‚dÚ‘±.                                   
001760*----------------------------------------------------------------*
001770*    ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“                                            *
001780*----------------------------------------------------------------*
001790     PERFORM  ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“.                                   
001800*----------------------------------------------------------------*
001810*    Ž‘ŽYî•ñ“Çž’è‹`                                            *
001820*----------------------------------------------------------------*
001830     PERFORM  Ž‘ŽYî•ñ“Çž’è‹`.                                   
001840*----------------------------------------------------------------*
001850*   Ž‘ŽYî•ñ“Çži‚PŒ–Új                                       *
001860*----------------------------------------------------------------*
001870     PERFORM   Ž‘ŽYî•ñ“Çžˆ—.                                  
001880*----------------------------------------------------------------*
001890*   Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çži‚PŒ–Új                               *
001900*----------------------------------------------------------------*
001910     PERFORM   Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—.                          
001920*                                                                 
001930 ‰Šúˆ—|‚d‚w‚h‚s.                                              
001940     EXIT.                                                        
001950******************************************************************
001960*    ‚n‚q‚`‚b‚k‚dÚ‘±                                            *
001970******************************************************************
001980 ‚n‚q‚`‚b‚k‚dÚ‘±                     SECTION.                    
001990 ‚n‚q‚`‚b‚k‚dÚ‘±|‚r‚s‚`‚q‚s.                                    
002000*                                                                 
002010*--< ‚h‚m‚hƒtƒ@ƒCƒ‹“ÇžƒTƒuƒ‹[ƒ`ƒ“ŒÄ‚Ño‚µ >                     
002020     CALL  COBCO001                USING  PARA-AREA.              
002030*                                                                 
002040     MOVE  PARA-DBSTRING              TO  DB-STRING.              
002050     MOVE  PARA-USERNAME              TO  USERNAME.               
002060     MOVE  PARA-PASSWORD              TO  PASSWD.                 
002070*                                                                 
002080*----------------------------------------------------------------*
002090*    ŠJŽnÚ‘±                                                    *
002100*----------------------------------------------------------------*
002110     IF  DB-STRING  =  SPACE                                      
002120        EXEC  SQL                                                 
002130           CONNECT  :USERNAME  IDENTIFIED  BY  :PASSWD            
002140        END-EXEC                                                  
002150     ELSE                                                         
002160        EXEC  SQL                                                 
002170           CONNECT  :USERNAME  IDENTIFIED  BY  :PASSWD            
002180             USING  :DB-STRING                                    
002190        END-EXEC                                                  
002200     END-IF.                                                      
002210*                                                                 
002220*----------------------------------------------------------------*
002230*    Ú‘±ó‘Ô”»’è                                                *
002240*----------------------------------------------------------------*
002250      EVALUATE  SQLCODE                                           
002260        WHEN    ’è”|‚r‚p‚k‚n‚j                                  
002270           CONTINUE                                               
002280        WHEN   OTHER                                              
002290*--<       Ú‘±ƒGƒ‰[ >                                           
002300           MOVE     -10               TO  ‚v|ƒGƒ‰[ƒR[ƒh        
002310           PERFORM  ƒGƒ‰[ˆ—                                    
002320     END-EVALUATE.                                                
002330*                                                                 
002340 ‚n‚q‚`‚b‚k‚dÚ‘±|‚d‚w‚h‚s.                                      
002350     EXIT.                                                        
002360******************************************************************
002370*  ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“                                              *
002380******************************************************************
002390 ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“                     SECTION.                    
002400 ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“|‚r‚s‚`‚q‚s.                                    
002410*--< ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“ >                                           
002420     OPEN  INPUT   “ü—Íƒtƒ@ƒCƒ‹.                                  
002430*                                                                 
002440*----------------------------------------------------------------*
002450*    ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“ó‘Ô”»’è                                    *
002460*----------------------------------------------------------------*
002470     EVALUATE  ‚v|ó‘Ô                                           
002480        WHEN   ZERO                                               
002490           CONTINUE                                               
002500        WHEN  OTHER                                               
002510*--<       ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“ƒGƒ‰[ >                               
002520           MOVE     -20                TO  ‚v|ƒGƒ‰[ƒR[ƒh       
002530           PERFORM  ƒGƒ‰[ˆ—                                    
002540     END-EVALUATE.                                                
002550*                                                                 
002560 ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“|‚d‚w‚h‚s.                                      
002570     EXIT.                                                        
002580******************************************************************
002590*    Ž‘ŽYî•ñ“Çž’è‹`                                            *
002600******************************************************************
002610 Ž‘ŽYî•ñ“Çž’è‹`                     SECTION.                    
002620 Ž‘ŽYî•ñ“Çž’è‹`|‚r‚s‚`‚q‚s.                                    
002630*                                                                 
002640     EXEC SQL                                                     
002650        DECLARE CUR1  CURSOR FOR                                  
002660           SELECT  ƒL[î•ñQŒ_–ñ”Ô†                             
002670                  ,ƒL[î•ñQ•¨Œ”Ô†                             
002680                  ,•¨ŒQ•¨ŒŽæ“¾‰¿Šz                             
002690                  ,•¨Œˆ•ªQ”„”pƒtƒ‰ƒO                           
002700            FROM   D921SIJ_TBL                                    
002710     END-EXEC.                                                    
002720*----------------------------------------------------------------*
002730*    Ž‘ŽYî•ñ‚n‚o‚d‚mˆ—                                        *
002740*----------------------------------------------------------------*
002750     EXEC  SQL                                                    
002760        OPEN  CUR1                                                
002770     END-EXEC.                                                    
002780*----------------------------------------------------------------*
002790*    Ž‘ŽYî•ñ“Çžó‘Ô”»’è                                        *
002800*----------------------------------------------------------------*
002810     EVALUATE  SQLCODE                                            
002820        WHEN  ’è”|‚r‚p‚k‚n‚j                                    
002830*--<       ³í >                                                 
002840           CONTINUE                                               
002850        WHEN  OTHER                                               
002860*--<       “ÇžƒGƒ‰[    >                                        
002870           MOVE      -30              TO  ‚v|ƒGƒ‰[ƒR[ƒh        
002880           PERFORM   ƒGƒ‰[ˆ—                                   
002890      END-EVALUATE.                                               
002900*									
002910 Ž‘ŽYî•ñ“Çž’è‹`|‚d‚w‚h‚s.                                      
002920     EXIT.                                                        
002930******************************************************************
002940*  Ž‘ŽYî•ñ“Çžˆ—i‚PŒ–Új                                    *
002950******************************************************************
002960 Ž‘ŽYî•ñ“Çžˆ—            SECTION.                             
002970 Ž‘ŽYî•ñ“Çžˆ—|‚r‚s‚`‚q‚s.                                    
002980*--< Ž‘ŽYî•ñ“Çžˆ— >                                           
002990     EXEC SQL                                                     
003000         FETCH  CUR1                                              
003010            INTO                                                  
003020                  :‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñ”Ô†                   
003030                 ,:‚c‚X‚Q‚P|ƒL[î•ñ|•¨Œ”Ô†                   
003040                 ,:‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz                   
003050                 ,:‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pƒtƒ‰ƒO                 
003060      END-EXEC.                                                   
003070*                                                                 
003080*----------------------------------------------------------------*
003090*    Ž‘ŽYî•ñ“Çž‚ðŠm”F                                          *
003100*----------------------------------------------------------------*
003110     EVALUATE   SQLCODE                                           
003120        WHEN    ’è”|‚r‚p‚k‚n‚j                                  
003130*--<       ³í >                                                 
003140           CONTINUE                                               
003150        WHEN   ’è”|‚r‚p‚k‚d‚m‚c                                 
003160*--<       “ÇžI—¹ >                                             
003170           MOVE  "Y"                  TO  ‚v|I—¹|ƒtƒ‰ƒO‚P      
003180           MOVE  HIGH-VALUE           TO                          
003190                                      ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñ”Ô†
003200        WHEN   OTHER                                              
003210*--<       “ÇžƒGƒ‰[ >                                           
003220           MOVE     -40               TO  ‚v|ƒGƒ‰[ƒR[ƒh        
003230           PERFORM  ƒGƒ‰[ˆ—                                    
003240     END-EVALUATE.                                                
003250*                                                                 
003260 Ž‘ŽYî•ñ“Çžˆ—|‚d‚w‚h‚s.                                      
003270     EXIT.                                                        
003280******************************************************************
003290*  Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—i‚PŒ–Új                            *
003300******************************************************************
003310 Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—            SECTION.                     
003320 Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—|‚r‚s‚`‚q‚s.                            
003330     READ  “ü—Íƒtƒ@ƒCƒ‹                                           
003340        AT END                                                    
003350           MOVE  "Y"                  TO  ‚v|I—¹|ƒtƒ‰ƒO‚Q      
003360           MOVE HIGH-VALUE            TO  ‚v‚r|Œ_–ñ”Ô†          
003370           GO    TO   Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—|‚d‚w‚h‚s          
003380     END-READ.                                                    
003390* *--< Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžó‘Ô”»’è >                             
003400     EVALUATE  ‚v|ó‘Ô                                           
003410        WHEN  ZERO                                                
003420           MOVE  “ü—Í|Œ_–ñ‚m‚n       TO  ‚v‚r|Œ_–ñ”Ô†          
003430           MOVE  “ü—Í|•¨Œ‚m‚n       TO  ‚v‚r|•¨Œ”Ô†          
003440           MOVE  “ü—Í|‚j‚d‚x|‰ð–ñ“ú TO  ‚v‚r|‰ð–ñ“ú            
003450*--<       Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“ü—ÍŒ” >                             
003460           COMPUTE   ‚v|“ü—Í|Œ”‚Q  =  ‚v|“ü—Í|Œ”‚Q + 1    
003470        WHEN  OTHER                                               
003480*--<      Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“ÇžƒGƒ‰[ >                            
003490           MOVE  SPACE                TO  ‚v‚r|Œ_–ñ”Ô†          
003500           MOVE  ZERO                 TO  ‚v‚r|•¨Œ”Ô†          
003510           MOVE  SPACE                TO  ‚v‚r|‰ð–ñ“ú            
003520           MOVE     -50               TO  ‚v|ƒGƒ‰[ƒR[ƒh        
003530           PERFORM  ƒGƒ‰[ˆ—                                    
003540     END-EVALUATE.                                                
003550 Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—|‚d‚w‚h‚s.                              
003560     EXIT.                                                        
003570**                                                                
003580******************************************************************
003590*    Žåˆ—                                                      *
003600******************************************************************
003610 Žåˆ—                               SECTION.                    
003620 Žåˆ—|‚r‚s‚`‚q‚s.                                              
003630*                                                                 
003640*----------------------------------------------------------------*
003650*    V•¨Œ”Ô†‚ðŽæ“¾‚·‚é                                        *
003660*----------------------------------------------------------------*
003670     PERFORM  V•¨Œ”Ô†ˆ—                                      
003680*                                                                 
003690     EVALUATE  TRUE                                               
003700*--<     Ž‘ŽYî•ñ‚Ì‚Ý‚Ìê‡ >                                     
003710         WHEN    ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñ”Ô† < ‚v‚r|Œ_–ñ”Ô†    
003720            PERFORM  Ž‘ŽYî•ñ“Çžˆ—                             
003730*--<    ƒ}ƒbƒ`ƒ“ƒO‚Ìê‡ > 	           			
003740         WHEN  ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñ”Ô† = ‚v‚r|Œ_–ñ”Ô†      
003750            PERFORM  Ž‘ŽYî•ñXV•ÒWo—Íˆ—                     
003760*--<     Ž‘ŽY–¾×‚Ì‚Ý‚Ìê‡ >                                     
003770         WHEN  ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñ”Ô† > ‚v‚r|Œ_–ñ”Ô†      
003780            PERFORM Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—                      
003790     END-EVALUATE.                                                
003800*                                                                 
003810 Žåˆ—|‚d‚w‚h‚s.                                                
003820     EXIT.                                                        
003830******************************************************************
003840*   V•¨Œ”Ô†ˆ—                                               *
003850******************************************************************
003860 V•¨Œ”Ô†ˆ—                     SECTION.                      
003870 V•¨Œ”Ô†ˆ—|‚r‚s‚`‚q‚s.                                      
003880     IF  ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñ”Ô† = HIGH-VALUE                
003890         OR ‚v‚r|Œ_–ñ”Ô† = HIGH-VALUE                           
003900         GO TO V•¨Œ”Ô†ˆ—|‚d‚w‚h‚s                           
003910     ELSE                                                         
003920        EXEC SQL                                                  
003930              SELECT  V•¨Œ”Ô†                                  
003940                INTO  :‚h‚j‚n‚O‚P‚O|V•¨Œ”Ô†                   
003950 	       	      FROM  IKOTBL010                                   
003960	  	     WHERE  Œ_–ñ”Ô† = :‚v‚r|Œ_–ñ”Ô†                  
003970		       AND  •¨Œ”Ô† = :‚v‚r|•¨Œ”Ô†                  
003980		       AND  ‰ð–ñ“ú   = :‚v‚r|‰ð–ñ“ú                    
003990        END-EXEC                                                  
004000*--<  V•¨Œ”Ô†ˆ—‚ðŠm”F >                                      
004010        EVALUATE   SQLCODE                                        
004020           WHEN    ’è”|‚r‚p‚k‚n‚j                               
004030*--<       ³í >                                                 
004040               COMPUTE   ‚v|“ü—Í|Œ”‚P = ‚v|“ü—Í|Œ”‚P + 1  
004050           WHEN   OTHER                                           
004060*--<      V•¨Œ”Ô†ˆ—ƒGƒ‰[ >                                  
004070              MOVE   ZERO             TO ‚h‚j‚n‚O‚P‚O|V•¨Œ”Ô† 
004080              MOVE     -60            TO  ‚v|ƒGƒ‰[ƒR[ƒh        
004090              PERFORM  ƒGƒ‰[ˆ—                                 
004100        END-EVALUATE                                              
004110*                                                                 
004120     END-IF.                                                      
004130 V•¨Œ”Ô†ˆ—|‚d‚w‚h‚s.                                        
004140     EXIT.                                                        
004150******************************************************************
004160*   Ž‘ŽYî•ñXV•ÒWo—Íˆ—                                     *
004170******************************************************************
004180 Ž‘ŽYî•ñXV•ÒWo—Íˆ—                     SECTION.            
004190 Ž‘ŽYî•ñXV•ÒWo—Íˆ—|‚r‚s‚`‚q‚s.                            
004200     EVALUATE  TRUE                                               
004210         WHEN  ‚c‚X‚Q‚P|ƒL[î•ñ|•¨Œ”Ô† <                     
004220                                   ‚h‚j‚n‚O‚P‚O|V•¨Œ”Ô†       
004230            PERFORM  Ž‘ŽYî•ñ“Çžˆ—                             
004240*                                                                 
004250         WHEN  ‚c‚X‚Q‚P|ƒL[î•ñ|•¨Œ”Ô† =                     
004260                                   ‚h‚j‚n‚O‚P‚O|V•¨Œ”Ô†       
004270            PERFORM  Ž‘ŽYî•ñXV•ÒWˆ—                         
004280            PERFORM  Ž‘ŽYî•ñXVo—Íˆ—                         
004290	          PERFORM  Ž‘ŽYî•ñ“Çžˆ—                             
004300	          PERFORM  Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—                     
004310	       WHEN  ‚c‚X‚Q‚P|ƒL[î•ñ|•¨Œ”Ô† >                     
004320                                   ‚h‚j‚n‚O‚P‚O|V•¨Œ”Ô†       
004330            PERFORM Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çžˆ—                      
004340     END-EVALUATE.                                                
004350*                                                                 
004360 Ž‘ŽYî•ñXV•ÒWo—Íˆ—|‚d‚w‚h‚s.                              
004370     EXIT.                                                        
004380******************************************************************
004390*    Ž‘ŽYî•ñXV•ÒWˆ—                                        *
004400******************************************************************
004410 Ž‘ŽYî•ñXV•ÒWˆ—           SECTION.                          
004420 Ž‘ŽYî•ñXV•ÒWˆ—|‚r‚s‚`‚q‚s.                                
004430*--<    No.91 >                                                   
004440     MOVE “ü—Í|•t•Û‹æ•ª|“®ŽY‘‡  TO                            
004450                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•t•Û‹æ•ª             
004460*--<    No.92 >                                                   
004470     IF “ü—Í|•t•Û“ú|”NŒŽ“ú = ZERO                               
004480        MOVE  ZERO   TO   ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û“ú              
004490     ELSE                                                         
004500        IF “ü—Í|•t•Û“ú|¢‹I = '0'                               
004510              MOVE  '19' TO  ‚v‚r|¢‹I                           
004520        ELSE                                                      
004530              MOVE  '20' TO  ‚v‚r|¢‹I                           
004540        END-IF                                                    
004550        STRING  ‚v‚r|¢‹I , “ü—Í|•t•Û“ú|”NŒŽ“ú                 
004560               DELIMITED  BY SIZE INTO  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û“ú
004570     END-IF.                                                      
004580*--<    No.94 >                                                   
004590     STRING  ‚v‚r|¢‹I , “ü—Í|•t•Û“ú|”NŒŽ“ú                    
004600          DELIMITED  BY  SIZE  INTO                               
004610                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•t•ÛŠJŽn”NŒŽ“ú.      
004620*--<    No.95 >                                                   
004630     MOVE “ü—Í|“®‘•ÛŒ¯—¿          TO                            
004640                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•ÛŒ¯—¿               
004650*--<    No.96 >                                                   
004660     MOVE “ü—Í|Ž–ŒÌ—L–³‹æ•ª        TO                            
004670                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ—L–³                 
004680*--<    No.97 >                                                   
004690     IF “ü—Í|Ž–ŒÌ“ú|”NŒŽ“ú = ZERO                               
004700        MOVE  ZERO   TO   ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ“ú              
004710     ELSE                                                         
004720         IF “ü—Í|Ž–ŒÌ“ú|¢‹I = '0'                              
004730               MOVE  '19' TO  ‚v‚r|Ž–ŒÌ“ú|¢‹I                  
004740         ELSE                                                     
004750               MOVE  '20' TO ‚v‚r|Ž–ŒÌ“ú|¢‹I                   
004760         END-IF                                                   
004770     END-IF.                                                      
004780     STRING  ‚v‚r|Ž–ŒÌ“ú|¢‹I , “ü—Í|Ž–ŒÌ“ú|”NŒŽ“ú            
004790          DELIMITED  BY  SIZE  INTO   ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ“ú. 
004800*--<    No.98 >                                                   
004810     MOVE “ü—Í|•ÛŒ¯V‹KŒp‘±‹æ•ª    TO                            
004820                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯Œp‘±                 
004830*--<    No.99 >                                                   
004840     MOVE “ü—Í|“®‘•ÛŒ¯—¿—¦        TO                            
004850                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯—¿—¦                 
004860*--<    No.100 >                                                  
004870     MOVE “ü—Í|“®‘•ÛŒ¯‰¿Ši        TO                            
004880                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯‰¿Ši                 
004890*--<    No.101 >                                                  
004900     MOVE “ü—Í|“®‘•¥–ß‚µ•ÛŒ¯—¿    TO                            
004910                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•Ô–ß•ÛŒ¯—¿               
004920*--<    No.102 >                                                  
004930     MOVE “ü—Í|“®‘•ÛŒ¯ØŒ””Ô†    TO                            
004940                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•ÛŒ¯ØŒ””Ô†         
004950*--<    No.103 >                                                  
004960     MOVE “ü—Í|“®‘•ÛŒ¯—¿—¦        TO                            
004970                     ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û—¦                   
004980*--<    No.104 >                                                  
004990     MOVE “ü—Í|Žc‰¿î•ñ|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz  TO                
005000                    ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz      
005010*--<    No.105 >                                                  
005020     MOVE “ü—Í|Ý’uêŠ–¼ƒJƒi      TO                            
005030                    ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ý’uêŠ–¼ƒJƒi            
005040*--<    No.109 >                                                  
005050     MOVE “ü—Í|•ÛŒ¯î•ñ|•ÛŒ¯‰ïŽÐƒR[ƒh  TO                      
005060                    ‚c‚X‚Q‚P|M—p•ÛŒ¯|M—p•ÛŒ¯‰ïŽÐƒR[ƒh        
005070*--<    No.110 >                                                  
005080     MOVE “ü—Í|M—p•ÛŒ¯ƒR[ƒh|‹@ŠB‹æ•ª   TO                     
005090                   ‚c‚X‚Q‚P|M—p•ÛŒ¯|‹@ŠB—Þ•ª—ÞƒR[ƒh           
005100*--<    No.111 >                                                  
005110     IF “ü—Í|’Ê’m‘‘—•t“ú|”NŒŽ“ú = ZERO                         
005120        MOVE  ZERO   TO   ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ“ú              
005130     ELSE                                                         
005140         IF “ü—Í|’Ê’m‘‘—•t“ú|¢‹I = '0'                        
005150               MOVE  '19' TO  ‚c‚X‚Q‚P|M—p•ÛŒ¯|’Ê’m‘”­‘—“ú    
005160         ELSE                                                     
005170               MOVE  '20' TO ‚v‚r|’Ê’m‘‘—•t“ú|¢‹I             
005180         END-IF                                                   
005190     END-IF.                                                      
005200     STRING  ‚v‚r|’Ê’m‘‘—•t“ú|¢‹I , “ü—Í|’Ê’m‘‘—•t“ú|”NŒŽ“ú
005210          DELIMITED  BY  SIZE  INTO                               
005220                                 ‚c‚X‚Q‚P|M—p•ÛŒ¯|’Ê’m‘”­‘—“ú 
005230*--<    No.113 >                                                  
005240     MOVE “ü—Í|M—p•ÛŒ¯—¿        TO   ‚c‚X‚Q‚P|M—p•ÛŒ¯|•ÛŒ¯—¿ 
005250*--<    No.114 >                                                  
005260     MOVE “ü—Í|•„†ˆê˜A”Ô†      TO   ‚c‚X‚Q‚P|M—p•ÛŒ¯|•„†   
005270*--<    No.119 >                                                  
005280     MOVE “ü—Í|”[•tæƒR[ƒh      TO                              
005290                  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x”[•tæƒR[ƒh        
005300*--<    No.120 >                                                  
005310     MOVE “ü—Í|”[•tæƒR[ƒh      TO                              
005320                  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|”[•tæƒR[ƒh              
005330*--<    No.123 >                                                  
005340     MOVE “ü—Í|”NÅŠz            TO                              
005350                  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|”NÅŠz                    
005360*--<    No.124 >                                                  
005370     MOVE “ü—Í|‘O”N“x•]‰¿Šz      TO                              
005380                  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x•]‰¿Šz              
005390*--<    No.125 >                                                  
005400     MOVE “ü—Í|‘O”N“x—˜_•ë‰¿    TO                              
005410                 ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x—˜_•ë‰¿             
005420*--<    No.126 >                                                  
005430     MOVE “ü—Í|“–”N“x•]‰¿Šz      TO                              
005440                 ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|“–”N“x•]‰¿Šz               
005450*--<    No.127 >                                                  
005460     MOVE “ü—Í|“–”N“x—˜_•ë‰¿    TO                              
005470                 ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|“–”N“x—˜_•ë‰¿             
005480*--<    No.156 >                                                  
005490     IF  “ü—Í|‰ð–ñ‹æ•ª = '0'                                     
005500        MOVE  0                   TO  ‚v‚r|‰ð–ñ‹æ•ª              
005510     ELSE                                                         
005520        MOVE  1                   TO  ‚v‚r|‰ð–ñ‹æ•ª              
005530     END-IF.                                                      
005540*--<    No.157 >                                                  
005550     MOVE “ü—Í|‰ð–ñ“ú            TO                              
005560                 ‚c‚X‚Q‚P|‰ïŽÐ—˜_|ž‹p’âŽ~“ú                   
005570*--<    No.158 >                                                  
005580     MOVE “ü—Í|‰ïŽÐ‘OŠú––•ë‰¿    TO                              
005590                 ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú––•ë‰¿                   
005600*--<    No.159 >                                                  
005610     COMPUTE ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú–˜ž‹pŠz—ÝŒv                 
005620                                    = ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz
005630                                  - ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú––•ë‰¿
005640*--<    No.162 >                                                  
005650     MOVE  “ü—Í|‰ïŽÐŒ»Ý•ë‰¿    TO   ‚c‚X‚Q‚P|‰ïŽÐ—˜_|Œ»Ý•ë‰¿
005660     COMPUTE ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŒŽ–˜ž‹pŠz—ÝŒv                 
005670                                    = ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz
005680                                    - ‚c‚X‚Q‚P|‰ïŽÐ—˜_|Œ»Ý•ë‰¿
005690*--<    No.164 ‚Æ@No.192 >                                       
005700     IF  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pƒtƒ‰ƒO = '1'                     
005710        MOVE  “ü—Í|‰ïŽÐŒ»Ý•ë‰¿    TO                            
005720                                      ‚c‚X‚Q‚P|‰ïŽÐ—˜_|œ‹p•ë‰¿
005730        MOVE  “ü—Í|Å–@“–Šú––•ë‰¿  TO                            
005740                 ‚c‚X‚Q‚P|Å–±|“–Šú–––@’è•ë‰¿                   
005750        COMPUTE   ‚c‚X‚Q‚P|Å–±|“–Šúž‹p‚Ö‚ÌU‘ÖŠz =            
005760                                  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|Œ»Ý•ë‰¿    
005770                                - ‚c‚X‚Q‚P|Å–±|“–Šú–––@’è•ë‰¿  
005780     ELSE                                                         
005790        MOVE  ZERO   TO   ‚c‚X‚Q‚P|‰ïŽÐ—˜_|œ‹p•ë‰¿            
005800        MOVE  ZERO   TO   ‚c‚X‚Q‚P|Å–±|“–Šúž‹p‚Ö‚ÌU‘ÖŠz      
005810     END-IF.                                                      
005820*--<    No.165 >                                                  
005830     COMPUTE ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽ–˜ž‹pŠz—ÝŒv                 
005840                                    = ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz
005850                                    - ‚c‚X‚Q‚P|‰ïŽÐ—˜_|Œ»Ý•ë‰¿
005860*--<    No.167 >                                                  
005870     MOVE “ü—Í|‰ïŽÐ“–Šúž‹p‚      TO                            
005880                  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|“–Šúž‹pŠz                  
005890*--<    No.168 >                                                  
005900     MOVE “ü—Í|‰ïŽÐ—˜_‘OŠú––•ë‰¿  TO                            
005910                  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú––•ë‰¿                  
005920*--<    No.169 >                                                  
005930     COMPUTE ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú–˜ž‹pŠz—ÝŒv                 
005940                                  = ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz  
005950                                  - ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú––•ë‰¿
005960*--<    No.171 172 >                                              
005970     MOVE “ü—Í|‰ïŽÐ—˜_“–Šú––•ë‰¿    TO                          
005980                                     ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|Œ»Ý•ë‰¿ 
005990     COMPUTE ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŒŽ–˜ž‹pŠz—ÝŒv                 
006000                                    = ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz
006010                                    - ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|Œ»Ý•ë‰¿
006020*--<    No.173 >                                                  
006030     COMPUTE ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽ–˜ž‹pŠz—ÝŒv                 
006040                               = ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz     
006050                                    - ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|Œ»Ý•ë‰¿
006060*--<    No.175 >                                                  
006070     COMPUTE ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽž‹pŠz                       
006080                                  = ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú––•ë‰¿
006090                                  - ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|Œ»Ý•ë‰¿  
006100*--<    No.177 >                                                  
006110     MOVE   “ü—Í|Å–@Š„‘‹æ•ª      TO  ‚c‚X‚Q‚P|Å–±|Š„‘ž‹p  
006120*--<    No.179 >                                                  
006130     MOVE   “ü—Í|Å–@Š„‘ž‹p”ï    TO  ‚c‚X‚Q‚P|Å–±|Š„‘ž‹p”ï
006140*--<    No.180 >                                                  
006150     MOVE   “ü—Í|Å–@“Á•Êž‹p—¦|•ªŽq                            
006160                                TO  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p—¦•ªŽq
006170*--<    No.181 >                                                  
006180     MOVE   “ü—Í|Å–@“Á•Êž‹p—¦|•ª•ê                            
006190                                TO  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p—¦•ª•ê
006200*--<    No.182 >                                                  
006210     MOVE   “ü—Í|Å–@“Á•Êž‹p”ï    TO  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p”ï
006220*--<    No.183 >                                                  
006230     MOVE   “ü—Í|Å–@‘OŠú––•ë‰¿–@’è TO                           
006240                    ‚c‚X‚Q‚P|Å–±|‘OŠú––ŽÀŽ{Šz•ë‰¿              
006250*--<    No.184 >                                                  
006260     COMPUTE ‚c‚X‚Q‚P|Å–±|‘OŠúŽÀŽ{Šz—ÝŒv                       
006270                                    = ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz
006280                                - ‚c‚X‚Q‚P|Å–±|‘OŠú––ŽÀŽ{Šz•ë‰¿
006290*--<    No.185 >                                                  
006300     MOVE   “ü—Í|Å–@ŒJ‰z’´‰ßŠz    TO                            
006310                  ‚c‚X‚Q‚P|Å–±|‘OŠúŒJ‰z’´‰ßŠz                  
006320*--<    No.186 187 >                                              
006330     MOVE   “ü—Í|Å–@“–Šú––•ë‰¿    TO  ‚v‚r|Å–@“–Šú––•ë‰¿      
006340     MOVE   “ü—Í|Å–@ž‹pŒÀ“xŠz    TO                            
006350                  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŒÀ“xŠz                  
006360     COMPUTE ‚v‚r|ŒÀ“xŠz      = ‚c‚X‚Q‚P|Å–±|‘OŠú––ŽÀŽ{Šz•ë‰¿ 
006370                               - ‚v‚r|Å–@“–Šú––•ë‰¿             
006380     IF  ‚v‚r|ŒÀ“xŠz < ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŒÀ“xŠz            
006390        COMPUTE ‚c‚X‚Q‚P|Å–±|‘OŠúž‹p•s‘«Šz =                  
006400                                    ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŒÀ“xŠz
006410                                    - ‚v‚r|ŒÀ“xŠz                
006420     ELSE                                                         
006430        MOVE ZERO TO   ‚c‚X‚Q‚P|Å–±|‘OŠúž‹p•s‘«Šz             
006440     END-IF.                                                      
006450*--<    No.188 >                                                  
006460     COMPUTE  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŽÀŽ{Šz—ÝŒv  =               
006470                                 ‚c‚X‚Q‚P|Å–±|‘OŠú––ŽÀŽ{Šz•ë‰¿ 
006480                                 - ‚v‚r|Å–@“–Šú––•ë‰¿           
006490*--<    No.189 >                                                  
006500     COMPUTE  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŽÀŽ{Šz—ÝŒv                  
006510                                = ‚c‚X‚Q‚P|Å–±|‘OŠú––ŽÀŽ{Šz•ë‰¿
006520                                - ‚v‚r|Å–@“–Šú––•ë‰¿            
006530*--<    No.190 >                                                  
006540     IF  “ü—Í|“–Šúž‹p‰ß•s‘«Šz < ZERO                    
006550        MOVE  “ü—Í|“–Šúž‹p‰ß•s‘«Šz                      
006560                                TO  ‚c‚X‚Q‚P|Å–±|“–Šúž‹p•s‘«Šz
006570     ELSE                                                         
006580        MOVE  ZERO   TO    ‚c‚X‚Q‚P|Å–±|“–Šúž‹p•s‘«Šz         
006590     END-IF.                                                      
006600*--<    No.191 >                                                  
006610     MOVE  “ü—Í|Å–@ŒJ‰z’´‰ßŠz     TO                            
006620                    ‚c‚X‚Q‚P|Å–±|“–Šúž‹p’´‰ßŠz                
006630*--<    No.193 >                                                  
006640     MOVE  “ü—Í|Å–@“–Šú––•ë‰¿     TO                            
006650                    ‚c‚X‚Q‚P|Å–±|“–Šú––ŽÀŽ{Šz•ë‰¿              
006660*--<    No.196 >                                                  
006670     MOVE  “ü—Í|Å–@‘OŠú––•ë‰¿–@’è TO                            
006680                    ‚c‚X‚Q‚P|Å–±|‘OŠú–––@’è•ë‰¿ .              
006690*                                                                 
006700 Ž‘ŽYî•ñXV•ÒWˆ—|‚d‚w‚h‚s.                                  
006710     EXIT.                                                        
006720******************************************************************
006730*    Ž‘ŽYî•ñXVo—Íˆ—                                        *
006740******************************************************************
006750 Ž‘ŽYî•ñXVo—Íˆ—           SECTION.                          
006760 Ž‘ŽYî•ñXVo—Íˆ—|‚r‚s‚`‚q‚s.                                
006770                                                                  
006780     EXEC SQL                                                     
006790        UPDATE D921SIJ_TBL                                        
006800           SET                                                    
006810*--<    No.91 >                                                   
006820               “®‘•ÛŒ¯Q“®‘•t•Û‹æ•ª                             
006830                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•t•Û‹æ•ª      
006840*--<    No.92 >                                                   
006850              ,“®‘•ÛŒ¯Q•t•Û“ú                                   
006860                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û“ú            
006870*--<    No.94 >                                                   
006880              ,“®‘•ÛŒ¯Q“®‘•t•ÛŠJŽn”NŒŽ“ú                       
006890                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•t•ÛŠJŽn”NŒŽ“ú
006900*--<    No.95 >                                                   
006910              ,“®‘•ÛŒ¯Q“®‘•ÛŒ¯—¿                               
006920                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•ÛŒ¯—¿        
006930*--<    No.96 >                                                   
006940              ,“®‘•ÛŒ¯QŽ–ŒÌ—L–³                                 
006950                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ—L–³          
006960*--<    No.97>                                                    
006970              ,“®‘•ÛŒ¯QŽ–ŒÌ“ú                                   
006980                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ“ú            
006990*--<    No.98 >                                                   
007000              ,“®‘•ÛŒ¯Q•ÛŒ¯Œp‘±                                 
007010                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯Œp‘±          
007020*--<    No.99 >                                                   
007030              ,“®‘•ÛŒ¯Q•ÛŒ¯—¿—¦                                 
007040                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯—¿—¦          
007050*--<    No.100 >                                                  
007060              ,“®‘•ÛŒ¯Q•ÛŒ¯‰¿Ši                                 
007070                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯‰¿Ši          
007080*--<    No.101 >                                                  
007090              ,“®‘•ÛŒ¯Q•Ô–ß•ÛŒ¯—¿                               
007100                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|•Ô–ß•ÛŒ¯—¿        
007110*--<    No.102 >                                                  
007120              ,“®‘•ÛŒ¯Q“®‘•ÛŒ¯ØŒ””Ô†                         
007130                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•ÛŒ¯ØŒ””Ô†  
007140*--<    No.103 >                                                  
007150              ,“®‘•ÛŒ¯Q•t•Û—¦                                   
007160                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û—¦            
007170*--<    No.104 >                                                  
007180              ,“®‘•ÛŒ¯QŒp‘±ƒŠ[ƒXž‹p‘ÎÛŠz                     
007190                       = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz
007200*--<    No.105 >                                                  
007210              ,“®‘•ÛŒ¯QÝ’uêŠ–¼ƒJƒi                           
007220                         = :‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ý’uêŠ–¼ƒJƒi    
007230*--<    No.109 >                                                  
007240              ,M—p•ÛŒ¯QM—p•ÛŒ¯‰ïŽÐƒR[ƒh                       
007250                         = :‚c‚X‚Q‚P|M—p•ÛŒ¯|M—p•ÛŒ¯‰ïŽÐƒR[ƒh
007260*--<    No.110 >                                                  
007270              ,M—p•ÛŒ¯Q‹@ŠB—Þ•ª—ÞƒR[ƒh                         
007280                         = :‚c‚X‚Q‚P|M—p•ÛŒ¯|‹@ŠB—Þ•ª—ÞƒR[ƒh  
007290*--<    No.111 >                                                  
007300              ,M—p•ÛŒ¯Q’Ê’m‘”­‘—“ú                             
007310                         = :‚c‚X‚Q‚P|M—p•ÛŒ¯|’Ê’m‘”­‘—“ú      
007320*--<    No.113 >                                                  
007330              ,M—p•ÛŒ¯Q•ÛŒ¯—¿                                   
007340                         = :‚c‚X‚Q‚P|M—p•ÛŒ¯|•ÛŒ¯—¿            
007350*--<    No.114 >                                                  
007360              ,M—p•ÛŒ¯Q•„†                                     
007370                         = :‚c‚X‚Q‚P|M—p•ÛŒ¯|•„†              
007380*--<    No.119 >                                                  
007390             ,ŒÅ’èŽ‘ŽYÅQ‘O”N“x”[•tæƒR[ƒh                      
007400                     = : ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x”[•tæƒR[ƒh 
007410*--<    No.120 >                                                  
007420              ,ŒÅ’èŽ‘ŽYÅQ”[•tæƒR[ƒh                           
007430                           = :‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|”[•tæƒR[ƒh  
007440*--<    No.123 >                                                  
007450              ,ŒÅ’èŽ‘ŽYÅQ”NÅŠz                                 
007460                           = :‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|”NÅŠz        
007470*--<    No.124 >                                                  
007480              ,ŒÅ’èŽ‘ŽYÅQ‘O”N“x•]‰¿Šz                           
007490                           = :‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x•]‰¿Šz  
007500*--<    No.125 >                                                  
007510              ,ŒÅ’èŽ‘ŽYÅQ‘O”N“x—˜_•ë‰¿                         
007520                           = :‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x—˜_•ë‰¿
007530*--<    No.126 >                                                  
007540              ,ŒÅ’èŽ‘ŽYÅQ“–”N“x•]‰¿Šz                           
007550                           = :‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|“–”N“x•]‰¿Šz  
007560*--<    No.127 >                                                  
007570              ,ŒÅ’èŽ‘ŽYÅQ“–”N“x—˜_•ë‰¿                         
007580                           = :‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|“–”N“x—˜_•ë‰¿
007590*--<    No.156 >                                                  
007600              ,‰ïŽÐ—˜_Qž‹p’âŽ~ƒtƒ‰ƒO                           
007610                           = :‚v‚r|‰ð–ñ‹æ•ª                      
007620*--<    No.157 >                                                  
007630              ,‰ïŽÐ—˜_Qž‹p’âŽ~“ú                               
007640                           = :‚c‚X‚Q‚P|‰ïŽÐ—˜_|ž‹p’âŽ~“ú      
007650*--<    No.158 >                                                  
007660              ,‰ïŽÐ—˜_Q‘OŠú––•ë‰¿                               
007670                           = :‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú––•ë‰¿      
007680*--<    No.159 >                                                  
007690              ,‰ïŽÐ—˜_Q‘OŠú–˜ž‹pŠz—ÝŒv                         
007700                           = :‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú–˜ž‹pŠz—ÝŒv
007710*--<    No.162 >                                                  
007720             ,‰ïŽÐ—˜_Q‘OŒŽ–˜ž‹pŠz—ÝŒv                          
007730                           = :‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŒŽ–˜ž‹pŠz—ÝŒv
007740*--<    No.163 >                                                  
007750              ,‰ïŽÐ—˜_QŒ»Ý•ë‰¿                                 
007760                           = :‚c‚X‚Q‚P|‰ïŽÐ—˜_|Œ»Ý•ë‰¿        
007770*--<    No.164 >                                                  
007780              ,‰ïŽÐ—˜_Qœ‹p•ë‰¿  = :‚c‚X‚Q‚P|‰ïŽÐ—˜_|œ‹p•ë‰¿
007790*--<    No.165 >                                                  
007800              ,‰ïŽÐ—˜_Q“–ŒŽ–˜ž‹pŠz—ÝŒv                         
007810                           = :‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽ–˜ž‹pŠz—ÝŒv
007820*--<    No.167 >                                                  
007830              ,‰ïŽÐ—˜_Q“–Šúž‹pŠz                               
007840                           = :‚c‚X‚Q‚P|‰ïŽÐ—˜_|“–Šúž‹pŠz      
007850*--<    No.168 >                                                  
007860              ,ŠÇ—‰ïŒvQ‘OŠú––•ë‰¿                               
007870                           = :‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú––•ë‰¿      
007880*--<    No.169 >                                                  
007890              ,ŠÇ—‰ïŒvQ‘OŠú–˜ž‹pŠz—ÝŒv                         
007900                           = :‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú–˜ž‹pŠz—ÝŒv
007910*--<    No.171 >                                                  
007920              ,ŠÇ—‰ïŒvQ‘OŒŽ–˜ž‹pŠz—ÝŒv                         
007930                           = :‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú–˜ž‹pŠz—ÝŒv
007940*--<    No.172 >                                                  
007950              ,ŠÇ—‰ïŒvQŒ»Ý•ë‰¿  = :‚c‚X‚Q‚P|ŠÇ—‰ïŒv|Œ»Ý•ë‰¿
007960*--<    No.173 >                                                  
007970              ,ŠÇ—‰ïŒvQ“–ŒŽ–˜ž‹pŠz—ÝŒv                         
007980                           = :‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽ–˜ž‹pŠz—ÝŒv
007990*--<    No.175 >                                                  
008000              ,ŠÇ—‰ïŒvQ“–Šúž‹pŠz                               
008010                        = :‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽž‹pŠz         
008020*--<    No.177 >                                                  
008030              ,Å–±QŠ„‘ž‹p         = :‚c‚X‚Q‚P|Å–±|Š„‘ž‹p 
008040*--<    No.179 >                                                  
008050              ,Å–±QŠ„‘ž‹p”ï                                   
008060                           = :‚c‚X‚Q‚P|Å–±|Š„‘ž‹p”ï          
008070*--<    No.180 >                                                  
008080              ,Å–±Q“Á•Êž‹p—¦•ªŽq                               
008090                           = :‚c‚X‚Q‚P|Å–±|“Á•Êž‹p—¦•ªŽq      
008100*--<    No.181 >                                                  
008110              ,Å–±Q“Á•Êž‹p—¦•ª•ê                               
008120                           = :‚c‚X‚Q‚P|Å–±|“Á•Êž‹p—¦•ª•ê      
008130*--<    No.182 >                                                  
008140              ,Å–±Q“Á•Êž‹p”ï                                   
008150                           = :‚c‚X‚Q‚P|Å–±|“Á•Êž‹p”ï          
008160*--<    No.183 >                                                  
008170              ,Å–±Q‘OŠú––ŽÀŽ{Šz•ë‰¿                             
008180                           = :‚c‚X‚Q‚P|Å–±|‘OŠú––ŽÀŽ{Šz•ë‰¿    
008190*--<    No.184 >                                                  
008200              ,Å–±Q‘OŠúŽÀŽ{Šz—ÝŒv                               
008210                            = :‚c‚X‚Q‚P|Å–±|‘OŠúŽÀŽ{Šz—ÝŒv     
008220*--<    No.185 >                                                  
008230              ,Å–±Q‘OŠúŒJ‰z’´‰ßŠz                               
008240                           = :‚c‚X‚Q‚P|Å–±|‘OŠúŒJ‰z’´‰ßŠz      
008250*--<    No.186 >                                                  
008260              ,Å–±Q‘OŠúž‹p•s‘«Šz                               
008270                            = :‚c‚X‚Q‚P|Å–±|‘OŠúž‹p•s‘«Šz     
008280*--<    No.187 >                                                  
008290              ,Å–±Q“–Šúž‹pŒÀ“xŠz                               
008300                           = :‚c‚X‚Q‚P|Å–±|“–Šúž‹pŒÀ“xŠz      
008310*--<    No.188 >                                                  
008320              ,Å–±Q“–Šúž‹pŽÀŽ{Šz                               
008330                         = :‚c‚X‚Q‚P|Å–±|“–Šúž‹pŽÀŽ{Šz—ÝŒv    
008340*--<    No.189 >                                                  
008350              ,Å–±Q“–Šúž‹pŽÀŽ{Šz—ÝŒv                           
008360                           = :‚c‚X‚Q‚P|Å–±|“–Šúž‹pŽÀŽ{Šz—ÝŒv  
008370*--<    No.190 >                                                  
008380              ,Å–±Q“–Šúž‹p•s‘«Šz                               
008390                              = :‚c‚X‚Q‚P|Å–±|“–Šúž‹p•s‘«Šz   
008400*--<    No.191 >                                                  
008410              ,Å–±Q“–Šúž‹p’´‰ßŠz                               
008420                           = :‚c‚X‚Q‚P|Å–±|“–Šúž‹p’´‰ßŠz      
008430*--<    No.192 >                                                  
008440              ,Å–±Q“–Šúž‹p‚Ö‚ÌU‘ÖŠz                           
008450                           = :‚c‚X‚Q‚P|Å–±|“–Šúž‹p‚Ö‚ÌU‘ÖŠz  
008460*--<    No.193 >                                                  
008470              ,Å–±Q“–Šú––ŽÀŽ{Šz•ë‰¿                             
008480                           = :‚c‚X‚Q‚P|Å–±|“–Šú––ŽÀŽ{Šz•ë‰¿    
008490*--<    No.196 >                                                  
008500              ,Å–±Q‘OŠú–––@’è•ë‰¿                               
008510                           = :‚c‚X‚Q‚P|Å–±|‘OŠú–––@’è•ë‰¿      
008520*--<    No.197 >                                                  
008530              ,Å–±Q“–Šú–––@’è•ë‰¿                               
008540                           = :‚c‚X‚Q‚P|Å–±|“–Šú–––@’è•ë‰¿      
008550        WHERE  ƒL[î•ñQŒ_–ñ”Ô†     = :‚v‚r|Œ_–ñ”Ô†           
008560          AND  ƒL[î•ñQ•¨Œ”Ô†     = :‚h‚j‚n‚O‚P‚O|V•¨Œ”Ô† 
008570     END-EXEC.                                                    
008580*                                                                 
008590*----------------------------------------------------------------*
008600*    Ž‘ŽYî•ñXVˆ—‚ðŠm”F                                      *
008610*----------------------------------------------------------------*
008620         EVALUATE   SQLCODE                                       
008630           WHEN    ’è”|‚r‚p‚k‚n‚j                               
008640*--<          XV¬Œ÷ >                                          
008650              COMPUTE  ‚v|XV|Œ” = ‚v|XV|Œ” + 1        
008660           WHEN    ’è”|‚r‚p‚k‚d‚m‚c                             
008670              CONTINUE                                            
008680           WHEN   OTHER                                           
008690*--<          XVŽ¸”s >                                          
008700              MOVE     -70            TO  ‚v|ƒGƒ‰[ƒR[ƒh        
008710              PERFORM  ƒGƒ‰[ˆ—                                 
008720        END-EVALUATE.                                             
008730 Ž‘ŽYî•ñXVo—Íˆ—|‚d‚w‚h‚s.                                  
008740     EXIT.                                                        
008750*                                                                 
008760******************************************************************
008770*    I—¹ˆ—                                                    *
008780******************************************************************
008790 I—¹ˆ—                             SECTION.                    
008800 I—¹ˆ—|‚r‚s‚`‚q‚s.                                            
008810*                                                                 
008820*----------------------------------------------------------------*
008830*    ‚c‚aƒNƒ[ƒY                                                *
008840*----------------------------------------------------------------*
008850*                                                                 
008860     PERFORM  ‚c‚aƒNƒ[ƒY.                                       
008870*                                                                 
008880     PERFORM  ‚c‚aƒRƒ~ƒbƒgˆ—.                                   
008890*--< ƒtƒ@ƒCƒ‹ƒNƒ[ƒY >                                           
008900     CLOSE  “ü—Íƒtƒ@ƒCƒ‹.                                         
008910*----------------------------------------------------------------*
008920*    I—¹ƒƒbƒZ[ƒWo—Íˆ—                                      *
008930*----------------------------------------------------------------*
008940     PERFORM  I—¹ƒƒbƒZ[ƒWo—Í.                                 
008950*                                                                 
008960*--< ƒvƒƒOƒ‰ƒ€³íI—¹ >                                         
008970     MOVE  ’è”|³íó‘Ô             TO  PROGRAM-STATUS.         
008980*                                                                 
008990 I—¹ˆ—|‚d‚w‚h‚s.                                              
009000     EXIT.                                                        
009010******************************************************************
009020*    ‚c‚aƒNƒ[ƒY                                                *
009030******************************************************************
009040 ‚c‚aƒNƒ[ƒY                         SECTION.                    
009050 ‚c‚aƒNƒ[ƒY|‚r‚s‚`‚q‚s.                                        
009060*                                                                 
009070*--< ƒJ[ƒ\ƒ‹‚ÌƒNƒ[ƒY >                                         
009080     EXEC  SQL                                                    
009090        CLOSE  CUR1                                               
009100     END-EXEC.                                                    
009110*                                                                 
009120 ‚c‚aƒNƒ[ƒY|‚d‚w‚h‚s.                                          
009130     EXIT.                                                        
009140******************************************************************
009150*    ‚c‚aƒRƒ~ƒbƒgˆ—                                            *
009160******************************************************************
009170 ‚c‚aƒRƒ~ƒbƒgˆ—                     SECTION.                    
009180 ‚c‚aƒRƒ~ƒbƒgˆ—|‚r‚s‚`‚q‚s.                                    
009190*                                                                 
009200     EXEC  SQL                                                    
009210        COMMIT  WORK  RELEASE                                     
009220     END-EXEC.                                                    
009230*                                                                 
009240     INITIALIZE                       IF-CHOCO001.                
009250     MOVE  "3"                        TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê.     
009260     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c       TO  ‹¤‚P|ƒ\[ƒX‚h‚c.       
009270     MOVE  "0"                        TO  ‹¤‚P|•œ‹AƒR[ƒh.       
009280     MOVE  "COMMIT"                   TO  ‹¤‚P|ˆ—Ž¯•Ê.         
009290     MOVE  "ƒRƒ~ƒbƒgŽÀŽ{"             TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW. 
009300     CALL  CLOCO001                USING  IF-CHOCO001.            
009310*                                                                 
009320 ‚c‚aƒRƒ~ƒbƒgˆ—|‚d‚w‚h‚s.                                      
009330     EXIT.                                                        
009340******************************************************************
009350*    ‚c‚aƒ[ƒ‹ƒoƒbƒNˆ—                                        *
009360******************************************************************
009370 ‚c‚aƒ[ƒ‹ƒoƒbƒNˆ—                 SECTION.                    
009380 ‚c‚aƒ[ƒ‹ƒoƒbƒNˆ—|‚r‚s‚`‚q‚s.                                
009390*                                                                 
009400     EXEC  SQL                                                    
009410        ROLLBACK WORK  RELEASE                                    
009420     END-EXEC.                                                    
009430*                                                                 
009440     INITIALIZE                       IF-CHOCO001.                
009450     MOVE  "1"                        TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê.     
009460     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c       TO  ‹¤‚P|ƒ\[ƒX‚h‚c.       
009470     MOVE  "9"                        TO  ‹¤‚P|•œ‹AƒR[ƒh.       
009480     MOVE  "ROLLBACK"                 TO  ‹¤‚P|ˆ—Ž¯•Ê.         
009490     MOVE  "ƒ[ƒ‹ƒoƒbƒNŽÀŽ{"         TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW. 
009500     CALL  CLOCO001                USING  IF-CHOCO001.            
009510*                                                                 
009520 ‚c‚aƒ[ƒ‹ƒoƒbƒNˆ—|‚d‚w‚h‚s.                                  
009530     EXIT.                                                        
009540******************************************************************
009550*    I—¹ƒƒbƒZ[ƒWo—Í                                          *
009560******************************************************************
009570  I—¹ƒƒbƒZ[ƒWo—Í                  SECTION.                    
009580  I—¹ƒƒbƒZ[ƒWo—Í|‚r‚s‚`‚q‚s.                                 
009590*                                                                 
009600*----------------------------------------------------------------*
009610*    V•¨Œ”Ô†Ì”Ôƒe[ƒuƒ‹“ÇžŒ”                              *
009620*----------------------------------------------------------------*
009630     INITIALIZE                       IF-CHOCO001.                
009640     MOVE  "3"                        TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê.     
009650     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c       TO  ‹¤‚P|ƒ\[ƒX‚h‚c.       
009660     MOVE  ZERO                       TO  ‹¤‚P|•œ‹AƒR[ƒh.       
009670     MOVE  "IKOTBL010"                TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c. 
009680     MOVE  "COUNT"                    TO  ‹¤‚P|ˆ—Ž¯•Ê.         
009690     MOVE  ‚v|“ü—Í|Œ”‚P           TO  ‹¤‚P|ƒf[ƒ^“à—e.       
009700     MOVE  " V•¨Œ”Ô†Ì”Ôƒe[ƒuƒ‹“ÇžŒ”"                      
009710                                      TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW. 
009720     CALL  CLOCO001                USING  IF-CHOCO001.            
009730*                                                                 
009740*----------------------------------------------------------------*
009750*    Ž‘ŽY–¾×“Ç“ÇžŒ”                                          *
009760*----------------------------------------------------------------*
009770     INITIALIZE                       IF-CHOCO001.                
009780     MOVE  "3"                        TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê.     
009790     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c       TO  ‹¤‚P|ƒ\[ƒX‚h‚c.       
009800     MOVE  ZERO                       TO  ‹¤‚P|•œ‹AƒR[ƒh.       
009810     MOVE  "CPBIS165"                 TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c. 
009820     MOVE  "COUNT"                    TO  ‹¤‚P|ˆ—Ž¯•Ê.         
009830     MOVE  ‚v|“ü—Í|Œ”‚Q           TO  ‹¤‚P|ƒf[ƒ^“à—e.       
009840     MOVE  " Ž‘ŽY–¾×“Ç“ÇžŒ”"      TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW. 
009850     CALL  CLOCO001                USING  IF-CHOCO001.            
009860*                                                                 
009870*----------------------------------------------------------------*
009880*    Ž‘ŽYî•ñƒe[ƒuƒ‹XVŒ”                                    *
009890*----------------------------------------------------------------*
009900     INITIALIZE                       IF-CHOCO001.                
009910     MOVE  "3"                        TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê.     
009920     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c       TO  ‹¤‚P|ƒ\[ƒX‚h‚c.       
009930     MOVE  ZERO                       TO  ‹¤‚P|•œ‹AƒR[ƒh.       
009940     MOVE  "D921SIJ"                  TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c. 
009950     MOVE  "COUNT"                    TO  ‹¤‚P|ˆ—Ž¯•Ê.         
009960     MOVE  ‚v|XV|Œ”             TO  ‹¤‚P|ƒf[ƒ^“à—e.       
009970     MOVE  "Ž‘ŽYî•ñƒe[ƒuƒ‹XVŒ”"                             
009980                                      TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW. 
009990     CALL  CLOCO001                USING  IF-CHOCO001.            
010000*                                                                 
010010*----------------------------------------------------------------*
010020*    I—¹ƒƒbƒZ[ƒW o—Í                                         *
010030*----------------------------------------------------------------*
010040     INITIALIZE                       IF-CHOCO001.                
010050     MOVE  "3"                        TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê.     
010060     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c       TO  ‹¤‚P|ƒ\[ƒX‚h‚c.       
010070     MOVE  ZERO                       TO  ‹¤‚P|•œ‹AƒR[ƒh.       
010080     MOVE  "END"                      TO  ‹¤‚P|ˆ—Ž¯•Ê.         
010090     MOVE  ’è”|ƒvƒƒOƒ‰ƒ€–¼         TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW. 
010100     CALL  CLOCO001                USING  IF-CHOCO001.            
010110*                                                                 
010120 I—¹ƒƒbƒZ[ƒWo—Í|‚d‚w‚h‚s.                                    
010130     EXIT.                                                        
010140******************************************************************
010150*    ƒGƒ‰[ˆ—                                                  *
010160******************************************************************
010170 ƒGƒ‰[ˆ—                           SECTION.                    
010180 ƒGƒ‰[ˆ—|‚r‚s‚`‚q‚s.                                          
010190*                                                                 
010200     MOVE  "Y"                        TO ‚v|ˆÙíI—¹|ƒtƒ‰ƒO.    
010210     INITIALIZE                           IF-CHOCO001.            
010220*                                                                 
010230     EVALUATE  ‚v|ƒGƒ‰[ƒR[ƒh                                   
010240        WHEN  -10                                                 
010250*--<       ‚n‚q‚`‚b‚k‚dÚ‘±Ž¸”s >                                 
010260           MOVE  "1"                  TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê      
010270           MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c TO  ‹¤‚P|ƒ\[ƒX‚h‚c        
010280           MOVE  "9"                  TO  ‹¤‚P|•œ‹AƒR[ƒh        
010290           MOVE  "CONNECT"            TO  ‹¤‚P|ˆ—Ž¯•Ê          
010300           MOVE  SQLCODE              TO  ‹¤‚P|ƒf[ƒ^“à—e        
010310           MOVE  SQLERRMC             TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW  
010320           CALL  CLOCO001          USING  IF-CHOCO001             
010330*                                                                 
010340        WHEN  -20                                                 
010350*--<    ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“        >                                 
010360           MOVE  "1"                  TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê      
010370           MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c TO  ‹¤‚P|ƒ\[ƒX‚h‚c        
010380           MOVE  "9"                  TO  ‹¤‚P|•œ‹AƒR[ƒh        
010390           MOVE  "CPBIS165"           TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c  
010400           MOVE  "OPEN"               TO  ‹¤‚P|ˆ—Ž¯•Ê          
010410           MOVE  ‚v|ó‘Ô             TO  ‹¤‚P|ƒf[ƒ^“à—e        
010420           CALL  CLOCO001          USING  IF-CHOCO001             
010430*                                                                 
010440        WHEN  -30                                                 
010450*--<       Ž‘ŽYî•ñ‚n‚o‚d‚m  >                                    
010460           MOVE  "1"                  TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê      
010470           MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c TO  ‹¤‚P|ƒ\[ƒX‚h‚c        
010480           MOVE  "9"                  TO  ‹¤‚P|•œ‹AƒR[ƒh        
010490           MOVE  "D921SIJ"            TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c  
010500           MOVE  "OPEN"               TO  ‹¤‚P|ˆ—Ž¯•Ê          
010510           MOVE  SQLCODE              TO  ‹¤‚P|ƒf[ƒ^“à—e        
010520           MOVE  SQLERRMC             TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW  
010530           CALL  CLOCO001          USING  IF-CHOCO001             
010540*                                                                 
010550        WHEN  -40                                                 
010560*--<       Ž‘ŽYî•ñ“Çž   >                                     
010570           MOVE  "1"                  TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê      
010580           MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c TO  ‹¤‚P|ƒ\[ƒX‚h‚c        
010590           MOVE  "9"                  TO  ‹¤‚P|•œ‹AƒR[ƒh        
010600           MOVE  "D921SIJ"            TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c  
010610           MOVE  "FETCH"              TO  ‹¤‚P|ˆ—Ž¯•Ê          
010620           MOVE  SQLCODE              TO  ‹¤‚P|ƒf[ƒ^“à—e        
010630           MOVE  SQLERRMC             TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW  
010640           CALL  CLOCO001          USING  IF-CHOCO001             
010650*                                                                 
010660        WHEN  -50                                                 
010670*--<       Ž‘ŽY–¾×ƒtƒ@ƒCƒ‹“Çž  >                                
010680           MOVE  "1"                  TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê      
010690           MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c TO  ‹¤‚P|ƒ\[ƒX‚h‚c        
010700           MOVE  "9"                  TO  ‹¤‚P|•œ‹AƒR[ƒh        
010710           MOVE  "CPBIS165"           TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c  
010720           MOVE  "READ"               TO  ‹¤‚P|ˆ—Ž¯•Ê          
010730           MOVE  ‚v|ó‘Ô             TO  ‹¤‚P|ƒf[ƒ^“à—e        
010740           CALL  CLOCO001          USING  IF-CHOCO001             
010750*                                                                 
010760        WHEN  -60                                                 
010770*--<       V•¨Œ”Ô†’Šoˆ—  >                                  
010780           MOVE  "2"                  TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê      
010790           MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c TO  ‹¤‚P|ƒ\[ƒX‚h‚c        
010800           MOVE  "9"                  TO  ‹¤‚P|•œ‹AƒR[ƒh        
010810           MOVE  "IKOTBL010"          TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c  
010820           MOVE  "SELECT"             TO  ‹¤‚P|ˆ—Ž¯•Ê          
010830           MOVE  SQLCODE              TO  ‹¤‚P|ƒf[ƒ^“à—e        
010840           MOVE  SQLERRMC             TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW  
010850           CALL  CLOCO001          USING  IF-CHOCO001             
010860           MOVE  "N"                  TO  ‚v|ˆÙíI—¹|ƒtƒ‰ƒO    
010870           DISPLAY "Ž‘ŽYî•ñƒe[ƒuƒ‹XV‚È‚¢"
010880                   "Œ_–ñ”Ô†=" ‚v‚r|Œ_–ñ”Ô†
010890*                                                                 
010900        WHEN  -70                                                 
010910*--<       Ž‘ŽYî•ñXVˆ—  >                                    
010920           MOVE  "1"                  TO  ‹¤‚P|ƒCƒxƒ“ƒgŽí•Ê      
010930           MOVE  ’è”|ƒvƒƒOƒ‰ƒ€‚h‚c TO  ‹¤‚P|ƒ\[ƒX‚h‚c        
010940           MOVE  "9"                  TO  ‹¤‚P|•œ‹AƒR[ƒh        
010950           MOVE  "D921SIJ"            TO  ‹¤‚P|ˆ—ƒe[ƒuƒ‹‚h‚c  
010960           MOVE  "UPDATE"              TO  ‹¤‚P|ˆ—Ž¯•Ê         
010970           MOVE  SQLCODE              TO  ‹¤‚P|ƒf[ƒ^“à—e        
010980           MOVE  SQLERRMC             TO  ‹¤‚P|‚»‚Ì‘¼ƒƒbƒZ[ƒW  
010990           CALL  CLOCO001          USING  IF-CHOCO001             
011000*                                                                 
011010        WHEN  OTHER                                               
011020           MOVE  "N"                  TO ‚v|ˆÙíI—¹|ƒtƒ‰ƒO     
011030     END-EVALUATE.                                                
011040*                                                                 
011050     IF ‚v|ˆÙíI—¹|ƒtƒ‰ƒO  =  "Y"                              
011060        PERFORM  ‚c‚aƒ[ƒ‹ƒoƒbƒNˆ—                             
011070*                                                                 
011080        PERFORM  I—¹ˆ—                                         
011090*                                                                 
011100*--<    ƒvƒƒOƒ‰ƒ€ˆÙíI—¹‚ÌƒŠƒ^[ƒ“ƒR[ƒh >                      
011110        MOVE  ’è”|ˆÙíó‘Ô          TO  PROGRAM-STATUS          
011120*                                                                 
011130        EXIT  PROGRAM                                             
011140     END-IF.                                                      
011150*                                                                 
011160 ƒGƒ‰[ˆ—|‚d‚w‚h‚s.                                            
011170     EXIT.                                                        
011180******************************************************************
011190*                  END OF PROGRAM                                *
011200******************************************************************                                                                
