000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. L9208.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 77 YCKUAN PIC 9(5).
000070 77 NIAN PIC 9.
000090 77 LIXI PIC 9(7).
000100*P-LIXI BIAN JI XING
000110 77 P-LIXI PIC *,*(3),*(3).
000120 77 HEJI PIC 9(7).
000130 77 YUESHU PIC 99.
000140 77 CKSHU PIC 9(7).
000150 77 RR PIC 9V99.
000160 01 LILU.
000170     02 R1 PIC 9V99.
000180     02 R2 PIC 9V99.
000190     02 R3 PIC 9V99.
000200     02 R5 PIC 9V99.
000210 PROCEDURE DIVISION.
000220 PR-START.
000230     DISPLAY "LI XI LU RU R1 R2 R3 R5".
000240     ACCEPT R1.
000250     ACCEPT R2.
000260     ACCEPT R3.
000270     ACCEPT R5.
000280     DISPLAY "YUE CUN KUAN".
000290     ACCEPT YCKUAN.
000300 PR-O.
000310     DISPLAY "NIAN XIAN".
000320     ACCEPT NIAN.
000330     IF NIAN = 1 MOVE R1 TO RR GO TO PR-1.
000340     IF NIAN = 2 MOVE R2 TO RR GO TO PR-1.
000350     IF NIAN = 3 MOVE R3 TO RR GO TO PR-1.
000360     IF NIAN = 5 MOVE R5 TO RR GO TO PR-1.
000370     DISPLAY "NIAN SHU RU CUO".
000380     GO TO PR-O.
000390 PR-1.
000400*
000410     COMPUTE YUESHU = NIAN * 12.
000420*
000430     COMPUTE CKSHU = YCKUAN * YUESHU.
000440*     
000450     PERFORM PR-2.
000460     MOVE LIXI TO P-LIXI.
000470     DISPLAY "LIXI=" P-LIXI.
000480     DISPLAY "BEN LI HE JI=" HEJI.
000490     STOP 0.
000500 PR-2.              
000510     COMPUTE LIXI = YCKUAN * YUESHU * ( YUESHU + 1 ) * RR / 2400.
000520     DISPLAY LIXI.
000530     COMPUTE HEJI = CKSHU + LIXI.     