       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAIJRO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       77 PROD-SOLD PIC 9(3)V99.
       77 QTY-SOLD   PIC 9(4).
       77 VALUE-CALC PIC Z(7).99.
       PROCEDURE DIVISION USING PROD-COST QTY-SOLD
                         VALUE-CALC.
       BEGIN.
                COMPUTE VALUE-CALC=PROD-OOST * QTY -SOLD.
       BB.  
           EXIT PROGRAM.
