000010************************************************
000020* Â–±iÂ–±Šî–{j(LTRSMK)
000030************************************************
000040 01  ‚k‚s‚q‚r‚l‚j|Â–±Œ_–ñ‚m‚n PIC  X(010).
000050 01  ‚k‚s‚q‚r‚l‚j|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚r‚l‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000070 01  ‚k‚s‚q‚r‚l‚j|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000080 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚P PIC S9(013) COMP-3.
000090 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚P PIC S9(013) COMP-3.
000100 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚Q PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚Q PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚R PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚R PIC S9(013) COMP-3.
000140 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚S PIC S9(013) COMP-3.
000150 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚S PIC S9(013) COMP-3.
000160 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚T PIC S9(013) COMP-3.
000170 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚T PIC S9(013) COMP-3.
000180 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚U PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚U PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚V PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚V PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚W PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚W PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚X PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚X PIC S9(013) COMP-3.
000260 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|‰ñŽû•¨Œ‹àŠz‚P‚O PIC S9(013) COMP-3.
000270 01  ‚k‚s‚q‚r‚l‚j|Œ_–ñî•ñ|Œ_–ñ‹àŠz‚P‚O PIC S9(013) COMP-3.
000280 01  ‚k‚s‚q‚r‚l‚j|Â–±Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000290 01  ‚k‚s‚q‚r‚l‚j|‘S•”‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚r‚l‚j|‘S•”‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000310 01  ‚k‚s‚q‚r‚l‚j|‘S•”‰ð–ñ”NŒŽ|¢‹I PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚r‚l‚j|‘S•”‰ð–ñ”NŒŽ|”NŒŽ PIC  X(004).
000330 01  ‚k‚s‚q‚r‚l‚j|‹ŒÂ–±Œ_–ñ‚m‚n PIC  X(010).
000340 01  ‚k‚s‚q‚r‚l‚j|VÂ–±Œ_–ñ‚m‚n PIC  X(010).
000350 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚P PIC S9(001) COMP-3.
000360 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚Q PIC S9(001) COMP-3.
000370 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚R PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚S PIC S9(001) COMP-3.
000390 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚T PIC S9(001) COMP-3.
000400 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚U PIC S9(001) COMP-3.
000410 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚V PIC S9(001) COMP-3.
000420 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚W PIC S9(001) COMP-3.
000430 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚X PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚r‚l‚j|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX‚P‚O PIC S9(001) COMP-3.
000450 01  ‚k‚s‚q‚r‚l‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(022).
000460 01  ‚k‚s‚q‚r‚l‚j|‹¤’Êî•ñ PIC  X(035).
