//COB2RUN  JOB  CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//GO1        EXEC PGM=SEQFILE3
//STEPLIB DD DSN=ST125.TEST.LOAD,DISP=SHR
//STUDENTS  DD  DSN=ST125.COBOL.STUDENT2,DISP=SHR
//SYSOUT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN   DD  *
9123293ZHAO    PENG820506LD32M
9345632THOMAS  EVEN740903LD12M
1920340TERRY  CLAYS670404LD02F

/*
//
