       IDENTIFICATION DIVISION.
       PROGRAM-ID.   mainpgm.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       L100.
           CALL "FILEM".
           CALL "FILER".
           STOP 1.
           STOP RUN.