      *****************************************************************   
      *程序ID         ：StudentInfo                                             
      *程序名         ：学生学籍数据                                  
      *日期           作成者            概要                              
      *2007/03/18     张丽娟            作成                              
      *                                                                   
      *                                                                   
      *                                                                   
      *****************************************************************   
000030 01 ()StudentInfo.
      *         姓名
           02 ()SName                   PIC X(10).
      *         性别
           02 ()SSex                     PIC X.
      *         年龄
           02 ()SAge                     PIC 99.

