000010************************************************
000020* (ALM_CPPMST)
000030************************************************
000040 01  ALM_CPPMST-CTLNUM PIC  X(006).
000050 01  ALM_CPPMST-CLTNAM PIC  X(040).
000060 01  ALM_CPPMST-BALCAP PIC S9(013) COMP-3.
000070 01  ALM_CPPMST-COLAMT PIC S9(013) COMP-3.
000080 01  ALM_CPPMST-ISUDAY PIC  X(008).
000090 01  ALM_CPPMST-DUEDAY PIC  X(008).
000100 01  ALM_CPPMST-UPDCYC PIC  X(002).
000110 01  ALM_CPPMST-AVEBAL PIC S9(013) COMP-3.
000120 01  ALM_CPPMST-COLRAT PIC S9(002)V9(5) COMP-3.
000130 01  ALM_CPPMST-CHARGE PIC S9(002)V9(5) COMP-3.
000140 01  ALM_CPPMST-REFNUM PIC  X(020).
000150 01  ALM_CPPMST-FIXFLT PIC  X(001).
000160 01  ALM_CPPMST-TRMTYP PIC  X(001).
