000010************************************************
000020* (ALM_ACCMST)
000030************************************************
000040 01  ALM_ACCMST-ACCCOD PIC  X(005).
000050 01  ALM_ACCMST-ACCNAM PIC  X(032).
000060 01  ALM_ACCMST-ASTLIA PIC  X(001).
000070 01  ALM_ACCMST-ALMDET PIC  X(002).
000080 01  ALM_ACCMST-DUECOD PIC  X(002).
000090 01  ALM_ACCMST-ALMTYP PIC  X(001).
000100 01  ALM_ACCMST-OPEDAY PIC  X(008).
000110 01  ALM_ACCMST-BALCAP PIC S9(013) COMP-3.
000120 01  ALM_ACCMST-OPEFLG PIC  X(001).
