000010************************************************
000020* (ALM_FORM_0001M)
000030************************************************
000040 01  ALM_FORM_0001M-MON000 PIC  X(006).
000050 01  ALM_FORM_0001M-MON001 PIC  X(006).
000060 01  ALM_FORM_0001M-MON002 PIC  X(006).
000070 01  ALM_FORM_0001M-MON003 PIC  X(006).
000080 01  ALM_FORM_0001M-MON004 PIC  X(006).
000090 01  ALM_FORM_0001M-MON005 PIC  X(006).
000100 01  ALM_FORM_0001M-MON006 PIC  X(006).
000110 01  ALM_FORM_0001M-MON007 PIC  X(006).
000120 01  ALM_FORM_0001M-MON008 PIC  X(006).
000130 01  ALM_FORM_0001M-MON009 PIC  X(006).
000140 01  ALM_FORM_0001M-MON010 PIC  X(006).
000150 01  ALM_FORM_0001M-MON011 PIC  X(006).
000160 01  ALM_FORM_0001M-MON012 PIC  X(006).
