000010************************************************
000020* (ALM_SWPMST)
000030************************************************
000040 01  ALM_SWPMST-CTLNUM PIC  X(004).
000050 01  ALM_SWPMST-CLTNAM PIC  X(040).
000060 01  ALM_SWPMST-ISUDAY PIC  X(008).
000070 01  ALM_SWPMST-INTBGN PIC  X(008).
000080 01  ALM_SWPMST-DUEDAY PIC  X(008).
000090 01  ALM_SWPMST-UPDCYC PIC  X(002).
000100 01  ALM_SWPMST-MONCNT PIC S9(003) COMP-3.
000110 01  ALM_SWPMST-CNTCAP PIC S9(013) COMP-3.
000120 01  ALM_SWPMST-BALCAP PIC S9(013) COMP-3.
000130 01  ALM_SWPMST-COLAMT PIC S9(013) COMP-3.
000140 01  ALM_SWPMST-COLLST PIC S9(013) COMP-3.
000150 01  ALM_SWPMST-COLCNT PIC S9(002) COMP-3.
000160 01  ALM_SWPMST-RCVDAY PIC  X(003).
000170 01  ALM_SWPMST-PAYDAY PIC  X(003).
000180 01  ALM_SWPMST-RCVRAT PIC S9(002)V9(5) COMP-3.
000190 01  ALM_SWPMST-PAYRAT PIC S9(002)V9(5) COMP-3.
000200 01  ALM_SWPMST-MARGIN PIC S9(002)V9(5) COMP-3.
000210 01  ALM_SWPMST-CCYCOD PIC  X(003).
000220 01  ALM_SWPMST-CCYRAT PIC S9(004)V9(2) COMP-3.
000230 01  ALM_SWPMST-AVEBAL PIC S9(013) COMP-3.
000240 01  ALM_SWPMST-UPDFLG PIC  X(001).
