000010************************************************
000020* (ALM_EXCEL_0001)
000030************************************************
000040 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|Ž‘•‰‹æ•ª PIC  X(006).
000050 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚`‚k‚lƒR[ƒh PIC  X(002).
000060 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚`‚k‚l–¾×–¼ PIC  X(020).
000070 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|ŒÅ’è•Ï“® PIC  X(006).
000080 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|•”–åƒR[ƒh PIC  X(001).
000090 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|•”–å–¼ PIC  X(010).
000100 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|’´’ZŠú PIC S9(013) COMP-3.
000110 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|Šú“úŠÇ— PIC S9(013) COMP-3.
000120 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|ŒÂ•ÊŠÇ— PIC S9(013) COMP-3.
000130 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|–³ŠúŒÀ PIC S9(013) COMP-3.
000140 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‘ÎÛŠO PIC S9(013) COMP-3.
000150 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Pƒ–ŒŽŒã PIC S9(013) COMP-3.
000160 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Qƒ–ŒŽŒã PIC S9(013) COMP-3.
000170 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Rƒ–ŒŽŒã PIC S9(013) COMP-3.
000180 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Sƒ–ŒŽŒã PIC S9(013) COMP-3.
000190 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Tƒ–ŒŽŒã PIC S9(013) COMP-3.
000200 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Uƒ–ŒŽŒã PIC S9(013) COMP-3.
000210 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Vƒ–ŒŽŒã PIC S9(013) COMP-3.
000220 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Wƒ–ŒŽŒã PIC S9(013) COMP-3.
000230 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Xƒ–ŒŽŒã PIC S9(013) COMP-3.
000240 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚P‚Oƒ–ŒŽŒã PIC S9(013) COMP-3.
000250 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚P‚Pƒ–ŒŽŒã PIC S9(013) COMP-3.
000260 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚P‚Qƒ–ŒŽŒã PIC S9(013) COMP-3.
000270 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|“–”N“x PIC S9(013) COMP-3.
000280 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚P”NŒã”N“x PIC S9(013) COMP-3.
000290 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚Q”NŒã”N“x PIC S9(013) COMP-3.
000300 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚R”NŒã”N“x PIC S9(013) COMP-3.
000310 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚S”NŒã”N“x PIC S9(013) COMP-3.
000320 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚T”NŒã”N“x PIC S9(013) COMP-3.
000330 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚U”NŒã”N“x PIC S9(013) COMP-3.
000340 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚V”NŒã”N“x PIC S9(013) COMP-3.
000350 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚W”NŒã”N“x PIC S9(013) COMP-3.
000360 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚X”NŒã”N“x PIC S9(013) COMP-3.
000370 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|‚P‚O”N’´ PIC S9(013) COMP-3.
000380 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|’´’ZŠú 
                                             PIC S9(002)V9(2) COMP-3.
000390 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|Šú“úŠÇ— 
                                             PIC S9(002)V9(2) COMP-3.
000400 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|ŒÂ•ÊŠÇ— 
                                             PIC S9(002)V9(2) COMP-3.
000410 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|–³ŠúŒÀ 
                                             PIC S9(002)V9(2) COMP-3.
000420 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‘ÎÛŠO 
                                             PIC S9(002)V9(2) COMP-3.
000430 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Pƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000440 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Qƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000450 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Rƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000460 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Sƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000470 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Tƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000480 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Uƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000490 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Vƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000500 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Wƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000510 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Xƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000520 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚P‚Oƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000530 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚P‚Pƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000540 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚P‚Qƒ–ŒŽŒã 
                                             PIC S9(002)V9(2) COMP-3.
000550 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|“–”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000560 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚P”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000570 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚Q”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000580 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚R”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000590 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚S”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000600 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚T”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000610 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚U”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000620 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚V”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000630 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚W”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000640 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚X”NŒã”N“x 
                                             PIC S9(002)V9(2) COMP-3.
000650 01  ‚`‚k‚l|‚d‚w‚b‚d‚k|‚O‚O‚O‚P|—˜‘§|‚P‚O”N’´ 
                                             PIC S9(002)V9(2) COMP-3.
