000010************************************************
000020* (ANK_LOST)
000030************************************************
000040 01  ‚`‚m‚j|‚k‚n‚r‚s|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚k‚n‚r‚s|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚k‚n‚r‚s|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚`‚m‚j|‚k‚n‚r‚s|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000080 01  ‚`‚m‚j|‚k‚n‚r‚s|ŒÚ‹qƒR[ƒh PIC  X(006).
000090 01  ‚`‚m‚j|‚k‚n‚r‚s|Žæˆøæ–¼ PIC  X(060).
000100 01  ‚`‚m‚j|‚k‚n‚r‚s|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000110 01  ‚`‚m‚j|‚k‚n‚r‚s|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000120 01  ‚`‚m‚j|‚k‚n‚r‚s|Œ©Ï“ú PIC  X(008).
000130 01  ‚`‚m‚j|‚k‚n‚r‚s|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000140 01  ‚`‚m‚j|‚k‚n‚r‚s|ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000150 01  ‚`‚m‚j|‚k‚n‚r‚s|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000160 01  ‚`‚m‚j|‚k‚n‚r‚s|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000170 01  ‚`‚m‚j|‚k‚n‚r‚s|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000180 01  ‚`‚m‚j|‚k‚n‚r‚s|‘e—˜‰v PIC S9(013) COMP-3.
000190 01  ‚`‚m‚j|‚k‚n‚r‚s|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000200 01  ‚`‚m‚j|‚k‚n‚r‚s|•¨Œ–¼ PIC  X(060).
000210 01  ‚`‚m‚j|‚k‚n‚r‚s|Žó’ƒŠ[ƒX‰ïŽÐ PIC  X(040).
000220 01  ‚`‚m‚j|‚k‚n‚r‚s|‘¼ŽÐŽó’—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000230 01  ‚`‚m‚j|‚k‚n‚r‚s|ƒƒXƒg——R‹æ•ª PIC  X(002).
000240 01  ‚`‚m‚j|‚k‚n‚r‚s|ƒƒXƒgˆÄŒ–ž—¹“ú PIC  X(008).
000250 01  ‚`‚m‚j|‚k‚n‚r‚s|ƒƒXƒg——R PIC  X(100).
000260 01  ‚`‚m‚j|‚k‚n‚r‚s|“o˜^“ú PIC  X(008).
000270 01  ‚`‚m‚j|‚k‚n‚r‚s|“o˜^Žž PIC  X(006).
000280 01  ‚`‚m‚j|‚k‚n‚r‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000290 01  ‚`‚m‚j|‚k‚n‚r‚s|XV“ú PIC  X(008).
000300 01  ‚`‚m‚j|‚k‚n‚r‚s|XVŽž PIC  X(006).
000310 01  ‚`‚m‚j|‚k‚n‚r‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
