000010************************************************
000020* (ANK_TANNI)
000030************************************************
000040 01  ‚`‚m‚j|‚s‚`‚m‚m‚h|’PˆÊƒR[ƒh PIC  X(002).
000050 01  ‚`‚m‚j|‚s‚`‚m‚m‚h|’PˆÊ PIC  X(004).
000060 01  ‚`‚m‚j|‚s‚`‚m‚m‚h|“o˜^“ú PIC  X(008).
000070 01  ‚`‚m‚j|‚s‚`‚m‚m‚h|“o˜^Žž PIC  X(006).
000080 01  ‚`‚m‚j|‚s‚`‚m‚m‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚`‚m‚j|‚s‚`‚m‚m‚h|XV“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚s‚`‚m‚m‚h|XVŽž PIC  X(006).
000110 01  ‚`‚m‚j|‚s‚`‚m‚m‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
