000010************************************************
000020* (ANK_STATUS)
000030************************************************
000040 01  ‚`‚m‚j|‚r‚s‚`‚s‚t‚r|ƒXƒe[ƒ^ƒX PIC  X(001).
000050 01  ‚`‚m‚j|‚r‚s‚`‚s‚t‚r|“à—e PIC  X(010).
000060 01  ‚`‚m‚j|‚r‚s‚`‚s‚t‚r|“o˜^“ú PIC  X(008).
000070 01  ‚`‚m‚j|‚r‚s‚`‚s‚t‚r|“o˜^Žž PIC  X(006).
000080 01  ‚`‚m‚j|‚r‚s‚`‚s‚t‚r|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚`‚m‚j|‚r‚s‚`‚s‚t‚r|XV“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚r‚s‚`‚s‚t‚r|XVŽž PIC  X(006).
000110 01  ‚`‚m‚j|‚r‚s‚`‚s‚t‚r|XV’S“–ŽÒƒR[ƒh PIC  X(004).
