000010************************************************
000020* (ANK_KANRIHYO)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|’S“–ŽÒƒR[ƒh PIC  X(004).
000080 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ˆÄŒó‹µ‹æ•ª PIC  X(002).
000090 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ŒÚ‹qƒR[ƒh PIC  X(006).
000100 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|Žæˆøæ–¼ PIC  X(060).
000110 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|Œ©Ï“ú PIC  X(008).
000120 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000130 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000140 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000150 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‘e—˜‰v PIC S9(013) COMP-3.
000160 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000170 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000180 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|•¨Œ–¼|Š¿Žš PIC  X(040).
000190 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ŒŸŽû—\’è“ú PIC  X(008).
000200 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|Žó’ƒŠ[ƒX‰ïŽÐ PIC  X(040).
000210 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‘¼ŽÐŽó’—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000220 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ƒƒXƒg——R‹æ•ª PIC  X(002).
000230 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ƒƒXƒgˆÄŒ–ž—¹“ú PIC  X(008).
000240 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|ƒƒXƒg——R PIC  X(100).
