000010************************************************
000020* (ANK_JUCYU)
000030************************************************
000040 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|’S“–ŽÒƒR[ƒh PIC  X(004).
000070 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|ŒÚ‹qƒR[ƒh PIC  X(006).
000080 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|Œ_–ñ“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000110 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000120 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000130 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‘e—˜‰v PIC S9(013) COMP-3.
000140 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000150 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000160 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|•¨Œ–¼|Š¿Žš PIC  X(040).
000170 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|ŒŸŽû—\’è“ú PIC  X(008).
000180 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000190 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|w“üæ–¼ PIC  X(060).
