000010************************************************
000020* (ANK_SHOUHOU)
000030************************************************
000040 01  ‚`‚m‚j|‚r‚g‚n‚t‚g‚n‚t|Žx•¥•û–@ƒR[ƒh PIC  X(002).
000050 01  ‚`‚m‚j|‚r‚g‚n‚t‚g‚n‚t|Žx•¥•û–@ PIC  X(040).
000060 01  ‚`‚m‚j|‚r‚g‚n‚t‚g‚n‚t|“o˜^“ú PIC  X(008).
000070 01  ‚`‚m‚j|‚r‚g‚n‚t‚g‚n‚t|“o˜^Žž PIC  X(006).
000080 01  ‚`‚m‚j|‚r‚g‚n‚t‚g‚n‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚`‚m‚j|‚r‚g‚n‚t‚g‚n‚t|XV“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚r‚g‚n‚t‚g‚n‚t|XVŽž PIC  X(006).
000110 01  ‚`‚m‚j|‚r‚g‚n‚t‚g‚n‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
