000010************************************************
000020* (ANK_WORK001)
000030************************************************
000040 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|Œ©Ï‘’ñoæ PIC  X(060).
000070 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|Œ©Ï“ú PIC  X(008).
000080 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ZŠ PIC  X(100).
000090 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|’S“–•”“X PIC  X(020).
000100 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|“d˜b”Ô† PIC  X(020).
000110 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|‚e‚`‚w”Ô† PIC  X(020).
000120 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|•¨Œ–¼‚P PIC  X(040).
000130 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|”—Ê‚P PIC S9(004) COMP-3.
000140 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|’PˆÊ‚P PIC  X(004).
000150 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|w“ü‹àŠz‚P PIC S9(013) COMP-3.
000160 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|•¨Œ–¼‚Q PIC  X(040).
000170 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|”—Ê‚Q PIC S9(004) COMP-3.
000180 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|’PˆÊ‚Q PIC  X(004).
000190 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|w“ü‹àŠz‚Q PIC S9(013) COMP-3.
000200 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|•¨Œ–¼‚R PIC  X(040).
000210 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|”—Ê‚R PIC S9(004) COMP-3.
000220 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|’PˆÊ‚R PIC  X(004).
000230 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|w“ü‹àŠz‚R PIC S9(013) COMP-3.
000240 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|•¨Œ–¼‚S PIC  X(040).
000250 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|”—Ê‚S PIC S9(004) COMP-3.
000260 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|’PˆÊ‚S PIC  X(004).
000270 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|w“ü‹àŠz‚S PIC S9(013) COMP-3.
000280 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|•¨Œ–¼‚T PIC  X(040).
000290 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|”—Ê‚T PIC S9(004) COMP-3.
000300 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|’PˆÊ‚T PIC  X(004).
000310 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|w“ü‹àŠz‚T PIC S9(013) COMP-3.
000320 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000330 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ŒvŽZ•ûŽ®‚P PIC  X(001).
000340 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ŒvŽZ•ûŽ®‚Q PIC  X(001).
000350 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ŒvŽZ•ûŽ®‚R PIC  X(001).
000360 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ƒŠ[ƒXŠúŠÔ‚P PIC S9(003) COMP-3.
000370 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ƒŠ[ƒXŠúŠÔ‚Q PIC S9(003) COMP-3.
000380 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ƒŠ[ƒXŠúŠÔ‚R PIC S9(003) COMP-3.
000390 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|¿‹ƒTƒCƒNƒ‹‚P PIC S9(002) COMP-3.
000400 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|¿‹ƒTƒCƒNƒ‹‚Q PIC S9(002) COMP-3.
000410 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|¿‹ƒTƒCƒNƒ‹‚R PIC S9(002) COMP-3.
000420 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ƒŠ[ƒX—¿‚P PIC S9(013) COMP-3.
000430 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ƒŠ[ƒX—¿‚Q PIC S9(013) COMP-3.
000440 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ƒŠ[ƒX—¿‚R PIC S9(013) COMP-3.
000450 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|Á”ïÅ“™Šz‚P PIC S9(013) COMP-3.
000460 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|Á”ïÅ“™Šz‚Q PIC S9(013) COMP-3.
000470 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|Á”ïÅ“™Šz‚R PIC S9(013) COMP-3.
000480 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|‘OŽóƒŠ[ƒX—¿‚P PIC S9(013) COMP-3.
000490 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|‘OŽóƒŠ[ƒX—¿‚Q PIC S9(013) COMP-3.
000500 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|‘OŽóƒŠ[ƒX—¿‚R PIC S9(013) COMP-3.
000510 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ƒŠ[ƒX—¿Žx•¥•û–@‚P PIC  X(040).
000520 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ƒŠ[ƒX—¿Žx•¥•û–@‚Q PIC  X(040).
000530 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ÄƒŠ[ƒX—¿ PIC  X(060).
000540 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ŒŸŽû—\’è“ú PIC  X(008).
000550 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|Ý’uêŠ–¼ PIC  X(060).
000560 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|•ÛŽçŒ_–ñ PIC  X(060).
000570 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|˜A‘Ñ•ÛØl PIC  X(060).
000580 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|•tð€ PIC  X(500).
000590 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|Œ©Ï—LŒøŠúŒÀ PIC  X(008).
000600 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ˆÄŒƒŠƒtƒ@ƒŒƒ“ƒX‚P PIC  X(020).
000610 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|ˆÄŒƒŠƒtƒ@ƒŒƒ“ƒX‚Q PIC  X(020).
000620 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|w“ü‹àŠz”ñ•\Ž¦‹æ•ª 
                                             PIC S9(001) COMP-3.
000630 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|—¿—¦”ñ•\Ž¦‹æ•ª PIC S9(001) COMP-3.
000640 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|“o˜^“ú PIC  X(008).
000650 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|“o˜^Žž PIC  X(006).
000660 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000670 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|XV“ú PIC  X(008).
000680 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|XVŽž PIC  X(006).
000690 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚O‚P|XV’S“–ŽÒƒR[ƒh PIC  X(004).
