000010************************************************
000020* (ANK_WORK009)
000030************************************************
000040 01  ANK_WORK009-KEY PIC  X(001).
000050 01  ANK_WORK009-案件番号 PIC  X(010).
000060 01  ANK_WORK009-見積枝番 PIC  X(002).
000070 01  ANK_WORK009-物件NO PIC  X(003).
000080 01  ANK_WORK009-物件名_漢字 PIC  X(040).
000090 01  ANK_WORK009-購入金額 PIC S9(013) COMP-3.
000100 01  ANK_WORK009-耐用年数 PIC S9(002) COMP-3.
000110 01  ANK_WORK009-動総保険料率 PIC S9(002)V9(3) COMP-3.
000120 01  ANK_WORK009-登録日 PIC  X(008).
000130 01  ANK_WORK009-登録時刻 PIC  X(006).
000140 01  ANK_WORK009-登録担当者ｺｰﾄﾞ PIC  X(004).
000150 01  ANK_WORK009-更新日 PIC  X(008).
000160 01  ANK_WORK009-更新時刻 PIC  X(006).
000170 01  ANK_WORK009-更新担当者ｺｰﾄﾞ PIC  X(004).
