000010************************************************
000020* (APR_LPWK_CHUMON)
000030************************************************
000040 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000050 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000060 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|’ •[ì¬‹æ•ª PIC  X(001).
000070 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|Œ_–ñ”Ô†‚e‚q‚n‚l 
                                             PIC  X(009).
000080 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|Œ_–ñ”Ô†‚s‚n PIC  X(009).
000090 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|Œ_–ñ“ú PIC  X(008).
000100 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|ŒŸŽû—\’è“ú PIC  X(008).
000110 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|ŒŸŽû“ú PIC  X(008).
000120 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|”„Žå–¼ PIC  X(060).
000130 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|Žx•¥ðŒ PIC  X(040).
000140 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000150 01  ‚`‚o‚q|‚k‚o‚v‚j|‚b‚g‚t‚l‚n‚m|Á”ïÅ“™Šz‡Œv 
                                             PIC S9(013) COMP-3.
