000010************************************************
000020* (APR_LPWK_PROOF)
000030************************************************
000040 01  ‚`‚o‚q|‚k‚o‚v‚j|‚o‚q‚n‚n‚e|’[––”Ô† PIC  X(016).
000050 01  ‚`‚o‚q|‚k‚o‚v‚j|‚o‚q‚n‚n‚e|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚`‚o‚q|‚k‚o‚v‚j|‚o‚q‚n‚n‚e|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚`‚o‚q|‚k‚o‚v‚j|‚o‚q‚n‚n‚e|Ý’uêŠ–¼ PIC  X(020).
000080 01  ‚`‚o‚q|‚k‚o‚v‚j|‚o‚q‚n‚n‚e|ƒAƒ|ƒ¤•iƒR[ƒh PIC  X(004).
000090 01  ‚`‚o‚q|‚k‚o‚v‚j|‚o‚q‚n‚n‚e|•¨Œ–¼ PIC  X(030).
000100 01  ‚`‚o‚q|‚k‚o‚v‚j|‚o‚q‚n‚n‚e|‰ð–ñŒãƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
