000010************************************************
000020* (APR_LPWK_KEIYAKUSYO)
000030************************************************
000040 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|’[––”Ô† 
                                             PIC  X(016).
000050 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|ƒŠ[ƒXŠ„•Š‹æ•ª 
                                             PIC  X(001).
000060 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|ŠJŽnƒAƒ|ƒŒ_–ñ”Ô† 
                                             PIC  X(007).
000070 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|ƒy[ƒW‹æ•ª 
                                             PIC S9(001) COMP-3.
000080 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|ƒŒƒR[ƒh‹æ•ª 
                                             PIC S9(001) COMP-3.
000090 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|\ž“ú 
                                             PIC  X(008).
000100 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|³‘ø“ú 
                                             PIC  X(008).
000110 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|I—¹ƒAƒ|ƒŒ_–ñ”Ô† 
                                             PIC  X(007).
000120 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|•¨Œ–¼ PIC  X(020).
000130 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000140 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|w“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000150 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|ƒŠ[ƒX—¿‘Šz 
                                             PIC S9(013) COMP-3.
000160 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|Á”ïÅŠz 
                                             PIC S9(011) COMP-3.
000170 01  ‚`‚o‚q|‚k‚o‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚r‚x‚n|‡ŒvŠz 
                                             PIC S9(013) COMP-3.
