000010************************************************
000020* (APR_LPWK_CHOHYO)
000030************************************************
000040 01  APR_LPWK_CHOHYO-KEY PIC  X(001).
000050 01  APR_LPWK_CHOHYO-’ •[1 PIC  X(001).
000060 01  APR_LPWK_CHOHYO-’ •[2 PIC  X(001).
000070 01  APR_LPWK_CHOHYO-’ •[3 PIC  X(001).
