000010************************************************
000020* (APR_BUKKEN_SOSIN)
000030************************************************
000040 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ƒf[ƒ^Ž¯•ÊƒR[ƒh 
                                             PIC  X(002).
000050 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|‘—MŽ–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000060 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ì¬“ú•t PIC  X(008).
000070 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ì¬Žž PIC  X(006).
000080 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Œ_–ñ”Ô† PIC  X(009).
000090 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ƒŒƒR[ƒh‹æ•ª PIC  X(001).
000100 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|•¨Œ‚m‚n PIC  X(003).
000110 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|•¨Œ–¼Š¿Žš PIC  X(040).
000120 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|•¨Œ–¼ƒJƒi PIC  X(020).
000130 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Žd—l»‘¢”Ô† PIC  X(020).
000140 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|”—Ê PIC S9(004) COMP-3.
000150 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|w“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000160 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Žd“üÁ”ïÅ“™ 
                                             PIC S9(013) COMP-3.
000170 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Ž‘ŽYƒR[ƒh PIC  X(007).
000180 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|‘Ï—p”N” PIC  X(002).
000190 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|’†ŒÃŽ‘ŽYƒR[ƒh 
                                             PIC  X(001).
000200 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|“®‘•ÛŒ¯ƒR[ƒh 
                                             PIC  X(004).
000210 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|“®‘•ÛŒ¯—¿—¦ 
                                             PIC S9(004) COMP-3.
000220 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|”[•tæƒR[ƒh PIC  X(006).
000230 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Å‹æ•ª PIC  X(001).
000240 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|“Á—áŠúŠÔ 
                                             PIC S9(002) COMP-3.
000250 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|“Á—á—¦•ªŽq 
                                             PIC S9(002) COMP-3.
000260 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|“Á—á—¦•ª•ê 
                                             PIC S9(002) COMP-3.
000270 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Å•‰’SƒR[ƒh PIC  X(001).
000280 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Ý’uêŠ—X•Ö”Ô†
                                             PIC  X(007).
000290 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Ý’uêŠZŠ PIC  X(100).
000300 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Ý’uêŠ–¼Š¿Žš 
                                             PIC  X(040).
000310 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Ý’uêŠ–¼ƒJƒi 
                                             PIC  X(020).
000320 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|M—p•ÛŒ¯ƒR[ƒh 
                                             PIC  X(006).
000330 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Œ^Ž®”Ô† PIC  X(015).
000340 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|w“üæƒR[ƒh PIC  X(008).
000350 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Žx•¥æƒR[ƒh PIC  X(004).
000360 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000370 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Žc‰¿Šz 
                                             PIC S9(013) COMP-3.
000380 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Žc‰¿•ÛØ‹æ•ª PIC  X(001).
000390 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Žc‰¿•ÛØæƒR[ƒh 
                                             PIC  X(008).
000400 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|Žc‰¿•ÛØæ–¼ PIC  X(060).
000410 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚P 
                                             PIC  X(012).
000420 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚Q 
                                             PIC  X(012).
000430 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚R 
                                             PIC  X(012).
000440 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚S 
                                             PIC  X(012).
000450 01  ‚`‚o‚q|‚a‚t‚j‚j‚d‚m|‚r‚n‚r‚h‚m|ƒfƒB[ƒ‰[ƒR[ƒh
                                             PIC  X(005).
