000010************************************************
000020* (APR_KESSAI_MST)
000030************************************************
000040 01  ‚`‚o‚q|‚j‚d‚r‚r‚`‚h|‚l‚r‚s|ŒˆÏæƒR[ƒh PIC  X(006).
000050 01  ‚`‚o‚q|‚j‚d‚r‚r‚`‚h|‚l‚r‚s|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000060 01  ‚`‚o‚q|‚j‚d‚r‚r‚`‚h|‚l‚r‚s|“o˜^“ú PIC  X(008).
000070 01  ‚`‚o‚q|‚j‚d‚r‚r‚`‚h|‚l‚r‚s|“o˜^Žž PIC  X(006).
000080 01  ‚`‚o‚q|‚j‚d‚r‚r‚`‚h|‚l‚r‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚`‚o‚q|‚j‚d‚r‚r‚`‚h|‚l‚r‚s|XV“ú PIC  X(008).
000100 01  ‚`‚o‚q|‚j‚d‚r‚r‚`‚h|‚l‚r‚s|XVŽž PIC  X(006).
000110 01  ‚`‚o‚q|‚j‚d‚r‚r‚`‚h|‚l‚r‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
