000010************************************************
000020* (COM_LOG)
000030************************************************
000040 01  ‚b‚n‚l|‚k‚n‚f|‚j‚d‚x PIC  X(006).
000050 01  ‚b‚n‚l|‚k‚n‚f|ƒGƒ‰[—L–³ƒtƒ‰ƒO PIC  X(001).
000060 01  ‚b‚n‚l|‚k‚n‚f|ƒvƒƒWƒFƒNƒgƒR[ƒh PIC  X(003).
000070 01  ‚b‚n‚l|‚k‚n‚f|ƒvƒƒWƒFƒNƒg–¼ PIC  X(030).
000080 01  ‚b‚n‚l|‚k‚n‚f|ƒvƒƒOƒ‰ƒ€‚h‚c PIC  X(030).
000090 01  ‚b‚n‚l|‚k‚n‚f|ƒvƒƒOƒ‰ƒ€–¼ PIC  X(030).
000100 01  ‚b‚n‚l|‚k‚n‚f|ƒƒbƒZ[ƒW PIC  X(200).
000110 01  ‚b‚n‚l|‚k‚n‚f|‹Æ–±“ú•t PIC  X(008).
000120 01  ‚b‚n‚l|‚k‚n‚f|ƒ}ƒVƒ“ƒf[ƒg PIC  X(008).
000130 01  ‚b‚n‚l|‚k‚n‚f|ƒ}ƒVƒ“ƒ^ƒCƒ€ PIC  X(006).
