000010************************************************
000020* ‰ð–ñ—ÝÏƒtƒ@ƒCƒ‹(–¾×)(CPFBUP02)
000030************************************************
000040 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|“ü—ÍŽ–‹ÆŠ‚b‚c PIC S9(004) COMP-3.
000050 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|ƒf[ƒ^Ž¯•Ê PIC S9(002) COMP-3.
000060 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|Ž–‹ÆŠ‚b‚c PIC S9(004) COMP-3.
000070 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|ƒŒƒR[ƒh‹æ•ª PIC  X(001).
000080 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|Œ_–ñ‚m‚n PIC  X(009).
000090 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|•¨Œ‚m‚n PIC S9(003) COMP-3.
000100 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|Š¨’èˆ—‚b‚c PIC S9(002) COMP-3.
000110 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|ƒ_ƒ~[ PIC  X(004).
000120 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‚j‚d‚x|ÄƒŠ[ƒX‚b‚c PIC S9(001) COMP-3.
000130 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|•¨Œ‚m‚n PIC S9(003) COMP-3.
000140 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|•¨Œ–¼Š¿Žš PIC  X(060).
000150 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|•¨Œ–¼ƒJƒi PIC  X(030).
000160 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žd—l»‘¢”Ô† PIC  X(020).
000170 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”—Ê PIC S9(004) COMP-3.
000180 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Ž‘ŽY‚b‚c PIC S9(007) COMP-3.
000190 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|w“üæ‚b‚c PIC  X(008).
000200 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|w“ü‹àŠz PIC S9(013) COMP-3.
000210 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒfƒB[ƒ‰[‚b‚c PIC  X(005).
000220 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ‘ÎÛ‚b‚c PIC  X(001).
000230 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|•¨ŒŽ}”Ô”•„†Œ… PIC  X(001).
000240 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|•¨ŒŽ}”Ô” PIC S9(003) COMP-3.
000250 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”[•tæ‚b‚c PIC  X(006).
000260 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Ý’uêŠ–¼Š¿Žš PIC  X(040).
000270 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Ý’uêŠ–¼ƒJƒi PIC  X(020).
000280 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Ý’uêŠ—X•Ö”Ô†|e PIC  X(003).
000290 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Ý’uêŠ—X•Ö”Ô†|Žq PIC  X(004).
000300 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Ý’uêŠZŠŠ¿Žš PIC  X(100).
000310 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Å‹æ•ª PIC S9(001) COMP-3.
000320 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‘Ï—p”N”•„†Œ… PIC  X(001).
000330 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‘Ï—p”N” PIC S9(002) COMP-3.
000340 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|’†ŒÃŽ‘ŽY‚b‚c PIC S9(001) COMP-3.
000350 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Ž‘ŽYˆ•ª‚b‚c PIC  X(001).
000360 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ž‹p‹æ•ª PIC S9(002) COMP-3.
000370 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000380 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ“ú|”N PIC S9(002) COMP-3.
000390 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ“ú|ŒŽ PIC S9(002) COMP-3.
000400 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ“ú|“ú PIC S9(002) COMP-3.
000410 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Š„‘‹æ•ª PIC S9(002) COMP-3.
000420 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|“Á—á‹æ•ª PIC S9(002) COMP-3.
000430 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žc‰¿•ÛØ‹æ•ª PIC S9(001) COMP-3.
000440 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žc‰¿•ÛØæ‚b‚c PIC  X(008).
000450 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žc‰¿•ÛØæ–¼Š¿Žš PIC  X(060).
000460 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žc‰¿‚P•ÛØ PIC S9(013) COMP-3.
000470 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žc‰¿‚QŒ©Ï PIC S9(013) COMP-3.
000480 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz PIC S9(013) COMP-3.
000490 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|•ÛŒ¯‰ïŽÐ‚b‚c PIC  X(001).
000500 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000510 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|“®‘•ÛŒ¯‰¿Ši PIC S9(013) COMP-3.
000520 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|“®‘•ÛŒ¯—¿ PIC S9(013) COMP-3.
000530 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|M—p•ÛŒ¯‚b‚c|•t•Û‹æ•ª PIC  X(001).
000540 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|M—p•ÛŒ¯‚b‚c|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000550 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|M—p•ÛŒ¯‚b‚c|‹@ŠB‹æ•ª PIC  X(002).
000560 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|M—p•ÛŒ¯‚b‚c|‹@ŠB–¼”Ô† PIC  X(002).
000570 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Œ`Ž®”Ô† PIC  X(015).
000580 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Á”ïÅ—¦‚R‹K’è‘¹ŠQ‹à 
                                             PIC S9(002)V9(1) COMP-3.
000590 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒVƒƒ[ƒv‰ð–ñˆ— PIC  X(001).
000600 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000610 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Å•‰’S‚b‚c PIC  X(001).
000620 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|“–‘O”N“x•]‰¿Šz PIC S9(013) COMP-3.
000630 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|“–‘O”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
000640 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ïŽÐ—˜_‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
000650 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ïŽÐ‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
000660 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|–@’è‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
000670 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‹K’è‘¹ŠQ‹à PIC S9(013) COMP-3.
000680 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”„‹p‘ã‹à PIC S9(013) COMP-3.
000690 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000700 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ“ü‹à“ú|”N PIC S9(002) COMP-3.
000710 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ“ü‹à“ú|ŒŽ PIC S9(002) COMP-3.
000720 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñ“ü‹à“ú|“ú PIC S9(002) COMP-3.
000730 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒ_ƒ~[‚O‚O‚P PIC  X(034).
000740 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P PIC  X(012).
000750 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚Q PIC  X(012).
000760 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚R PIC  X(012).
000770 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚S PIC  X(012).
000780 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žc‘¶•ªw“ü‹àŠz PIC S9(013) COMP-3.
000790 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žc‰¿Šz PIC S9(013) COMP-3.
000800 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|Žc‘¶•ªŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000810 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ÄƒŠ[ƒX•t•Û—¦•„†Œ… PIC  X(001).
000820 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ÄƒŠ[ƒX•t•Û—¦ PIC S9(002) COMP-3.
000830 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”„‹pˆø“n‹æ•ª PIC  X(001).
000840 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”pŠüˆø“næ‹æ•ª PIC  X(001).
000850 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ÄƒŠ[ƒXŽü‰ñ‚b‚c PIC S9(001) COMP-3.
000860 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒ_ƒ~[‚O‚O‚Q PIC  X(026).
000870 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñˆ—‚b‚c PIC  X(001).
000880 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”„‹p‹àŠz“ü‹à—\’è“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000890 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”„‹p‹àŠz“ü‹à—\’è“ú|”N PIC S9(002) COMP-3.
000900 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”„‹p‹àŠz“ü‹à—\’è“ú|ŒŽ PIC S9(002) COMP-3.
000910 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”„‹p‹àŠz“ü‹à—\’è“ú|“ú PIC S9(002) COMP-3.
000920 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”„‹p‹àŠz“ü‹àæ‚b‚c PIC  X(008).
000930 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|”„‹pæ–¼ƒJƒi PIC  X(030).
000940 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ˆø“n”ï—p PIC S9(013) COMP-3.
000950 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|“–Šúž‹p”ï—p PIC S9(013) COMP-3.
000960 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|‰ð–ñŽž•ë‰¿ PIC S9(013) COMP-3.
000970 01  ‚b‚o‚e‚a‚t‚o‚O‚Q|ƒ_ƒ~[‚O‚O‚R PIC  X(033).
