000010************************************************
000020* ‘‡Užƒf[ƒ^(ƒwƒbƒ_[ƒŒƒR[ƒh)(CPFESFRH)
000030************************************************
000040 01  ‚b‚o‚e‚d‚r‚e‚q‚g|ƒf[ƒ^‹æ•ª PIC  X(001).
000050 01  ‚b‚o‚e‚d‚r‚e‚q‚g|Ž¯•Ê‚b‚c PIC  X(002).
000060 01  ‚b‚o‚e‚d‚r‚e‚q‚g|ŒvŽZ•ûŽ® PIC  X(001).
000070 01  ‚b‚o‚e‚d‚r‚e‚q‚g|UžˆË—Šl‚b‚c PIC  X(010).
000080 01  ‚b‚o‚e‚d‚r‚e‚q‚g|UžˆË—Šl–¼ PIC  X(040).
000090 01  ‚b‚o‚e‚d‚r‚e‚q‚g|Žæ‘g“ú|ŒŽ PIC  X(002).
000100 01  ‚b‚o‚e‚d‚r‚e‚q‚g|Žæ‘g“ú|“ú PIC  X(002).
000110 01  ‚b‚o‚e‚d‚r‚e‚q‚g|‹âs‚b‚c PIC  X(004).
000120 01  ‚b‚o‚e‚d‚r‚e‚q‚g|‹âs–¼ PIC  X(015).
000130 01  ‚b‚o‚e‚d‚r‚e‚q‚g|Žx“X‚b‚c PIC  X(003).
000140 01  ‚b‚o‚e‚d‚r‚e‚q‚g|Žx“X–¼ PIC  X(015).
000150 01  ‚b‚o‚e‚d‚r‚e‚q‚g|—a‹àŽí–Ú PIC  X(001).
000160 01  ‚b‚o‚e‚d‚r‚e‚q‚g|ŒûÀ”Ô† PIC  X(007).
000170 01  ‚b‚o‚e‚d‚r‚e‚q‚g|ƒ_ƒ~[‚O‚O‚P PIC  X(017).
