000010************************************************
000020* ‰ð–ñ—š—ðÂŒ ƒtƒ@ƒCƒ‹(CPFKAIRD)
000030************************************************
000040 01  ‚b‚o‚e‚j‚`‚h‚q‚c|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚b‚o‚e‚j‚`‚h‚q‚c|•¨Œ‚m‚n PIC S9(003) COMP-3.
000060 01  ‚b‚o‚e‚j‚`‚h‚q‚c|‰ð–ñ‹æ•ª PIC  X(001).
000070 01  ‚b‚o‚e‚j‚`‚h‚q‚c|‰ð–ñ“ú|¢‹I PIC  X(001).
000080 01  ‚b‚o‚e‚j‚`‚h‚q‚c|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000090 01  ‚b‚o‚e‚j‚`‚h‚q‚c|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000100 01  ‚b‚o‚e‚j‚`‚h‚q‚c|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000110 01  ‚b‚o‚e‚j‚`‚h‚q‚c|ƒŒƒR[ƒh‹æ•ª PIC  X(002).
000120 01  ‚b‚o‚e‚j‚`‚h‚q‚c|ƒf[ƒ^‚P PIC  X(200).
000130 01  ‚b‚o‚e‚j‚`‚h‚q‚c|ƒf[ƒ^‚Q PIC  X(1000).
