000010************************************************
000020* (CPM_PRTTMP)
000030************************************************
000040 01  CPM_PRTTMP-CTLNUM PIC  X(006).
000050 01  CPM_PRTTMP-CLTCOD PIC  X(007).
000060 01  CPM_PRTTMP-CLTNAM PIC  X(040).
000070 01  CPM_PRTTMP-REFNUM PIC  X(010).
000080 01  CPM_PRTTMP-BILNUM PIC  X(007).
000090 01  CPM_PRTTMP-CNTDAY PIC  X(008).
000100 01  CPM_PRTTMP-BORDAY PIC  X(008).
000110 01  CPM_PRTTMP-DUEDAY PIC  X(008).
000120 01  CPM_PRTTMP-HLDTYP PIC  X(001).
000130 01  CPM_PRTTMP-BORTYP PIC  X(001).
000140 01  CPM_PRTTMP-TRMTYP PIC  X(001).
000150 01  CPM_PRTTMP-FIXFLT PIC  X(001).
000160 01  CPM_PRTTMP-BEFAFT PIC  X(001).
000170 01  CPM_PRTTMP-YERDAY PIC  X(001).
000180 01  CPM_PRTTMP-DAYBAS PIC  X(001).
000190 01  CPM_PRTTMP-FRATYP PIC  X(001).
000200 01  CPM_PRTTMP-SALTYP PIC  X(001).
000210 01  CPM_PRTTMP-OBJTYP PIC  X(001).
000220 01  CPM_PRTTMP-ICGTYP PIC  X(001).
000230 01  CPM_PRTTMP-HOLSFT PIC  X(001).
000240 01  CPM_PRTTMP-DUECAL PIC  X(001).
000250 01  CPM_PRTTMP-MTGTYP PIC  X(001).
000260 01  CPM_PRTTMP-CPYDAY PIC  X(002).
000270 01  CPM_PRTTMP-ICGDAY PIC  X(008).
000280 01  CPM_PRTTMP-IPYDAY PIC  X(008).
000290 01  CPM_PRTTMP-FSTPAY PIC  X(008).
000300 01  CPM_PRTTMP-IPYCYC PIC  X(002).
000310 01  CPM_PRTTMP-CPYCYC PIC  X(002).
000320 01  CPM_PRTTMP-GAPTYP PIC  X(001).
000330 01  CPM_PRTTMP-REMARK PIC  X(040).
000340 01  CPM_PRTTMP-CREDEP PIC  X(001).
000350 01  CPM_PRTTMP-CRENUM PIC  X(007).
000360 01  CPM_PRTTMP-DEBBNK PIC  X(004).
000370 01  CPM_PRTTMP-DEBBRC PIC  X(003).
000380 01  CPM_PRTTMP-DEBDEP PIC  X(001).
000390 01  CPM_PRTTMP-DEBNUM PIC  X(007).
000400 01  CPM_PRTTMP-DAYCNT PIC S9(004) COMP-3.
000410 01  CPM_PRTTMP-BORCAP PIC S9(013) COMP-3.
000420 01  CPM_PRTTMP-INTRAT PIC S9(002)V9(6) COMP-3.
000430 01  CPM_PRTTMP-INTRST PIC S9(013) COMP-3.
000440 01  CPM_PRTTMP-BALAMT PIC S9(013) COMP-3.
000450 01  CPM_PRTTMP-AVEAMT PIC S9(013)V9(3) COMP-3.
000460 01  CPM_PRTTMP-UNPINT PIC S9(013) COMP-3.
000470 01  CPM_PRTTMP-MONINT PIC S9(013) COMP-3.
000480 01  CPM_PRTTMP-ACMINT PIC S9(013) COMP-3.
000490 01  CPM_PRTTMP-MAXBAL PIC S9(013) COMP-3.
