000010************************************************
000020* (CPM_CLTMST)
000030************************************************
000040 01  CPM_CLTMST-CLTCOD PIC  X(007).
000050 01  CPM_CLTMST-CLTNAM PIC  X(040).
000060 01  CPM_CLTMST-BNKCOD PIC  X(004).
000070 01  CPM_CLTMST-BRCCOD PIC  X(003).
000080 01  CPM_CLTMST-DEPKND PIC  X(001).
000090 01  CPM_CLTMST-DEPNUM PIC  X(007).
000100 01  CPM_CLTMST-DEPNAM PIC  X(040).
