      *****************************************************************
      *   最新グループコード(D011STK_TBL)
      *****************************************************************
       01  最新グループコード.
           03  Ｄ０１１－最新グループコード
                                     PIC S9(009) PACKED-DECIMAL.
           03  Ｄ０１１－更新年月日  PIC  X(008).
           03  Ｄ０１１－更新時間    PIC  X(008).
           03  Ｄ０１１－更新者      PIC  X(008).
           03  Ｄ０１１－登録年月日  PIC  X(008).
           03  Ｄ０１１－登録時間    PIC  X(008).
           03  Ｄ０１１－登録担当者  PIC  X(008).
           03  Ｄ０１１－入力担当者コード
                                     PIC  X(008).
