      *****************************************************************
      *   ƒOƒ‹[ƒvŽc‚î•ñŽí—Þ•Êƒ}ƒXƒ^(D027GZS_TBL)
      *****************************************************************
       01  ƒOƒ‹[ƒvŽc‚î•ñŽí—Þ•Êƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚V|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚V|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚Q‚V|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚O‚Q‚V|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚V|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
