      *****************************************************************
      *   ƒOƒ‹[ƒvŽc‚î•ñŽí—Þ•Ê—š—ðƒ}ƒXƒ^(D029GZR_TBL)
      *****************************************************************
       01  ƒOƒ‹[ƒvŽc‚î•ñŽí—Þ•Ê—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚X|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚X|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚Q‚X|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚O‚Q‚X|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚X|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
