      *****************************************************************
      *   Žx•¥æÂ–±Žc‚î•ñ—š—ðƒ}ƒXƒ^(D036SSR_TBL)
      *****************************************************************
       01  Žx•¥æÂ–±Žc‚î•ñ—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚R‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚R‚U|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚R‚U|•”“XƒR[ƒh  PIC  X(008).
           03  ‚c‚O‚R‚U|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚R‚U|Â–±Žc‚‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚R‚U|Â–±ŽcŒ”  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚R‚U|Â–±Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚R‚U|Â–±Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚R‚U|Â–±–¢•¥Œ”
                                     PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚R‚U|Â–±–¢•¥Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚R‚U|Â–±–¢•¥Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚R‚U|Â–±ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚R‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚R‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚R‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚R‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚R‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
