      *****************************************************************
      *   ŒûÀ”Ô†ƒ}ƒXƒ^(D043KZB_TBL)
      *****************************************************************
       01  ŒûÀ”Ô†ƒ}ƒXƒ^.
           03  ‚c‚O‚S‚R|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚R|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚O‚S‚R|ŒûÀ–¼Ì    PIC  X(040).
           03  ‚c‚O‚S‚R|ŒûÀ—ªÌ    PIC  X(016).
           03  ‚c‚O‚S‚R|ŒûÀƒJƒi–¼Ì
                                     PIC  X(012).
           03  ‚c‚O‚S‚R|ŒûÀƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚O‚S‚R|Æ‡ƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚O‚S‚R|ŒûÀŽåŠÇ•”“X
                                     PIC  X(004).
           03  ‚c‚O‚S‚R|•¼Ží        PIC  X(003).
           03  ‚c‚O‚S‚R|ƒZƒOƒƒ“ƒgƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚O‚S‚R|ŒûÀ”Ô†—˜—pŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚O‚S‚R|ŒûÀ”Ô†—˜—pI—¹“ú
                                     PIC  X(008).
           03  ‚c‚O‚S‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚S‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚R|XVƒtƒ‰ƒO  PIC  X(001).
