      *****************************************************************
      *   Š¨’è‰È–Úƒ}ƒXƒ^(D044KJK_TBL)
      *****************************************************************
       01  Š¨’è‰È–Úƒ}ƒXƒ^.
           03  ‚c‚O‚S‚S|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|ŽåŠÇ•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚S‚S|Š¨’è‰È–Ú—˜—pŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚O‚S‚S|Š¨’è‰È–Ú—˜—pI—¹“ú
                                     PIC  X(008).
           03  ‚c‚O‚S‚S|Š¨’è‰È–Ú–¼Ì
                                     PIC  X(040).
           03  ‚c‚O‚S‚S|Š¨’è‰È–Ú—ªÌ
                                     PIC  X(016).
           03  ‚c‚O‚S‚S|Š¨’è‰È–ÚƒJƒi–¼Ì
                                     PIC  X(012).
           03  ‚c‚O‚S‚S|Š¨’è‰È–Ú‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|Š¨’è‰È–Ú‘ÝŽØ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|Žc‚ŒvŽZ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|Š¨’è‰È–Ú•ª—Þ
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|•â••ë‹æ•ª  PIC  X(002).
           03  ‚c‚O‚S‚S|à–±‰ïŒv—pWŒvæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|à–±‰ïŒv—p“]‘—æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|¤–@—pWŒvæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|¤–@—p“]‘—æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|ØŽæ˜AŒ‹—pWŒvæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|ØŽæ˜AŒ‹—p“]‘—æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|ØŽæ’P“Æ—pWŒvæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|ØŽæ’P“Æ—p“]‘—æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S‚S|ŒûÀ”Ô†ŠÇ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|Š¨’è‰È–ÚÁ”ïÅ’[”ˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|Š¨’è‰È–ÚÁ”ïÅŠÇ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|Š¨’è‰È–ÚÁ”ïÅ—¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|‰È–Úƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚O‚S‚S|Æ‡ƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚O‚S‚S|‚`‚k‚l˜AŒg‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|‘«Žw’è      PIC  X(003).
           03  ‚c‚O‚S‚S|•½‹ÏŽc‚—v”Û
                                     PIC  X(001).
           03  ‚c‚O‚S‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚S‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚S|XVƒtƒ‰ƒO  PIC  X(001).
