      *****************************************************************
      *   ¿‹“à–óƒR[ƒhƒ}ƒXƒ^(D047SQU_TBL)
      *****************************************************************
       01  ¿‹“à–óƒR[ƒhƒ}ƒXƒ^.
           03  ‚c‚O‚S‚V|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚O‚S‚V|¿‹æ’Zk–¼Ì
                                     PIC  X(040).
           03  ‚c‚O‚S‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚S‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚S‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
