      *****************************************************************
      *   GLOVIAƒƒjƒ…[ƒ}ƒXƒ^(D062GLM_TBL)
      *****************************************************************
       01  ‚f‚k‚n‚u‚h‚`ƒƒjƒ…[ƒ}ƒXƒ^.
           03  ‚c‚O‚U‚Q|ƒ†[ƒU‚h‚c  PIC  X(010).
           03  ‚c‚O‚U‚Q|‰ïŽÐƒR[ƒh  PIC  X(002).
           03  ‚c‚O‚U‚Q|ƒ†[ƒUƒ^ƒCƒv
                                     PIC  X(003).
           03  ‚c‚O‚U‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚U‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚Q|XVŽÒ      PIC  X(008).
