      *****************************************************************
      *   ƒlƒbƒgƒŠ[ƒVƒ“ƒOƒ†[ƒUƒŠƒXƒg‚h‚cƒe[ƒuƒ‹(D085NLU_TBL)
      *****************************************************************
       01  ƒlƒbƒgƒŠ[ƒVƒ“ƒOƒ†[ƒUƒŠƒXƒg‚h‚cƒe[ƒuƒ‹.
           03  ‚c‚O‚W‚T|•ª—ÞƒR[ƒh  PIC  X(001).
           03  ‚c‚O‚W‚T|ƒƒOƒCƒ“‚h‚c
                                     PIC  X(010).
           03  ‚c‚O‚W‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚W‚T|Œ_–ñæƒR[ƒh
                                     PIC  X(010).
           03  ‚c‚O‚W‚T|¿‹æƒR[ƒh
                                     PIC  X(010).
           03  ‚c‚O‚W‚T|‰ïŽÐ–¼      PIC  X(096).
           03  ‚c‚O‚W‚T|•”–¼      PIC  X(034).
           03  ‚c‚O‚W‚T|Ž–¼        PIC  X(034).
           03  ‚c‚O‚W‚T|‚…‚‚‚‰‚ŒƒAƒhƒŒƒX
                                     PIC  X(050).
           03  ‚c‚O‚W‚T|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚O‚W‚T|ZŠ        PIC  X(120).
           03  ‚c‚O‚W‚T|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚O‚W‚T|’S“–ŽÒƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚W‚T|’S“–ŽÒ–¼Ì  PIC  X(010).
           03  ‚c‚O‚W‚T|‹æ•ª        PIC  X(008).
           03  ‚c‚O‚W‚T|–ž—¹’S“–ŽÒƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚W‚T|–ž—¹’S“–ŽÒ–¼Ì
                                     PIC  X(010).
           03  ‚c‚O‚W‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
