      *****************************************************************
      *   ŽæˆøæƒNƒŒƒ‰ƒCƒ“—š—ðƒ}ƒXƒ^(D088TRC_TBL)
      *****************************************************************
       01  ŽæˆøæƒNƒŒƒ‰ƒCƒ“—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚W‚W|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚W‚W|“K—pŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚W‚W|—^MŒÀ“x‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚W‚W|“K—pŠúŒÀ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚W‚W|–³Œøƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚O‚W‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
