      *****************************************************************
      *   ðŒŽwŽ¦ƒ}ƒXƒ^(D092JKS_TBL)
      *****************************************************************
       01  ðŒŽwŽ¦ƒ}ƒXƒ^.
           03  ‚c‚O‚X‚Q|‹æ•ª        PIC  X(001).
           03  ‚c‚O‚X‚Q|ðŒŽwŽ¦”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚Q|ðŒŽwŽ¦–¼Ì
                                     PIC  X(120).
           03  ‚c‚O‚X‚Q|’S•Û’¥‹‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚X‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
