      *****************************************************************
      *   •ïŠ‡ˆÙ—áðŒƒ}ƒXƒ^(D098HKJ_TBL)
      *****************************************************************
       01  •ïŠ‡ˆÙ—áðŒƒ}ƒXƒ^.
           03  ‚c‚O‚X‚W|•ïŠ‡ˆÙ—áðŒƒR[ƒh
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚W|ŽåŠÇ•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚X‚W|•ïŠ‡ˆÙ—áðŒ–¼Ì
                                     PIC  X(040).
           03  ‚c‚O‚X‚W|ŠÇ—ƒŒƒxƒ‹‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚W|•ïŠ‡ðŒ—LŒø‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚X‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
