      *****************************************************************
      *   ’S•ÛŠÇ—(D100TNP_TBL)
      *****************************************************************
       01  ’S•ÛŠÇ—.
           03  ‚c‚P‚O‚O|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚O‚O|’S•Û”Ô†    PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚P‚O‚O|’S•ÛŽí—Þ‘å•ª—Þ
                                     PIC  X(002).
           03  ‚c‚P‚O‚O|’S•ÛŽí—Þ¬•ª—Þ
                                     PIC  X(002).
           03  ‚c‚P‚O‚O|Šî€’S•Û‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚O‚O|ª•’Ê‹æ•ª  PIC  X(001).
           03  ‚c‚P‚O‚O|‹¤—p’S•Û‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚O‚O|ŠÓ’è”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚O‚O|ŽŸ‰ñŠÓ’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚P‚O‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚P‚O‚O|Œ_–ñ–ž—¹“ú  PIC  X(008).
           03  ‚c‚P‚O‚O|’S•ÛŠú“ú    PIC  X(008).
           03  ‚c‚P‚O‚O|’S•Û•i      PIC  X(040).
           03  ‚c‚P‚O‚O|‹É“xŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚O‚O|ŠÓ’èŽž‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚O‚O|Š|–Ú        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚O‚O|æ‡ˆÊ      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚O‚O|‹K’è’l      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚O‚O|ŽQl’l      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚O‚O|ŠÓ’è‹@ŠÖ    PIC  X(040).
           03  ‚c‚P‚O‚O|”õl        PIC  X(040).
           03  ‚c‚P‚O‚O|’S•ÛŽí—Þ‘å•ª—Þ–¼Ì
                                     PIC  X(040).
           03  ‚c‚P‚O‚O|’S•ÛŽí—Þ¬•ª—Þ–¼Ì
                                     PIC  X(040).
           03  ‚c‚P‚O‚O|’S•Û•ÛŠÇ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚O‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚O‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚O‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚O‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚O‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚O‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚O‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
