      *****************************************************************
      *   •ÛŒ¯‰ïŽÐƒ}ƒXƒ^(D101HKK_TBL)
      *****************************************************************
       01  •ÛŒ¯‰ïŽÐƒ}ƒXƒ^.
           03  ‚c‚P‚O‚P|•ÛŒ¯‰ïŽÐŽ¯•ÊƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚P‚O‚P|•ÛŒ¯‰ïŽÐ–¼  PIC  X(080).
           03  ‚c‚P‚O‚P|•ÛŒ¯‰ïŽÐ–¼—ªÌ
                                     PIC  X(010).
           03  ‚c‚P‚O‚P|•ÛŒ¯‰ïŽÐ–¼ƒJƒi
                                     PIC  X(050).
           03  ‚c‚P‚O‚P|•ÛŒ¯‰ïŽÐ–¼—ªÌƒJƒi
                                     PIC  X(012).
           03  ‚c‚P‚O‚P|•ÛŒ¯‰ïŽÐ‘ã—“XƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚O‚P|•ÛŒ¯‰ïŽÐ‘ã—“X–¼
                                     PIC  X(080).
           03  ‚c‚P‚O‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚O‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚O‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚O‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚O‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚O‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚O‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚O‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
