      *****************************************************************
      *   ’ZŠú•ÛŒ¯—¿—¦ƒ}ƒXƒ^(D111HTR_TBL)
      *****************************************************************
       01  ’ZŠú•ÛŒ¯—¿—¦ƒ}ƒXƒ^.
           03  ‚c‚P‚P‚P|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚P‚P‚P|“K—pŠJŽn“ú  PIC  X(008).
           03  ‚c‚P‚P‚P|Œo‰ßŒŽ“ú    PIC  X(004).
           03  ‚c‚P‚P‚P|’ZŠú•ÛŒ¯—¿—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚P‚P‚P|•ÛŒ¯‰ïŽÐ‹æ•ª–¼Ì
                                     PIC  X(080).
           03  ‚c‚P‚P‚P|XV“úŽž    PIC  X(016).
           03  ‚c‚P‚P‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚P‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚P‚P|Œ—“à‹æ•ª    PIC  X(001).
           03  ‚c‚P‚P‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚P‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚P‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚P|XVŽžŠÔ    PIC  X(008).
