      *****************************************************************
      *   “®‘•ÛŒ¯ØŒ””Ô†ƒ}ƒXƒ^(D112HSB_TBL)
      *****************************************************************
       01  “®‘•ÛŒ¯ØŒ””Ô†ƒ}ƒXƒ^.
           03  ‚c‚P‚P‚Q|•ÛŒ¯‰ïŽÐŽ¯•ÊƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚P‚P‚Q|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚Q|“®‘•ÛŒ¯ØŒ””Ô†
                                     PIC  X(011).
           03  ‚c‚P‚P‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚P‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚P‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚P‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚P‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
