      *****************************************************************
      *   L•ñƒƒbƒZ[ƒWŠÇ—ƒ}ƒXƒ^(D116KMK_TBL)
      *****************************************************************
       01  L•ñƒƒbƒZ[ƒWŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚P‚P‚U|ŠÇ—‚h‚c    PIC  X(008).
           03  ‚c‚P‚P‚U|L•ñƒƒbƒZ[ƒW
                                     PIC  X(138).
           03  ‚c‚P‚P‚U|•\Ž¦ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚P‚P‚U|XV“úŽž    PIC  X(016).
           03  ‚c‚P‚P‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚P‚U|•¶ŽšF‹æ•ª  PIC  X(001).
           03  ‚c‚P‚P‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚P‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚P‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚P‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚U|XVŽžŠÔ    PIC  X(008).
