      *****************************************************************
      *   Ž‘ŽYŽí—Þƒ}ƒXƒ^(D12SIB_TBL)
      *****************************************************************
       01  Ž‘ŽYŽí—Þƒ}ƒXƒ^.
           03  ‚c‚P‚Q|Ž‘ŽYŽí—Þ      PIC  X(007).
           03  ‚c‚P‚Q|“K—p”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚Q|Ž‘ŽY‘å•ª—Þ–¼Ì
                                     PIC  X(040).
           03  ‚c‚P‚Q|Ž‘ŽY–¼Ì      PIC  X(060).
           03  ‚c‚P‚Q|‘Ï—p”N”      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚Q|Å–@‹æ•ª      PIC  X(001).
           03  ‚c‚P‚Q|XV“úŽž      PIC  X(016).
           03  ‚c‚P‚Q|XVŽÒ        PIC  X(008).
           03  ‚c‚P‚Q|\—p”»’èƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚P‚Q|ŠJŽ¦—p”»’èƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚P‚Q|”NŽŸ“Œv—p”»’èƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚P‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚Q|Ž‘ŽY–¼ÌƒJƒi  PIC  X(040).
           03  ‚c‚P‚Q|Ž‘ŽY—ªÌ      PIC  X(010).
           03  ‚c‚P‚Q|Ž‘ŽY—ªÌƒJƒi  PIC  X(012).
           03  ‚c‚P‚Q|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚Q|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚P‚Q|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚P‚Q|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚Q|XVŽžŠÔ      PIC  X(008).
