      *****************************************************************
      *   ŠJŽ¦æƒ}ƒXƒ^(D142KJS_TBL)
      *****************************************************************
       01  ŠJŽ¦æƒ}ƒXƒ^.
           03  ‚c‚P‚S‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚S‚Q|ŠJŽ¦æƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚S‚Q|ŠJŽ¦æ–¼    PIC  X(060).
           03  ‚c‚P‚S‚Q|ŠJŽ¦•û–@‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚S‚Q|’‹LÈ—ªŽæˆø•\Ž¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚S‚Q|‹¦’²”ñŠ²Ž–‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚S‚Q|ÄƒŠ[ƒXŠJŽ¦‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚S‚Q|ŠJŽ¦’ •[—˜Žqo—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚S‚Q|’èŠz’è—¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚S‚Q|“à–ó–¾×o—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚S‚Q|–{ŒˆŽZŒŽ“ú  PIC  X(004).
           03  ‚c‚P‚S‚Q|ŠJŽ¦ŒˆŽZŒŽ‚P
                                     PIC  X(002).
           03  ‚c‚P‚S‚Q|ŠJŽ¦ŒˆŽZŒŽ‚Q
                                     PIC  X(002).
           03  ‚c‚P‚S‚Q|ŠJŽ¦ŒˆŽZŒŽ‚R
                                     PIC  X(002).
           03  ‚c‚P‚S‚Q|–{ŒˆŽZŠúŠÔŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚S‚Q|‘ÎÛŠúŠÔŒŽ”‚P
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚S‚Q|‘ÎÛŠúŠÔŒŽ”‚Q
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚S‚Q|‘ÎÛŠúŠÔŒŽ”‚R
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚S‚Q|ÅVˆ—‘ÎÛŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚P‚S‚Q|ÅVˆ—‘ÎÛI—¹“ú
                                     PIC  X(008).
           03  ‚c‚P‚S‚Q|‚m‚d‚s‚k‚d‚`‚r‚h‚m‚f—˜—pŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚S‚Q|Žž’ •[o—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚S‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚S‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚S‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚S‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚S‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚S‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚S‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
