      *****************************************************************
      *   ŠJŽ¦Œ_–ñæƒ}ƒXƒ^(D143KJK_TBL)
      *****************************************************************
       01  ŠJŽ¦Œ_–ñæƒ}ƒXƒ^.
           03  ‚c‚P‚S‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚S‚R|ŠJŽ¦æƒR[ƒh
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚P‚S‚R|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚P‚S‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚S‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚S‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚S‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚S‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚S‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚S‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
