      *****************************************************************
      *   ŠeŽí‹à—˜ƒ}ƒXƒ^(D181KKN_TBL)
      *****************************************************************
       01  ŠeŽí‹à—˜ƒ}ƒXƒ^.
           03  ‚c‚P‚W‚P|‹à—˜‹æ•ª    PIC  X(002).
           03  ‚c‚P‚W‚P|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚P|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚P‚W‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚W‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚W‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
