      *****************************************************************
      *   ÄƒŠ[ƒXŒvŽZ—¦ƒ}ƒXƒ^(D184SKR_TBL)
      *****************************************************************
       01  ÄƒŠ[ƒXŒvŽZ—¦ƒ}ƒXƒ^.
           03  ‚c‚P‚W‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚W‚S|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚P‚W‚S|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚W‚S|ŒvŽZ’PˆÊ    PIC  X(001).
           03  ‚c‚P‚W‚S|’[”ˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚W‚S|ŒvŽZ—¦•ªŽq  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚P‚W‚S|ŒvŽZ—¦•ª•ê  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚P‚W‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚W‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚W‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
