      *****************************************************************
      *   ÄƒŠ[ƒX•t•Û—¦ƒ}ƒXƒ^(D185SFR_TBL)
      *****************************************************************
       01  ÄƒŠ[ƒX•t•Û—¦ƒ}ƒXƒ^.
           03  ‚c‚P‚W‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚W‚T|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚P‚W‚T|‘ÎÛŽ‘ŽYƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚P‚W‚T|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚W‚T|•t•Û—¦      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚W‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚W‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚W‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
