      *****************************************************************
      *   Ž©—pŽ‘ŽYÝ’uêŠƒ}ƒXƒ^(D187SCB_TBL)
      *****************************************************************
       01  Ž©—pŽ‘ŽYÝ’uêŠƒ}ƒXƒ^.
           03  ‚c‚P‚W‚V|Ý’uêŠ’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚P‚W‚V|Ý’uêŠƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚P‚W‚V|Ý’uêŠ–¼  PIC  X(020).
           03  ‚c‚P‚W‚V|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚P‚W‚V|ZŠ‚P      PIC  X(060).
           03  ‚c‚P‚W‚V|ZŠ‚Q      PIC  X(060).
           03  ‚c‚P‚W‚V|ZŠ‚R      PIC  X(060).
           03  ‚c‚P‚W‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚W‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚W‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
