      *****************************************************************
      *   ³ŒpŠÇ—ƒe[ƒuƒ‹(D230SKS_TBL)
      *****************************************************************
       01  ³ŒpŠÇ—ƒe[ƒuƒ‹.
           03  ‚c‚Q‚R‚O|³ŒpŒ³|Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚Q‚R‚O|³ŒpŒ³|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚R‚O|³Œp\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚R‚O|³Œpæ|˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚R‚O|³Œpæ|Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚Q‚R‚O|³Œpæ|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚R‚O|³Œpæ|Œ_–ñŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚Q‚R‚O|ƒGƒ“ƒgƒŠ“ú  PIC  X(008).
           03  ‚c‚Q‚R‚O|‹Æ–±”NŒŽ    PIC  X(006).
           03  ‚c‚Q‚R‚O|ÄƒŠ[ƒX³Œp‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚R‚O|Œ³Œ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚Q‚R‚O|Œ³ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚R‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚R‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚R‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚R‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚R‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚R‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚Q‚R‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
