      *****************************************************************
      *   Œ©ÏŽx•¥“à—e(D261MSN_TBL)
      *****************************************************************
       01  Œ©ÏŽx•¥“à—e.
           03  ‚c‚Q‚U‚P|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚Q‚U‚P|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚Q‚U‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚Q‚U‚P|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|Žx•¥‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|–³žŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚U‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚U‚P|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|‰‰ñŽx•¥‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|ŒJ‰„ŠúŠÔ    PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|•¡”ŒJ‰„Žx•¥‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U‚P|•Ï‘¥‹æ•ª    PIC  X(001).
           03  ‚c‚Q‚U‚P|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|ˆÈ~Žx•¥ƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|ˆÈ~Žx•¥“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚P|“o˜^’S“–ŽÒ  PIC  X(008).
