      *****************************************************************
      *   Œ©Ï”ï—pŽx•¥(D264MHS_TBL)
      *****************************************************************
       01  Œ©Ï”ï—pŽx•¥.
           03  ‚c‚Q‚U‚S|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚S|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚S|”ï—pŽí—Þ    PIC  X(003).
           03  ‚c‚Q‚U‚S|ŒJ‰„ŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚S|”ï—p‹æ•ª    PIC  X(001).
           03  ‚c‚Q‚U‚S|”ï—p‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚S|‰‰ñŽx•¥—\’è”NŒŽ
                                     PIC  X(006).
           03  ‚c‚Q‚U‚S|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚S|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚U‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚U‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚S|“o˜^’S“–ŽÒ  PIC  X(008).
