      *****************************************************************
      *   Œ©ÏŽèŒ`ÂŒ –¾×(D272MTS_TBL)
      *****************************************************************
       01  Œ©ÏŽèŒ`ÂŒ –¾×.
           03  ‚c‚Q‚V‚Q|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚Q‚V‚Q|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚Q‚V‚Q|Šz–Ê‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|ŽèŒ`Šú“ú    PIC  X(008).
           03  ‚c‚Q‚V‚Q|—˜‘§Šú“ú    PIC  X(008).
           03  ‚c‚Q‚V‚Q|“ú”        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|Š„ˆø—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|Š„ˆø—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|Žæ—§Žè”—¿“™
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|Žæ—§Žè”—¿“™Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|”ƒŽæ‘ã‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|ŽÐ“à‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚V‚Q|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|ŽÀŽ¿”N—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|‘e—˜        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|ŽèŒ`”Ô†    PIC  X(010).
           03  ‚c‚Q‚V‚Q|ŽèŒ`Ží—Þ    PIC  X(001).
           03  ‚c‚Q‚V‚Q|Žx•¥‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚Q‚V‚Q|Žx•¥Žx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚Q‚V‚Q|ŽÐ“à‹à—˜|ˆê”Ê
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|‘e—˜|ˆê”Ê  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚V‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚V‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
