      *****************************************************************
      *   Œ©Ï•Ï‘¥(D28MHK_TBL)
      *****************************************************************
       01  Œ©Ï•Ï‘¥.
           03  ‚c‚Q‚W|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚W|Œ©Ï”Ô†Ž}”Ô  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚W|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚Q‚W|ŠJŽn‰ñ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚W|•¨Œ”Ô†      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚W|Œ©Ï”Ô†|’S“–ŽÒ
                                     PIC  X(002).
           03  ‚c‚Q‚W|ŠJŽn”NŒŽ      PIC  X(006).
           03  ‚c‚Q‚W|I—¹‰ñ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚W|I—¹”NŒŽ      PIC  X(006).
           03  ‚c‚Q‚W|‹àŠz          PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚W|Á”ïÅ        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚W|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚W|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚W|XVŽÒ        PIC  X(008).
           03  ‚c‚Q‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚W|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚W|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚W|“o˜^’S“–ŽÒ    PIC  X(008).
