      *****************************************************************
      *   Œ©ÏŠ„•Š“WŠJ(D29KPT_TBL)
      *****************************************************************
       01  Œ©ÏŠ„•Š“WŠJ.
           03  ‚c‚Q‚X|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚X|Œ©Ï”Ô†Ž}”Ô  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚X|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚Q‚X|˜A”Ô          PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚X|ƒT[ƒo”Ô†    PIC  X(002).
           03  ‚c‚Q‚X|•¨Œ”Ô†      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚X|‰ñŽû”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚X|Œ³–{          PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚X|—˜‘§          PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚X|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚X|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚X|XVŽÒ        PIC  X(008).
           03  ‚c‚Q‚X|”„ã”NŒŽ      PIC  X(006).
           03  ‚c‚Q‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚X|Œ³–{Žc‚      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚X|•Š•¥‹à        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚X|””ï—p        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚X|ŽcƒŠ[ƒX—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚X|•ÔÏ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚X|ŠúŠÔŒŽ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚X|ŠúŠÔ“ú”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚X|—˜‘§ŒvŽZŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚Q‚X|—˜‘§ŒvŽZI—¹“ú
                                     PIC  X(008).
           03  ‚c‚Q‚X|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚X|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚X|“o˜^’S“–ŽÒ    PIC  X(008).
