      *****************************************************************
      *   Œ_–ñ”Ô†Ì”Ôƒe[ƒuƒ‹(D316SBN_TBL)
      *****************************************************************
       01  Œ_–ñ”Ô†Ì”Ôƒe[ƒuƒ‹.
           03  ‚c‚R‚P‚U|Šú          PIC  X(002).
           03  ‚c‚R‚P‚U|Œ_–ñŒ`‘Ô    PIC  X(001).
           03  ‚c‚R‚P‚U|“Á’èŽæˆøæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚U|ÅIŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚P‚U|•”Š–¼      PIC  X(020).
           03  ‚c‚R‚P‚U|ŠJŽn”Ô†    PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚R‚P‚U|I—¹”Ô†    PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚R‚P‚U|Ì”Ô‘OÅI”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚P‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚P‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚P‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚U|“o˜^’S“–ŽÒ  PIC  X(008).
