      *****************************************************************
      *   ˆÏ‘õ•ÛŽç’âŽ~—š—ð(D323ITR_TBL)
      *****************************************************************
       01  ˆÏ‘õ•ÛŽç’âŽ~—š—ð.
           03  ‚c‚R‚Q‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚Q‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚Q‚R|‰ð–ñ˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|’âŽ~”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚R|•ÔŠÒ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚R|¿‹‘ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚Q‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚Q‚R|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚Q‚R|•ÔŠÒˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|Á”ïÅ“™    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚Q‚R|¿‹”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|Œ_–ñæ•”–å–¼
                                     PIC  X(060).
           03  ‚c‚R‚Q‚R|’âŽ~——R    PIC  X(120).
           03  ‚c‚R‚Q‚R|ƒŠ[ƒXŠúŠÔ–¢Œo‰ßŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|Œ_–ñŽÒ–¼    PIC  X(080).
           03  ‚c‚R‚Q‚R|Œ_–ñŽÒ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚R‚Q‚R|Œ_–ñŽÒ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚R‚Q‚R|Œ_–ñŽÒZŠ  PIC  X(080).
           03  ‚c‚R‚Q‚R|Œ_–ñŽÒ“X–¼  PIC  X(080).
           03  ‚c‚R‚Q‚R|Œ_–ñŽÒ“X“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚R‚Q‚R|Œ_–ñŽÒ“X—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚R‚Q‚R|Œ_–ñŽÒ“XZŠ
                                     PIC  X(080).
           03  ‚c‚R‚Q‚R|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚Q‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚Q‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚Q‚R|˜A—•[”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚Q‚R|•ÔŠÒ•ÛŽç—¿ŽÀŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|•ÔŠÒ•ÛŽç—¿·Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚R|“o˜^’S“–ŽÒ  PIC  X(008).
