      *****************************************************************
      *   Œ_–ñ•ÛØl(D327KHS_TBL)
      *****************************************************************
       01  Œ_–ñ•ÛØl.
           03  ‚c‚R‚Q‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚Q‚V|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚V|•ÛØlŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚Q‚V|•ÛØlŠÖŒW‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚Q‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚Q‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚Q‚V|“ü—Í‡      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚V|“o˜^’S“–ŽÒ  PIC  X(008).
