      *****************************************************************
      *   •¨Œ(D33BUK_TBL)
      *****************************************************************
       01  •¨Œ.
           03  ‚c‚R‚R|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚R‚R|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚R‚R|•¨Œ”Ô†      PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚R|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R|‚eŒ^–¼        PIC  X(025).
           03  ‚c‚R‚R|Žæ“¾”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|‰ð–ñ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|ˆÚ“®”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|”„”p”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|ó‘Ôƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚R|‰ð–ñƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚R|ˆÚ“®ƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚R|”„”pƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚R|³Œpƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚R|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|‰ð–ñ——R      PIC  X(002).
           03  ‚c‚R‚R|ˆÚ“®——R      PIC  X(002).
           03  ‚c‚R‚R|”„”p——R      PIC  X(002).
           03  ‚c‚R‚R|»‘¢ŽÒ–¼      PIC  X(060).
           03  ‚c‚R‚R|Žæ“¾‰¿Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|Žæ“¾Á”ïÅŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‘ŠŽE‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‘ŠŽEŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚R‚R|·ˆø‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|·ˆø‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|Žc‰¿Ý’èŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|Ž‘ŽYŽí—Þ      PIC  X(007).
           03  ‚c‚R‚R|”—Ê          PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚R‚R|’PˆÊ          PIC  X(001).
           03  ‚c‚R‚R|Å–@‹æ•ª      PIC  X(001).
           03  ‚c‚R‚R|‘Ï—p”N”      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R|•¨ŒŽí—Þ      PIC  X(002).
           03  ‚c‚R‚R|ƒ\ƒtƒg‹æ•ª    PIC  X(001).
           03  ‚c‚R‚R|­ŠzŽ‘ŽY‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|’†ŒÃŽ‘ŽY‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|‰ïŽÐž‹p‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|ŒÅ’èŽ‘ŽYÅ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R|M—p•ÛŒ¯‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|‹@ŠB—Þ•ª—ÞƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚R|ƒfƒB[ƒ‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚R|ƒfƒB[ƒ‰ƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚R|Žx•¥ƒTƒCƒg    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R|Žx•¥“ú        PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R|Žx•¥•û–@      PIC  X(001).
           03  ‚c‚R‚R|ŽèŒ`ƒTƒCƒg    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|”[•tæƒR[ƒh  PIC  X(006).
           03  ‚c‚R‚R|ZŠ‚Q        PIC  X(060).
           03  ‚c‚R‚R|ZŠ‚R        PIC  X(060).
           03  ‚c‚R‚R|•¨ŒƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‹ŒŒ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚R|‹Œ•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚R|ˆ•ªæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚R|ˆ•ªæƒR[ƒh  PIC  X(005).
           03  ‚c‚R‚R|”„‹p‘ã‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|”„‹p‘ã‰ñŽû“ú  PIC  X(008).
           03  ‚c‚R‚R|”„‹p‘ã‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚R‚R|•ÛŒ¯Ž–ŒÌƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|•ÛŒ¯Ž–ŒÌ‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|Ž–ŒÌ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|Ž–ŒÌ‘ä”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|ƒ†[ƒUŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|“–ŽÐŒü’lˆøŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|•ªŠ„”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|’èŠz|ŒŽŠzž‹p”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|’èŠz|ŒŽŠzž‹p”ï’[”
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|Œ©Ï•¨Œ”Ô†  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚R|ÄƒŠ[ƒX—\’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|ÄƒŠ[ƒX—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|ÄƒŠ[ƒXŽc‰¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‹Œ•¨Œ—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‹ŒŽc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|Ž©‘¼ŽÐ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚R|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚R‚R|Žx•¥æƒR[ƒh  PIC  X(005).
           03  ‚c‚R‚R|Ý’uêŠƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚R‚R|•ÛŒ¯‰ïŽÐ‹æ•ª  PIC  X(004).
           03  ‚c‚R‚R|’è‰¿          PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|ƒŒƒ“ƒ^ƒ‹”{—¦  PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|ƒŒƒ“ƒ^ƒ‹—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|”„”pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R|”„”pˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚R|”„”pŽæÁ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|”„”pŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R|”„”pŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚R|‰ð–ñˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚R|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚R|’™‘ •i•]‰¿Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|³ŒpŒ³Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚R|³ŒpŒ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚R|³Œp”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|³Œpˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚R|ˆ•ª—\’è      PIC  X(001).
           03  ‚c‚R‚R|–ž—¹ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R|–ž—¹ˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚R|–ž—¹ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R|–ž—¹ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚R|‰ð–ñ‹æ•ª      PIC  X(001).
           03  ‚c‚R‚R|”„”p‹æ•ª      PIC  X(001).
           03  ‚c‚R‚R|‹¦’²ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚R|‹¦’²Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚R|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚R‚R|XVŽÒ        PIC  X(008).
           03  ‚c‚R‚R|˜A”Ô          PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|’™‘ •i‹æ•ª    PIC  X(001).
           03  ‚c‚R‚R|Žæ“¾ŠzŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚R‚R|ƒŠ[ƒX—¿ŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚R‚R|•ªŠ„Œ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚R|•ªŠ„ˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚R|ˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|HŽ–”ï“™‘gž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R|HŽ–”ï“™      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|ŠCŠOÝ’uêŠ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R|•ÛØ‰ïŽÐ      PIC  X(009).
           03  ‚c‚R‚R|•¨Œ–¼Ì      PIC  X(060).
           03  ‚c‚R‚R|³Œp“ñŽŸÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|‘¼ŽÐw“üŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|ˆÏ‘õ•ÛŽç‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|ˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|•¨Œˆ•ª‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚R|—X•Ö”Ô†      PIC  X(007).
           03  ‚c‚R‚R|•¨Œˆ•ª˜A”Ô  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|Œ©Ï|Œ©Ï”Ô†|’S“–ŽÒ
                                     PIC  X(002).
           03  ‚c‚R‚R|Œ©Ï|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚R|Œ©Ï|•¨Œ”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|“ñŽŸŒ_–ñ—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|“o˜^”Ô†      PIC  X(008).
           03  ‚c‚R‚R|•¨Œˆ•ª\¿ó‘Ôƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‘¼ŽÐÄƒŠ[ƒXŽc‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‹Œ‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|•¨Œˆ•ª\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R|³Œp—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‹ŒˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R|‹ŒˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‹ŒˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|•¨Œ‹æ•ª      PIC  X(002).
           03  ‚c‚R‚R|Ží—Þ‹æ•ª      PIC  X(002).
           03  ‚c‚R‚R|ƒ[ƒJ[‹æ•ª  PIC  X(003).
           03  ‚c‚R‚R|‹@ŠB”Ô†      PIC  X(020).
           03  ‚c‚R‚R|•¨Œ–¼ƒJƒi    PIC  X(060).
           03  ‚c‚R‚R|ZŠ‚P        PIC  X(060).
           03  ‚c‚R‚R|Ý’uêŠ–¼    PIC  X(080).
           03  ‚c‚R‚R|Ý’uêŠ–¼ƒJƒi
                                     PIC  X(080).
           03  ‚c‚R‚R|’Zk\¿‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|Žc‰¿‹æ•ª      PIC  X(001).
           03  ‚c‚R‚R|ÌŽZ•¨Œì¬˜A”Ô
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚R|Žw’è“dŽqŒvŽZ‹@
                                     PIC  X(040).
           03  ‚c‚R‚R|“dŽqŒvŽZ‹@Š—LŽÒ
                                     PIC  X(040).
           03  ‚c‚R‚R|•¨Œ•ªŠ„\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|ž‹pŽ‘ŽYÅ—¦  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚P
                                     PIC  X(016).
           03  ‚c‚R‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚Q
                                     PIC  X(016).
           03  ‚c‚R‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚R
                                     PIC  X(016).
           03  ‚c‚R‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚S
                                     PIC  X(016).
           03  ‚c‚R‚R|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚R|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚R‚R|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚R‚R|ÅžŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|ÅžŽc‰¿Ý’èŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|•¨ŒƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‘¼ŽÐw“ü‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|Ž©ŽÐƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‘¼ŽÐƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|Š—LƒŠ[ƒX‰ïŽÐ
                                     PIC  X(009).
           03  ‚c‚R‚R|“Á—áŠúŠÔ      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R|“Á—á—¦|•ªŽq  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R|“Á—á—¦|•ª•ê  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|“Á—á‰ÛÅ•W€Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|ŒÅÅ•‰’S‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|ŒÅÅÅ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚R|ÂŒ ”ƒŽæ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|ÂŒ ”ƒŽæ‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|”„‹pˆÏ‘õŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|ˆøŽæ•‰’S‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|ˆøŽæ”ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|”„‹pŒ©Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚R|•t•Û—¦        PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R|’Ê’m‘”­‘—“ú  PIC  X(008).
           03  ‚c‚R‚R|•„†          PIC  X(005).
           03  ‚c‚R‚R|M—p•ÛŒ¯—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‹@Ží–¼”Ô†    PIC  X(002).
           03  ‚c‚R‚R|Ž©ŽÐw“üŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|‘¹ŠQ•ÛŒ¯‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|”…ž•ÛŒ¯‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|‰ð–ñŽæÁ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R|³ŒpŽæÁ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R|³ŒpŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚R|“®‘—¦        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚R|•ÛŽç‹æ•ª      PIC  X(001).
           03  ‚c‚R‚R|‰ð–ñ\¿˜A”Ô  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R|“–‰Žc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|“–‰‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R|M—p•ÛŒ¯ƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚R‚R|“®‘•t•Û‹æ•ª  PIC  X(001).
           03  ‚c‚R‚R|’™‘ •iŽ¯•Ê‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R|”ñ‰Ò“®Ž‘ŽYŒÅÅ\‹æ•ª
                                     PIC  X(001).
