      *****************************************************************
      *   Œ_–ñŒp‘±”ï—pŽx•¥(D352KHS_TBL)
      *****************************************************************
       01  Œ_–ñŒp‘±”ï—pŽx•¥.
           03  ‚c‚R‚T‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚T‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T‚Q|”ï—pŽí—Þ    PIC  X(003).
           03  ‚c‚R‚T‚Q|ŒJ‰„ŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚T‚Q|”ï—p‹æ•ª    PIC  X(001).
           03  ‚c‚R‚T‚Q|”ï—p‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T‚Q|‰‰ñŽx•¥—\’è”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚T‚Q|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T‚Q|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚T‚Q|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚R‚T‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚T‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚T‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚T‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚T‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚T‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚T‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
