      *****************************************************************
      *   •ÏX\¿(D360HSI_TBL)
      *****************************************************************
       01  •ÏX\¿.
           03  ‚c‚R‚U‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚O|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚O|•ÏX—\’è“ú  PIC  X(008).
           03  ‚c‚R‚U‚O|•ÏX“à—e    PIC  X(002).
           03  ‚c‚R‚U‚O|\¿ó‘Ôƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚O|\¿ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚O|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚O|ˆ—”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚O|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚R‚U‚O|ŽæÁ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚O|ŽæÁ”NŒŽ    PIC  X(008).
           03  ‚c‚R‚U‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚U‚O|’S“–•”“XƒR[ƒh
                                     PIC  X(004).
