      *****************************************************************
      *   •ÏX\¿_Œ_–ñ“à—e(D361HKY_TBL)
      *****************************************************************
       01  •ÏX\¿|Œ_–ñ“à—e.
           03  ‚c‚R‚U‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|Œ©Ï”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚P|âg‹cŒˆÙ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|‘Ý•tŽÀs—\’è“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|¬–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|Œ_–ñŒ–¼    PIC  X(060).
           03  ‚c‚R‚U‚P|ƒGƒ“ƒhƒ†[ƒUƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚P|Œ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|Ð‰îƒ‹[ƒg  PIC  X(001).
           03  ‚c‚R‚U‚P|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚U‚P|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|•Ï‘¥•¥      PIC  X(001).
           03  ‚c‚R‚U‚P|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|Œ_–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|’S•Û‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|‹¦’²‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚U‚P|ŽåŠ²Ž–æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚P|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ƒ†[ƒU—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|’·ƒvƒ‰‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚U‚P|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚R‚U‚P|‘æ‚P‰ñ‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‘æ‚P‰ñ‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‘æ‚P‰ñ‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‘æ‚P‰ñ‰ñŽû‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|U‘ÖŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|“ª‹à‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|‰c‹ÆƒRƒƒ“ƒg—“‚P
                                     PIC  X(080).
           03  ‚c‚R‚U‚P|‰c‹ÆƒRƒƒ“ƒg—“‚Q
                                     PIC  X(080).
           03  ‚c‚R‚U‚P|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚P|–ž—¹ˆÄ“à‘—•t‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|–ž—¹ˆÄ“à‰ñ“š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚U‚P|‘k‹yˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‘k‹yˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|ŒŸŽûŽæÁ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|ŒŸŽûŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|“–‰‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ÅV‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ÅI•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒXƒf[ƒ^ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒXŽ©“®ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|ƒŠ[ƒXŠ„•Š‘O•¥ŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|“ª‹à¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‘O•¥¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|“ª‹à¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‘O•¥¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚P|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|•¨ŒŠm”F    PIC  X(001).
           03  ‚c‚R‚U‚P|‚Ü‚é‚ß’PˆÊ  PIC  X(001).
           03  ‚c‚R‚U‚P|“à–óˆóü•û–@
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Œ_–ñŠúŠÔ‰ñ”ˆóü—L–³
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|¬–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|¬–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|¬–ñŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX¿‹ŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚P|“–‰—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|“–‰‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|“–‰ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|“–‰Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆÈ~‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆÈ~‰ñŽû“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆÈ~‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‹ŒŽæˆø”Ô†  PIC  X(010).
           03  ‚c‚R‚U‚P|‰ð–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|‰ð–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|–ž—¹—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|–ž—¹—\–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒXŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|³ŒpƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|³Œpˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|³ŒpŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|³ŒpŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|”„‹pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|”„‹pˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|ðŒ•ÏXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|ðŒ•ÏXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚P|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Œ_–ñ—¿—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‘e—˜Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|“–‰Œ_–ñ—¿—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆÈ~‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|¿‹ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|¿‹ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|¿‹Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|Œ_–ñŽæˆø‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Ó”C‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|‘ŠŽE‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|’•¶‘o—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|–ž—¹ˆÄ“à’ •[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX—¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Œ_–ñ‘Ž®    PIC  X(001).
           03  ‚c‚R‚U‚P|•¨Œ•ÛŠÇêŠ
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|¿‹æ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚U‚P|•s“®ŽY’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|—L‰¿ØŒ”’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‚»‚Ì‘¼’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|•ÛØl—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|–¢ŽûŽc‚‘ÎÛŠOƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚R‚U‚P|“®‘•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|“®‘•t•ÛŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚P|–â‡‚¹”Ô†  PIC  X(010).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‹ŒŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚R‚U‚P|w“ü‘I‘ðŒ •tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX\¿‘—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|³Œp\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ƒŠƒXƒPƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‘e—˜‰vŠz|•\
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‚¨Žx•¥–¾×‘ì¬Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‚¨Žx•¥–¾×‘—v”Û
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|\¿”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|‘ÎÛŒ³–{Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚P|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|¿‹Šî€    PIC  X(001).
           03  ‚c‚R‚U‚P|ŽŸ‰ñÄƒŠ[ƒX‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽŸ‰ñÄƒŠ[ƒX‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽG”ï•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽG”ï”Ì‘£”ï  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽG”ïM—p•ÛŒ¯
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽG”ï‚»‚Ì‘¼  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|’¥‹Š®—¹ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|’¥‹Š®—¹ŽæÁƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ŽŸ‰ñÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Œ_–ñ‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|’•¶‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‚»‚Ì‘¼”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‰c‹ÆƒRƒƒ“ƒg—“‚R
                                     PIC  X(080).
           03  ‚c‚R‚U‚P|ŽÐ“à‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ŽG”ï’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‹¦’²‰ñŽû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|’P”N“xŒ_–ñ  PIC  X(001).
           03  ‚c‚R‚U‚P|ƒoƒbƒNŽæˆø  PIC  X(001).
           03  ‚c‚R‚U‚P|”Û”F‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚R‚U‚P|”ñ‰ÛÅ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚U‚P|•ïŠ‡‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|ŠCŠOÝ’u‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|•¨ŒƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚R‚U‚P|‰ð–ñ‹àŒvŽZ•û–@
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|”À“ü—\’è“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|\¿Œ_–ñŠz‰ÁŽZƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Ð‰îæŽæˆøæ
                                     PIC  X(009).
           03  ‚c‚R‚U‚P|Ð‰îæŒ_–ñæ
                                     PIC  X(005).
           03  ‚c‚R‚U‚P|Ð‰îæ‚a‚s‚l
                                     PIC  X(004).
           03  ‚c‚R‚U‚P|Ð‰îæ—»“X  PIC  X(004).
           03  ‚c‚R‚U‚P|Ð‰îæ‹âs  PIC  X(004).
           03  ‚c‚R‚U‚P|Ð‰îæŽx“X  PIC  X(003).
           03  ‚c‚R‚U‚P|¿‹“ú      PIC  X(002).
           03  ‚c‚R‚U‚P|Œ_–ñŽæÁ——R‚P
                                     PIC  X(080).
           03  ‚c‚R‚U‚P|Œ_–ñŽæÁ——R‚Q
                                     PIC  X(080).
           03  ‚c‚R‚U‚P|Œ_–ñŽæÁ\¿‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ŒˆÙ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Œ_–ñ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ŒŸŽû“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Œ_–ñŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ŒŸŽûŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|•ÏX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|•ÏXƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚P|•ÏX”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|Â–±‹¦’²ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚U‚P|ˆê”Ê‘åŒû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|§“xƒŠ[ƒX  PIC  X(001).
           03  ‚c‚R‚U‚P|Šî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‘e—˜Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆê”ÊŽÐ“à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆê”ÊŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆê”Ê‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆê”ÊŠî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆê”ÊŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆê”Ê‘e—˜ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‹­§•Û‘¶ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚U‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚U‚P|ˆ´ùŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‹Æ–±‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|”ƒ–ß‹`–±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‘ã—‰ñŽû    PIC  X(001).
           03  ‚c‚R‚U‚P|”ƒŽæ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‹à—˜•Ï“®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|˜A“®‹à—˜‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚P|Š„ˆø—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‘Ý•t‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‘Ý•t‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|Ž‘‹àŽg“r‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚P|Ž‘‹àŽg“r•¶Œ¾
                                     PIC  X(080).
           03  ‚c‚R‚U‚P|Žx•¥ˆÏ‘õŽæˆøŒ`‘Ô
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|—ZŽ‘•û–@    PIC  X(001).
           03  ‚c‚R‚U‚P|•ÔÏðŒ    PIC  X(001).
           03  ‚c‚R‚U‚P|ƒŠ[ƒXŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Ž‘ŽY‰È–Ú‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|d—v«Šî€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‘O“n‹à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ƒgƒŠƒvƒ‹ƒIƒvƒVƒ‡ƒ“•ûŽ®
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ˆø‡’†Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|“à—e•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|³Œp•ªŠ„Ží—Þ
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|³Œp‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|–ž—¹ðŒ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‘æ‚P‰ñ–Ú‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚R‚U‚P|‘æ‚Q‰ñ–ÚˆÈ~‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚R‚U‚P|÷“nðŒ•tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Žx•¥Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‘¹ŠQ”…ž‹à•¶Œ¾
                                     PIC  X(080).
           03  ‚c‚R‚U‚P|—¬“®‰»”Ô†  PIC  X(006).
           03  ‚c‚R‚U‚P|—¬“®‰»æ    PIC  X(007).
           03  ‚c‚R‚U‚P|M‘õæÝ’è“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|M‘õI—¹“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|·“ü—\–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ÂŒ ”ƒŽæ“ú  PIC  X(008).
           03  ‚c‚R‚U‚P|‘ŠŽEð€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|÷“n‹ÖŽ~“Á–ñ
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|æ•ûŒ_–ñ”Ô†
                                     PIC  X(016).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX—¿•ªŽq
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX—¿•ª•ê
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|‰c‹ÆƒRƒƒ“ƒg—“‚S
                                     PIC  X(080).
           03  ‚c‚R‚U‚P|V‹Kæ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚U‚P|e–§æ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚U‚P|à–±•”‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ˆê”Ê‘O“n‹à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|ŒˆÙƒ‰ƒ“ƒN  PIC  X(001).
           03  ‚c‚R‚U‚P|‚¨—çó”­sƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|ˆÚsƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX\¿ðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚P|–â‚¢‡‚í‚¹’S“–•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚U‚P|–â‚¢‡‚í‚¹’S“–ŽÒ–¼
                                     PIC  X(020).
           03  ‚c‚R‚U‚P|ÄƒŠ[ƒX—¿Žx•¥—\’è“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|–ž—¹’Ê’m‘‰ñ“šŠúŒÀ
                                     PIC  X(008).
           03  ‚c‚R‚U‚P|\¿‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚P|“à—e\¿‘ˆóü‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚P|“à—e\¿‘ˆóüÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|Œ_–ñŒ–¼Ž©“®“o˜^‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|•ÔÏŒ´Ž‘    PIC  X(080).
           03  ‚c‚R‚U‚P|”Û”Fˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚P|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚R‚U‚P|—¬“®‰»æŒ_–ñæƒR[ƒh
                                     PIC  X(005).
