      *****************************************************************
      *   •ÏX\¿QÂŒ “WŠJ(D364HST_TBL)
      *****************************************************************
       01  •ÏX\¿|ÂŒ “WŠJ.
           03  ‚c‚R‚U‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚U‚S|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚S|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚R‚U‚S|”„ãŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|”„ãÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|”„ãÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚S|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚U‚S|¿‹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚S|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹Á”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚R‚U‚S|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚S|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚S|¿‹‘”­s“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚S|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚S|ˆÏ‘õ•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|ˆÏ‘õ•ÛŽçÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹Œ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚R‚U‚S|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚R‚U‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚S|ŽèŒ`ŽóŽæƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚S|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ¿‹Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚U‚S|—˜‘§¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚U‚S|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚R‚U‚S|—š—ð˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|”„ãÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|”„ãÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹ÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹ÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ¿‹ÂŒ Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ¿‹ÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹Œ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|¿‹Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Œ³–{‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|—˜‘§‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Žû‰v“WŠJ—˜‰ñ‚è
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ”„ãŒ³–{’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ•ªŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ•ªŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|•ÔÏ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚S|ŠúŠÔŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|ŠúŠÔ“ú”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|—˜‘§ŒvŽZŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚S|—˜‘§ŒvŽZI—¹“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚S|Ž©ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ‰ñŽûÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚U‚S|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚R‚U‚S|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚S|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Áž”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚S|‘¼ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|‘¼ŽÐ¿‹ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚S|Ž©ŽÐ‚»‚Ì‘¼””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
