      *****************************************************************
      *   ‘Ý•t‹à‘‘Öî•ñQŒ_–ñ(D369KKJ_TBL)
      *****************************************************************
       01  ‘Ý•t‹à‘‘Öî•ñ|Œ_–ñ.
           03  ‚c‚R‚U‚X|Œ_–ñ”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚U‚X|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚X|‘‘ÖŒ³Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚U‚X|‘‘ÖŒ³Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚X|‘‘ÖŒ³—˜‘§Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚X|“o˜^’S“–ŽÒ  PIC  X(008).
