      *****************************************************************
      *   •ÏX—š—ð_•¨Œ(D373HBK_TBL)
      *****************************************************************
       01  •ÏX—š—ð|•¨Œ.
           03  ‚c‚R‚V‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚V‚R|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‚eŒ^–¼      PIC  X(025).
           03  ‚c‚R‚V‚R|Žæ“¾”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|ˆÚ“®”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|”„”p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚R|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚R|ˆÚ“®ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚R|”„”pƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚R|³Œpƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚R|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚R‚V‚R|ˆÚ“®——R    PIC  X(002).
           03  ‚c‚R‚V‚R|”„”p——R    PIC  X(002).
           03  ‚c‚R‚V‚R|»‘¢ŽÒ–¼    PIC  X(060).
           03  ‚c‚R‚V‚R|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Žæ“¾Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‘ŠŽE‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚V‚R|·ˆø‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|·ˆø‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Ž‘ŽYŽí—Þ    PIC  X(007).
           03  ‚c‚R‚V‚R|”—Ê        PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|’PˆÊ        PIC  X(001).
           03  ‚c‚R‚V‚R|Å–@‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚R|‘Ï—p”N”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•¨ŒŽí—Þ    PIC  X(002).
           03  ‚c‚R‚V‚R|ƒ\ƒtƒg‹æ•ª  PIC  X(001).
           03  ‚c‚R‚V‚R|­ŠzŽ‘ŽY‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|’†ŒÃŽ‘ŽY‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|‰ïŽÐž‹p‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ŒÅ’èŽ‘ŽYÅ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|‹@ŠB—Þ•ª—ÞƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚V‚R|ƒfƒB[ƒ‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚R|ƒfƒB[ƒ‰ƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚R|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚R‚V‚R|ŽèŒ`ƒTƒCƒg  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|ZŠ‚Q      PIC  X(060).
           03  ‚c‚R‚V‚R|ZŠ‚R      PIC  X(060).
           03  ‚c‚R‚V‚R|•¨ŒƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‹ŒŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚R‚V‚R|‹Œ•¨Œ”Ô†  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ˆ•ªæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚R|ˆ•ªæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚R|”„‹p‘ã‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|”„‹p‘ã‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|”„‹p‘ã‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|•ÛŒ¯Ž–ŒÌƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|•ÛŒ¯Ž–ŒÌ‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Ž–ŒÌ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|Ž–ŒÌ‘ä”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ƒ†[ƒUŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|“–ŽÐŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•ªŠ„”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|’èŠz|ŒŽŠzž‹p”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|’èŠz|ŒŽŠzž‹p”ï’[”
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Œ©Ï•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ÄƒŠ[ƒX—\’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ÄƒŠ[ƒX—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ÄƒŠ[ƒXŽc‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‹Œ•¨Œ—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‹ŒŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Ž©‘¼ŽÐ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚V‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚R|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚R|Ý’uêŠƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚R‚V‚R|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚R‚V‚R|’è‰¿        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ƒŒƒ“ƒ^ƒ‹”{—¦
                                     PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ƒŒƒ“ƒ^ƒ‹—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|”„”pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|”„”pˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|”„”pŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|”„”pŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|”„”pŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|’™‘ •i•]‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|³ŒpŒ³Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚V‚R|³ŒpŒ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|³Œp”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|³Œpˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|ˆ•ª—\’è    PIC  X(001).
           03  ‚c‚R‚V‚R|–ž—¹ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|–ž—¹ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|–ž—¹ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚R|”„”p‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚R|‹¦’²ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚R|‹¦’²Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚V‚R|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|’™‘ •i‹æ•ª  PIC  X(001).
           03  ‚c‚R‚V‚R|Žæ“¾ŠzŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ƒŠ[ƒX—¿ŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|•ªŠ„Œ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•ªŠ„ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|ˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|HŽ–”ï“™‘gž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|HŽ–”ï“™    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ŠCŠOÝ’uêŠ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|•ÛØ‰ïŽÐ    PIC  X(009).
           03  ‚c‚R‚V‚R|•¨Œ–¼Ì    PIC  X(060).
           03  ‚c‚R‚V‚R|³Œp“ñŽŸÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•¨Œˆ•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚R‚V‚R|•¨Œˆ•ª˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Œ©Ï|Œ©Ï”Ô†|’S“–ŽÒ
                                     PIC  X(002).
           03  ‚c‚R‚V‚R|Œ©Ï|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Œ©Ï|•¨Œ”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|“ñŽŸŒ_–ñ—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|“o˜^”Ô†    PIC  X(008).
           03  ‚c‚R‚V‚R|•¨Œˆ•ª\¿ó‘Ôƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‘¼ŽÐÄƒŠ[ƒXŽc‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‹Œ‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•¨Œˆ•ª\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|³Œp—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‹ŒˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|‹ŒˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‹ŒˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•¨Œ‹æ•ª    PIC  X(002).
           03  ‚c‚R‚V‚R|Ží—Þ‹æ•ª    PIC  X(002).
           03  ‚c‚R‚V‚R|ƒ[ƒJ[‹æ•ª
                                     PIC  X(003).
           03  ‚c‚R‚V‚R|‹@ŠB”Ô†    PIC  X(020).
           03  ‚c‚R‚V‚R|•¨Œ–¼ƒJƒi  PIC  X(060).
           03  ‚c‚R‚V‚R|ZŠ‚P      PIC  X(060).
           03  ‚c‚R‚V‚R|Ý’uêŠ–¼  PIC  X(080).
           03  ‚c‚R‚V‚R|Ý’uêŠ–¼ƒJƒi
                                     PIC  X(080).
           03  ‚c‚R‚V‚R|’Zk\¿‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|Žc‰¿‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚R|ÌŽZ•¨Œì¬˜A”Ô
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Žw’è“dŽqŒvŽZ‹@
                                     PIC  X(040).
           03  ‚c‚R‚V‚R|“dŽqŒvŽZ‹@Š—LŽÒ
                                     PIC  X(040).
           03  ‚c‚R‚V‚R|•¨Œ•ªŠ„\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ž‹pŽ‘ŽYÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚P
                                     PIC  X(016).
           03  ‚c‚R‚V‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚Q
                                     PIC  X(016).
           03  ‚c‚R‚V‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚R
                                     PIC  X(016).
           03  ‚c‚R‚V‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚S
                                     PIC  X(016).
           03  ‚c‚R‚V‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚V‚R|ÅžŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ÅžŽc‰¿Ý’èŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•¨ŒƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‘¼ŽÐw“ü‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|Ž©ŽÐƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‘¼ŽÐƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Š—LƒŠ[ƒX‰ïŽÐ
                                     PIC  X(009).
           03  ‚c‚R‚V‚R|“Á—áŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|“Á—á—¦|•ªŽq
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|“Á—á—¦|•ª•ê
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|“Á—á‰ÛÅ•W€Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ŒÅÅ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ŒÅÅÅ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚V‚R|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ÂŒ ”ƒŽæ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|”„‹pˆÏ‘õŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|ˆøŽæ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|ˆøŽæ”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|”„‹pŒ©Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|•t•Û—¦      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|’Ê’m‘”­‘—“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|•„†        PIC  X(005).
           03  ‚c‚R‚V‚R|M—p•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‹@Ží–¼”Ô†  PIC  X(002).
           03  ‚c‚R‚V‚R|Ž©ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|‘¹ŠQ•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|”…ž•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|‰ð–ñŽæÁ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|³ŒpŽæÁ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚R|³ŒpŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|“®‘—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|•ÛŽç‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚R|‰ð–ñ\¿˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|“–‰Žc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|“–‰‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚R|M—p•ÛŒ¯ƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚R‚V‚R|“®‘•t•Û‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|’™‘ •iŽ¯•Ê‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚R|”ñ‰Ò“®Ž‘ŽYŒÅÅ\‹æ•ª
                                     PIC  X(001).
