      *****************************************************************
      *   •ÏX—š—ð_Žx•¥“à—e(D374HSN_TBL)
      *****************************************************************
       01  •ÏX—š—ð|Žx•¥“à—e.
           03  ‚c‚R‚V‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚R‚V‚S|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚V‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚S|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚S|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚V‚S|‰‰ñŽx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|‰‰ñŽx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|–³žŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥“úƒpƒ^[ƒ“
                                     PIC  X(001).
           03  ‚c‚R‚V‚S|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚R‚V‚S|•ÏX“ú      PIC  X(008).
           03  ‚c‚R‚V‚S|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚S|‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|‘¼ŽÐŒ_–ñ”Ô†
                                     PIC  X(020).
           03  ‚c‚R‚V‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚V‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚V‚S|Žx•¥Žè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ŽŸ‰ñŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ŽŸ‰ñŽx•¥Žè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|“ñ‰ñ–ÚˆÈ~Žx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|“ñ‰ñ–ÚˆÈ~Žx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|‘OŽóŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|“ª‹à        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|“ª‹àÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ŽèŒ`UoƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ŽèŒ`Uo“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ŒŽŠz—¿‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥Ï‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥Ï‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|‰‰ñŽx•¥‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚V‚S|‰ð–ñ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Ž•ª”ä—¦    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|¿‹‘Šm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚S|“ü‹àŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚S|Už—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚S|ƒ\ƒtƒgŽx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ƒ\ƒtƒgŽx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Žx•¥Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ÄƒŠ[ƒXŽx•¥Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ˆÈ~Žx•¥ƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|ˆÈ~Žx•¥“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚S|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
