      *****************************************************************
      *   •ÏX—š—ð_ÂŒ “WŠJ(D376HST_TBL)
      *****************************************************************
       01  •ÏX—š—ð|ÂŒ “WŠJ.
           03  ‚c‚R‚V‚U|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚U|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚V‚U|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚V‚U|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚R‚V‚U|”„ãŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|”„ãÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|”„ãÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚U|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚U|¿‹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹Á”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚V‚U|¿‹‘”­s“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚U|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚U|ˆÏ‘õ•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|ˆÏ‘õ•ÛŽçÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹Œ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚R‚V‚U|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚R‚V‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚V‚U|ŽèŒ`ŽóŽæƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚U|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ¿‹Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚V‚U|—˜‘§¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚V‚U|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚R‚V‚U|—š—ð˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|”„ãÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|”„ãÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹ÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹ÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ¿‹ÂŒ Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ¿‹ÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹Œ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|¿‹Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Œ³–{‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|—˜‘§‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Žû‰v“WŠJ—˜‰ñ‚è
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ”„ãŒ³–{’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ•ªŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ•ªŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|•ÔÏ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|ŠúŠÔŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|ŠúŠÔ“ú”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|—˜‘§ŒvŽZŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚U|—˜‘§ŒvŽZI—¹“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚U|Ž©ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ‰ñŽûÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚V‚U|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚U|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Áž”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚U|‘¼ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|‘¼ŽÐ¿‹ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚U|Ž©ŽÐ‚»‚Ì‘¼””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
