      *****************************************************************
      *   •¨Œ\¿(D391BSN_TBL)
      *****************************************************************
       01  •¨Œ\¿.
           03  ‚c‚R‚X‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚X‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚X‚P|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‚eŒ^–¼      PIC  X(025).
           03  ‚c‚R‚X‚P|Žæ“¾”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|ˆÚ“®”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|”„”p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚X‚P|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚X‚P|ˆÚ“®ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚X‚P|”„”pƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚X‚P|³Œpƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚X‚P|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚R‚X‚P|ˆÚ“®——R    PIC  X(002).
           03  ‚c‚R‚X‚P|”„”p——R    PIC  X(002).
           03  ‚c‚R‚X‚P|»‘¢ŽÒ–¼    PIC  X(060).
           03  ‚c‚R‚X‚P|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Žæ“¾Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‘ŠŽE‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚X‚P|·ˆø‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|·ˆø‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Ž‘ŽYŽí—Þ    PIC  X(007).
           03  ‚c‚R‚X‚P|”—Ê        PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|’PˆÊ        PIC  X(001).
           03  ‚c‚R‚X‚P|Å–@‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚P|‘Ï—p”N”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|•¨ŒŽí—Þ    PIC  X(002).
           03  ‚c‚R‚X‚P|ƒ\ƒtƒg‹æ•ª  PIC  X(001).
           03  ‚c‚R‚X‚P|­ŠzŽ‘ŽY‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|’†ŒÃŽ‘ŽY‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|‰ïŽÐž‹p‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ŒÅ’èŽ‘ŽYÅ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|‹@ŠB—Þ•ª—ÞƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚X‚P|ƒfƒB[ƒ‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚X‚P|ƒfƒB[ƒ‰ƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚P|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚R‚X‚P|ŽèŒ`ƒTƒCƒg  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|ZŠ‚Q      PIC  X(060).
           03  ‚c‚R‚X‚P|ZŠ‚R      PIC  X(060).
           03  ‚c‚R‚X‚P|•¨ŒƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‹ŒŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚R‚X‚P|‹Œ•¨Œ”Ô†  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ˆ•ªæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚X‚P|ˆ•ªæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚P|”„‹p‘ã‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|”„‹p‘ã‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|”„‹p‘ã‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|•ÛŒ¯Ž–ŒÌƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|•ÛŒ¯Ž–ŒÌ‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Ž–ŒÌ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|Ž–ŒÌ‘ä”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ƒ†[ƒUŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|“–ŽÐŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|•ªŠ„”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|’èŠz|ŒŽŠzž‹p”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|’èŠz|ŒŽŠzž‹p”ï’[”
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Œ©Ï•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ÄƒŠ[ƒX—\’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ÄƒŠ[ƒX—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ÄƒŠ[ƒXŽc‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‹Œ•¨Œ—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‹ŒŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Ž©‘¼ŽÐ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚X‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚X‚P|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚P|Ý’uêŠƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚R‚X‚P|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚R‚X‚P|’è‰¿        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ƒŒƒ“ƒ^ƒ‹”{—¦
                                     PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ƒŒƒ“ƒ^ƒ‹—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|”„”pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|”„”pˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|”„”pŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|”„”pŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|”„”pŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|’™‘ •i•]‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|³ŒpŒ³Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚X‚P|³ŒpŒ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|³Œp”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|³Œpˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|ˆ•ª—\’è    PIC  X(001).
           03  ‚c‚R‚X‚P|–ž—¹ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|–ž—¹ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|–ž—¹ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚P|”„”p‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚P|‹¦’²ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚X‚P|‹¦’²Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚X‚P|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|’™‘ •i‹æ•ª  PIC  X(001).
           03  ‚c‚R‚X‚P|Žæ“¾ŠzŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ƒŠ[ƒX—¿ŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|•ªŠ„Œ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|•ªŠ„ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|ˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|HŽ–”ï“™‘gž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|HŽ–”ï“™    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ŠCŠOÝ’uêŠ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|•ÛØ‰ïŽÐ    PIC  X(009).
           03  ‚c‚R‚X‚P|•¨Œ–¼Ì    PIC  X(060).
           03  ‚c‚R‚X‚P|³Œp“ñŽŸÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|•¨Œˆ•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚R‚X‚P|•¨Œˆ•ª˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Œ©Ï|Œ©Ï”Ô†|’S“–ŽÒ
                                     PIC  X(002).
           03  ‚c‚R‚X‚P|Œ©Ï|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Œ©Ï|•¨Œ”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|“ñŽŸŒ_–ñ—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|“o˜^”Ô†    PIC  X(008).
           03  ‚c‚R‚X‚P|•¨Œˆ•ª\¿ó‘Ôƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‘¼ŽÐÄƒŠ[ƒXŽc‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‹Œ‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|•¨Œˆ•ª\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|³Œp—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‹ŒˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|‹ŒˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‹ŒˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|•¨Œ‹æ•ª    PIC  X(002).
           03  ‚c‚R‚X‚P|Ží—Þ‹æ•ª    PIC  X(002).
           03  ‚c‚R‚X‚P|ƒ[ƒJ[‹æ•ª
                                     PIC  X(003).
           03  ‚c‚R‚X‚P|‹@ŠB”Ô†    PIC  X(020).
           03  ‚c‚R‚X‚P|•¨Œ–¼ƒJƒi  PIC  X(060).
           03  ‚c‚R‚X‚P|ZŠ‚P      PIC  X(060).
           03  ‚c‚R‚X‚P|Ý’uêŠ–¼  PIC  X(080).
           03  ‚c‚R‚X‚P|Ý’uêŠ–¼ƒJƒi
                                     PIC  X(080).
           03  ‚c‚R‚X‚P|’Zk\¿‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|Žc‰¿‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚P|ÌŽZ•¨Œì¬˜A”Ô
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Žw’è“dŽqŒvŽZ‹@
                                     PIC  X(040).
           03  ‚c‚R‚X‚P|“dŽqŒvŽZ‹@Š—LŽÒ
                                     PIC  X(040).
           03  ‚c‚R‚X‚P|•¨Œ•ªŠ„\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ž‹pŽ‘ŽYÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚P
                                     PIC  X(016).
           03  ‚c‚R‚X‚P|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚Q
                                     PIC  X(016).
           03  ‚c‚R‚X‚P|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚R
                                     PIC  X(016).
           03  ‚c‚R‚X‚P|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚S
                                     PIC  X(016).
           03  ‚c‚R‚X‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚X‚P|ÅžŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ÅžŽc‰¿Ý’èŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|•¨ŒƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‘¼ŽÐw“ü‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|Ž©ŽÐƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‘¼ŽÐƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Š—LƒŠ[ƒX‰ïŽÐ
                                     PIC  X(009).
           03  ‚c‚R‚X‚P|“Á—áŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|“Á—á—¦|•ªŽq
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|“Á—á—¦|•ª•ê
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|“Á—á‰ÛÅ•W€Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ŒÅÅ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ŒÅÅÅ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚X‚P|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ÂŒ ”ƒŽæ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|”„‹pˆÏ‘õŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|ˆøŽæ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|ˆøŽæ”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|”„‹pŒ©Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|•t•Û—¦      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|’Ê’m‘”­‘—“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|•„†        PIC  X(005).
           03  ‚c‚R‚X‚P|M—p•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‹@Ží–¼”Ô†  PIC  X(002).
           03  ‚c‚R‚X‚P|Ž©ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|‘¹ŠQ•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|”…ž•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|‰ð–ñŽæÁ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|³ŒpŽæÁ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚P|³ŒpŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|“®‘—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|•ÛŽç‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚P|‰ð–ñ\¿˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|“–‰Žc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|“–‰‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚P|M—p•ÛŒ¯ƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚R‚X‚P|“®‘•t•Û‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|’™‘ •iŽ¯•Ê‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚P|”ñ‰Ò“®Ž‘ŽYŒÅÅ\‹æ•ª
                                     PIC  X(001).
