      *****************************************************************
      *   •ÏX\¿Q‹à—Z“WŠJ(D393HKT_TBL)
      *****************************************************************
       01  •ÏX\¿|‹à—Z“WŠJ.
           03  ‚c‚R‚X‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚X‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚X‚R|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚R‚X‚R|“WŠJ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚R|—˜‘§ŒŽ”    PIC S9(001)V9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|—˜‘§        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Œ³–{’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐŒ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐ””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|“–ŒŽ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐ—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|Ž©ŽÐŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚X‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚X‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚R|XVŽÒ      PIC  X(008).
