      *****************************************************************
      *   •ÏX—š—ðQ‹à—Z“WŠJ(D394HKT_TBL)
      *****************************************************************
       01  •ÏX—š—ð|‹à—Z“WŠJ.
           03  ‚c‚R‚X‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚X‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚X‚S|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚X‚S|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚R‚X‚S|“WŠJ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚S|—˜‘§ŒŽ”    PIC S9(001)V9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|—˜‘§        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Œ³–{’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐŒ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐ””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|“–ŒŽ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐ—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|Ž©ŽÐŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚X‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚X‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚X‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚S|XVŽÒ      PIC  X(008).
