      *****************************************************************
      *   •ÏX—š—ðQ¿‹æ(D396HSQ_TBL)
      *****************************************************************
       01  •ÏX—š—ð|¿‹æ.
           03  ‚c‚R‚X‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚X‚U|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚U|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚U|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚X‚U|¿‹æ–¼Ì  PIC  X(080).
           03  ‚c‚R‚X‚U|•”–å–¼Ì    PIC  X(060).
           03  ‚c‚R‚X‚U|’S“–ŽÒ–¼Ì  PIC  X(020).
           03  ‚c‚R‚X‚U|¿‹‘•\Ž¦  PIC  X(001).
           03  ‚c‚R‚X‚U|Užl–¼    PIC  X(040).
           03  ‚c‚R‚X‚U|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚R‚X‚U|”[•tæƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚R‚X‚U|ZŠ‚Q      PIC  X(060).
           03  ‚c‚R‚X‚U|ZŠ‚R      PIC  X(060).
           03  ‚c‚R‚X‚U|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚R‚X‚U|ˆêŠ‡“ü‹àƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚U|‘—•tæ–¼Ì  PIC  X(060).
           03  ‚c‚R‚X‚U|‘—•tæ•”–å  PIC  X(060).
           03  ‚c‚R‚X‚U|‘—•tæ’S“–ŽÒ
                                     PIC  X(020).
           03  ‚c‚R‚X‚U|‘—•tæƒJƒi–¼Ì
                                     PIC  X(040).
           03  ‚c‚R‚X‚U|‘—•tæ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚R‚X‚U|‘—•tæŽs’¬‘ºƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚R‚X‚U|‘—•tæZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚R‚X‚U|‘—•tæZŠ‚R
                                     PIC  X(060).
           03  ‚c‚R‚X‚U|‘—•tæ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚R‚X‚U|Ž©“®ƒ}ƒbƒ`ƒ“ƒO‘ÎÛŠO‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|‰ñŽûƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚U|‰ñŽû“ú      PIC  X(002).
           03  ‚c‚R‚X‚U|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚R‚X‚U|‰ñŽûŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚U|¿‹ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚U|¿‹’÷“ú    PIC  X(002).
           03  ‚c‚R‚X‚U|¿‹ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚U|¿‹Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚U|ì¬’Ê”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚U|ì¬’PˆÊ    PIC  X(001).
           03  ‚c‚R‚X‚U|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|¿‹Žw’è—lŽ®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|‘—•t‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚U|ŽóŽæ‘¤‹à—Z‹@ŠÖƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚X‚U|ŽóŽæ‘¤Žx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚X‚U|ŽóŽæ‘¤ŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|ŽóŽæ‘¤ŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚X‚U|ŒûU‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚X‚U|ŒûUŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚X‚U|ŒûUŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|ŒûUŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚X‚U|ŒûU–¼‹`l  PIC  X(030).
           03  ‚c‚R‚X‚U|¿‹ˆ¶–¼ˆóü
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|¿‹“ú•tˆóü
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|‰ñŽûŠúŒÀˆóü
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|Žg—pŒŽˆóü  PIC  X(001).
           03  ‚c‚R‚X‚U|“à–óˆóü    PIC  X(001).
           03  ‚c‚R‚X‚U|¿‹”Ô†ˆóü
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|“E—v—“ˆóü  PIC  X(001).
           03  ‚c‚R‚X‚U|“E—v—“      PIC  X(060).
           03  ‚c‚R‚X‚U|”õl—“ˆóü  PIC  X(001).
           03  ‚c‚R‚X‚U|ŒûU‚²ˆÄ“à‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|W–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚U|XV“úŽž    PIC  X(016).
           03  ‚c‚R‚X‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚X‚U|‘—•tæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚X‚U|‰¼‘zŒûÀ˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚U|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|ƒRƒƒ“ƒg—“  PIC  X(060).
           03  ‚c‚R‚X‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚X‚U|•”–åƒJƒi–¼Ì
                                     PIC  X(030).
           03  ‚c‚R‚X‚U|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚U|‹¤—Lƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚X‚U|ZŠ‚P      PIC  X(060).
           03  ‚c‚R‚X‚U|ZŠƒJƒi–¼Ì
                                     PIC  X(060).
           03  ‚c‚R‚X‚U|‚e‚`‚w”Ô†  PIC  X(015).
           03  ‚c‚R‚X‚U|U‘Ö‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚X‚U|Ž©Uˆø—Ž“ú  PIC  X(002).
           03  ‚c‚R‚X‚U|ŽóŽæ‘¤ŒûÀƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚X‚U|UžŽè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚U|Œ»’S“–ŽÒ    PIC  X(008).
           03  ‚c‚R‚X‚U|Žå’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚X‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚X‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚U|‹Œ¿‹æƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚X‚U|ŒûÀˆø—ŽˆË—Š‘Žó—Ì“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚U|ŒûÀˆø—ŽŠJŽn“ú
                                     PIC  X(008).
