      *****************************************************************
      *   ”Ä—p¿‹Q§Œä(D401SQK_TBL)
      *****************************************************************
       01  ”Ä—p¿‹|§Œä.
           03  ‚c‚S‚O‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚O‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚O‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚O‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚O‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚O‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚O‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚O‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚O‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
