      *****************************************************************
      *   ‘O•¥‹à(D42MAB_TBL)
      *****************************************************************
       01  ‘O•¥‹à.
           03  ‚c‚S‚Q|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚S‚Q|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚Q|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚S‚Q|‘O•¥‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘O•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘O•¥‹àŠzÁ”ïÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘O•¥‹àŠzÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚Q|‘O•¥‰ñŽû•û–@  PIC  X(001).
           03  ‚c‚S‚Q|‘O•¥‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘O•¥‰ñŽû“ú    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚Q|[“–ŠJŽn‰ñ    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚Q|[“–ŒŽ”      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚Q|[“–ŠJŽn”NŒŽ  PIC  X(006).
           03  ‚c‚S‚Q|‰ñŽûŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‰ñŽûŠzÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|UžŽè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‰ñŽû”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚Q|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚Q|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚S‚Q|XVŽÒ        PIC  X(008).
           03  ‚c‚S‚Q|‰ð–ñ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚Q|‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|¿‹‘”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚S‚Q|–¢‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚Q|Ž©ŽÐ‘O•¥‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|Ž©ŽÐ‘O•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘¼ŽÐ‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘¼ŽÐ‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘¼ŽÐ‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘¼ŽÐ–¢‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚S‚Q|‘Ý“|‘¹Ž¸‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚Q|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚S‚Q|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚S‚Q|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚S‚Q|¿‹æƒR[ƒh  PIC  X(005).
           03  ‚c‚S‚Q|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚Q|Áž’Ê”Ô      PIC  X(011).
           03  ‚c‚S‚Q|[“–ÏŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚Q|[“–ÏŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|–¢[“–Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‰‰ñ“ü‹à“ú    PIC  X(008).
           03  ‚c‚S‚Q|Ž©ŽÐ‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|Ž©ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘¼ŽÐ‘O•¥‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|‘¼ŽÐ‘O•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|[“–”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚Q|[“–ÏŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|Ž©ŽÐ[“–ÏŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|Ž©ŽÐ[“–ÏŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|–¢[“–Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|Ž©ŽÐ–¢[“–Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|Ž©ŽÐ–¢[“–Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q|Áž”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚Q|‰ñŽû—\’è“ú    PIC  X(008).
