      *****************************************************************
      *   ‰ð–ñ—š—ðQÂŒ  (D464KSA_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|ÂŒ .
           03  ‚c‚S‚U‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚U‚S|Œ_–ñŒ–¼    PIC  X(040).
           03  ‚c‚S‚U‚S|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚S‚U‚S|•Ï‘¥•¥      PIC  X(001).
           03  ‚c‚S‚U‚S|“–‰ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚S|“–‰Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Á”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅVŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅVÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚S|ÅVÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅVŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅVÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|•ÛŽç–³žŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚U‚S|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚U‚S|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚S|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚S|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚S‚U‚S|‰ð–ñ‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅV—š—ð‰ð–ñ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅV‰ñŽû“ú  PIC  X(008).
           03  ‚c‚S‚U‚S|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|Š„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Š„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘k‹y‰ð–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚S|‰ð–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|–ž—¹ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚U‚S|–ž—¹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚S|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|‰ð–ñ\¿“ú  PIC  X(008).
           03  ‚c‚S‚U‚S|‰ñŽûðŒ•ÏXƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|‰ñŽûðŒ•ÏX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‰ñŽûðŒ•ÏX“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚S|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|•ÛŽç—L–³ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒXŽ©“®ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒXŽ©“®ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚U‚S|“–‰Žæ“¾Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Žæ“¾ŠzŒ»‰¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘O•¥ŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚S|¿‹‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‡ŽZæŒ_–ñŽí—Þ
                                     PIC  X(003).
           03  ‚c‚S‚U‚S|¡‰ñÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒXŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©U¿‹ƒXƒgƒbƒv\¿”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|Ž©U¿‹ƒXƒgƒbƒv\¿•”‰Û
                                     PIC  X(004).
           03  ‚c‚S‚U‚S|Ž©U¿‹ƒXƒgƒbƒv\¿ŽÒ
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|Ž©U¿‹ƒXƒgƒbƒvŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚S|Ž©U¿‹ƒXƒgƒbƒvI—¹”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚S|Ž©U¿‹ƒXƒgƒbƒv——R
                                     PIC  X(002).
           03  ‚c‚S‚U‚S|Ž©UƒXƒgƒbƒvƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|Ž©U“Á•Ê¿‹\¿”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|Ž©U“Á•Ê¿‹\¿•”‰Û
                                     PIC  X(004).
           03  ‚c‚S‚U‚S|Ž©U“Á•Ê¿‹\¿ŽÒ
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|Ž©U“Á•Ê¿‹ŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚S|Ž©U“Á•Ê¿‹I—¹”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚S|Ž©U“Á•Ê¿‹\¿‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©U“Á•ÊƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|Žx•¥ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|ˆÏ‘õ•ÛŽç‘Š“–ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|‚»‚Ì‘¼Œ_–ñŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚U‚S|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚U‚S|‘e—˜‰vŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘e—˜‰vŠz|•\
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ŽèŒ`ŽóŽæ“ú  PIC  X(008).
           03  ‚c‚S‚U‚S|ŽèŒ`–‡”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ•ªŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ•ªŒŽŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ•ªÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘¼ŽÐŠ„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|‘¼ŽÐŠ„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒXŽè”—¿‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒXŽè”—¿‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚S|”„‹p‘ãŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒXŽ©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÄƒŠ[ƒX‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Š„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Š„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Š„•ŠŒ´‰¿‘ŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Š„•Š—˜‰v‘ŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Â–±Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚S‚U‚S|Á”ïÅ’·Šú|ŽÀÑ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚S‚U‚S|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|“–‰ŒŽŠz—¿‹à‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Á”ïÅŠz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅVŒŽŠz—¿‹à‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅVÁ”ïÅŠz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅVŒ_–ñ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ÅVÁ”ïÅ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Žæ“¾‰¿Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Žæ“¾Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ŽŸ‰ñÄƒŠ[ƒX—¿‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|ƒŠƒXƒP‘OŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚U‚S|Ž©U¿‹‹àŠz•ÏX——R
                                     PIC  X(002).
           03  ‚c‚S‚U‚S|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ý’uêŠ‹æ•ª
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Œ_–ñ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|“–‰Á”ïÅ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐŒ³–{‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ”„ã—˜‘§‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ—˜‘§‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐŒÅ’èŽ‘ŽYÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ“®‘•ÛŒ¯‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐˆÏ‘õ•ÛŽç—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ‚»‚Ì‘¼””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ•ªŽx•¥”ï—p“K—p‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Ž©ŽÐ•ªŽx•¥”ï—pˆê”Ê‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|Œ³–{‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|—˜‘§‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚S|””ï—p‘Šz  PIC S9(013) PACKED-DECIMAL.
