      *****************************************************************
      *   ‰ð–ñ—š—ðQÂŒ ‰ð–ñ(D467KSK_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|ÂŒ ‰ð–ñ.
           03  ‚c‚S‚U‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚U‚V|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚U‚V|‰ð–ñ˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñ³Œp‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚V|‰ð–ñ—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñŒã—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñŒãÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñŒãŒ_–ñ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñŒãŒ_–ñ‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‚Ü‚é‚ß’PˆÊ  PIC  X(001).
           03  ‚c‚S‚U‚V|‡ˆÓ‰ð–ñ‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‘¹ŠQ”…ž‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|”„‹p‘ã[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚V|”„‹p‘ã[“–Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ß“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‘OŽó‰ß“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ß•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|•ÛŽç‰ß•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚V|‰ð–ñ‹à¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñ‹à¿‹ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñ‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñ”„ã”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚V|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ß“ü‹à•Ô‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ß“ü‹à•Ô‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‘OŽó‹à•Ô‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‘OŽó‹à•Ô‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|•Ô‹àŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚U‚V|•Ô‹à¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚U‚V|‰ß“ü‹à•Ô‹à“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚V|•Ô‹à“ú•Ê“rŽw’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚V|•Ô‹à‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚S‚U‚V|•Ô‹àŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚U‚V|•Ô‹àŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚S‚U‚V|•Ô‹àŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚U‚V|•Ô‹àŒûÀ–¼‹`l
                                     PIC  X(030).
           03  ‚c‚S‚U‚V|‰ð–ñ•ª‘O•¥ƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñ•ª‘O•¥ƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‘OŽóƒŠ[ƒX—¿ˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚V|Žc‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ŽcƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñ•ÛØŽc‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Œ¸Šz–@‚P‚P‚O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Œ¸Šz–@‚P‚O‚T
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|•ÛŒ¯‰¿Ši‚P‚P‚O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ŽÀŽ¿Œ³–{Žc‚P‚O‚T
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ŽÀŽ¿–¢‰ñŽûŒ³–{Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|–¢’¥ŽûŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|–¢’¥Žû•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|–¢’¥Žû‡ŒvŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ŽÀŽ¿Œ³–{Žc‚P‚O‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñŒvã‘e—˜
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|–@’è’èŠzž‹pŠzŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|–@’è’è—¦ž‹pŠzŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚S‚U‚V|‰ð–ñŽd–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚U‚V|¿‹Œ–¼    PIC  X(040).
           03  ‚c‚S‚U‚V|“ü‹à’âŽ~“ú  PIC  X(008).
           03  ‚c‚S‚U‚V|Ž©ŽÐ•ªŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Ž©ŽÐ•ªŒŽŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Ž©ŽÐ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Ž©ŽÐ•ªÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ÅVŒŽŠz—¿‹à‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ÅVÁ”ïÅŠz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ÅVŒ_–ñ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ÅVÁ”ïÅ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ŽŸ‰ñÄƒŠ[ƒX—¿‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ÅVŽæ“¾‰¿Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|ÅVŽæ“¾‰¿ŠzÁ”ïÅ‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñˆÈ~—˜‘§‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñˆÈ~—˜‘§‡Œv”„ã
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|‰ð–ñˆÈ~’²’B—˜‘§”„ã
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚U‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚U‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
