      *****************************************************************
      *   ‰ð–ñ—š—ðQŽx•¥“à—e(D473KSN_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|Žx•¥“à—e.
           03  ‚c‚S‚V‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚V‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚S‚V‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚V‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚V‚R|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚V‚R|‰‰ñŽx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|‰‰ñŽx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|–³žŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥“úƒpƒ^[ƒ“
                                     PIC  X(001).
           03  ‚c‚S‚V‚R|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚S‚V‚R|•ÏX“ú      PIC  X(008).
           03  ‚c‚S‚V‚R|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚R|‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|‘¼ŽÐŒ_–ñ”Ô†
                                     PIC  X(020).
           03  ‚c‚S‚V‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚V‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚V‚R|Žx•¥Žè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ŽŸ‰ñŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ŽŸ‰ñŽx•¥Žè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|“ñ‰ñ–ÚˆÈ~Žx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|“ñ‰ñ–ÚˆÈ~Žx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|‘OŽóŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|“ª‹à        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|“ª‹àÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ŽèŒ`UoƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ŽèŒ`Uo“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ŒŽŠz—¿‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥Ï‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥Ï‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|‰‰ñŽx•¥‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚V‚R|‰ð–ñ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Ž•ª”ä—¦    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|¿‹‘Šm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚V‚R|“ü‹àŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚V‚R|Už—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚V‚R|ƒ\ƒtƒgŽx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ƒ\ƒtƒgŽx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Žx•¥Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ÄƒŠ[ƒXŽx•¥Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ˆÈ~Žx•¥ƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|ˆÈ~Žx•¥“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚R|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
