      *****************************************************************
      *   ‰ð–ñ—š—ðQÂ–±Š„•Š“WŠJ(D476KST_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|Â–±Š„•Š“WŠJ.
           03  ‚c‚S‚V‚U|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚V‚U|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚V‚U|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚V‚U|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚V‚U|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚S‚V‚U|Žx•¥”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚U|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|—˜‘§ŒŽ”    PIC S9(001)V9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|—˜‘§        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|“–ŒŽ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚S‚V‚U|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|“WŠJ‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|•ÏXŒ³–{Žc‚’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚V‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚V‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
