      *****************************************************************
      *   ‰ð–ñ\¿QŒp‘±”ï—pŽx•¥(D513KKH_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿|Œp‘±”ï—pŽx•¥.
           03  ‚c‚T‚P‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚R|”ï—pŽí—Þ    PIC  X(003).
           03  ‚c‚T‚P‚R|ŒJ‰„ŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚R|”ï—p‹æ•ª    PIC  X(001).
           03  ‚c‚T‚P‚R|”ï—p‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚R|‰‰ñŽx•¥—\’è”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚P‚R|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚R|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚R|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚T‚P‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚P‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚T‚P‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚R|“o˜^’S“–ŽÒ  PIC  X(008).
