      *****************************************************************
      *   ‰ð–ñ\¿QŽx•¥“à—e(D517KSN_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿|Žx•¥“à—e.
           03  ‚c‚T‚P‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚V|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚T‚P‚V|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚T‚P‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚T‚P‚V|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚T‚P‚V|‰‰ñŽx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|‰‰ñŽx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|–³žŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥“úƒpƒ^[ƒ“
                                     PIC  X(001).
           03  ‚c‚T‚P‚V|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚T‚P‚V|•ÏX“ú      PIC  X(008).
           03  ‚c‚T‚P‚V|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚V|‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|‘¼ŽÐŒ_–ñ”Ô†
                                     PIC  X(020).
           03  ‚c‚T‚P‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚P‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚T‚P‚V|Žx•¥Žè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ŽŸ‰ñŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ŽŸ‰ñŽx•¥Žè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|“ñ‰ñ–ÚˆÈ~Žx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|“ñ‰ñ–ÚˆÈ~Žx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|‘OŽóŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|“ª‹à        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|“ª‹àÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ŽèŒ`UoƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ŽèŒ`Uo“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ŒŽŠz—¿‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥Ï‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥Ï‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|‰‰ñŽx•¥‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚P‚V|‰ð–ñ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Ž•ª”ä—¦    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|¿‹‘Šm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚V|“ü‹àŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚V|Už—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚V|ƒ\ƒtƒgŽx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ƒ\ƒtƒgŽx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Žx•¥Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ÄƒŠ[ƒXŽx•¥Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ˆÈ~Žx•¥ƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|ˆÈ~Žx•¥“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚V|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
