      *****************************************************************
      *   ”Ä—p“ü‹àŽd–ó(D571HNS_TBL)
      *****************************************************************
       01  ”Ä—p“ü‹àŽd–ó.
           03  ‚c‚T‚V‚P|“ü‹à“ú      PIC  X(008).
           03  ‚c‚T‚V‚P|‚r‚d‚p”Ô†  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚T‚V‚P|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚V‚P|ŽØ•û‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚T‚V‚P|ŽØ•û‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V‚P|ŽØ•û‰ÛÅ‹æ•ª
                                     PIC  X(003).
           03  ‚c‚T‚V‚P|‘Ý•û‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚T‚V‚P|‘Ý•û‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V‚P|‘Ý•û‰ÛÅ‹æ•ª
                                     PIC  X(003).
           03  ‚c‚T‚V‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚V‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚V‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚V‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚V‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚V‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚V‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
