000010*****************************************************************
000020*   “ü‹àÁžŠÇ—(D57NKK_TBL)
000030*****************************************************************
000040 01  “ü‹àÁžŠÇ—.
000050     03  ‚c‚T‚V‚m‚j‚j|Áž’Ê”Ô      PIC  X(011).
000060     03  ‚c‚T‚V‚m‚j‚j|ƒŒƒR[ƒh‹æ•ª  PIC  X(001).
000070     03  ‚c‚T‚V‚m‚j‚j|Áž”NŒŽ“ú    PIC  X(008).
000080     03  ‚c‚T‚V‚m‚j‚j|ÁžŽž      PIC  X(008).
000090     03  ‚c‚T‚V‚m‚j‚j|Áž’S“–ŽÒ    PIC  X(020).
000100     03  ‚c‚T‚V‚m‚j‚j|Žd–ó’ZkƒR[ƒh
000110                                     PIC  X(002).
000120     03  ‚c‚T‚V‚m‚j‚j|“E—v          PIC  X(080).
000130     03  ‚c‚T‚V‚m‚j‚j|ÁžŽæÁ‹æ•ª  PIC  X(001).
000140     03  ‚c‚T‚V‚m‚j‚j|“o˜^”NŒŽ“ú    PIC  X(008).
000150     03  ‚c‚T‚V‚m‚j‚j|“o˜^ŽžŠÔ      PIC  X(008).
000160     03  ‚c‚T‚V‚m‚j‚j|“o˜^’S“–ŽÒ    PIC  X(008).
000170     03  ‚c‚T‚V‚m‚j‚j|XV”NŒŽ“ú    PIC  X(008).
000180     03  ‚c‚T‚V‚m‚j‚j|XVŽžŠÔ      PIC  X(008).
000190     03  ‚c‚T‚V‚m‚j‚j|XVŽÒ        PIC  X(008).
000200     03  ‚c‚T‚V‚m‚j‚j|“ü—Í’S“–ŽÒƒR[ƒh
000210                                     PIC  X(008).
