      *****************************************************************
      *   —^MðŒ•¶Œ¾ƒe[ƒuƒ‹(D643YJM_TBL)
      *****************************************************************
       01  —^MðŒ•¶Œ¾ƒe[ƒuƒ‹.
           03  ‚c‚U‚S‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚S‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚S‚R|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚S‚R|—^MðŒ•¶Œ¾”Ô†
                                     PIC  X(003).
           03  ‚c‚U‚S‚R|—^MðŒ•¶Œ¾
                                     PIC  X(120).
           03  ‚c‚U‚S‚R|’S•ÛŽó•t‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚S‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚S‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚S‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚S‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚S‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚S‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚S‚R|“o˜^’S“–ŽÒ  PIC  X(008).
