      *****************************************************************
      *   ’ñŒgƒŠ[ƒX’ •[ŠÇ—ƒe[ƒuƒ‹(D660TKC_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX’ •[ŠÇ—ƒe[ƒuƒ‹.
           03  ‚c‚U‚U‚O|ˆóüŽwŽ¦‰æ–Ê‚h‚c
                                     PIC  X(008).
           03  ‚c‚U‚U‚O|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚O|’ •[‚h‚c    PIC  X(008).
           03  ‚c‚U‚U‚O|•\Ž¦‡      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚O|o—ÍŒ`‘Ô    PIC  X(001).
           03  ‚c‚U‚U‚O|’¥‹ŠÇ——L–³
                                     PIC  X(001).
           03  ‚c‚U‚U‚O|’¥‹ŠÇ—Ží—Þ
                                     PIC  X(001).
           03  ‚c‚U‚U‚O|‘—ÞŽí—Þ    PIC  X(003).
           03  ‚c‚U‚U‚O|‘—Þ˜A”Ô|’¥‹‘—Þ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚O|o—Íó‹µ    PIC  X(001).
           03  ‚c‚U‚U‚O|ÅIo—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚U‚O|ÅIo—ÍŽžŠÔ
                                     PIC  X(008).
           03  ‚c‚U‚U‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚U‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
