      *****************************************************************
      *   ’ñŒgƒŠ[ƒX’†“r‰ð–ñƒe[ƒuƒ‹(D667KAI_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX’†“r‰ð–ñƒe[ƒuƒ‹.
           03  ‚c‚U‚U‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚U‚V|’ñŒgæŒ_–ñ”Ô†
                                     PIC  X(027).
           03  ‚c‚U‚U‚V|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚U‚V|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚U‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚V|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚V|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚V|¬–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚V|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚U‚U‚V|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚U‚U‚V|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Œ_–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‘OŽóƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‘O“n‹à—˜‘§Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Ž©ŽÐŒÅ’èŽ‘ŽYÅ|ŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Ž©ŽÐ“®‘•ÛŒ¯—¿|ŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Ž©ŽÐw“üŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|”—Ê‡Œv    PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|ƒ†[ƒU—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‘æ‚P‰ñ‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‚a‚d‚f‚h‚m‰ñ”
                                     PIC  X(001).
           03  ‚c‚U‚U‚V|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚U‚V|ˆÈ~‰ñŽû“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|ŽcŒŽ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|ƒŠ[ƒXŠ„•Š‘O•¥ŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‘OŽóŽcŒŽ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|ÅV“ü—ÍÁ”ïÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Ž©ŽÐ”„ãÂŒ Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚V|’ñŒgæ‰ïŽÐƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚U‚U‚V|’ñŒgæŽx“XƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚U‚U‚V|’ñŒgæŒ_–ñŽÒ–¼
                                     PIC  X(025).
           03  ‚c‚U‚U‚V|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚U‚U‚V|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚U‚U‚V|‰ð–ñˆ—    PIC  X(001).
           03  ‚c‚U‚U‚V|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚V|V’ñŒgæŒ_–ñ”Ô†
                                     PIC  X(012).
           03  ‚c‚U‚U‚V|‡ˆÓ‰ð–ñ‹àŽx•¥“ú
                                     PIC  X(008).
           03  ‚c‚U‚U‚V|Už’âŽ~“ú  PIC  X(008).
           03  ‚c‚U‚U‚V|‚l‚s‹æ•ª    PIC  X(001).
           03  ‚c‚U‚U‚V|•ÏX‹æ•ª    PIC  X(001).
           03  ‚c‚U‚U‚V|‚l‚s•ÏX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚V|‡ˆÓ‰ð–ñ‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Å’á‘¹ŠQ‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‡ˆÓ‰ð–ñ‹àÁ”ï—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‡ˆÓ‰ð–ñ‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‡ˆÓ‰ð–ñ‹à‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|·ˆøŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|·ˆøŽx•¥ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|ˆê•”•”•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚V|Ž©ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|”—Ê        PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Ž©ŽÐƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Ý’uêŠ–¼  PIC  X(080).
           03  ‚c‚U‚U‚V|•¨Œ–¼ƒJƒi  PIC  X(060).
           03  ‚c‚U‚U‚V|ŒÅ’èŽ‘ŽYÅ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚V|“®‘•t•Û‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚V|‘Ï—p”N”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‰ð–ñŽ©ŽÐw“üŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‰ð–ñ”—Ê    PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‰ð–ñŽ©ŽÐƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‰ð–ñ‘O“n‹à—˜‘§Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‰ð–ñŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‰ð–ñ•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Žx•¥Ï‘O•¥ƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|Žx•¥Ï‘O•¥ƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‰ßèƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|‰ßèƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|–¢•¥ƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|–¢•¥ƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚V|ƒGƒ‰[ƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚U‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚U‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚V|“o˜^Žž    PIC  X(008).
           03  ‚c‚U‚U‚V|“o˜^ŽÒ      PIC  X(008).
           03  ‚c‚U‚U‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
