      *****************************************************************
      *   ’ñŒgƒŠ[ƒXŒ©Ï(D671TMK_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒXŒ©Ï.
           03  ‚c‚U‚V‚P|Œ_–ñ”Ô†    PIC  X(009).
           03  ‚c‚U‚V‚P|’ñŒgæ–¼    PIC  X(060).
           03  ‚c‚U‚V‚P|‘ã•\•¨Œ–¼  PIC  X(040).
           03  ‚c‚U‚V‚P|•¨Œ‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|•¨Œ‹àŠzÁ”ïÅ
                                     PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|”—Ê        PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|‰Ád‘Ï—p”N”
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|‰ÁdŒJ‰„ŒŽ”
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|ƒŠ[ƒXŠúŠÔ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|‘OŽóŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|‹àŒÉŽx“XƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚V‚P|‹àŒÉ–¼      PIC  X(020).
           03  ‚c‚U‚V‚P|Žx“X–¼      PIC  X(020).
           03  ‚c‚U‚V‚P|ƒŠ[ƒX—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|‘OŽóƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚V‚P|”õl        PIC  X(100).
           03  ‚c‚U‚V‚P|o—Í‹æ•ª    PIC  X(001).
           03  ‚c‚U‚V‚P|Œ©Ï‘o—Í“ú
                                     PIC  X(008).
           03  ‚c‚U‚V‚P|Žæˆøæ–¼Ì  PIC  X(080).
           03  ‚c‚U‚V‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚V‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚V‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚V‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚V‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚V‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚V‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚V‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
