      *****************************************************************
      *   ƒf[ƒ^•ÏŠ·Q‰æ–Ê§Œä(D684DHS_TBL)
      *****************************************************************
       01  ƒf[ƒ^•ÏŠ·|‰æ–Ê§Œä.
           03  ‚c‚U‚W‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚S|‚r‚d‚p|‚m‚n
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚S|€–Ú–¼Ì    PIC  X(100).
           03  ‚c‚U‚W‚S|Žg—p‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚S|•\Ž¦‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚S|”wŒiF‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚S|Žg—p‚c‚v    PIC  X(030).
           03  ‚c‚U‚W‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚W‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚W‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
