      *****************************************************************
      *   ƒf[ƒ^’ù³Q‰æ–Ê§Œä(D685DTS_TBL)
      *****************************************************************
       01  ƒf[ƒ^’ù³|‰æ–Ê§Œä.
           03  ‚c‚U‚W‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚T|‚r‚d‚p|‚m‚n
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚T|€–Ú–¼Ì    PIC  X(100).
           03  ‚c‚U‚W‚T|Žg—p‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚T|•\Ž¦‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚T|”wŒiF‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚T|Žg—p‚c‚v    PIC  X(030).
           03  ‚c‚U‚W‚T|§Œä‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚W‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚W‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
