      *****************************************************************
      *   ’ñŒgƒŠ[ƒXƒf[ƒ^•ÏŠ·î•ñ(D687DHJ_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒXƒf[ƒ^•ÏŠ·î•ñ.
           03  ‚c‚U‚W‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚V|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚V|•”ƒR[ƒh  PIC  X(004).
           03  ‚c‚U‚W‚V|’S“–ŽÒƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|Œ_–ñ“ú      PIC  X(008).
           03  ‚c‚U‚W‚V|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚V|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚V|¿‹”­sƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|¿‹‘”­s“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|¿‹ŠÔŠu    PIC  X(002).
           03  ‚c‚U‚W‚V|¿‹Šî€ŒŽ  PIC  X(002).
           03  ‚c‚U‚W‚V|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚V|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚V|w“üŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚V|w“üæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚V|Â–±‹¦’²‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒvŽZ•ûŽ®    PIC  X(001).
           03  ‚c‚U‚W‚V|ˆÄŒ”­¶——R
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|Žc‰¿•ÛØæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚V|‰c‹Æ•”ˆÓŒ©  PIC  X(160).
           03  ‚c‚U‚W‚V|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚V|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚U‚W‚V|Ð‰îæ‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚V|Ð‰îæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚V|Ð‰îæŒ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚V|Ð‰îæ‚a‚s‚l–{Žx“XƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚U‚W‚V|Ð‰îæ•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|Ð‰îæ‹âsƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚U‚W‚V|‹¦’²“]‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚V|‹¦’²‰ñŽû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|‘¹ŠQ”…ž‹àŒvŽZ•û–@
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|‘¹ŠQ”…ž‹à•¶Œ¾
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|•¨ŒŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|ŒŸŽû“ú      PIC  X(008).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚P
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚Q
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚R
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚S
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚T
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚P
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚Q
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚R
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚S
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚T
                                     PIC  X(003).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚P
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚Q
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚R
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚S
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚T
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚P
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚Q
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚R
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚S
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚T
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚P
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚Q
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚R
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚S
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚T
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚P
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚Q
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚R
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚S
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚T
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ðŒ‚P
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ðŒ‚Q
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ðŒ‚R
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ðŒ‚S
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|Žx•¥ðŒ‚T
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ðŒ‚P
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ðŒ‚Q
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ðŒ‚R
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ðŒ‚S
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|Žx•¥ðŒ‚T
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ŒŸŽû‚P|ˆ´ùŽè”—¿Žx•¥ƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŒŸŽû‚Q|ˆ´ùŽè”—¿Žx•¥ƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ˆ´ùŽè”—¿Žx•¥“ú
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|‰‰ñ|‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|“ñ‰ñ–ÚˆÈ~|‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|‰‰ñ|‰ñŽûƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|“ñ‰ñ–ÚˆÈ~|‰ñŽûƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|‰‰ñ|‰ñŽû“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|“ñ‰ñ–ÚˆÈ~|‰ñŽû“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|‰‰ñ|˜’uŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|“ñ‰ñ–ÚˆÈ~|˜’uŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|‰‰ñ|‰ñŽû“ú•¶Œ¾
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|“ñ‰ñ–ÚˆÈ~|‰ñŽû“ú•¶Œ¾
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|“Á–ñð€    PIC  X(320).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|’ñŒgæ‚P
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|’ñŒgæ‚Q
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|’ñŒgæ‚R
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|’ñŒgæ‚S
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|’ñŒgæ‚T
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚P
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚Q
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚R
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚S
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚T
                                     PIC  X(030).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚P
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚Q
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚R
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚S
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚T
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|’ •[o—Í”NŒŽ“ú|ƒvƒ‰ƒXŒŽ”
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|’ •[o—Í”NŒŽ“ú|“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|ˆø“næ‹æ•ª|”„‹p
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|ˆø“næ‹æ•ª|”pŠü
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|”„‹p‹àŠz“ü‹àŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚V|”„‹p‹àŠz“ü‹àæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚V|”„‹pˆÏ‘õŽè”—¿Š„‡
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|”„‹p‹àŠz“ü‹à—\’è“ú|ƒvƒ‰ƒXŒŽ”
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|”„‹p‹àŠz“ü‹à—\’è“ú|“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|Žó“nŠúŒÀ    PIC  X(030).
           03  ‚c‚U‚W‚V|Žx•¥ðŒ    PIC  X(040).
           03  ‚c‚U‚W‚V|ƒŠ[ƒXŠúŠÔ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|—D‹ö‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|‘e—˜‰v      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|Šî–{—˜‰ñ‚è|Ž©ŽÐ
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|ŽÀŽ¿—˜‰ñ‚è|Ž©ŽÐ
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|‘e—˜‰v|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|Žx•¥‘€‰„‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|Žx•¥ƒTƒCƒg  PIC  X(004).
           03  ‚c‚U‚W‚V|Žx•¥“ú      PIC  X(008).
           03  ‚c‚U‚W‚V|ˆ´ùŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|ƒNƒŒƒ‰ƒCƒ“‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|‘OŽó‹àŠz|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|[“–        PIC  X(012).
           03  ‚c‚U‚W‚V|[“–ŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|“ñ‰ñ–ÚˆÈ~|‰ñŽûŠÔŠu
                                     PIC  X(002).
           03  ‚c‚U‚W‚V|Žx•¥•û–@‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚V|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚V|ŽèŒ`Uo“úƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŽèŒ`Uo“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|ŽèŒ`Šú“úƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|ŽèŒ`Šú“ú    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|ŽèŒ`ŽóŽæ•û–@
                                     PIC  X(004).
           03  ‚c‚U‚W‚V|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(013).
           03  ‚c‚U‚W‚V|Žx•¥‘ŠŽEŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|Žx•¥‘ŠŽEÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|Ž©ŽÐŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|‘¼ŽÐŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|ŒÂ•ÊƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚V|Žc‰¿‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚V|Žw’è“dŽqŒvŽZ‹@
                                     PIC  X(040).
           03  ‚c‚U‚W‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚W‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚W‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
