      *****************************************************************
      *   ‚r‚e‚b–ž—¹—\’è‚j‚d‚x(D688MSY_TBL)
      *****************************************************************
       01  ‚r‚e‚b–ž—¹—\’è‚j‚d‚x.
           03  ‚c‚U‚W‚W|‚r‚e‚bŒ_–ñ”Ô†
                                     PIC  X(012).
           03  ‚c‚U‚W‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚W‚W|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
