      *****************************************************************
      *   ŽO—mU•ªƒe[ƒuƒ‹i–ž—¹ƒf[ƒ^j(D691SFM_TBL)
      *****************************************************************
       01  ŽO—mU•ªƒe[ƒuƒ‹|–ž—¹ƒf[ƒ^.
           03  ‚c‚U‚X‚P|‚a‚n‚s‚kŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚U‚X‚P|‚a‚n‚s‚k•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚X‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚X‚P|ƒŠ[ƒXI—¹“ú
                                     PIC  X(008).
           03  ‚c‚U‚X‚P|”—Ê|‰ð–ñ‘O
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚X‚P|”—Ê|‰ð–ñŒã
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚X‚P|ŒÂ•ÊƒŠ[ƒX—¿|‰ð–ñ‘O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚P|w“ü‹àŠz|‰ð–ñ‘O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚P|Ž‘ŽYˆ•ªƒR[ƒh
                                     PIC S9(001) PACKED-DECIMAL.
