      *****************************************************************
      *   æ“ú•t—ÝÏƒe[ƒuƒ‹(D693SHR_TBL)
      *****************************************************************
       01  æ“ú•t—ÝÏƒe[ƒuƒ‹.
           03  ‚c‚U‚X‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚X‚R|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|ƒŠ[ƒXI—¹“ú
                                     PIC  X(008).
           03  ‚c‚U‚X‚R|ƒf[ƒ^‹æ•ª  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|‰ïˆõ”Ô†    PIC  X(016).
           03  ‚c‚U‚X‚R|Ž‘ŽY”Ô†    PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|ˆê•”•”•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚X‚R|ÄƒŠ[ƒX¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|ÄƒŠ[ƒXw“ü‹àŠz|‰ð–ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|ÄƒŠ[ƒX¿‹Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|–ž—¹”—Ê|‰ð–ñ•ª
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|–ž—¹ŒÂ•ÊƒŠ[ƒX—¿|‰ð–ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|–ž—¹w“ü‹àŠz|‰ð–ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|–ž—¹Ž‘ŽYˆ•ªƒR[ƒh
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|–ž—¹”„‹pŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|–ž—¹”„‹pŽ––±‘ãsŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚R|ˆ—“ú      PIC  X(008).
