         01  ‹Æ–±“ú•tŠÇ—.
           03  ‚c‚V‚O|‹Æ–±“à–óƒR[ƒh      PIC  X(002).
           03  ‚c‚V‚O|ƒOƒ‹[ƒv‚h‚c        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚O|˜A”Ô                PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚O|ŠÇ—”N              PIC  X(004).
           03  ‚c‚V‚O|ŠÇ—ŒŽ              PIC  X(002).
           03  ‚c‚V‚O|ŠÇ—“ú              PIC  X(002).
           03  ‚c‚V‚O|ƒŒƒR[ƒhà–¾        PIC  X(050).
           03  ‚c‚V‚O|“o˜^”NŒŽ“ú          PIC  X(008).
           03  ‚c‚V‚O|“o˜^ŽžŠÔ            PIC  X(008).
           03  ‚c‚V‚O|“o˜^’S“–ŽÒ          PIC  X(008).
           03  ‚c‚V‚O|XV”NŒŽ“ú          PIC  X(008).
           03  ‚c‚V‚O|XVŽžŠÔ            PIC  X(008).
           03  ‚c‚V‚O|XVŽÒ              PIC  X(008).
           03  ‚c‚V‚O|“ü—Í’S“–ŽÒƒR[ƒh    PIC  X(008).
           