      *****************************************************************
      *   ”Ä—p‰ïŒvŽd–óƒ}ƒXƒ^(D712KHS_TBL)
      *****************************************************************
       01  ”Ä—p‰ïŒvŽd–óƒ}ƒXƒ^.
           03  ‚c‚V‚P‚Q|“`•[”Ô†    PIC  X(012).
           03  ‚c‚V‚P‚Q|‹Æ–±ƒR[ƒh  PIC  X(002).
           03  ‚c‚V‚P‚Q|Žæˆø‹æ•ª    PIC  X(004).
           03  ‚c‚V‚P‚Q|“àŠO‹æ•ª    PIC  X(010).
           03  ‚c‚V‚P‚Q|Žæˆø“ú      PIC  X(008).
           03  ‚c‚V‚P‚Q|‚u‚`‚k‚t‚d“ú
                                     PIC  X(008).
           03  ‚c‚V‚P‚Q|“–‰Žæˆø“ú  PIC  X(008).
           03  ‚c‚V‚P‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(014).
           03  ‚c‚V‚P‚Q|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚Q|ó‘Ô‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚Q|³”FŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚Q|³”F“ú•t    PIC  X(008).
           03  ‚c‚V‚P‚Q|³”FŽž    PIC  X(006).
           03  ‚c‚V‚P‚Q|“o˜^íœ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚Q|ŽæÁ“`•[”Ô†
                                     PIC  X(012).
           03  ‚c‚V‚P‚Q|Š‘®•”“X    PIC  X(004).
           03  ‚c‚V‚P‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚P‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚Q|XVŽÒ      PIC  X(008).
