      *****************************************************************
      *   “`•[”Ô†Ì”Ôƒe[ƒuƒ‹(D716DSK_TBL)
      *****************************************************************
       01  “`•[”Ô†Ì”Ôƒe[ƒuƒ‹.
           03  ‚c‚V‚P‚U|‹Æ–±“à–óƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚P‚U|“`•[”Ô†    PIC  X(012).
