      *****************************************************************
      *   Žd–ó—š—ð(D720SWR_TBL)
      *****************************************************************
       01  Žd–ó—š—ð.
           03  ‚c‚V‚Q‚O|Žd–óƒCƒxƒ“ƒg‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚Q‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚Q‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚O|Žd–óƒR[ƒh  PIC  X(006).
           03  ‚c‚V‚Q‚O|‘ÝŽØ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚Q‚O|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚Q‚O|“o˜^Žž    PIC  X(008).
           03  ‚c‚V‚Q‚O|“ü‹àÁž’Zk‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚O|Žd–ó’ZkƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚Q‚O|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚Q‚O|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚Q‚O|‰ÛÅ‹æ•ªƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚Q‚O|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚Q‚O|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚V‚Q‚O|ÂŒ Â–±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚O|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚O|ê—pƒVƒXƒeƒ€‹æ•ª
                                     PIC  X(003).
           03  ‚c‚V‚Q‚O|Šm’èŒã’ù³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚O|ŒŸŽû’ù³”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚Q‚O|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚Q‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚Q‚O|ŒÄoŒ³ƒvƒƒOƒ‰ƒ€‚h‚c
                                     PIC  X(008).
           03  ‚c‚V‚Q‚O|“ü—Í“ú      PIC  X(008).
           03  ‚c‚V‚Q‚O|Žæˆø“ú      PIC  X(008).
           03  ‚c‚V‚Q‚O|‚u‚`‚k‚t‚d“ú
                                     PIC  X(008).
           03  ‚c‚V‚Q‚O|ŽæˆøæƒR[ƒh‚P
                                     PIC  X(009).
           03  ‚c‚V‚Q‚O|ŽæˆøæƒR[ƒh‚Q
                                     PIC  X(005).
           03  ‚c‚V‚Q‚O|Œvã•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚Q‚O|‚a‚n‚s‚k˜AŒ‹‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚O|”„ãÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚Q‚O|Žd“üÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚Q‚O|ŽóŽæŽè”—¿Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚Q‚O|‹àŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚O|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚O|Á”ïÅŒvã‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚O|‘OŽóƒŠ[ƒX—¿Œvã‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚O|ãæ‚¹‰ð–ñæŒ_–ñ”Ô†
                                     PIC  X(010).
