      *****************************************************************
      *   ŠÇ”Ì”ï—\ŽZ˜gŠÇ—ƒ}ƒXƒ^(D731KYS_TBL)
      *****************************************************************
       01  ŠÇ”Ì”ï—\ŽZ˜gŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚V‚R‚P|”N“x        PIC  X(004).
           03  ‚c‚V‚R‚P|•”“X        PIC  X(004).
           03  ‚c‚V‚R‚P|‰È–ÚƒR[ƒh  PIC  X(006).
           03  ‚c‚V‚R‚P|ŠúŽñ—\ŽZ    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚P|•ÏX‘OŠúŽñ—\ŽZ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚P|C³—\ŽZ    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚P|C³‘OC³—\ŽZ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚P|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚P|Š‘®•”“X    PIC  X(004).
           03  ‚c‚V‚R‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚R‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚R‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚R‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚R‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚R‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚R‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚R‚P|ŽxoŠz      PIC S9(013) PACKED-DECIMAL.
