      *****************************************************************
      *   ’èŠúŽx•¥ƒ}ƒXƒ^i–¾×j(D735HTS_TBL)
      *****************************************************************
       01  ’èŠúŽx•¥ƒ}ƒXƒ^i–¾×j.
           03  ‚c‚V‚R‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚R‚T|ÄƒŠ[ƒXƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚R‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚R‚T|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚R‚T|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚R‚T|‘ÝŽØ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚T|s”Ô†      PIC  X(002).
           03  ‚c‚V‚R‚T|‰È–ÚƒR[ƒh  PIC  X(006).
           03  ‚c‚V‚R‚T|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚R‚T|‚q‚d‚e‚m‚n‚P
                                     PIC  X(007).
           03  ‚c‚V‚R‚T|‚q‚d‚e‚m‚n‚Q
                                     PIC  X(009).
           03  ‚c‚V‚R‚T|‹àŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚T|‰ÛÅƒR[ƒh  PIC  X(003).
           03  ‚c‚V‚R‚T|Å—¦‹æ•ª    PIC  X(002).
           03  ‚c‚V‚R‚T|Œvã•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚R‚T|®—”Ô†    PIC  X(006).
