      *****************************************************************
      *   ‰È–ÚŒûÀ•Ê•½ŽcŠÇ—ƒ}ƒXƒ^(D741KHK_TBL)
      *****************************************************************
       01  ‰È–ÚŒûÀ•Ê•½ŽcŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚V‚S‚P|•”“X        PIC  X(004).
           03  ‚c‚V‚S‚P|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚S‚P|WŒv‰È–Ú    PIC  X(006).
           03  ‚c‚V‚S‚P|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚S‚P|•¼Ží        PIC  X(003).
           03  ‚c‚V‚S‚P|ˆ—‘ÎÛ”NŒŽ
                                     PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|ˆ—ŽÀŽ{“ú  PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|‚m‚d‚sŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|Ï”        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Pƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Qƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Rƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Sƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Tƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Uƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Vƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Wƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Xƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Oƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Pƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Qƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Rƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Sƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Tƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚S‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚S‚P|XVŽÒ      PIC  X(008).
