      *****************************************************************
      *   ¿‹–¾×ƒe[ƒuƒ‹(D761SQM_TBL)
      *****************************************************************
       01  ¿‹–¾×ƒe[ƒuƒ‹.
           03  ‚c‚V‚U‚P|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|¿‹‘“à–¾×˜A”Ô
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|¿‹–¾×‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚U‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚U‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚U‚P|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚V‚U‚P|ƒL[‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚V‚U‚P|’ŠoŽí•Ê    PIC  X(002).
           03  ‚c‚V‚U‚P|Äì¬’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚U‚P|’ •[‹æ•ª    PIC  X(004).
           03  ‚c‚V‚U‚P|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚U‚P|”zMæ•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚U‚P|’ •[‚h‚c    PIC  X(008).
           03  ‚c‚V‚U‚P|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚V‚U‚P|¿‹‘ì¬“ú
                                     PIC  X(008).
           03  ‚c‚V‚U‚P|¿‹‘“à•Å”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚U‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚V‚U‚P|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚U‚P|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚V‚U‚P|‹¦’²‹æ•ª    PIC  X(001).
           03  ‚c‚V‚U‚P|æ•ûŒ_–ñ”Ô†
                                     PIC  X(016).
           03  ‚c‚V‚U‚P|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|—˜‘§        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|•ÔÏ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚U‚P|—˜‘§ŒvŽZŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚V‚U‚P|—˜‘§ŒvŽZI—¹“ú
                                     PIC  X(008).
           03  ‚c‚V‚U‚P|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚V‚U‚P|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚V‚U‚P|¿‹‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|—¿‹à        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|Á”ïÅ      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚U‚P|ƒL[Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚U‚P|“E—v¿‹Œ–¼
                                     PIC  X(060).
           03  ‚c‚V‚U‚P|ŽæˆøŽí—Þ    PIC  X(020).
           03  ‚c‚V‚U‚P|“E—vŒ_–ñæ–¼
                                     PIC  X(080).
           03  ‚c‚V‚U‚P|“E—væ•ûŒ_–ñ”Ô†
                                     PIC  X(016).
           03  ‚c‚V‚U‚P|•¨Œ”      PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚U‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚U‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚U‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚U‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚U‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚U‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚U‚P|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|ŠúŠÔŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|ŠúŠÔ“ú”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚U‚P|ŠúŠÔ•\Ž¦    PIC  X(004).
           03  ‚c‚V‚U‚P|•\Ž¦—pŒ_–ñ”Ô†
                                     PIC  X(010).
