      *****************************************************************
      *   Œ_–ñ—š—ð(D780KYR_TBL)
      *****************************************************************
       01  Œ_–ñ—š—ð.
           03  ‚c‚V‚W‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‹æ•ª        PIC  X(001).
           03  ‚c‚V‚W‚O|ƒGƒ“ƒgƒŠ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|ƒGƒ“ƒgƒŠŽžŠÔ
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|Œ©Ï”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚O|âg‹cŒˆÙ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|‘Ý•tŽÀs—\’è“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|¬–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|Œ_–ñŒ–¼    PIC  X(040).
           03  ‚c‚V‚W‚O|ƒGƒ“ƒhƒ†[ƒUƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚O|Œ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|Ð‰îƒ‹[ƒg  PIC  X(001).
           03  ‚c‚V‚W‚O|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚O|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|•Ï‘¥•¥      PIC  X(001).
           03  ‚c‚V‚W‚O|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|Œ_–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|’S•Û‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|‹¦’²‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚O|ŽåŠ²Ž–æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚O|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ƒ†[ƒU—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|’·ƒvƒ‰‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚O|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚V‚W‚O|‘æ‚P‰ñ‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‘æ‚P‰ñ‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‘æ‚P‰ñ‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‘æ‚P‰ñ‰ñŽû‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|U‘ÖŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|“ª‹à‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|‰c‹ÆƒRƒƒ“ƒg—“‚P
                                     PIC  X(080).
           03  ‚c‚V‚W‚O|‰c‹ÆƒRƒƒ“ƒg—“‚Q
                                     PIC  X(080).
           03  ‚c‚V‚W‚O|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚O|–ž—¹ˆÄ“à‘—•t‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|–ž—¹ˆÄ“à‰ñ“š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚O|‘k‹yˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‘k‹yˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|ŒŸŽûŽæÁ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|ŒŸŽûŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|“–‰‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ÅV‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ÅI•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒXƒf[ƒ^ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒXŽ©“®ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|ƒŠ[ƒXŠ„•Š‘O•¥ŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|“ª‹à¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‘O•¥¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|“ª‹à¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‘O•¥¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚O|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|•¨ŒŠm”F    PIC  X(001).
           03  ‚c‚V‚W‚O|‚Ü‚é‚ß’PˆÊ  PIC  X(001).
           03  ‚c‚V‚W‚O|“à–óˆóü•û–@
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Œ_–ñŠúŠÔ‰ñ”ˆóü—L–³
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|¬–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|¬–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|¬–ñŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX¿‹ŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚W‚O|“–‰—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|“–‰‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|“–‰ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|“–‰Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆÈ~‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆÈ~‰ñŽû“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆÈ~‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‹ŒŽæˆø”Ô†  PIC  X(010).
           03  ‚c‚V‚W‚O|‰ð–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|‰ð–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|–ž—¹—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|–ž—¹—\–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒXŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|³ŒpƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|³Œpˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|³ŒpŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|³ŒpŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|”„‹pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|”„‹pˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|ðŒ•ÏXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|ðŒ•ÏXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚O|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Œ_–ñ—¿—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‘e—˜Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|“–‰Œ_–ñ—¿—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆÈ~‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|¿‹ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|¿‹ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|¿‹Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|Œ_–ñŽæˆø‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Ó”C‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|‘ŠŽE‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|’•¶‘o—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|–ž—¹ˆÄ“à’ •[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX—¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Œ_–ñ‘Ž®    PIC  X(001).
           03  ‚c‚V‚W‚O|•¨Œ•ÛŠÇêŠ
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|¿‹æ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚O|•s“®ŽY’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|—L‰¿ØŒ”’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‚»‚Ì‘¼’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|•ÛØl—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|–¢ŽûŽc‚‘ÎÛŠOƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚V‚W‚O|“®‘•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|“®‘•t•ÛŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚O|–â‡‚¹”Ô†  PIC  X(010).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‹ŒŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚V‚W‚O|w“ü‘I‘ðŒ •tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX\¿‘—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|³Œp\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ƒŠƒXƒPƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‘e—˜‰vŠz|•\
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‚¨Žx•¥–¾×‘ì¬Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‚¨Žx•¥–¾×‘—v”Û
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|\¿”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|‘ÎÛŒ³–{Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚O|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|¿‹Šî€    PIC  X(001).
           03  ‚c‚V‚W‚O|ŽŸ‰ñÄƒŠ[ƒX‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽŸ‰ñÄƒŠ[ƒX‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽG”ï•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽG”ï”Ì‘£”ï  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽG”ïM—p•ÛŒ¯
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽG”ï‚»‚Ì‘¼  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|’¥‹Š®—¹ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|’¥‹Š®—¹ŽæÁƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ŽŸ‰ñÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Œ_–ñ‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|’•¶‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‚»‚Ì‘¼”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‰c‹ÆƒRƒƒ“ƒg—“‚R
                                     PIC  X(080).
           03  ‚c‚V‚W‚O|ŽÐ“à‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ŽG”ï’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‹¦’²‰ñŽû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|’P”N“xŒ_–ñ  PIC  X(001).
           03  ‚c‚V‚W‚O|ƒoƒbƒNŽæˆø  PIC  X(001).
           03  ‚c‚V‚W‚O|”Û”F‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚O|”ñ‰ÛÅ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚O|•ïŠ‡‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|ŠCŠOÝ’u‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|•¨ŒƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚V‚W‚O|‰ð–ñ‹àŒvŽZ•û–@
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|”À“ü—\’è“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|\¿Œ_–ñŠz‰ÁŽZƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Ð‰îæŽæˆøæ
                                     PIC  X(009).
           03  ‚c‚V‚W‚O|Ð‰îæŒ_–ñæ
                                     PIC  X(005).
           03  ‚c‚V‚W‚O|Ð‰îæ‚a‚s‚l
                                     PIC  X(004).
           03  ‚c‚V‚W‚O|Ð‰îæ—»“X  PIC  X(004).
           03  ‚c‚V‚W‚O|Ð‰îæ‹âs  PIC  X(004).
           03  ‚c‚V‚W‚O|Ð‰îæŽx“X  PIC  X(003).
           03  ‚c‚V‚W‚O|¿‹“ú      PIC  X(002).
           03  ‚c‚V‚W‚O|Œ_–ñŽæÁ——R‚P
                                     PIC  X(080).
           03  ‚c‚V‚W‚O|Œ_–ñŽæÁ——R‚Q
                                     PIC  X(080).
           03  ‚c‚V‚W‚O|Œ_–ñŽæÁ\¿‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ŒˆÙ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Œ_–ñ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ŒŸŽû“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Œ_–ñŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ŒŸŽûŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|•ÏX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|•ÏXƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚O|•ÏX”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|Â–±‹¦’²ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚W‚O|ˆê”Ê‘åŒû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|§“xƒŠ[ƒX  PIC  X(001).
           03  ‚c‚V‚W‚O|Šî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‘e—˜Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆê”ÊŽÐ“à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆê”ÊŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆê”Ê‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆê”ÊŠî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆê”ÊŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆê”Ê‘e—˜ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‹­§•Û‘¶ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚W‚O|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚W‚O|ˆ´ùŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‹Æ–±‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|”ƒ–ß‹`–±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‘ã—‰ñŽû    PIC  X(001).
           03  ‚c‚V‚W‚O|”ƒŽæ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‹à—˜•Ï“®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|˜A“®‹à—˜‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚O|Š„ˆø—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‘Ý•t‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‘Ý•t‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|Ž‘‹àŽg“r‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚O|Ž‘‹àŽg“r•¶Œ¾
                                     PIC  X(080).
           03  ‚c‚V‚W‚O|Žx•¥ˆÏ‘õŽæˆøŒ`‘Ô
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|—ZŽ‘•û–@    PIC  X(001).
           03  ‚c‚V‚W‚O|•ÔÏðŒ    PIC  X(001).
           03  ‚c‚V‚W‚O|ƒŠ[ƒXŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Ž‘ŽY‰È–Ú‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|d—v«Šî€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‘O“n‹à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ƒgƒŠƒvƒ‹ƒIƒvƒVƒ‡ƒ“•ûŽ®
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ˆø‡’†Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|“à—e•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|³Œp•ªŠ„Ží—Þ
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|³Œp‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|–ž—¹ðŒ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|‘æ‚P‰ñ–Ú‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚V‚W‚O|‘æ‚Q‰ñ–ÚˆÈ~‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚V‚W‚O|÷“nðŒ•tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Žx•¥Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‘¹ŠQ”…ž‹à•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚V‚W‚O|—¬“®‰»”Ô†  PIC  X(006).
           03  ‚c‚V‚W‚O|—¬“®‰»æ    PIC  X(007).
           03  ‚c‚V‚W‚O|M‘õæÝ’è“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|M‘õI—¹“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|·“ü—\–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ÂŒ ”ƒŽæ“ú  PIC  X(008).
           03  ‚c‚V‚W‚O|‘ŠŽEð€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|÷“n‹ÖŽ~“Á–ñ
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|æ•ûŒ_–ñ”Ô†
                                     PIC  X(016).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX—¿•ªŽq
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX—¿•ª•ê
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|‰c‹ÆƒRƒƒ“ƒg—“‚S
                                     PIC  X(080).
           03  ‚c‚V‚W‚O|V‹Kæ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚O|e–§æ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚O|à–±•”‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ˆê”Ê‘O“n‹à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|ŒˆÙƒ‰ƒ“ƒN  PIC  X(001).
           03  ‚c‚V‚W‚O|‚¨—çó”­sƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|ˆÚsƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX\¿ðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚O|–â‚¢‡‚í‚¹’S“–•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚O|–â‚¢‡‚í‚¹’S“–ŽÒ–¼
                                     PIC  X(020).
           03  ‚c‚V‚W‚O|ÄƒŠ[ƒX—¿Žx•¥—\’è“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|–ž—¹’Ê’m‘‰ñ“šŠúŒÀ
                                     PIC  X(008).
           03  ‚c‚V‚W‚O|\¿‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚O|“à—e\¿‘ˆóü‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚O|“à—e\¿‘ˆóüÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|Œ_–ñŒ–¼Ž©“®“o˜^‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚O|•ÔÏŒ´Ž‘    PIC  X(080).
