      *****************************************************************
      *   •”“X—š—ðƒ}ƒXƒ^(D784BKR_TBL)
      *****************************************************************
       01  •”“X—š—ðƒ}ƒXƒ^.
           03  ‚c‚V‚W‚S|•”‰ÛƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚W‚S|ƒT[ƒo”Ô†  PIC  X(002).
           03  ‚c‚V‚W‚S|•”‰Û–¼Ì    PIC  X(040).
           03  ‚c‚V‚W‚S|XV“úŽž    PIC  X(016).
           03  ‚c‚V‚W‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚W‚S|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚V‚W‚S|Žs’¬‘ºƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚V‚W‚S|ZŠ‚Q      PIC  X(060).
           03  ‚c‚V‚W‚S|ZŠ‚R      PIC  X(060).
           03  ‚c‚V‚W‚S|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚V‚W‚S|•”Š’·–¼    PIC  X(020).
           03  ‚c‚V‚W‚S|–ðE‚P      PIC  X(030).
           03  ‚c‚V‚W‚S|–ðE‚Q      PIC  X(030).
           03  ‚c‚V‚W‚S|‰ïŒv•”–åƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚W‚S|”„ãŒvã‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚S|ƒRƒ“ƒX[ƒ}–@l‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚S|‹Æ–±‹æ•ª    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚S|•”‰ÛƒpƒXƒ[ƒh
                                     PIC  X(015).
           03  ‚c‚V‚W‚S|ƒCƒ“ƒvƒbƒg‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚S|‚e‚`‚w”Ô†  PIC  X(015).
           03  ‚c‚V‚W‚S|•”‰Û–¼ÌƒJƒi
                                     PIC  X(040).
           03  ‚c‚V‚W‚S|•”‰Û—ªÌ    PIC  X(016).
           03  ‚c‚V‚W‚S|•”‰Û—ªÌƒJƒi
                                     PIC  X(012).
           03  ‚c‚V‚W‚S|ZŠ‚P      PIC  X(040).
           03  ‚c‚V‚W‚S|‘M”Ô†    PIC  X(002).
           03  ‚c‚V‚W‚S|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚W‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚S|XVŽžŠÔ    PIC  X(008).
