      *****************************************************************
      *   ŒûÀ”Ô†—š—ðƒ}ƒXƒ^(D786KZB_TBL)
      *****************************************************************
       01  ŒûÀ”Ô†—š—ðƒ}ƒXƒ^.
           03  ‚c‚V‚W‚U|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚U|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚W‚U|ŒûÀ–¼Ì    PIC  X(040).
           03  ‚c‚V‚W‚U|ŒûÀ—ªÌ    PIC  X(016).
           03  ‚c‚V‚W‚U|ŒûÀƒJƒi–¼Ì
                                     PIC  X(012).
           03  ‚c‚V‚W‚U|ŒûÀƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚V‚W‚U|Æ‡ƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚V‚W‚U|ŒûÀŽåŠÇ•”“X
                                     PIC  X(004).
           03  ‚c‚V‚W‚U|•¼Ží        PIC  X(003).
           03  ‚c‚V‚W‚U|ƒZƒOƒƒ“ƒgƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚V‚W‚U|ŒûÀ”Ô†—˜—pŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚U|ŒûÀ”Ô†—˜—pI—¹“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚W‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚U|XVƒtƒ‰ƒO  PIC  X(001).
