      *****************************************************************
      *   •ÏX—š—ðQ¿‹æ(D787SQK_TBL)
      *****************************************************************
       01  •ÏX—š—ð|¿‹æ.
           03  ‚c‚V‚W‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚V|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚V|¿‹æ–¼Ì  PIC  X(080).
           03  ‚c‚V‚W‚V|•”–å–¼Ì    PIC  X(060).
           03  ‚c‚V‚W‚V|’S“–ŽÒ–¼Ì  PIC  X(020).
           03  ‚c‚V‚W‚V|¿‹‘•\Ž¦  PIC  X(001).
           03  ‚c‚V‚W‚V|Užl–¼    PIC  X(040).
           03  ‚c‚V‚W‚V|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚V‚W‚V|”[•tæƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚V‚W‚V|ZŠ‚Q      PIC  X(060).
           03  ‚c‚V‚W‚V|ZŠ‚R      PIC  X(060).
           03  ‚c‚V‚W‚V|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚V‚W‚V|ˆêŠ‡“ü‹àƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚V|‘—•tæ–¼Ì  PIC  X(060).
           03  ‚c‚V‚W‚V|‘—•tæ•”–å  PIC  X(060).
           03  ‚c‚V‚W‚V|‘—•tæ’S“–ŽÒ
                                     PIC  X(020).
           03  ‚c‚V‚W‚V|‘—•tæƒJƒi–¼Ì
                                     PIC  X(040).
           03  ‚c‚V‚W‚V|‘—•tæ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚V‚W‚V|‘—•tæŽs’¬‘ºƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚V‚W‚V|‘—•tæZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚V‚W‚V|‘—•tæZŠ‚R
                                     PIC  X(060).
           03  ‚c‚V‚W‚V|‘—•tæ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚V‚W‚V|Ž©“®ƒ}ƒbƒ`ƒ“ƒO‘ÎÛŠO‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|‰ñŽûƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚V|‰ñŽû“ú      PIC  X(002).
           03  ‚c‚V‚W‚V|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚V‚W‚V|‰ñŽûŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚V|¿‹ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚V|¿‹’÷“ú    PIC  X(002).
           03  ‚c‚V‚W‚V|¿‹ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚V|¿‹Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚V|ì¬’Ê”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚V|ì¬’PˆÊ    PIC  X(001).
           03  ‚c‚V‚W‚V|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|¿‹Žw’è—lŽ®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|‘—•t‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚V|ŽóŽæ‘¤‹à—Z‹@ŠÖƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚V|ŽóŽæ‘¤Žx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚W‚V|ŽóŽæ‘¤ŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|ŽóŽæ‘¤ŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚V‚W‚V|ŒûU‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚V|ŒûUŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚W‚V|ŒûUŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|ŒûUŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚V‚W‚V|ŒûU–¼‹`l  PIC  X(030).
           03  ‚c‚V‚W‚V|¿‹ˆ¶–¼ˆóü
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|¿‹“ú•tˆóü
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|‰ñŽûŠúŒÀˆóü
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|Žg—pŒŽˆóü  PIC  X(001).
           03  ‚c‚V‚W‚V|“à–óˆóü    PIC  X(001).
           03  ‚c‚V‚W‚V|¿‹”Ô†ˆóü
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|“E—v—“ˆóü  PIC  X(001).
           03  ‚c‚V‚W‚V|“E—v—“      PIC  X(060).
           03  ‚c‚V‚W‚V|”õl—“ˆóü  PIC  X(001).
           03  ‚c‚V‚W‚V|ŒûU‚²ˆÄ“à‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|W–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚V|XV“úŽž    PIC  X(016).
           03  ‚c‚V‚W‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚W‚V|‘—•tæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚W‚V|‰¼‘zŒûÀ˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚V|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|ƒRƒƒ“ƒg—“  PIC  X(060).
           03  ‚c‚V‚W‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚V|•”–åƒJƒi–¼Ì
                                     PIC  X(030).
           03  ‚c‚V‚W‚V|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚V|‹¤—Lƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚V|ZŠ‚P      PIC  X(060).
           03  ‚c‚V‚W‚V|ZŠƒJƒi–¼Ì
                                     PIC  X(060).
           03  ‚c‚V‚W‚V|‚e‚`‚w”Ô†  PIC  X(015).
           03  ‚c‚V‚W‚V|U‘Ö‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚V|Ž©Uˆø—Ž“ú  PIC  X(002).
           03  ‚c‚V‚W‚V|ŽóŽæ‘¤ŒûÀƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚W‚V|UžŽè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚V|Œ»’S“–ŽÒ    PIC  X(008).
           03  ‚c‚V‚W‚V|Žå’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚W‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚V|‹Œ¿‹æƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚V|ŒûÀˆø—ŽˆË—Š‘Žó—Ì“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚V|ŒûÀˆø—ŽŠJŽn“ú
                                     PIC  X(008).
