      *****************************************************************
      *   ‹x“úƒJƒŒƒ“ƒ_(D801KKM_TBL)
      *****************************************************************
       01  ‹x“úƒJƒŒƒ“ƒ_.
           03  ‚c‚W‚O‚P|‹x“ú”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚O‚P|ƒJƒŒƒ“ƒ_‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚O‚P|‹x“ú‹æ•ª    PIC  X(001).
           03  ‚c‚W‚O‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚O‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚O‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚O‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚O‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚O‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚O‚P|“o˜^’S“–ŽÒ  PIC  X(008).
