      *****************************************************************
      *   ‹¦’²“]”„‹p—š—ð(D814KTB_TBL)
      *****************************************************************
       01  ‹¦’²“]”„‹p—š—ð.
           03  ‚c‚W‚P‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚P‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚S|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚S|”„‹p˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚S|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚W‚P‚S|‘¼ŽÐŽx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚P‚S|‘¼ŽÐŽx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚P‚S|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚W‚P‚S|Žx•¥ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚S|Žx•¥ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚S|ŽæÁ‹æ•ª    PIC  X(001).
           03  ‚c‚W‚P‚S|ŽæÁ“ú      PIC  X(008).
           03  ‚c‚W‚P‚S|ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚S|Žx•¥ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚S|‘¼ŽÐŽx•¥—\’è“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚S|‘¼ŽÐŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚S|‘¼ŽÐŽx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚S|‘¼ŽÐŽx•¥Á”ïÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚W‚P‚S|‘¼ŽÐŽx•¥Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚W‚P‚S|‘¼ŽÐŽx•¥“ú  PIC  X(008).
           03  ‚c‚W‚P‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚P‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚P‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚P‚S|‰ð–ñ\¿˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
