      *****************************************************************
      *   œ‹p—š—ð(D815JKO_TBL)
      *****************************************************************
       01  œ‹p—š—ð.
           03  ‚c‚W‚P‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚P‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚T|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚T|œ‹p˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚T|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚W‚P‚T|œ‹p—\’è“ú  PIC  X(008).
           03  ‚c‚W‚P‚T|”„”p——R    PIC  X(002).
           03  ‚c‚W‚P‚T|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚P‚T|ˆ•ªƒ‹[ƒg  PIC  X(001).
           03  ‚c‚W‚P‚T|\¿ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|\¿ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚T|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|\¿ŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚T|\¿ŽæÁ“ú  PIC  X(008).
           03  ‚c‚W‚P‚T|\¿ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|\¿ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚T|ŒˆÙƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|ŒˆÙˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚T|ŒˆÙƒ‰ƒ“ƒN  PIC  X(001).
           03  ‚c‚W‚P‚T|ŒˆÙ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚T|ŒˆÙŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|³”F‹æ•ª    PIC  X(001).
           03  ‚c‚W‚P‚T|ŒˆÙŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚T|ŒˆÙŽæÁ“ú  PIC  X(008).
           03  ‚c‚W‚P‚T|ŒˆÙŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|ŒˆÙŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚T|Šm’èƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|Šm’èˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚T|Šm’èŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚T|Šm’èŽæÁ“ú  PIC  X(008).
           03  ‚c‚W‚P‚T|Šm’èŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|Šm’èŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚P‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚P‚T|ˆø“næ‹æ•ª  PIC  X(001).
           03  ‚c‚W‚P‚T|ˆøŽæ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚T|ˆøŽæ”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚T|””ï—pÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚P‚T|‰ð–ñ\¿˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚T|‘ã•\•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
