      *****************************************************************
      *   ŠÇ——^M“WŠJ(D852KRT_TBL)
      *****************************************************************
       01  ŠÇ——^M“WŠJ.
           03  ‚c‚W‚T‚Q|—^MŠÇ—æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚T‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚T‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚W‚T‚Q|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|“WŠJ”NŒŽ    PIC  X(006).
           03  ‚c‚W‚T‚Q|“WŠJ“ú•t    PIC  X(002).
           03  ‚c‚W‚T‚Q|“ü‹àƒtƒ‰ƒO  PIC  X(002).
           03  ‚c‚W‚T‚Q|“WŠJŽx•¥‰ñ”
                                     PIC  X(003).
           03  ‚c‚W‚T‚Q|ŽÀƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|—˜‘§Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|Œ³–{“à“ü    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|Œ³–{Žc      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|ÂŒ Žc      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|–ñ’è—˜—¦    PIC S9(003)V9(008) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|Ž–ŒÌŒã“ü‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚T‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚T‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
