      *****************************************************************
      *   ŠÇ——^M“ü‹àî•ñ(D853KRN_TBL)
      *****************************************************************
       01  ŠÇ——^M“ü‹àî•ñ.
           03  ‚c‚W‚T‚R|—^MŠÇ—æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚T‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚T‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚T‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚W‚T‚R|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚T‚R|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚W‚T‚R|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚W‚T‚R|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚W‚T‚R|¿‹‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚T‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚T‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚T‚R|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚T‚R|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚W‚T‚R|¿‹‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚R|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚W‚T‚R|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚R|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚R|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚R|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚R|Áž”NŒŽ“ú  PIC  X(008).
