      *****************************************************************
      *   ŒûUó‘ÔŠÇ—(D87KJK_TBL)
      *****************************************************************
       01  ŒûUó‘ÔŠÇ—.
           03  ‚c‚W‚V|U‘Ö‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚W‚V|–ñ’è“ú        PIC  X(002).
           03  ‚c‚W‚V|U‘Ö‹âs–¼    PIC  X(040).
           03  ‚c‚W‚V|U‘Ö“ú        PIC  X(008).
           03  ‚c‚W‚V|ì¬“ú        PIC  X(008).
           03  ‚c‚W‚V|ˆÏ‘õŽÒƒR[ƒh  PIC  X(010).
           03  ‚c‚W‚V|ˆÏ‘õŽÒ–¼      PIC  X(030).
           03  ‚c‚W‚V|ˆø—Ž“ú|ŒŽ    PIC  X(002).
           03  ‚c‚W‚V|ˆø—Ž“ú|“ú    PIC  X(002).
           03  ‚c‚W‚V|Žæˆø‹âs”Ô†  PIC  X(004).
           03  ‚c‚W‚V|Žæˆø‹âs–¼    PIC  X(015).
           03  ‚c‚W‚V|ŽæˆøŽx“X”Ô†  PIC  X(003).
           03  ‚c‚W‚V|ŽæˆøŽx“X–¼    PIC  X(015).
           03  ‚c‚W‚V|ˆÏ‘õŽÒ—a‹àŽí–Ú
                                     PIC  X(001).
           03  ‚c‚W‚V|ˆÏ‘õŽÒŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚W‚V|–ñ’è”NŒŽ“ú    PIC  X(008).
           03  ‚c‚W‚V|ŒûUƒXƒe[ƒ^ƒX
                                     PIC  X(001).
           03  ‚c‚W‚V|ˆø—Ž“ú|”N    PIC  X(002).
           03  ‚c‚W‚V|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚W‚V|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚W‚V|XVŽÒ        PIC  X(008).
           03  ‚c‚W‚V|•ÏXÏƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚V|ƒtƒ@ƒCƒ‹–¼    PIC  X(008).
           03  ‚c‚W‚V|Žæˆø‹âs–¼Š¿Žš
                                     PIC  X(016).
           03  ‚c‚W‚V|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚W‚V|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚W‚V|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚W‚V|’S“–ŽÒƒR[ƒh  PIC  X(008).
           03  ‚c‚W‚V|ƒtƒ@ƒCƒ‹ì¬æ
                                     PIC  X(040).
           03  ‚c‚W‚V|U‘Öæ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚W‚V|‘—Mæ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚W‚V|‘—Mæ‚e‚`‚w”Ô†
                                     PIC  X(015).
           03  ‚c‚W‚V|‘ã—‰ñŽû‹æ•ª  PIC  X(001).
