      *****************************************************************
      *   ŒŽŽŸÂŒ î•ñƒe[ƒuƒ‹(D912SJM_TBL)
      *****************************************************************
       01  ŒŽŽŸÂŒ î•ñƒe[ƒuƒ‹.
           03  ‚c‚X‚P‚Q|ƒŒƒR[ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚X‚P‚Q|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŒŽŽŸ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚Q|ŠúŽñ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚Q|Šú––”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚Q|“–“ú”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|ÂŒ Žc‚‹æ•ª
                                     PIC  X(002).
           03  ‚c‚X‚P‚Q|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Œ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚X‚P‚Q|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚Q|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚X‚P‚Q|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚X‚P‚Q|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚Q|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚Q|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚Q|¿‹æŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚Q|Œ_–ñæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚Q|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚Q|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚Q|Â–±‹¦’²‹æ•ª
                                     PIC  X(002).
           03  ‚c‚X‚P‚Q|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚Q|’S•Û‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Á”ïÅ‹æ•ª  PIC  X(002).
           03  ‚c‚X‚P‚Q|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ•ª¿‹‰ñ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|¬–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚Q|¬–ñ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚Q|¬–ñŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|ŒŸŽûŽæÁ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|ŒŸŽûŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|Œ_–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚Q|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|‘OŽóƒŠ[ƒX—¿“ü‹à“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|“ü‹à“ú      PIC  X(008).
           03  ‚c‚X‚P‚Q|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—¬“®‰»æ    PIC  X(007).
           03  ‚c‚X‚P‚Q|”Û”F‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|˜’uŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŽó[“–ŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|‘OŽó[“–ŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|‘OŽó[“–ŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŽó[“–”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|‘OŽó[“–ÏŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰‰ñ‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|ÅI‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñ‹àŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñ‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñ‹àŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘O•¥‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘O•¥‹àŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘O•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘O•¥‹àŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ³–{‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ³–{‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—˜‘§‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—˜‘§‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|””ï—p‘Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|””ï—p‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŒÅ’èŽ‘ŽYÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“®‘•ÛŒ¯—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Žx•¥—˜‘§“K—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Žx•¥—˜‘§ˆê”Ê‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ˆÏ‘õ•ÛŽç—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñÏ–¢ŒŸŽû‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñÏ–¢ŒŸŽûÁ”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŒˆÙÏ–¢¬–ñ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŒˆÙÏ–¢¬–ñÁ”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Žc‰¿‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÅžŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÅžŽc‰¿Ý’èŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|M—p•ÛŒ¯—¿Žc‚‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|M—p•ÛŒ¯—¿Žc‚Á”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãÁ”ïÅŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽóŒvãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽóŒvãŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽóŒvãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽóŒvãŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãŽ©ŽÐŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãŽ©ŽÐ—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvã””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvã””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvã“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒvãˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––”NŒŽ  PIC  X(006).
           03  ‚c‚X‚P‚Q|‘OŠú––¿‹‰ñ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––ÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Á”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––ñ’èÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––ñ’èÁ”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––‘OŽó‹àŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––‘OŽó‹àÁ”ïÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––‘OŽó‹àÁ”ïÅŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––ñ’è—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––ŽÀŽ¿Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––”„ãŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––”„ãŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––””ï—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––””ï—pŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Š„•ŠŒ´‰¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Š„•ŠŒ´‰¿Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰vŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––ŒÅ’èŽ‘ŽYÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––“®‘•ÛŒ¯—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Žx•¥—˜‘§“K—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Žx•¥—˜‘§ˆê”ÊŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––ˆÏ‘õ•ÛŽç—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––”„ã—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜Á”ïÅ‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜ŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜ŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜ŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜Žx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜Žx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜ˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‰ñŽûŽÀÑŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‰ñŽûŽÀÑŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‰ñŽûŽÀÑŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‰ñŽûŽÀÑŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŠúŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŠúŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŠúŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŠúŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŠúŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŠúˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––ÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Á”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–––ñ’èÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––‘OŽó‹àŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––‘OŽó‹àÁ”ïÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––‘OŽó‹àÁ”ïÅŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–––ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–––ñ’è—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––ŽÀŽ¿Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––”„ãŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––”„ãŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––””ï—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––””ï—pŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Š„•ŠŒ´‰¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Š„•ŠŒ´‰¿Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰vŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––ŒÅ’èŽ‘ŽYÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––“®‘•ÛŒ¯—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Žx•¥—˜‘§“K—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Žx•¥—˜‘§ˆê”ÊŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––ˆÏ‘õ•ÛŽç—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––”„ã—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Á”ïÅ‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜ŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜ŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜ŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Žx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Žx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜ˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜ŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜ŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––ÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Á”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––ñ’èÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––‘OŽó‹àŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––‘OŽó‹àÁ”ïÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––‘OŽó‹àÁ”ïÅŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––ñ’è—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––ŽÀŽ¿Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––”„ãŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––”„ãŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––””ï—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––””ï—pŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Š„•ŠŒ´‰¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Š„•ŠŒ´‰¿Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰vŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––ŒÅ’èŽ‘ŽYÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––“®‘•ÛŒ¯—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Žx•¥—˜‘§“K—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Žx•¥—˜‘§ˆê”ÊŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––ˆÏ‘õ•ÛŽç—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––”„ã—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––‘OŽóŽû‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––¢ŽûŽû‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Á”ïÅ‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜ŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜ŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜ŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Žx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Žx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜ˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜ŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜ŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽûŽÀÑŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽûŽÀÑŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽûŽÀÑŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽûŽÀÑŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–ñ’è’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–ñ’è’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–ñ’è’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–ñ’è’²®ŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó’²®ŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–ñ’èŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–ñ’è—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽÀŽ¿Œ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽÀŽ¿—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ã’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ã’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ””ï—p’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ””ï—p’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‹à—ZŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‹à—ZŒ³–{’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‹à—Z—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‹à—Z—˜‘§’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒÅ’èŽ‘ŽYÅ’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ“®‘•ÛŒ¯—¿’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽx•¥—˜‘§’²®Šz“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŽx•¥—˜‘§’²®Šzˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽˆÏ‘õ•ÛŽç—¿’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ã—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚P‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚X‚P‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚P‚Q|XVŽÒ      PIC  X(008).
