      *****************************************************************
      *   ŒŽŽŸÂŒ î•ñƒe[ƒuƒ‹(D912SJM_TBL)‚Ì‹Œƒo[ƒWƒ‡ƒ“(D912SJO_TBL)
      *****************************************************************
       01  ŒŽŽŸÂŒ î•ñƒe[ƒuƒ‹.
           03  ‚c‚X‚P‚Q|ƒŒƒR[ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚X‚P‚Q|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|¿‹‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|‰ð–ñ”„‹pŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|\¿˜A”Ô    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚Q|VŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚X‚P‚Q|–ž—¹”„‹pƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|¿‹æŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚Q|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚Q|Œ_–ñæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚Q|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚Q|Œ_–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚Q|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|ƒŠ[ƒXŠJŽn‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚X‚P‚Q|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|‹¦’²‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚Q|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚X‚P‚Q|‘k‹yˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‘k‹yˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|¬–ñ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚Q|¬–ñŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|ŒŸŽûŽæÁ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|ŒŸŽûŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|ÅV‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|¿‹ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰ñŽûŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|§“x“]“o˜^”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|§“x“]Šm’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‰ñŽûƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‘O•¥ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚Q|ŽG”ï”Ì‘£”ï  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ_–ñ“à—eŒ_–ñŒ–¼
                                     PIC  X(040).
           03  ‚c‚X‚P‚Q|¬–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚Q|ŽÐ“à‹à—˜    PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|”N‘e—˜—¦    PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|”Ì”„‘£i”ï  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŽG”ï        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|”„”pƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒX\¿‘—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|“ª‹à‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|–¢ŽûŽc‚‘ÎÛŠOƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|ÅV‘ÎŠOŒ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚X‚P‚Q|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|ŒŸŽûƒGƒ“ƒgƒŠˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|’S•Û‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|‘Ý•t—˜—¦    PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÅVŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Á”ïÅ‹æ•ª  PIC  X(002).
           03  ‚c‚X‚P‚Q|ÅVÁ”ï—¦  PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÅVÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|•ÛŽç–³žŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÅV‰ñŽû“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|“–‰Žæ“¾‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|–ž—¹ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚Q|–ž—¹“ú      PIC  X(008).
           03  ‚c‚X‚P‚Q|Ž‘ŽYŽí—Þ    PIC  X(005).
           03  ‚c‚X‚P‚Q|‡ŽZæŒ_–ñŽí—Þ
                                     PIC  X(003).
           03  ‚c‚X‚P‚Q|ÄƒŠ[ƒXŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|ˆÏ‘õ•ÛŽç‘Š“–ŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|§“x“]Žx•¥ŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘O•¥ŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‚»‚Ì‘¼Œ_–ñŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Œ_–ñŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Œ_–ñŽí—Þ“à•”ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚X‚P‚Q|Žx•¥—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ´‰¿’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŒÅ’èŽ‘ŽYÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|”N—˜‰ñ‚è    PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰^—p—˜‰ñ‚è  PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘e—˜‰vŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘e—˜‰vŠz|•\
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘e—˜‰vŠz|— 
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‹K’è‘¹ŠQ‹àŠî–{Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|M—p•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“®ŽY•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|•ÛŽç—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‚»‚Ì‘¼ŽG”ï  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Žè”—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŽèŒ`ŽóŽæ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|ŽèŒ`–‡”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Ši•t‹æ•ª    PIC  X(002).
           03  ‚c‚X‚P‚Q|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Ž©ŽÐ•ªŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Ž©ŽÐ•ªŒŽŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Ž©ŽÐ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Ž©ŽÐ•ªÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚Q|ÂŒ Œ_–ñŒ–¼
                                     PIC  X(040).
           03  ‚c‚X‚P‚Q|¡‰ñÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‰ð–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚Q|‰ð–ñ‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚X‚P‚Q|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|ŽæÁ‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚Q|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|‰ð–ñ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚Q|‰ð–ñŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŒÚ‹q‹æ•ª    PIC  X(002).
           03  ‚c‚X‚P‚Q|‚s‚`‚r‚rƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚X‚P‚Q|‘Ý“|”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|“Á’èŽæˆøæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Å‘å“Â‘£‰ñ”
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Ž©“®¿‹‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|“Â‘£‰ñ”    PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚Q|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚Q|‰c‹ÆŠ‹æ•ª  PIC  X(001).
           03  ‚c‚X‚P‚Q|‰ïŒv•”–åƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚X‚P‚Q|ƒRƒ“ƒX[ƒ}–@l‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‘OŠú–˜”„ãŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜Á”ïÅŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––¢ŽÀŒ»Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜”„ãŠz—ÝŒvÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––¢ŽÀŒ»Žc‚ÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜”„ãŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–˜Á”ïÅŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú–––¢ŽÀŒ»Žc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––Œ³–{Žc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŠú––—˜‘§Žc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽó‘Ôƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‘OŒŽŠ„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽÂŒ ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽÂŒ Á”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ”„ã‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ”„ãŠz‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽÁ”ïÅ‘Š“–Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽÁ”ïÅ‘Š“–Šz‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜”„ãŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Á”ïÅŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Œ³–{‰ñŽûŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜—˜‘§‰ñŽûŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Œ³–{Žû“ü—\’èŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜—˜‘§Žû“ü—\’èŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ”„ã‘ŠzÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜”„ãŠz—ÝŒvÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ‘¼ŽÐŠ„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ‘¼ŽÐÅVŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ‘¼ŽÐÅVÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ”„ã‘Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽÁ”ïÅ‘Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ”„ãŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽÁ”ïÅ‘Š“–Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜”„ãŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Á”ïÅŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜Œ³–{‰ñŽûŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–˜—˜‘§‰ñŽûŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Œ³–{Žc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––—˜‘§Žc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú”„ãŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú”„ãŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Š„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Š„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐŠ„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐŠ„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Š„•Š“ª‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Š„•Š“ª‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Š„•Š“ª‹à‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Š„•Š“ª‹àÁ”ïÅ‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“ª‹à‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“ª‹àŒvã”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|“–‰Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–‰Á”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÅVŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÅVÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐÅVŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐÅVÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘¼ŽÐŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|”„ã‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|”„ãÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|”„ã‘Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|”„ãÁ”ïÅ‘Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ‘Š“–Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ—¦
                                     PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ‘Š“–Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ—¦‘¼ŽÐ
                                     PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜”„ãŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Á”ïÅŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜”„ãŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Á”ïÅŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––¢ŽÀŒ»Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––¢ŽÀŒ»Žc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ã‘‰ÁŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ‘‰ÁŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŒ¸­Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅŒ¸­Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ã‘‰ÁŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ‘‰ÁŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŒ¸­Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅŒ¸­Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª‘‰ÁŽ©”„ã”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª‘‰ÁŽŠ”„ã”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª”„ã‘‰ÁŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªÁ”ïÅ‘‰ÁŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª”„ã‘‰ÁŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªÁ”ïÅ‘‰ÁŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªŒ¸­Ž©”„ã”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªŒ¸­ŽŠ”„ã”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª”„ãŒ¸­Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªÁ”ïÅŒ¸­Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª”„ãŒ¸­Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªÁ”ïÅŒ¸­Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªÁ”ïÅ—¦
                                     PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|V‹K‘‰Á•ªŒ³–{Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|V‹K‘‰Á•ª—˜‘§Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|V‹K‘‰Á•ªŒ³–{Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|V‹K‘‰Á•ª—˜‘§Šz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒ³–{“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ—˜‘§“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽŒ³–{“ü‹àŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ—˜‘§“ü‹àŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Œ³–{Žc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––—˜‘§Žc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Œ³–{Žû“ü—\’èŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜—˜‘§Žû“ü—\’èŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Œ³–{Žû“ü—\’èŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜—˜‘§Žû“ü—\’èŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Œ³–{‰ñŽûŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜—˜‘§‰ñŽûŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜Œ³–{‰ñŽûŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜—˜‘§‰ñŽûŠz—ÝŒv‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰ñŽû—\’èŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ³–{–¢Œo‰ßƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—˜‘§–¢Œo‰ßƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ³–{–¢Œo‰ßƒŠ[ƒX—¿‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—˜‘§–¢Œo‰ßƒŠ[ƒX—¿‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ³–{–¢ŽûƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—˜‘§–¢ŽûƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ³–{–¢ŽûƒŠ[ƒX—¿‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—˜‘§–¢ŽûƒŠ[ƒX—¿‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ³–{‘OŽó‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—˜‘§‘OŽó‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ³–{‘OŽó‹à‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—˜‘§‘OŽó‹à‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŠz‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ‘Š“–Šz‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽÁ”ïÅ—¦‚Q
                                     PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª‘‰ÁŽ©”„ã”NŒŽ‚Q
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª‘‰ÁŽŠ”„ã”NŒŽ‚Q
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª”„ã‘‰ÁŠz‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªÁ”ïÅ‘‰ÁŠz‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªŒ¸­Ž©”„ã”NŒŽ‚Q
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªŒ¸­ŽŠ”„ã”NŒŽ‚Q
                                     PIC  X(006).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª”„ãŒ¸­Šz‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªÁ”ïÅŒ¸­Šz‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ªÁ”ïÅ—¦‚Q
                                     PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|”„ã‘ŠzÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ãŠzÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜”„ãŠz—ÝŒvÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–Šú”„ãŠz—ÝŒvÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª”„ã‘‰ÁŠzÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘k‹y•ª”„ãŒ¸­ŠzÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––¢ŽÀŒ»Žc‚ÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘Ý“|‘¹Ž¸Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘Ý“|‘¹Ž¸Šz—˜‘§‘Š“–Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ˆá–ñ‹à•ªŠ„‰ñŽû”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ˆá–ñ‹à•ªŠ„‰ñŽû”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘Ï—p”N”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|•ÛŒ¯—¿—¦    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|S‘©ŠúŠÔŒã“–ŒŽƒŒƒ“ƒ^ƒ‹—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ã‘ÎÛƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|“–ŒŽ”„ã’²®ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|“–ŒŽðŒ•ÏXƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‰c‹ÆŠT—vŒ_–ñ’Šoƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‰c‹ÆŠT—vŒŸŽû’Šoƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Žd–óƒtƒ‰ƒO|”„ã
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Žd–óƒtƒ‰ƒO|ŒŸŽû
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|‰‰ñ‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|ÅI‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚Q|“ü‹à‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŽÀŒ»‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œo——pŽåŒ_–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽóƒŠ[ƒX—¿“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽóƒŠ[ƒX—¿“ü‹àŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‘OŽóƒŠ[ƒX—¿“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‘OŽóƒŠ[ƒX—¿“ü‹àŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰¼Žó‹àU‘Ö‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰¼Žó‹àU‘Ö‹àŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰¼Žó‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰¼Žó‹à‘¼ŽÐ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó‹à“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‘OŽó‹à“ü‹àŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰¼Žó‹àU‘Ö—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ‰¼Žó‹àU‘Ö—˜‘§‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––‘OŽó‹àŽc‚‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Œ»Ý•ë‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÂŒ ÷“nŽx•¥Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘ä’ |“–ŒŽ“ü‹à‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘ä’ |“–ŒŽ“ü‹à‰ñŽûŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘ä’ |“–ŒŽ“ü‹à‘OŽóŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘ä’ |“–ŒŽ“ü‹à‘OŽóŠz‘¼ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|Š¨’èˆ—ƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—¬“®‰»æ    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚Q|ÂŒ ‰ð–ñŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|¿‹‘ì¬‹æ•ª
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|•”‰Û–¼Ì    PIC  X(040).
           03  ‚c‚X‚P‚Q|Á”ïÅ—¦    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ŽåŒ_–ñ‹æ•ª–¼Ì
                                     PIC  X(060).
           03  ‚c‚X‚P‚Q|ŽæˆøæƒJƒi–¼Ì
                                     PIC  X(040).
           03  ‚c‚X‚P‚Q|Â–±‹¦’²‹æ•ª
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|•¨Œ–¼Ì    PIC  X(060).
           03  ‚c‚X‚P‚Q|“–ŒŽ––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|‘OŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|•”“X—ªÌ    PIC  X(016).
           03  ‚c‚X‚P‚Q|Œ_–ñæ–¼Ì  PIC  X(080).
           03  ‚c‚X‚P‚Q|—‚ŒŽ•ªŒ³–{‰ñŽûŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|—‚ŒŽ•ª—˜‘§‰ñŽûŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚Q|Ž©ŽÐŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|“–ŒŽ–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚Q|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚Q|ƒOƒ‹[ƒv–¼  PIC  X(080).
           03  ‚c‚X‚P‚Q|ƒOƒ‹[ƒv–¼ƒJƒi
                                     PIC  X(040).
