      *****************************************************************
      *   •ÛŒ¯î•ñ(D914HJM_TBL)
      *****************************************************************
       01  •ÛŒ¯î•ñ.
           03  ‚c‚X‚P‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚X‚P‚S|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚X‚P‚S|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚X‚P‚S|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚S|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚X‚P‚S|Œ_–ñŒ`‘Ô    PIC  X(020).
           03  ‚c‚X‚P‚S|•ÛŒ¯‰ïŽÐŽ¯•ÊƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚X‚P‚S|•ÛŒ¯‰ïŽÐ–¼  PIC  X(040).
           03  ‚c‚X‚P‚S|“–ŒŽ|“–ŒŽŠO‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚S|“–ŒŽ|“–ŒŽŠO
                                     PIC  X(012).
           03  ‚c‚X‚P‚S|ƒ†[ƒU[–¼  PIC  X(040).
           03  ‚c‚X‚P‚S|•¨Œ–¼Ì    PIC  X(040).
           03  ‚c‚X‚P‚S|•t•Û“ú      PIC  X(008).
           03  ‚c‚X‚P‚S|w“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚S|•ÛŒ¯‰¿Ši    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚S|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚X‚P‚S|—¿—¦        PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚X‚P‚S|•ÛŒ¯—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚S|Žc‰¿—L      PIC  X(001).
           03  ‚c‚X‚P‚S|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚X‚P‚S|V‹KŒp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚S|“o˜^Žž    PIC  X(008).
           03  ‚c‚X‚P‚S|“o˜^ŽÒ      PIC  X(008).
           03  ‚c‚X‚P‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚S|XVŽž    PIC  X(008).
           03  ‚c‚X‚P‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚X‚P‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
