      *****************************************************************
      *   ’ •[ŠÇ—ƒe[ƒuƒ‹(D980CYK_TBL)
      *****************************************************************
       01  ’ •[ŠÇ—ƒe[ƒuƒ‹.
           03  ‚c‚X‚W‚O|’ •[’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚W‚O|’ •[‚m‚n    PIC S9(012) PACKED-DECIMAL.
           03  ‚c‚X‚W‚O|•”‰ÛƒR[ƒh  PIC  X(004).
           03  ‚c‚X‚W‚O|’ •[’S“–ŽÒ–¼
                                     PIC  X(020).
           03  ‚c‚X‚W‚O|ˆ—‚h‚c    PIC  X(020).
           03  ‚c‚X‚W‚O|’ •[–¼      PIC  X(080).
           03  ‚c‚X‚W‚O|Œ”        PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚X‚W‚O|ì¬“ú      PIC  X(008).
           03  ‚c‚X‚W‚O|ì¬Žž    PIC  X(008).
           03  ‚c‚X‚W‚O|ÅVˆóü“ú  PIC  X(008).
           03  ‚c‚X‚W‚O|ÅVˆóüŽž
                                     PIC  X(008).
           03  ‚c‚X‚W‚O|ˆóüó‘Ô    PIC  X(002).
           03  ‚c‚X‚W‚O|ƒGƒ‰[ƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚X‚W‚O|ƒGƒ‰[ƒ^ƒCƒgƒ‹
                                     PIC  X(020).
           03  ‚c‚X‚W‚O|’ •[‚h‚c    PIC  X(008).
           03  ‚c‚X‚W‚O|‹æ•ª        PIC  X(001).
           03  ‚c‚X‚W‚O|•Å”        PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚X‚W‚O|–¢ˆóüíœ“ú
                                     PIC  X(008).
           03  ‚c‚X‚W‚O|ˆóüÏíœ“ú
                                     PIC  X(008).
           03  ‚c‚X‚W‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚W‚O|’ •[Ž¯•Ê    PIC  X(001).
