      *****************************************************************
      *   Œ©Ï”Ô†Ì”Ô(D999MTS_TBL)
      *****************************************************************
       01  Œ©Ï”Ô†Ì”Ô.
           03  ‚c‚X‚X‚X|Œ©Ï”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚X‚X‚X|ÅIŽ}”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚X‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚X‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚X‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚X‚X‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚X‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚X‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚X‚X|“o˜^’S“–ŽÒ  PIC  X(008).
