000010************************************************
000020* (DFS_APLLST)
000030************************************************
000040 01  DFS_APLLST-OPEDAY PIC  X(008).
000050 01  DFS_APLLST-BNKCOD PIC  X(004).
000060 01  DFS_APLLST-BNKKNJ PIC  X(016).
000070 01  DFS_APLLST-FLPCNT PIC  X(001).
000080 01  DFS_APLLST-TOTCNT PIC S9(005) COMP-3.
000090 01  DFS_APLLST-TOTAMT PIC S9(010) COMP-3.
000100 01  DFS_APLLST-PAYDAY PIC  X(004).
000110 01  DFS_APLLST-OPENAM PIC  X(020).
