000010************************************************
000020* (DFS_CHKLST)
000030************************************************
000040 01  DFS_CHKLST-DATTYP PIC  X(001).
000050 01  DFS_CHKLST-BNKCOD PIC  X(004).
000060 01  DFS_CHKLST-BNKNAM PIC  X(015).
000070 01  DFS_CHKLST-BRCCOD PIC  X(003).
000080 01  DFS_CHKLST-BRCNAM PIC  X(015).
000090 01  DFS_CHKLST-PAYDAY PIC  X(004).
000100 01  DFS_CHKLST-DEPKND PIC  X(001).
000110 01  DFS_CHKLST-DEPNUM PIC  X(007).
000120 01  DFS_CHKLST-CSTNAM PIC  X(030).
000130 01  DFS_CHKLST-TRNAMT PIC S9(010) COMP-3.
000140 01  DFS_CHKLST-TRNTYP PIC  X(001).
000150 01  DFS_CHKLST-PAYNUM PIC  X(008).
000160 01  DFS_CHKLST-CSTNUM PIC  X(012).
000170 01  DFS_CHKLST-RESULT PIC  X(001).
000180 01  DFS_CHKLST-CONTAX PIC S9(008) COMP-3.
000190 01  DFS_CHKLST-REGDAY PIC  X(008).
000200 01  DFS_CHKLST-REGTIM PIC  X(006).
000210 01  DFS_CHKLST-REGPSN PIC  X(004).
000220 01  DFS_CHKLST-MODDAY PIC  X(008).
000230 01  DFS_CHKLST-MODTIM PIC  X(006).
000240 01  DFS_CHKLST-MODPSN PIC  X(004).
000250 01  DFS_CHKLST-ERRFLG PIC  X(005).
000260 01  DFS_CHKLST-DBLFLG PIC  X(001).
