000010************************************************
000020* (DFS_ADDMOD)
000030************************************************
000040 01  DFS_ADDMOD-JOBTYP PIC  X(004).
000050 01  DFS_ADDMOD-REGTIM PIC  X(006).
000060 01  DFS_ADDMOD-PAYNUM PIC  X(008).
000070 01  DFS_ADDMOD-CSTNUM PIC  X(012).
000080 01  DFS_ADDMOD-PAYDAY PIC  X(002).
000090 01  DFS_ADDMOD-BNKCOD PIC  X(004).
000100 01  DFS_ADDMOD-BNKNAM PIC  X(015).
000110 01  DFS_ADDMOD-BRCCOD PIC  X(003).
000120 01  DFS_ADDMOD-BRCNAM PIC  X(015).
000130 01  DFS_ADDMOD-CSTNAM PIC  X(030).
000140 01  DFS_ADDMOD-DEPKND PIC  X(001).
000150 01  DFS_ADDMOD-DEPNUM PIC  X(007).
000160 01  DFS_ADDMOD-TRNAMT PIC S9(010) COMP-3.
000170 01  DFS_ADDMOD-PAYDAY_O PIC  X(002).
000180 01  DFS_ADDMOD-BNKCOD_O PIC  X(004).
000190 01  DFS_ADDMOD-BNKNAM_O PIC  X(015).
000200 01  DFS_ADDMOD-BRCCOD_O PIC  X(003).
000210 01  DFS_ADDMOD-BRCNAM_O PIC  X(015).
000220 01  DFS_ADDMOD-CSTNAM_O PIC  X(030).
000230 01  DFS_ADDMOD-DEPKND_O PIC  X(001).
000240 01  DFS_ADDMOD-DEPNUM_O PIC  X(007).
000250 01  DFS_ADDMOD-TRNAMT_O PIC S9(010) COMP-3.
000260 01  DFS_ADDMOD-PAYDAY_M PIC  X(001).
000270 01  DFS_ADDMOD-BNKCOD_M PIC  X(001).
000280 01  DFS_ADDMOD-BNKNAM_M PIC  X(001).
000290 01  DFS_ADDMOD-BRCCOD_M PIC  X(001).
000300 01  DFS_ADDMOD-BRCNAM_M PIC  X(001).
000310 01  DFS_ADDMOD-CSTNAM_M PIC  X(001).
000320 01  DFS_ADDMOD-DEPKND_M PIC  X(001).
000330 01  DFS_ADDMOD-DEPNUM_M PIC  X(001).
000340 01  DFS_ADDMOD-TRNAMT_M PIC  X(001).
