000010************************************************
000020* (ELP_MODLST)
000030************************************************
000040 01  ELP_MODLST-JOBTYP PIC  X(001).
000050 01  ELP_MODLST-REGTIM PIC  X(006).
000060 01  ELP_MODLST-LONNUM PIC  X(005).
000070 01  ELP_MODLST-LONTYP PIC  X(001).
000080 01  ELP_MODLST-DIVCOD PIC  X(004).
000090 01  ELP_MODLST-PSNCOD PIC  X(007).
000100 01  ELP_MODLST-PSNNAM PIC  X(018).
000110 01  ELP_MODLST-LONDAY PIC  X(008).
000120 01  ELP_MODLST-REPDAY PIC  X(008).
000130 01  ELP_MODLST-OBJCOD PIC  X(001).
000140 01  ELP_MODLST-LONTRM PIC S9(003) COMP-3.
000150 01  ELP_MODLST-FRZTRM PIC S9(003) COMP-3.
000160 01  ELP_MODLST-LONAMT PIC S9(013) COMP-3.
000170 01  ELP_MODLST-INTRAT PIC S9(002)V9(6) COMP-3.
000180 01  ELP_MODLST-SALAMT PIC S9(013) COMP-3.
000190 01  ELP_MODLST-SALINT PIC S9(013) COMP-3.
000200 01  ELP_MODLST-SALCAP PIC S9(013) COMP-3.
000210 01  ELP_MODLST-SALBAL PIC S9(013) COMP-3.
000220 01  ELP_MODLST-SALREP PIC S9(013) COMP-3.
000230 01  ELP_MODLST-BNSAMT PIC S9(013) COMP-3.
000240 01  ELP_MODLST-BNSINT PIC S9(013) COMP-3.
000250 01  ELP_MODLST-BNSCAP PIC S9(013) COMP-3.
000260 01  ELP_MODLST-BNSBAL PIC S9(013) COMP-3.
000270 01  ELP_MODLST-BNSREP PIC S9(013) COMP-3.
000280 01  ELP_MODLST-DLYINT PIC S9(013) COMP-3.
000290 01  ELP_MODLST-REMARK PIC  X(040).
000300 01  ELP_MODLST-DIVCOD_O PIC  X(004).
000310 01  ELP_MODLST-PSNCOD_O PIC  X(007).
000320 01  ELP_MODLST-PSNNAM_O PIC  X(018).
000330 01  ELP_MODLST-LONDAY_O PIC  X(008).
000340 01  ELP_MODLST-REPDAY_O PIC  X(008).
000350 01  ELP_MODLST-OBJCOD_O PIC  X(001).
000360 01  ELP_MODLST-LONTRM_O PIC S9(003) COMP-3.
000370 01  ELP_MODLST-FRZTRM_O PIC S9(003) COMP-3.
000380 01  ELP_MODLST-LONAMT_O PIC S9(013) COMP-3.
000390 01  ELP_MODLST-INTRAT_O PIC S9(002)V9(6) COMP-3.
000400 01  ELP_MODLST-SALAMT_O PIC S9(013) COMP-3.
000410 01  ELP_MODLST-BNSAMT_O PIC S9(013) COMP-3.
000420 01  ELP_MODLST-REMARK_O PIC  X(040).
000430 01  ELP_MODLST-DIVCOD_M PIC  X(001).
000440 01  ELP_MODLST-PSNCOD_M PIC  X(001).
000450 01  ELP_MODLST-PSNNAM_M PIC  X(001).
000460 01  ELP_MODLST-LONDAY_M PIC  X(001).
000470 01  ELP_MODLST-REPDAY_M PIC  X(001).
000480 01  ELP_MODLST-OBJCOD_M PIC  X(001).
000490 01  ELP_MODLST-LONTRM_M PIC  X(001).
000500 01  ELP_MODLST-FRZTRM_M PIC  X(001).
000510 01  ELP_MODLST-LONAMT_M PIC  X(001).
000520 01  ELP_MODLST-INTRAT_M PIC  X(001).
000530 01  ELP_MODLST-SALAMT_M PIC  X(001).
000540 01  ELP_MODLST-BNSAMT_M PIC  X(001).
000550 01  ELP_MODLST-REMARK_M PIC  X(001).
