000010************************************************
000020* (ELP_WRKPAY)
000030************************************************
000040 01  ELP_WRKPAY-LONNUM PIC  X(005).
000050 01  ELP_WRKPAY-LONTYP PIC  X(001).
000060 01  ELP_WRKPAY-DIVCOD PIC  X(004).
000070 01  ELP_WRKPAY-PSNCOD PIC  X(007).
000080 01  ELP_WRKPAY-RECNUM PIC  X(004).
000090 01  ELP_WRKPAY-PAYDAY PIC  X(008).
000100 01  ELP_WRKPAY-SALAMT PIC S9(013) COMP-3.
000110 01  ELP_WRKPAY-SALINT PIC S9(013) COMP-3.
000120 01  ELP_WRKPAY-SALCAP PIC S9(013) COMP-3.
000130 01  ELP_WRKPAY-SALBAL PIC S9(013) COMP-3.
000140 01  ELP_WRKPAY-BNSAMT PIC S9(013) COMP-3.
000150 01  ELP_WRKPAY-BNSINT PIC S9(013) COMP-3.
000160 01  ELP_WRKPAY-BNSCAP PIC S9(013) COMP-3.
000170 01  ELP_WRKPAY-BNSBAL PIC S9(013) COMP-3.
000180 01  ELP_WRKPAY-TOTBAL PIC S9(013) COMP-3.
