000010************************************************
000020* (ELP_WRKMST)
000030************************************************
000040 01  ELP_WRKMST-LONNUM PIC  X(005).
000050 01  ELP_WRKMST-LONTYP PIC  X(001).
000060 01  ELP_WRKMST-DIVCOD PIC  X(004).
000070 01  ELP_WRKMST-PSNCOD PIC  X(007).
000080 01  ELP_WRKMST-PSNNAM PIC  X(018).
000090 01  ELP_WRKMST-LONDAY PIC  X(008).
000100 01  ELP_WRKMST-REPDAY PIC  X(008).
000110 01  ELP_WRKMST-OBJCOD PIC  X(001).
000120 01  ELP_WRKMST-LONTRM PIC S9(003) COMP-3.
000130 01  ELP_WRKMST-FRZTRM PIC S9(003) COMP-3.
000140 01  ELP_WRKMST-LONAMT PIC S9(013) COMP-3.
000150 01  ELP_WRKMST-INTRAT PIC S9(002)V9(6) COMP-3.
000160 01  ELP_WRKMST-SALAMT PIC S9(013) COMP-3.
000170 01  ELP_WRKMST-SALINT PIC S9(013) COMP-3.
000180 01  ELP_WRKMST-SALCAP PIC S9(013) COMP-3.
000190 01  ELP_WRKMST-SALBAL PIC S9(013) COMP-3.
000200 01  ELP_WRKMST-SALREP PIC S9(013) COMP-3.
000210 01  ELP_WRKMST-BNSAMT PIC S9(013) COMP-3.
000220 01  ELP_WRKMST-BNSINT PIC S9(013) COMP-3.
000230 01  ELP_WRKMST-BNSCAP PIC S9(013) COMP-3.
000240 01  ELP_WRKMST-BNSBAL PIC S9(013) COMP-3.
000250 01  ELP_WRKMST-BNSREP PIC S9(013) COMP-3.
000260 01  ELP_WRKMST-DLYINT PIC S9(013) COMP-3.
000270 01  ELP_WRKMST-REMARK PIC  X(040).
000280 01  ELP_WRKMST-REGDAY PIC  X(008).
000290 01  ELP_WRKMST-REGTIM PIC  X(006).
000300 01  ELP_WRKMST-REGPSN PIC  X(004).
000310 01  ELP_WRKMST-MODDAY PIC  X(008).
000320 01  ELP_WRKMST-MODTIM PIC  X(006).
000330 01  ELP_WRKMST-MODPSN PIC  X(004).
