000010************************************************
000020* (EMC_JUSYO_DAIRI)
000030************************************************
000040 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000060 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000070 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|—X•Ö”Ô† PIC  X(007).
000080 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|ZŠ‚P PIC  X(040).
000090 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|ZŠ‚Q PIC  X(040).
000100 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|Žæˆøæ–¼ PIC  X(040).
000110 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|•”–¼ PIC  X(040).
000120 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|“o˜^“ú PIC  X(008).
000130 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|“o˜^Žž PIC  X(006).
000140 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|“o˜^’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000150 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|XV“ú PIC  X(008).
000160 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|XVŽž PIC  X(006).
000170 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|‚c‚`‚h‚q‚h|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
