000010************************************************
000020* (EMC_WK_SEIMEN)
000030************************************************
000040 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ŒŸŽû“ú PIC  X(008).
000060 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|“ú•t PIC  X(004).
000070 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|“ü‹à“ú PIC  X(002).
000080 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|¿‹æƒR[ƒh PIC  X(008).
000090 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|[“–‰ñ PIC  X(003).
000100 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|‘Žx•¥‰ñ” PIC  X(003).
000110 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|Å—¦ PIC S9(002)V9(1) COMP-3.
000120 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|“–ŒŽƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000130 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|Á”ïÅŠz PIC S9(011) COMP-3.
000140 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|–¾×‚m‚n PIC  X(004).
000150 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|•¨Œ–¼ PIC  X(030).
000160 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000170 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚P 
                                             PIC  X(010).
000180 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚Q 
                                             PIC  X(010).
000190 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚R 
                                             PIC  X(010).
000200 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚S 
                                             PIC  X(010).
000210 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|”õl PIC  X(070).
000220 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P PIC  X(001).
000230 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚Q PIC  X(001).
000240 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚R PIC  X(001).
000250 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚S PIC  X(001).
000260 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚T PIC  X(001).
000270 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚U PIC  X(001).
000280 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚V PIC  X(001).
000290 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚W PIC  X(001).
000300 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚X PIC  X(001).
000310 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P‚O PIC  X(001).
000320 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P‚P PIC  X(001).
000330 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P‚Q PIC  X(001).
000340 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P‚R PIC  X(001).
000350 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P‚S PIC  X(001).
000360 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P‚T PIC  X(001).
000370 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P‚U PIC  X(001).
