000010************************************************
000020* (EMC_HOSYU)
000030************************************************
000040 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|¿‹ƒR[ƒh PIC  X(002).
000060 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000070 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000080 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|•¨Œ–¼ PIC  X(030).
000090 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|•ÛŽç—¿ PIC S9(013) COMP-3.
000100 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|Á”ïÅ PIC S9(013) COMP-3.
000110 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|Å—¦ PIC S9(002)V9(1) COMP-3.
000120 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|“o˜^“ú PIC  X(008).
000130 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|“o˜^Žž PIC  X(006).
000140 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|XV“ú PIC  X(008).
000160 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|XVŽž PIC  X(006).
000170 01  ‚d‚l‚b|‚g‚n‚r‚x‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
