000010************************************************
000020* (EMC_BIKO)
000030************************************************
000040 01  ‚d‚l‚b|‚a‚h‚j‚n|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚d‚l‚b|‚a‚h‚j‚n|”õl PIC  X(070).
000060 01  ‚d‚l‚b|‚a‚h‚j‚n|“o˜^“ú PIC  X(008).
000070 01  ‚d‚l‚b|‚a‚h‚j‚n|“o˜^Žž PIC  X(006).
000080 01  ‚d‚l‚b|‚a‚h‚j‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚d‚l‚b|‚a‚h‚j‚n|XV“ú PIC  X(008).
000100 01  ‚d‚l‚b|‚a‚h‚j‚n|XVŽž PIC  X(006).
000110 01  ‚d‚l‚b|‚a‚h‚j‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
