000010************************************************
000020* EXT_TAXMST(EXT_TAXMST)
000030************************************************
000040 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|Šî€”N PIC  X(004).
000050 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•tæƒR[ƒh PIC  X(006).
000060 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•tæ–¼ PIC  X(040).
000070 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‹âsƒR[ƒh PIC  X(004).
000080 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‹âs–¼Š¿Žš PIC  X(030).
000090 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‹âs–¼ƒJƒi PIC  X(015).
000100 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|•ñž‹à‹æ•ª PIC S9(001) COMP-3.
000110 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t•û–@ PIC S9(001) COMP-3.
000120 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|Ž©“®ˆø—Ž PIC  X(001).
000130 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•tŠúŒÀ‚P PIC  X(008).
000140 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•tŠúŒÀ‚Q PIC  X(008).
000150 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•tŠúŒÀ‚R PIC  X(008).
000160 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•tŠúŒÀ‚S PIC  X(008).
000170 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t“ú‚P PIC  X(008).
000180 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t“ú‚Q PIC  X(008).
000190 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t“ú‚R PIC  X(008).
000200 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t“ú‚S PIC  X(008).
000210 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|•ñž‹à“ü‹à“ú PIC  X(008).
000220 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|•s“®ŽYÅ‹æ•ª PIC S9(001) COMP-3.
000230 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|ˆ—‹æ•ª PIC S9(001) COMP-3.
000240 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|ì‹Æ‹æ•ª PIC S9(002) COMP-3.
000250 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|XV•WŽ¯ PIC S9(001) COMP-3.
000260 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|Å—¦ PIC S9(002)V9(7) COMP-3.
000270 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‰ÛÅ•W€Šz PIC S9(013) COMP-3.
000280 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|ÅŠz PIC S9(013) COMP-3.
000290 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|•ñž‹à PIC S9(013) COMP-3.
000300 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t‹àŠz‚P PIC S9(013) COMP-3.
000310 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t‹àŠz‚Q PIC S9(013) COMP-3.
000320 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t‹àŠz‚R PIC S9(013) COMP-3.
000330 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”[•t‹àŠz‚S PIC S9(013) COMP-3.
000340 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|•s“®ŽYÅŠz PIC S9(013) COMP-3.
000350 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|•s“®ŽYÅ•ñž‹à PIC S9(013) COMP-3.
000360 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|•ªŠ„”[•tŒÀ“x PIC S9(013) COMP-3.
000370 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|—˜_‹àŠz PIC S9(013) COMP-3.
000380 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|Œˆ’èŠz PIC S9(013) COMP-3.
000390 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|•s“®ŽY•ñ§‹à“ü‹à“ú PIC  X(008).
000400 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‰ÛÅ•W€Šz|“y’nŒš•¨ 
000410                                       PIC S9(013) COMP-3.
000420 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|Œˆ’èŠz|“y’nŒš•¨ PIC S9(013) COMP-3.
000430 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|—˜_‹àŠz|“y’nŒš•¨ 
000440                                       PIC S9(013) COMP-3.
000450 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|W–ñ\æƒR[ƒh PIC  X(006).
000460 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‰ÛÅ•W€Šz|’Ê’m‘ 
000470                                       PIC S9(013) COMP-3.
000480 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‰ÛÅ•W€Šz|“y’nŒš•¨|’Ê’m‘ 
000490                                       PIC S9(013) COMP-3.
000500 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‰ÛÅ•W€Šz|“y’n|’Ê’m‘ 
000510                                       PIC S9(013) COMP-3.
000520 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‰ÛÅ•W€Šz|Œš•¨|’Ê’m‘ 
000530                                       PIC S9(013) COMP-3.
000540 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|“o˜^”NŒŽ“ú PIC  X(008).
000550 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|“o˜^ŽžŠÔ PIC  X(008).
000560 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|“o˜^’S“–ŽÒ PIC  X(008).
000570 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|XV”NŒŽ“ú PIC  X(008).
000580 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|XVŽžŠÔ PIC  X(008).
000590 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|“ü—Í’S“–ŽÒƒR[ƒh PIC  X(008).
000600 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|XVŽÒ PIC  X(008).
000610 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|Œˆ’èŠz|‡Œv PIC S9(013) COMP-3.
000620 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|”õl PIC  X(060).
