000010************************************************
000020* (EXT_MODLST)
000030************************************************
000040 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ì‹Æ‹æ•ª PIC  X(001).
000050 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ˆ—Žž PIC  X(006).
000060 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tæƒR[ƒh PIC  X(006).
000070 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tæ–¼ PIC  X(020).
000080 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âsƒR[ƒh PIC  X(004).
000090 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âs–¼ PIC  X(030).
000100 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âs–¼ƒJƒi PIC  X(015).
000110 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à‹æ•ª PIC  X(001).
000120 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t•û–@ PIC  X(001).
000130 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|Ž©“®ˆø—Ž PIC  X(001).
000140 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚P PIC  X(008).
000150 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚Q PIC  X(008).
000160 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚R PIC  X(008).
000170 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚S PIC  X(008).
000180 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚P PIC  X(008).
000190 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚Q PIC  X(008).
000200 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚R PIC  X(008).
000210 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚S PIC  X(008).
000220 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à“ü‹à“ú PIC  X(008).
000230 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|Šî€”N PIC  X(004).
000240 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅ‹æ•ª PIC  X(001).
000250 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ˆ—‹æ•ª PIC  X(001).
000260 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ˆóü‹æ•ª PIC  X(002).
000270 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|XV•WŽ¯ PIC  X(001).
000280 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|Å—¦ PIC S9(001)V9(3) COMP-3.
000290 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‰ÛÅ•W€Šz PIC S9(013) COMP-3.
000300 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ÅŠz PIC S9(013) COMP-3.
000310 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à PIC S9(013) COMP-3.
000320 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚P PIC S9(013) COMP-3.
000330 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚Q PIC S9(013) COMP-3.
000340 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚R PIC S9(013) COMP-3.
000350 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚S PIC S9(013) COMP-3.
000360 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅŠz PIC S9(013) COMP-3.
000370 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅ•ñž‹à PIC S9(013) COMP-3.
000380 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ªŠ„”[•tŒÀ“x PIC S9(013) COMP-3.
000390 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tæ–¼|‚n PIC  X(020).
000400 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âsƒR[ƒh|‚n PIC  X(004).
000410 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âs–¼|‚n PIC  X(030).
000420 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âs–¼ƒJƒi|‚n PIC  X(015).
000430 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à‹æ•ª|‚n PIC  X(001).
000440 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t•û–@|‚n PIC  X(001).
000450 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|Ž©“®ˆø—Ž|‚n PIC  X(001).
000460 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚P|‚n PIC  X(008).
000470 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚Q|‚n PIC  X(008).
000480 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚R|‚n PIC  X(008).
000490 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚S|‚n PIC  X(008).
000500 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚P|‚n PIC  X(008).
000510 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚Q|‚n PIC  X(008).
000520 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚R|‚n PIC  X(008).
000530 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚S|‚n PIC  X(008).
000540 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à“ü‹à“ú|‚n PIC  X(008).
000550 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅ‹æ•ª|‚n PIC  X(001).
000560 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ˆ—‹æ•ª|‚n PIC  X(001).
000570 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|Å—¦|‚n PIC S9(001)V9(3) COMP-3.
000580 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‰ÛÅ•W€Šz|‚n PIC S9(013) COMP-3.
000590 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ÅŠz|‚n PIC S9(013) COMP-3.
000600 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à|‚n PIC S9(013) COMP-3.
000610 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚P|‚n PIC S9(013) COMP-3.
000620 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚Q|‚n PIC S9(013) COMP-3.
000630 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚R|‚n PIC S9(013) COMP-3.
000640 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚S|‚n PIC S9(013) COMP-3.
000650 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅŠz|‚n PIC S9(013) COMP-3.
000660 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅ•ñž‹à|‚n 
                                             PIC S9(013) COMP-3.
000670 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tæ–¼|‚l PIC  X(001).
000680 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âsƒR[ƒh|‚l PIC  X(001).
000690 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âs–¼|‚l PIC  X(001).
000700 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‹âs–¼ƒJƒi|‚l PIC  X(001).
000710 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à‹æ•ª|‚l PIC  X(001).
000720 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t•û–@|‚l PIC  X(001).
000730 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|Ž©“®ˆø—Ž|‚l PIC  X(001).
000740 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚P|‚l PIC  X(001).
000750 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚Q|‚l PIC  X(001).
000760 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚R|‚l PIC  X(001).
000770 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•tŠúŒÀ‚S|‚l PIC  X(001).
000780 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚P|‚l PIC  X(001).
000790 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚Q|‚l PIC  X(001).
000800 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚R|‚l PIC  X(001).
000810 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t“ú‚S|‚l PIC  X(001).
000820 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à“ü‹à“ú|‚l PIC  X(001).
000830 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅ‹æ•ª|‚l PIC  X(001).
000840 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ˆ—‹æ•ª|‚l PIC  X(001).
000850 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|Å—¦|‚l PIC  X(001).
000860 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|‰ÛÅ•W€Šz|‚l PIC  X(001).
000870 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|ÅŠz|‚l PIC  X(001).
000880 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•ñž‹à|‚l PIC  X(001).
000890 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚P|‚l PIC  X(001).
000900 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚Q|‚l PIC  X(001).
000910 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚R|‚l PIC  X(001).
000920 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|”[•t‹àŠz‚S|‚l PIC  X(001).
000930 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅŠz|‚l PIC  X(001).
000940 01  ‚d‚w‚s|‚l‚n‚c‚k‚r‚s|•s“®ŽYÅ•ñž‹à|‚l PIC  X(001).
