000010************************************************
000020* (FCT_HOSHO)
000030************************************************
000040 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Œ_–ñ”Ô† PIC  X(007).
000050 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Œ_–ñ”Ô†Ž}”Ô PIC  X(002).
000060 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽÀs“ú PIC  X(008).
000070 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`Uo“ú PIC  X(008).
000080 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`Šú“ú PIC  X(008).
000090 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`ŒˆÏ“ú PIC  X(008).
000100 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`ŒˆÏŠm”F“ú PIC  X(008).
000110 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`Šz–Ê‹àŠz PIC S9(013) COMP-3.
000120 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`•ÛØ‹àŠz PIC S9(013) COMP-3.
000130 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`•ÛØ“ú” PIC S9(004) COMP-3.
000140 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|•ÛØ—¿—¦ PIC S9(002)V9(8) COMP-3.
000150 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|•ÛØ—¿ PIC S9(013) COMP-3.
000160 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`•ÛØŠúŠÔ‰‚ß PIC  X(008).
000170 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`•ÛØŠúŠÔI‚í‚è PIC  X(008).
000180 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|•ÛØ—¿Žx•¥“ú PIC  X(008).
000190 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|•ÛØ—¿‰ñŽû•ûŽ® PIC  X(001).
000200 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|‹âs’ZkƒR[ƒh PIC  X(002).
000210 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|‹âsƒR[ƒh PIC  X(007).
000220 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŒûÀ–¼Ì PIC  X(060).
000230 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŒûÀ”Ô† PIC  X(007).
000240 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|‹âs–¼ PIC  X(060).
000250 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Šm”Fæ PIC  X(020).
000260 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Šm”F“à—e PIC  X(080).
000270 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Œ´Â–±ŽÒƒR[ƒh PIC  X(008).
000280 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`‚m‚n PIC  X(010).
000290 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|ŽèŒ`Ží—Þ PIC  X(001).
000300 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|— ‘•û–@ PIC  X(001).
000310 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Žx•¥l–¼ PIC  X(060).
000320 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Žx•¥êŠ PIC  X(060).
000330 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Žæˆø‹âsƒR[ƒh PIC  X(007).
000340 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Œ´Â–±ŽÒî•ñ‚P PIC  X(040).
000350 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Œ´Â–±ŽÒî•ñ‚Q PIC  X(040).
000360 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|Œ´Â–±ŽÒî•ñ‚R PIC  X(040).
000370 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|“o˜^“ú PIC  X(008).
000380 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|“o˜^Žž PIC  X(006).
000390 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000400 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|XV“ú PIC  X(008).
000410 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|XVŽž PIC  X(006).
000420 01  ‚e‚b‚s|‚g‚n‚r‚g‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
