000010************************************************
000020* ”Û”F(•¨Œ)(HSNINB)
000030************************************************
000040 01  ‚g‚r‚m‚h‚m‚a|Œ_–ñ”Ô†  PIC  X(009).
000050 01  ‚g‚r‚m‚h‚m‚a|•¨Œ‚m‚n  PIC  X(003).
000060 01  ‚g‚r‚m‚h‚m‚a|”Û”F“ú  PIC  X(008).
000070 01  ‚g‚r‚m‚h‚m‚a|”Û”Fƒ^ƒCƒv  PIC  X(001).
000080 01  ‚g‚r‚m‚h‚m‚a|Ž‘ŽYXV‹æ•ª  PIC  X(001).
000090 01  ‚g‚r‚m‚h‚m‚a|•¨Œ–¼  PIC  X(030).
000100 01  ‚g‚r‚m‚h‚m‚a|“–‰w“ü‹à  PIC S9(013) COMP-3.
000110 01  ‚g‚r‚m‚h‚m‚a|‘OŒŽw“ü‹à  PIC S9(013) COMP-3.
000120 01  ‚g‚r‚m‚h‚m‚a|“–ŒŽw“ü‹à  PIC S9(013) COMP-3.
000130 01  ‚g‚r‚m‚h‚m‚a|Žd“üÁ”ïÅ  PIC S9(010) COMP-3.
000140 01  ‚g‚r‚m‚h‚m‚a|Žc‰¿  PIC S9(013) COMP-3.
000150 01  ‚g‚r‚m‚h‚m‚a|–Ú“WŠJ“ú  PIC  X(006).
000160 01  ‚g‚r‚m‚h‚m‚a|–ÚŽx•¥‰ñ”  PIC  X(004).
000170 01  ‚g‚r‚m‚h‚m‚a|–ÚŽÀƒŠ[ƒX—¿  PIC S9(013) COMP-3.
000180 01  ‚g‚r‚m‚h‚m‚a|–Ú—˜‘§  PIC S9(013) COMP-3.
000190 01  ‚g‚r‚m‚h‚m‚a|–ÚŒ³–{“à“ü‚ê  PIC S9(013) COMP-3.
000200 01  ‚g‚r‚m‚h‚m‚a|–ÚŒ³–{Žc  PIC S9(013) COMP-3.
000210 01  ‚g‚r‚m‚h‚m‚a|–ÚÂŒ Žc  PIC S9(013) COMP-3.
000220 01  ‚g‚r‚m‚h‚m‚a|–Ú””ï—p  PIC S9(013) COMP-3.
000230 01  ‚g‚r‚m‚h‚m‚a|”„ãÁ”ïÅ  PIC S9(010) COMP-3.
000240 01  ‚g‚r‚m‚h‚m‚a|‚s‚`‚w‚h‚m‚s‘Š“–  PIC S9(010) COMP-3.
000250 01  ‚g‚r‚m‚h‚m‚a|‚s‚`‚w‚o“à“ü‚ê  PIC S9(010) COMP-3.
000260 01  ‚g‚r‚m‚h‚m‚a|‚s‚`‚w‚oŽc‚  PIC S9(013) COMP-3.
000270 01  ‚g‚r‚m‚h‚m‚a|ŒvŒŽ”  PIC  X(013).
