000010************************************************
000020* ”Û”F(“WŠJ)(HSNINT)
000030************************************************
000040 01  ‚g‚r‚m‚h‚m‚s|Œ_–ñ”Ô†  PIC  X(009).
000050 01  ‚g‚r‚m‚h‚m‚s|“WŠJ”NŒŽ  PIC  X(006).
000060 01  ‚g‚r‚m‚h‚m‚s|Žx•¥‰ñ”  PIC  X(004).
000070 01  ‚g‚r‚m‚h‚m‚s|ŽÀƒŠ[ƒX—¿  PIC S9(013) COMP-3.
000080 01  ‚g‚r‚m‚h‚m‚s|—˜‘§  PIC S9(013) COMP-3.
000090 01  ‚g‚r‚m‚h‚m‚s|Œ³–{“à“ü‚ê  PIC S9(013) COMP-3.
000100 01  ‚g‚r‚m‚h‚m‚s|Œ³–{Žc  PIC S9(013) COMP-3.
000110 01  ‚g‚r‚m‚h‚m‚s|ÂŒ Žc  PIC S9(013) COMP-3.
000120 01  ‚g‚r‚m‚h‚m‚s|””ï—p  PIC S9(013) COMP-3.
000130 01  ‚g‚r‚m‚h‚m‚s|ŒvŽZƒpƒ^[ƒ“  PIC  X(001).
000140 01  ‚g‚r‚m‚h‚m‚s|Œvãƒpƒ^[ƒ“  PIC  X(001).
000150 01  ‚g‚r‚m‚h‚m‚s|Œo‰ßŒŽ”  PIC  X(003).
000160 01  ‚g‚r‚m‚h‚m‚s|ƒŠ[ƒX—˜—p‚P‚Q  PIC S9(013) COMP-3.
000170 01  ‚g‚r‚m‚h‚m‚s|ƒŠ[ƒX—˜—p‚R  PIC S9(013) COMP-3.
000180 01  ‚g‚r‚m‚h‚m‚s|—˜‘§‚P‚Q  PIC S9(013) COMP-3.
000190 01  ‚g‚r‚m‚h‚m‚s|—˜‘§‚R  PIC S9(013) COMP-3.
000200 01  ‚g‚r‚m‚h‚m‚s|”ï—p‚P‚Q  PIC S9(013) COMP-3.
000210 01  ‚g‚r‚m‚h‚m‚s|”ï—p‚R  PIC S9(013) COMP-3.
