000010************************************************
000020* (IBS_ACCOUNT)
000030************************************************
000040 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|Š¨’è‰È–ÚƒR[ƒh PIC  X(002).
000050 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|Žg—p‹æ•ª PIC  X(001).
000060 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|‘å•ª—ÞƒR[ƒh PIC  X(001).
000070 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|‰È–ÚƒR[ƒh PIC  X(003).
000080 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|ŽæˆøƒR[ƒh PIC  X(002).
000090 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|ŒûÀ”Ô† PIC  X(008).
000100 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|‘å•ª—Þ–¼ PIC  X(010).
000110 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|Š¨’è‰È–Ú–¼ PIC  X(024).
000120 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|Žæˆø–¼ PIC  X(010).
000130 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|ŒûÀ–¼ PIC  X(032).
000140 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|WŒvƒR[ƒh‚P PIC  X(004).
000150 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|WŒvƒR[ƒh‚Q PIC  X(004).
000160 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|WŒvƒR[ƒh‚R PIC  X(004).
000170 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|“o˜^“ú PIC  X(008).
000180 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|“o˜^Žž PIC  X(006).
000190 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000200 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|XV“ú PIC  X(008).
000210 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|XVŽž PIC  X(006).
000220 01  ‚h‚a‚r|‚`‚b‚b‚n‚t‚m‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
