000010************************************************
000020* (IBS_CONTRACT)
000030************************************************
000040 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|ˆÄŒ‚m‚n PIC  X(012).
000060 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|—^M‘ÎÛ‹æ•ª PIC  X(001).
000070 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘ÝŽåƒR[ƒh PIC  X(008).
000080 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|ŽØŽåƒR[ƒh PIC  X(008).
000090 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñŽ¯•Ê–¼ PIC  X(030).
000100 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Œ³–{Œ³—˜‹æ•ª PIC  X(001).
000110 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Œ³–{•¼Ží PIC  X(003).
000120 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Œ³–{ PIC S9(014)V9(2) COMP-3.
000130 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|ƒ†ƒjƒbƒg‰¿Ši 
                                             PIC S9(014)V9(2) COMP-3.
000140 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Žc‰¿Šz PIC S9(014)V9(2) COMP-3.
000150 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Œ³—˜‡Œv PIC S9(014)V9(2) COMP-3.
000160 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|—˜‘§•¼Ží PIC  X(003).
000170 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|¬–ñ“ú PIC  X(008).
000180 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|ŽÀs“ú PIC  X(008).
000190 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|I—¹“ú PIC  X(008).
000200 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñŠúŠÔ PIC S9(003) COMP-3.
000210 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|˜’uŠúŠÔ PIC S9(002) COMP-3.
000220 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000230 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Žx•¥‰ñ” PIC S9(004) COMP-3.
000240 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘ÝŽåŠ¨’è‰È–ÚƒR[ƒh PIC  X(002).
000250 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|ŽØŽåŠ¨’è‰È–ÚƒR[ƒh PIC  X(002).
000260 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘OŽæŒãŽæ‹æ•ª PIC  X(001).
000270 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|—˜—¦Šî”ƒR[ƒh PIC  X(001).
000280 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|•Ð’[—¼’[‹æ•ª PIC  X(001).
000290 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|—˜‘§’PˆÊ PIC S9(002) COMP-3.
000300 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|’[”ˆ—ƒR[ƒh PIC  X(001).
000310 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|—˜‘§Šî€“ú PIC  X(002).
000320 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šî€“ú‹x“ú‹æ•ª PIC  X(002).
000330 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šî€“ú•Ï“®‹æ•ª PIC  X(001).
000340 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰ñŽû“ú“ú”· PIC S9(002) COMP-3.
000350 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰^—p‹à—˜‹æ•ª PIC  X(001).
000360 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰^—p‹à—˜ƒƒ‚ PIC  X(040).
000370 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|’²’B‹à—˜‹æ•ª PIC  X(001).
000380 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|’²’B‹à—˜ƒƒ‚ PIC  X(040).
000390 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|’²’Bæ–¼Ì PIC  X(040).
000400 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|—˜—¦Šm’èŒÀ“x“ú PIC  X(008).
000410 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|ô‘Ö‘ÎÛ‹æ•ª PIC  X(001).
000420 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|ŠOÅTœƒR[ƒh PIC  X(001).
000430 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Á”ïÅƒR[ƒh PIC  X(003).
000440 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚P PIC  X(030).
000450 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚P PIC S9(002) COMP-3.
000460 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚P PIC  X(001).
000470 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚Q PIC  X(030).
000480 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚Q PIC S9(002) COMP-3.
000490 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚Q PIC  X(001).
000500 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚R PIC  X(030).
000510 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚R PIC S9(002) COMP-3.
000520 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚R PIC  X(001).
000530 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚S PIC  X(030).
000540 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚S PIC S9(002) COMP-3.
000550 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚S PIC  X(001).
000560 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚T PIC  X(030).
000570 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚T PIC S9(002) COMP-3.
000580 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚T PIC  X(001).
000590 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚U PIC  X(030).
000600 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚U PIC S9(002) COMP-3.
000610 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚U PIC  X(001).
000620 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚V PIC  X(030).
000630 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚V PIC S9(002) COMP-3.
000640 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚V PIC  X(001).
000650 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚W PIC  X(030).
000660 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚W PIC S9(002) COMP-3.
000670 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚W PIC  X(001).
000680 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚X PIC  X(030).
000690 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚X PIC S9(002) COMP-3.
000700 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚X PIC  X(001).
000710 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‘—Þ–¼‚P‚O PIC  X(030).
000720 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|Šú“úŠÇ—‚P‚O PIC S9(002) COMP-3.
000730 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|‰c‹Æ“ú”»’è‚P‚O PIC  X(001).
000740 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|”Ä—p‹æ•ª‚P PIC  X(002).
000750 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|”Ä—p‹æ•ª‚Q PIC  X(002).
000760 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|”Ä—p‹æ•ª‚R PIC  X(002).
000770 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|“o˜^“ú PIC  X(008).
000780 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|“o˜^Žž PIC  X(006).
000790 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000800 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|XV“ú PIC  X(008).
000810 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|XVŽž PIC  X(006).
000820 01  ‚h‚a‚r|‚b‚n‚m‚s‚q‚`‚b‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
