000010************************************************
000020* (IBS_SUMMARY)
000030************************************************
000040 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ˆÄŒ‚m‚n PIC  X(012).
000050 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ_–ñ‚m‚n PIC  X(009).
000060 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘ÝŽØ‹æ•ª PIC  X(001).
000070 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ_–ñó‘Ô‹æ•ª PIC  X(001).
000080 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ŽæˆøæƒR[ƒh PIC  X(008).
000090 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰ïŽÐ‹æ•ª PIC  X(002).
000100 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Š¨’è‰È–ÚƒR[ƒh PIC  X(002).
000110 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘ÝŽåŽØŽå‹æ•ª–¼ PIC  X(004).
000120 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘ÝŽåŽØŽåƒR[ƒh PIC  X(008).
000130 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘ÝŽåŽØŽå–¼ PIC  X(060).
000140 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|âg‹c‚m‚n PIC  X(010).
000150 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ_–ñŒ`‘Ô PIC  X(001).
000160 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ˆÄŒ¬–ñ“ú PIC  X(008).
000170 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ˆÄŒ–¼ PIC  X(060).
000180 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‹¦’²Œ`‘Ô PIC  X(002).
000190 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Š²Ž–‰ïŽÐƒR[ƒh PIC  X(008).
000200 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ˆÄŒ‘S‘Ì•¼Ží PIC  X(003).
000210 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ˆÄŒ‘S‘ÌŠz PIC S9(014)V9(2) COMP-3.
000220 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŽÐŽ•ªŠz•¼Ží PIC  X(003).
000230 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŽÐŽ•ªŠz PIC S9(014)V9(2) COMP-3.
000240 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Žå“±“XƒR[ƒh PIC  X(004).
000250 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‹L’ “XƒR[ƒh PIC  X(004).
000260 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ’S“–ŽÒ PIC  X(004).
000270 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Ž––±’S“–ŽÒ PIC  X(001).
000280 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|—^MæƒR[ƒh PIC  X(008).
000290 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|”í•ÛØŒ`‘Ô PIC  X(001).
000300 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|•ÛŒ¯‘—Þ’¥‹ PIC  X(001).
000310 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|•ÛŒ¯XVŒŽ‚P PIC  X(004).
000320 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|•ÛŒ¯XVŒŽ‚Q PIC  X(004).
000330 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|•ÛŒ¯XVŒŽ‚R PIC  X(004).
000340 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Ž‘‹àŽg“rƒR[ƒh PIC  X(004).
000350 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’S•ÛŽí—Þ PIC  X(002).
000360 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’S•Û•]‰¿Šz•¼Ží PIC  X(003).
000370 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’S•Û•]‰¿Šz PIC S9(014)V9(2) COMP-3.
000380 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’S•Û–¼Ì PIC  X(040).
000390 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|—^M‘ÎÛ‹æ•ª PIC  X(001).
000400 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘ÝŽåƒR[ƒh PIC  X(008).
000410 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ŽØŽåƒR[ƒh PIC  X(008).
000420 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ_–ñŽ¯•Ê–¼ PIC  X(030).
000430 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ³–{Œ³—˜‹æ•ª PIC  X(001).
000440 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ³–{•¼Ží PIC  X(003).
000450 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ³–{ PIC S9(014)V9(2) COMP-3.
000460 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ƒ†ƒjƒbƒg‰¿Ši 
                                             PIC S9(014)V9(2) COMP-3.
000470 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Žc‰¿Šz PIC S9(014)V9(2) COMP-3.
000480 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ³—˜‡Œv PIC S9(014)V9(2) COMP-3.
000490 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|—˜‘§•¼Ží PIC  X(003).
000500 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ_–ñ¬–ñ“ú PIC  X(008).
000510 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ŽÀs“ú PIC  X(008).
000520 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|I—¹“ú PIC  X(008).
000530 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ_–ñŠúŠÔ PIC S9(003) COMP-3.
000540 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|˜’uŠúŠÔ PIC S9(002) COMP-3.
000550 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000560 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Žx•¥‰ñ” PIC S9(004) COMP-3.
000570 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ŽÀs“ú‚s‚s‚l 
                                             PIC S9(004)V9(2) COMP-3.
000580 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘ÝŽå|Š¨’è‰È–ÚƒR[ƒh PIC  X(002).
000590 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ŽØŽå|Š¨’è‰È–ÚƒR[ƒh PIC  X(002).
000600 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŽæŒãŽæ‹æ•ª PIC  X(001).
000610 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|—˜—¦Šî”ƒR[ƒh PIC  X(001).
000620 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|•Ð’[—¼’[‹æ•ª PIC  X(001).
000630 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|—˜‘§’PˆÊ PIC S9(002) COMP-3.
000640 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’[”ˆ—ƒR[ƒh PIC  X(001).
000650 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|—˜‘§Šî€“ú PIC  X(002).
000660 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šî€“ú‹x“ú‹æ•ª PIC  X(002).
000670 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šî€“ú•Ï“®‹æ•ª PIC  X(001).
000680 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰ñŽû“ú“ú”· PIC S9(002) COMP-3.
000690 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰^—p‹à—˜‹æ•ª PIC  X(001).
000700 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰^—p‹à—˜ƒƒ‚ PIC  X(040).
000710 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’²’B‹à—˜‹æ•ª PIC  X(001).
000720 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’²’B‹à—˜ƒƒ‚ PIC  X(040).
000730 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’²’Bæ–¼Ì PIC  X(040).
000740 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|—˜—¦Šm’èŒÀ“x“ú PIC  X(008).
000750 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ô‘Ö‘ÎÛ‹æ•ª PIC  X(001).
000760 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ŠOÅTœƒR[ƒh PIC  X(001).
000770 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Á”ïÅƒR[ƒh PIC  X(003).
000780 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚P PIC  X(030).
000790 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚P PIC S9(002) COMP-3.
000800 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚P PIC  X(001).
000810 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚Q PIC  X(030).
000820 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚Q PIC S9(002) COMP-3.
000830 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚Q PIC  X(001).
000840 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚R PIC  X(030).
000850 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚R PIC S9(002) COMP-3.
000860 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚R PIC  X(001).
000870 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚S PIC  X(030).
000880 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚S PIC S9(002) COMP-3.
000890 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚S PIC  X(001).
000900 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚T PIC  X(030).
000910 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚T PIC S9(002) COMP-3.
000920 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚T PIC  X(001).
000930 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚U PIC  X(030).
000940 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚U PIC S9(002) COMP-3.
000950 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚U PIC  X(001).
000960 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚V PIC  X(030).
000970 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚V PIC S9(002) COMP-3.
000980 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚V PIC  X(001).
000990 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚W PIC  X(030).
001000 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚W PIC S9(002) COMP-3.
001010 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚W PIC  X(001).
001020 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚X PIC  X(030).
001030 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚X PIC S9(002) COMP-3.
001040 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚X PIC  X(001).
001050 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘—Þ–¼‚P‚O PIC  X(030).
001060 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šú“úŠÇ—‚P‚O PIC S9(002) COMP-3.
001070 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰c‹Æ“ú”»’è‚P‚O PIC  X(001).
001080 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|”Ä—p‹æ•ª‚P PIC  X(002).
001090 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|”Ä—p‹æ•ª‚Q PIC  X(002).
001100 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|”Ä—p‹æ•ª‚R PIC  X(002).
001110 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ŒvŽZ“ú PIC  X(008).
001120 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“ú” PIC S9(004) COMP-3.
001130 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰ñŽû“ú PIC  X(008).
001140 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‚s‚s‚l PIC S9(004)V9(2) COMP-3.
001150 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’²’B‹à—˜ PIC S9(004)V9(8) COMP-3.
001160 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰^—p‹à—˜ PIC S9(004)V9(8) COMP-3.
001170 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|—˜‘§ PIC S9(014)V9(2) COMP-3.
001180 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‚»‚Ì‘¼ PIC S9(014)V9(2) COMP-3.
001190 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰ñŽûŠz PIC S9(014)V9(2) COMP-3.
001200 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢ŽÀŒ»—˜‰v·Šz—ÝŒv 
                                             PIC S9(014)V9(2) COMP-3.
001210 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|”õl PIC  X(020).
001220 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘O‰ñ¡‰ñŠú“ú PIC  X(008).
001230 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ŽŸ‰ñŠú“ú PIC  X(008).
001240 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢¬–ñŽc‚|Œ³–{|•¼Ží PIC  X(003).
001250 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢¬–ñŽc‚|Œ³–{|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001260 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢¬–ñŽc‚|Œ³–{|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001270 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢¬–ñŽc‚|Œ³–{|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001280 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢¬–ñŽc‚|Œ³–{|‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001290 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢¬–ñŽc‚|Œ³–{|Š·ŽZŠz 
                                             PIC S9(014)V9(2) COMP-3.
001300 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|Œ³–{|•¼Ží PIC  X(003).
001310 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|Œ³–{|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001320 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|Œ³–{|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001330 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|Œ³–{|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001340 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|—˜‘§|•¼Ží PIC  X(003).
001350 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|—˜‘§|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001360 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|—˜‘§|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001370 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|—˜‘§|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001380 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|Œ³—˜‡Œv|•¼Ží 
                                             PIC  X(003).
001390 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|Œ³—˜‡Œv|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001400 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|Œ³—˜‡Œv|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001410 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘OŒŽ––Žc‚|Œ³—˜‡Œv|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001420 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|Œ³–{|•¼Ží PIC  X(003).
001430 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|Œ³–{|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001440 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|Œ³–{|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001450 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|Œ³–{|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001460 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|—˜‘§|•¼Ží PIC  X(003).
001470 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|—˜‘§|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001480 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|—˜‘§|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001490 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|—˜‘§|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001500 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|Œ³—˜‡Œv|•¼Ží 
                                             PIC  X(003).
001510 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|Œ³—˜‡Œv|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001520 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|Œ³—˜‡Œv|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001530 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽŽÀs‚|Œ³—˜‡Œv|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001540 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|Œ³–{|•¼Ží PIC  X(003).
001550 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|Œ³–{|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001560 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|Œ³–{|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001570 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|Œ³–{|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001580 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|—˜‘§|•¼Ží PIC  X(003).
001590 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|—˜‘§|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001600 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|—˜‘§|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001610 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|—˜‘§|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001620 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|Œ³—˜‡Œv|•¼Ží 
                                             PIC  X(003).
001630 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|Œ³—˜‡Œv|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001640 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|Œ³—˜‡Œv|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001650 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‰ñŽû‚|Œ³—˜‡Œv|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001660 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³–{|•¼Ží PIC  X(003).
001670 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³–{|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001680 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³–{|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001690 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³–{|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001700 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³–{|‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001710 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³–{|Š·ŽZŠz 
                                             PIC S9(014)V9(2) COMP-3.
001720 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|—˜‘§|•¼Ží PIC  X(003).
001730 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|—˜‘§|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001740 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|—˜‘§|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001750 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|—˜‘§|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001760 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|—˜‘§|‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001770 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|—˜‘§|Š·ŽZŠz 
                                             PIC S9(014)V9(2) COMP-3.
001780 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³—˜‡Œv|•¼Ží 
                                             PIC  X(003).
001790 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³—˜‡Œv|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001800 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³—˜‡Œv|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001810 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³—˜‡Œv|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001820 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³—˜‡Œv|‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001830 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ––Žc‚|Œ³—˜‡Œv|Š·ŽZŠz 
                                             PIC S9(014)V9(2) COMP-3.
001840 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ˆ×‘Ö·‘¹‰v|Œ³–{ 
                                             PIC S9(014) COMP-3.
001850 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ˆ×‘Ö·‘¹‰v|—˜‘§ 
                                             PIC S9(014) COMP-3.
001860 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ˆ×‘Ö·‘¹‰v|Œ³—˜‡Œv 
                                             PIC S9(014) COMP-3.
001870 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ|•¼Ží PIC  X(003).
001880 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(2) COMP-3.
001890 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ•½‹ÏŽc‚|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001900 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ•½‹ÏŽc‚|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001910 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰^—pŒŽ’†—˜‘§|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001920 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰^—pŒŽ’†—˜‘§|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001930 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’²’BŒŽ’†—˜‘§|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001940 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|’²’BŒŽ’†—˜‘§|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001950 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‘e—˜|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
001960 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|“–ŒŽ‘e—˜|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
001970 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‰^—p—˜‰ñ‚è PIC S9(004)V9(8) COMP-3.
001980 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Œ©‰zŒJ‰„‹æ•ª PIC  X(001).
001990 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢ŽûŽû‰v|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
002000 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢ŽûŽû‰v|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
002010 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢ŽûŽû‰v|ŠúŠÔ“ú” 
                                             PIC S9(004) COMP-3.
002020 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢ŽûŽû‰v|–¢Žû“ú” 
                                             PIC S9(004) COMP-3.
002030 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢Œo‰ßŽû‰v|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
002040 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢Œo‰ßŽû‰v|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
002050 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢Œo‰ßŽû‰v|ŠúŠÔ“ú” 
                                             PIC S9(004) COMP-3.
002060 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢Œo‰ßŽû‰v|–¢Œo‰ß“ú” 
                                             PIC S9(004) COMP-3.
002070 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘O•¥”ï—p|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
002080 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘O•¥”ï—p|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
002090 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘O•¥”ï—p|ŠúŠÔ“ú” 
                                             PIC S9(004) COMP-3.
002100 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|‘O•¥”ï—p|‘O•¥“ú” 
                                             PIC S9(004) COMP-3.
002110 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢•¥”ï—p|‹àŠz 
                                             PIC S9(014)V9(2) COMP-3.
002120 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢•¥”ï—p|‰~Š·ŽZŠz 
                                             PIC S9(014) COMP-3.
002130 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢•¥”ï—p|ŠúŠÔ“ú” 
                                             PIC S9(004) COMP-3.
002140 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|–¢•¥”ï—p|–¢•¥“ú” 
                                             PIC S9(004) COMP-3.
002150 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|Šî€“ú PIC  X(008).
002160 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ì¬“ú PIC  X(008).
002170 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ì¬Žž PIC  X(006).
002180 01  ‚h‚a‚r|‚r‚t‚l‚l‚`‚q‚x|ì¬’S“–ŽÒƒR[ƒh PIC  X(004).
