000010************************************************
000020* (IBS_TRANS_CITY)
000030************************************************
000040 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‚b‚h‚s‚x|ˆÄŒ‚m‚n PIC  X(012).
000050 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‚b‚h‚s‚x|ŠÖ˜A“sŽsƒR[ƒh PIC  X(003).
