000010************************************************
000020* マスタコード変換テーブル(IKOTBL006)
000030************************************************
000040 01  ＩＫＯ００６－旧取引先コード PIC  X(008).
000050 01  ＩＫＯ００６－目的ＣＤ PIC  X(001).
000060 01  ＩＫＯ００６－旧ユーザーコード PIC  X(007).
000070 01  ＩＫＯ００６－新取引先コード PIC  X(007).
000080 01  ＩＫＯ００６－枝番 PIC  X(008).
