000010************************************************
000020* Â–±Žx•¥æƒR[ƒh•ÏŠ·ƒe[ƒuƒ‹(IKOTBL009)
000030************************************************
000040 01  ‚h‚j‚n‚O‚O‚X|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚h‚j‚n‚O‚O‚X|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000060 01  ‚h‚j‚n‚O‚O‚X|Â–±Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000070 01  ‚h‚j‚n‚O‚O‚X|Â–±ŽæˆøæƒR[ƒh PIC  X(008).
000080 01  ‚h‚j‚n‚O‚O‚X|Œ»Žx•¥æƒR[ƒh PIC  X(008).
000090 01  ‚h‚j‚n‚O‚O‚X|Žx•¥æVŽæˆøæƒR[ƒh PIC  X(007).
000100 01  ‚h‚j‚n‚O‚O‚X|Žx•¥æŽ}”Ô PIC  X(003).
