000010************************************************
000020* ¿‹“à–óƒR[ƒh•ÏŠ·ƒe[ƒuƒ‹(IKOTBL005)
000030************************************************
000040 01  ‚h‚j‚n‚O‚O‚T|Œ»¿‹“à–óƒR[ƒh PIC  X(003).
000050 01  ‚h‚j‚n‚O‚O‚T|ƒAƒNƒZƒX‹æ•ª PIC  X(001).
000060 01  ‚h‚j‚n‚O‚O‚T|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000070 01  ‚h‚j‚n‚O‚O‚T|Á”ïÅƒR[ƒh PIC  X(002).
000080 01  ‚h‚j‚n‚O‚O‚T|’¥Žû’·’Z‹æ•ª PIC S9(001) COMP-3.
000090 01  ‚h‚j‚n‚O‚O‚T|Žè”—¿¿‹ƒR[ƒh PIC  X(002).
000100 01  ‚h‚j‚n‚O‚O‚T|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000110 01  ‚h‚j‚n‚O‚O‚T|Œvã‹æ•ª PIC S9(001) COMP-3.
000120 01  ‚h‚j‚n‚O‚O‚T|‹æ•ª‚P PIC S9(001) COMP-3.
000130 01  ‚h‚j‚n‚O‚O‚T|Â‹¦ã‚PŒ… PIC  X(001).
000140 01  ‚h‚j‚n‚O‚O‚T|‹æ•ª‚Q PIC  X(001).
000150 01  ‚h‚j‚n‚O‚O‚T|Œ_–ñŽí—Þã‚PŒ… PIC S9(001) COMP-3.
000160 01  ‚h‚j‚n‚O‚O‚T|V¿‹“à–óƒR[ƒh PIC  X(003).
000170 01  ‚h‚j‚n‚O‚O‚T|V¿‹“à–óƒR[ƒh‚Q PIC  X(003).
