000010************************************************
000020* (JOM_SEIKYU_MEISAI)
000030************************************************
000040 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|–¾×‚m‚n PIC  X(004).
000060 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|•¨Œ–¼ PIC  X(030).
000070 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|”—Ê 
                                             PIC S9(004) COMP-3.
000080 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|w“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000090 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|Žc‰¿ 
                                             PIC S9(013) COMP-3.
000100 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000110 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼ PIC  X(020).
000120 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚P 
                                             PIC  X(010).
000130 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚Q 
                                             PIC  X(010).
000140 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚R 
                                             PIC  X(010).
000150 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚S 
                                             PIC  X(010).
000160 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚l‚d‚h‚r‚`‚h|•ÏXÏ•WŽ¯ PIC  X(001).
