000010************************************************
000020* (JOM_FORM_0009_T)
000030************************************************
000040 01  JOM_FORM_0009_T-JOBCOD PIC S9(002) COMP-3.
000050 01  JOM_FORM_0009_T-å_ñÒî‘çÜ PIC  X(009).
000060 01  JOM_FORM_0009_T-å_ñÒì˙ PIC  X(008).
000070 01  JOM_FORM_0009_T-ëÊ1âÒì¸ã‡ì˙ PIC  X(008).
000080 01  JOM_FORM_0009_T-ì¸ã‡ì˙ PIC  X(004).
000090 01  JOM_FORM_0009_T-ê≈ó¶ PIC S9(002)V9(1) COMP-3.
000100 01  JOM_FORM_0009_T-ºﬁÆ”è§ïi∫∞ƒﬁ PIC  X(004).
000110 01  JOM_FORM_0009_T-ï®åèñº PIC  X(030).
000120 01  JOM_FORM_0009_T-ÿ∞Ωóø1 PIC S9(013) COMP-3.
000130 01  JOM_FORM_0009_T-ÿ∞Ωóø2 PIC S9(013) COMP-3.
000140 01  JOM_FORM_0009_T-ÿ∞Ωóø3 PIC S9(013) COMP-3.
000150 01  JOM_FORM_0009_T-ÿ∞Ωóø4 PIC S9(013) COMP-3.
000160 01  JOM_FORM_0009_T-ÿ∞Ωóø5 PIC S9(013) COMP-3.
000170 01  JOM_FORM_0009_T-ÿ∞Ωóø6 PIC S9(013) COMP-3.
000180 01  JOM_FORM_0009_T-ÿ∞Ωóø7 PIC S9(013) COMP-3.
000190 01  JOM_FORM_0009_T-ÿ∞Ωóø8 PIC S9(013) COMP-3.
000200 01  JOM_FORM_0009_T-ÿ∞Ωóø9 PIC S9(013) COMP-3.
000210 01  JOM_FORM_0009_T-ÿ∞Ωóø10 PIC S9(013) COMP-3.
000220 01  JOM_FORM_0009_T-ÿ∞Ωóø11 PIC S9(013) COMP-3.
000230 01  JOM_FORM_0009_T-ÿ∞Ωóø12 PIC S9(013) COMP-3.
000240 01  JOM_FORM_0009_T-ÿ∞Ωóø13 PIC S9(013) COMP-3.
000250 01  JOM_FORM_0009_T-ÿ∞Ωóø14 PIC S9(013) COMP-3.
000260 01  JOM_FORM_0009_T-ÿ∞Ωóøçáåv PIC S9(013) COMP-3.
000270 01  JOM_FORM_0009_T-è¡îÔê≈1 PIC S9(013) COMP-3.
000280 01  JOM_FORM_0009_T-è¡îÔê≈2 PIC S9(013) COMP-3.
000290 01  JOM_FORM_0009_T-è¡îÔê≈3 PIC S9(013) COMP-3.
000300 01  JOM_FORM_0009_T-è¡îÔê≈4 PIC S9(013) COMP-3.
000310 01  JOM_FORM_0009_T-è¡îÔê≈5 PIC S9(013) COMP-3.
000320 01  JOM_FORM_0009_T-è¡îÔê≈6 PIC S9(013) COMP-3.
000330 01  JOM_FORM_0009_T-è¡îÔê≈7 PIC S9(013) COMP-3.
000340 01  JOM_FORM_0009_T-è¡îÔê≈8 PIC S9(013) COMP-3.
000350 01  JOM_FORM_0009_T-è¡îÔê≈9 PIC S9(013) COMP-3.
000360 01  JOM_FORM_0009_T-è¡îÔê≈10 PIC S9(013) COMP-3.
000370 01  JOM_FORM_0009_T-è¡îÔê≈11 PIC S9(013) COMP-3.
000380 01  JOM_FORM_0009_T-è¡îÔê≈12 PIC S9(013) COMP-3.
000390 01  JOM_FORM_0009_T-è¡îÔê≈13 PIC S9(013) COMP-3.
000400 01  JOM_FORM_0009_T-è¡îÔê≈14 PIC S9(013) COMP-3.
000410 01  JOM_FORM_0009_T-è¡îÔê≈çáåv PIC S9(013) COMP-3.
