000010************************************************
000020* (JOM_FORM_0018)
000030************************************************
000040 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ƒWƒ‡ƒ‚Žx“XƒR[ƒh PIC  X(002).
000050 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|Žx“X–¼Š¿Žš PIC  X(060).
000060 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ƒWƒ‡ƒ‚Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000080 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|Žd“üÁ”ïÅ“™Šz‡Œv 
                                             PIC S9(013) COMP-3.
000090 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000100 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000110 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|Á”ïÅ“™Šz PIC S9(013) COMP-3.
000120 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(6) COMP-3.
000130 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000140 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|‘OŽóŒŽ” PIC S9(002) COMP-3.
000150 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000160 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ŒJ‰„‹àŠz PIC S9(013) COMP-3.
000170 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000180 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000190 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|”„Žå–¼ PIC  X(060).
000200 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|w“üæƒR[ƒh PIC  X(008).
000210 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000220 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|•¨Œ‚m‚n PIC  X(003).
000230 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ƒWƒ‡ƒ‚¤•iƒR[ƒh PIC  X(004).
000240 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|ƒWƒ‡ƒ‚¤•i•ª—Þ–¼ PIC  X(030).
000250 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|Ž‘ŽYƒR[ƒh PIC  X(007).
000260 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|‘Ï—p”N” PIC  X(002).
000270 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000280 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|“®‘•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000290 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|•¨Œ–¼Š¿Žš PIC  X(040).
000300 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|•¨Œ–¼ƒJƒi PIC  X(020).
000310 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|”—Ê PIC S9(004) COMP-3.
000320 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|”[•tæƒR[ƒh PIC  X(006).
000330 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|Ý’uêŠ–¼Š¿Žš PIC  X(040).
000340 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|Ý’uêŠZŠ PIC  X(100).
000350 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚W|M—p•ÛŒ¯ƒR[ƒh PIC  X(006).
