000010************************************************
000020* (JOM_FORM_0011)
000030************************************************
000040 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚P|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚P|ÅIŽ}”Ô PIC  X(002).
000060 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚P|ŒŸŽû“ú PIC  X(008).
