000010************************************************
000020* (JOM_SJYOKEN_MST)
000030************************************************
000040 01  ‚i‚n‚l|‚r‚i‚x‚n‚j‚d‚m|‚l‚r‚s|ƒWƒ‡ƒ‚Žx•¥ðŒƒR[ƒh 
                                             PIC  X(002).
000050 01  ‚i‚n‚l|‚r‚i‚x‚n‚j‚d‚m|‚l‚r‚s|ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000060 01  ‚i‚n‚l|‚r‚i‚x‚n‚j‚d‚m|‚l‚r‚s|Žx•¥ðŒ•¶Œ¾ PIC  X(040).
