000010************************************************
000020* (JOM_KIHON)
000030************************************************
000040 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ƒWƒ‡ƒ‚Žx“XƒR[ƒh PIC  X(002).
000050 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ƒWƒ‡ƒ‚Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000080 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000100 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Žæˆøæ–¼ PIC  X(060).
000110 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|âg‹c‚m‚n PIC  X(010).
000130 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000140 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000150 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|‘æ‚P‰ñ“ü‹à“ú PIC  X(008).
000160 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|“ü‹àŠî€“ú PIC  X(002).
000170 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000180 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
000190 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|˜’uŒŽ” PIC S9(002)V9(2) COMP-3.
000200 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|‘OŽóŒŽ” PIC S9(002) COMP-3.
000210 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(2) COMP-3.
000220 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000230 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|‰‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000240 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000250 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|I‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000260 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000270 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000280 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|[“–‘ŠŽE‹æ•ª PIC  X(001).
000290 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000300 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Žd“üÁ”ïÅ“™Šz‡Œv PIC S9(013) COMP-3.
000310 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000320 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŒJ‰„‹àŠz PIC S9(013) COMP-3.
000330 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000340 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000350 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000360 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|‘e—˜‰v PIC S9(013) COMP-3.
000370 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000380 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŽóŽæŽè”—¿Œ»Ý‰¿’l PIC S9(013) COMP-3.
000390 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000400 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŒŽŠzŒÅ’èŽ‘ŽYÅ‘Šz PIC S9(013) COMP-3.
000410 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŒŽŠz“®‘•ÛŒ¯—¿‘Šz PIC S9(013) COMP-3.
000420 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŒŽŠz‘OŽóƒƒŠƒbƒg PIC S9(013) COMP-3.
000430 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŒŽŠzŒJ‰„ƒƒŠƒbƒg PIC S9(013) COMP-3.
000440 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ŽÀŽ¿ƒŠ[ƒX—¿‚o‚u PIC S9(013) COMP-3.
000450 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000460 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|”„Žå–¼ PIC  X(060).
000470 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|”„ŽåZŠ PIC  X(100).
000480 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ƒWƒ‡ƒ‚Žx•¥ðŒƒR[ƒh PIC  X(002).
000490 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|w“üæƒR[ƒh PIC  X(008).
000500 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ƒGƒ‰[—L–³‹æ•ª PIC  X(001).
000510 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000520 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000530 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000540 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000550 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000560 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000570 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ˆ´ùŽè”—¿ PIC S9(013) COMP-3.
000580 01  ‚i‚n‚l|‚j‚h‚g‚n‚m|ˆ´ùŽè”—¿Œ»Ý‰¿’l PIC S9(013) COMP-3.
