000010************************************************
000020* (JOM_FORM_0004)
000030************************************************
000040 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|ƒWƒ‡ƒ‚Žx•¥ðŒƒR[ƒh 
                                             PIC  X(002).
000050 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|ƒWƒ‡ƒ‚Žx“XƒR[ƒh PIC  X(002).
000060 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|ƒWƒ‡ƒ‚Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|Œ_–ñ”Ô† PIC  X(009).
000080 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000090 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|Ý’uêŠZŠ PIC  X(100).
000100 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|•¨Œ–¼|Š¿Žš PIC  X(040).
000110 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|”—Ê PIC S9(004) COMP-3.
000120 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|Žx•¥ðŒ•¶Œ¾ PIC  X(040).
000130 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|w“ü‹àŠz PIC S9(013) COMP-3.
000140 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
