000010************************************************
000020* (JOM_FORM_0017)
000030************************************************
000040 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚V|ƒWƒ‡ƒ‚Žx“XƒR[ƒh PIC  X(002).
000050 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚V|ƒWƒ‡ƒ‚Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚V|ƒWƒ‡ƒ‚•¨Œ‚m‚n PIC  X(003).
000070 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚V|ƒƒbƒZ[ƒW PIC  X(060).
