000010************************************************
000020* (KAI_WK_HOUKISON)
000030************************************************
000040 01  KAI_WK_HOUKISON-NO PIC S9(003) COMP-3.
000050 01  KAI_WK_HOUKISON-実質未回収元本 PIC S9(013) COMP-3.
000060 01  KAI_WK_HOUKISON-未徴収TAX PIC S9(013) COMP-3.
000070 01  KAI_WK_HOUKISON-未徴収保険料 PIC S9(013) COMP-3.
000080 01  KAI_WK_HOUKISON-合計 PIC S9(013) COMP-3.
000090 01  KAI_WK_HOUKISON-減額法110 PIC S9(013) COMP-3.
000100 01  KAI_WK_HOUKISON-減額法105 PIC S9(013) COMP-3.
000110 01  KAI_WK_HOUKISON-実質元本残105 PIC S9(013) COMP-3.
000120 01  KAI_WK_HOUKISON-残ﾘｰｽ料 PIC S9(013) COMP-3.
000130 01  KAI_WK_HOUKISON-未償却残高 PIC S9(013) COMP-3.
000140 01  KAI_WK_HOUKISON-契約番号 PIC  X(009).
000150 01  KAI_WK_HOUKISON-保険価格110 PIC S9(013) COMP-3.
000160 01  KAI_WK_HOUKISON-物件NO PIC  X(003).
000170 01  KAI_WK_HOUKISON-実質利回り PIC S9(002)V9(8) COMP-3.
000180 01  KAI_WK_HOUKISON-割賦FLG PIC  X(001).
000190 01  KAI_WK_HOUKISON-法定定率未償却残高 PIC S9(013) COMP-3.
