000010************************************************
000020* (KAI_WK_BUKKEN)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|•¨Œ”Ô† PIC  X(003).
000060 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|Ý’uêŠ–¼ PIC  X(040).
000070 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|•¨Œ–¼ PIC  X(040).
000080 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|•¨Œˆ•ª•û–@ PIC  X(050).
000090 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000100 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|ƒŠ[ƒX—¿Á”ïÅ 
                                             PIC S9(013) COMP-3.
000110 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|‘O•¥ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|‘O•¥Á”ïÅ PIC S9(013) COMP-3.
000130 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|•¨Œ‹àŠz PIC S9(013) COMP-3.
000140 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|•¨ŒÁ”ïÅ PIC S9(013) COMP-3.
000150 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|“Á–ñ PIC  X(600).
000160 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|˜A”Ô PIC S9(003) COMP-3.
000170 01  ‚j‚`‚h|‚v‚j|‚a‚t‚j‚j‚d‚m|’¼“]‹æ•ª PIC  X(001).
