000010************************************************
000020* (KAI_SAITENK)
000030************************************************
000040 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|“WŠJ”Ô† PIC  X(003).
000070 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|•s‹Ï“™ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000080 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|ŒŽ” PIC S9(003) COMP-3.
000090 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|“o˜^“ú PIC  X(008).
000100 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|“o˜^Žž PIC  X(006).
000110 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|XV“ú PIC  X(008).
000130 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|XVŽž PIC  X(006).
000140 01  ‚j‚`‚h|‚r‚`‚h‚s‚d‚m‚j|XV’S“–ŽÒƒR[ƒh PIC  X(004).
