000010************************************************
000020* (KAI_WK_CYOUSEI)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚b‚x‚n‚t‚r‚d‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚b‚x‚n‚t‚r‚d‚h|’²®—L–³ PIC  X(001).
000060 01  ‚j‚`‚h|‚v‚j|‚b‚x‚n‚t‚r‚d‚h|’²®‹àŠz PIC S9(013) COMP-3.
000070 01  ‚j‚`‚h|‚v‚j|‚b‚x‚n‚t‚r‚d‚h|’²®——R PIC  X(020).
000080 01  ‚j‚`‚h|‚v‚j|‚b‚x‚n‚t‚r‚d‚h|‘æ‚RŽÒŽx•¥ŽÒ–¼ƒJƒi 
                                             PIC  X(030).
000090 01  ‚j‚`‚h|‚v‚j|‚b‚x‚n‚t‚r‚d‚h|‘æ‚RŽÒŽx•¥ŽÒ–¼Š¿Žš 
                                             PIC  X(040).
