000010************************************************
000020* (KAI_SHOBUN)
000030************************************************
000040 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|Ž‘ŽYˆ•ª‹æ•ª PIC  X(001).
000070 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|ˆ•ªæŽ¯•Ê”Ô† PIC  X(001).
000080 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|”„‹pæˆø“næ–¼Š¿Žš PIC  X(060).
000090 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|”„‹pæˆø“næ–¼ƒJƒi PIC  X(030).
000100 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|Ý’uêŠ–¼ PIC  X(040).
000110 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|Ý’uêŠ–¼ƒJƒi PIC  X(020).
000120 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|Ý’uêŠZŠ PIC  X(100).
000130 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|”„‹pˆø“næ‹æ•ª PIC  X(001).
000140 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|•¨Œ–¼Š¿Žš PIC  X(040).
000150 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|•¨Œ–¼ƒJƒi PIC  X(020).
000160 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|Žd—l»‘¢”Ô† PIC  X(020).
000170 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|”—Ê PIC S9(004) COMP-3.
000180 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|’P‰¿ PIC S9(013) COMP-3.
000190 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|”„‹p‹àŠz PIC S9(013) COMP-3.
000200 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|”„‹pÅ—¦ PIC S9(002)V9(1) COMP-3.
000210 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|”„‹p‹àŠz“ü‹àæƒR[ƒh PIC  X(008).
000220 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|”„‹p‹àŠz“ü‹à—\’è“ú PIC  X(008).
000230 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|ˆøŽæ”ï—p PIC S9(013) COMP-3.
000240 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|“o˜^“ú PIC  X(008).
000250 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|“o˜^Žž PIC  X(006).
000260 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000270 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|XV“ú PIC  X(008).
000280 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|XVŽž PIC  X(006).
000290 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000300 01  ‚j‚`‚h|‚r‚g‚n‚a‚t‚m|Žx•¥ðŒ PIC  X(172).
