000010************************************************
000020* (KEI_WK_YOTEI2)
000030************************************************
000040 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|’[––”Ô† PIC  X(016).
000060 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|Œ_–ñ“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|ƒŠ[ƒXŠJŽn“ú PIC  X(008).
000080 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|ƒŠ[ƒXŠúŠÔ–ž—¹“ú PIC  X(008).
000090 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|‚¨Žx•¥‰ñ” PIC S9(003) COMP-3.
000100 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|ƒŠ[ƒX—¿‘Šz 
                                             PIC S9(013) COMP-3.
000110 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|‚P‰ñ“–‚½‚èƒŠ[ƒX—¿ PIC  X(018).
000120 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|‚P‰ñ“–‚½‚èÁ”ïÅ“™ PIC  X(018).
000130 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|‘ã•\•¨Œ–¼ PIC  X(040).
000140 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|•¨ŒÝ’uêŠ PIC  X(040).
000150 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚Q|Žx•¥ŠJŽn“ú PIC  X(010).
