000010************************************************
000020* (KEI_MIZUHO_20020719)
000030************************************************
000040 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|ŒÚ‹q”Ô† 
                                             PIC  X(020).
000050 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|ƒf[ƒ^‹æ•ª 
                                             PIC  X(001).
000060 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|‹Œ‹âs‚b‚c 
                                             PIC  X(004).
000070 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|‹ŒŽx“X‚b‚c 
                                             PIC  X(003).
000080 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|‹Œ—a‹àŽí–Ú 
                                             PIC  X(001).
000090 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|‹ŒŒûÀ”Ô† 
                                             PIC  X(007).
000100 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|VŽx“X‚b‚c 
                                             PIC  X(003).
000110 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|VŽx“X–¼ 
                                             PIC  X(015).
000120 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|V—a‹àŽí–Ú 
                                             PIC  X(001).
000130 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|VŒûÀ”Ô† 
                                             PIC  X(007).
000140 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|V‹âs‚b‚c 
                                             PIC  X(004).
000150 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|V‹âs–¼ 
                                             PIC  X(020).
000160 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚Q‚O‚O‚Q‚O‚V‚P‚X|Œ‹‰Ê‚b‚c 
                                             PIC  X(001).
