000010************************************************
000020* (KEI_LPWK_RINGI_YOSIN)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|‚v‚j˜A”Ô 
                                             PIC S9(003) COMP-3.
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|’[––”Ô† 
                                             PIC  X(016).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh 
                                             PIC  X(008).
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|—^Mæ–¼ 
                                             PIC  X(060).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|•ÛØ’S•Û“à—e 
                                             PIC  X(030).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|•Û‘S”ÍˆÍ 
                                             PIC  X(020).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|•‰’SŠ„‡ 
                                             PIC S9(003) COMP-3.
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|ƒŠ[ƒXŽc‚–¼Šñ‚¹ 
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|Š„•ŠŽc‚–¼Šñ‚¹ 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|‘Ý•tŽc‚–¼Šñ‚¹ 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|–¢ŒŸŽûŽc‚–¼Šñ‚¹ 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|–¢’¥ŽûŽc‚–¼Šñ‚¹ 
                                             PIC S9(013) COMP-3.
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|Žæˆøæ–¼ 
                                             PIC  X(060).
000180 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚x‚n‚r‚h‚m|Œ_–ñ“ú 
                                             PIC  X(008).
