000010************************************************
000020* (KEI_LPWK_EDA_SEIKYU)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Žæˆøæ‹æ•ª 
                                             PIC  X(001).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŒÚ‹qƒR[ƒh 
                                             PIC  X(006).
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Š¨’èˆ—ƒR[ƒh 
                                             PIC  X(002).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŽæˆøŒ`‘ÔƒR[ƒh 
                                             PIC  X(002).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Œ_–ñ“ú PIC  X(008).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŒŸŽû“ú PIC  X(008).
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŒvŽZ•ûŽ® 
                                             PIC  X(001).
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|˜’uŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‘OŽóŒŽ” 
                                             PIC S9(002) COMP-3.
000180 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000190 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Á”ïÅ’¥Žû‹æ•ª 
                                             PIC  X(001).
000200 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000210 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000220 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000230 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000240 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŒÅ’èŽ‘ŽYÅ‘Šz 
                                             PIC S9(013) COMP-3.
000250 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|“®‘•ÛŒ¯—¿‘Šz 
                                             PIC S9(013) COMP-3.
000260 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000270 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|I‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000280 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Šî–{ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000290 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŒŽŠzŒÅ’èŽ‘ŽYÅ‘Šz 
                                             PIC S9(013) COMP-3.
000300 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŒŽŠz“®‘•ÛŒ¯—¿‘Šz 
                                             PIC S9(013) COMP-3.
000310 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹æƒR[ƒh 
                                             PIC  X(008).
000320 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹æ–¼ 
                                             PIC  X(060).
000330 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹æ•”–å–¼Ì 
                                             PIC  X(040).
000340 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹æ—X•Ö”Ô†‚RŒ… 
                                             PIC  X(003).
000350 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹æ—X•Ö”Ô†‚SŒ… 
                                             PIC  X(004).
000360 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|“s“¹•{Œ§ 
                                             PIC  X(010).
000370 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹æZŠ‚P 
                                             PIC  X(040).
000380 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹æZŠ‚Q 
                                             PIC  X(040).
000390 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹‹æ•ª‚P 
                                             PIC  X(001).
000400 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|¿‹‹æ•ª‚Q 
                                             PIC  X(001).
000410 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‘æ‚P‰ñƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000420 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‚Q‰ñ–ÚˆÈ~ƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000430 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŽèŒ`–‡” 
                                             PIC S9(003) COMP-3.
000440 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|“ü‹àŠî€“ú 
                                             PIC  X(002).
000450 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|—a‹àŽí—Þ 
                                             PIC  X(001).
000460 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‹âsƒR[ƒh 
                                             PIC  X(007).
000470 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ŒûÀ”Ô† 
                                             PIC  X(007).
000480 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000490 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000500 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‘OŽóƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000510 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Žc‰¿‰ñŽû“ú 
                                             PIC  X(008).
000520 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‹âs’ZkƒR[ƒh 
                                             PIC  X(002).
000530 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|•¨Œ‚m‚n 
                                             PIC  X(003).
000540 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|•¨Œ–¼|Š¿Žš 
                                             PIC  X(040).
000550 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|•¨Œ–¼|ƒJƒi 
                                             PIC  X(020).
000560 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚P 
                                             PIC  X(012).
000570 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|‰ñ” PIC  X(001).
000580 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Á”ïÅŠz‚P 
                                             PIC S9(013) COMP-3.
000590 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|Á”ïÅŠz‚Q 
                                             PIC S9(013) COMP-3.
000600 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ƒŠ[ƒX—¿‚P 
                                             PIC S9(013) COMP-3.
000610 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|ƒŠ[ƒX—¿‚Q 
                                             PIC S9(013) COMP-3.
000620 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|—\”õ PIC  X(010).
000630 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚r‚d‚h‚j‚x‚t|’[––”Ô† 
                                             PIC  X(016).
