000010************************************************
000020* (KEI_WK_EDA_THUMON)
000030************************************************
000040 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000060 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|’[––”Ô† PIC  X(016).
000070 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000080 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Œ_–ñ“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|ŒŸŽû—\’è“ú PIC  X(008).
000110 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|[“–|‘ŠŽE‹æ•ª 
                                             PIC  X(001).
000120 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|‘O“n‹à‹æ•ª PIC  X(001).
000130 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|w“üæ–¼ PIC  X(060).
000140 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|w“üæZŠ PIC  X(100).
000150 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000170 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ŒJ‰„‹àŠz‚P 
                                             PIC S9(013) COMP-3.
000180 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ðŒ•¶Œ¾‚P 
                                             PIC  X(040).
000190 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ŒJ‰„‹àŠz‚Q 
                                             PIC S9(013) COMP-3.
000200 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ðŒ•¶Œ¾‚Q 
                                             PIC  X(040).
000210 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ŒJ‰„‹àŠz‚R 
                                             PIC S9(013) COMP-3.
000220 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ðŒ•¶Œ¾‚R 
                                             PIC  X(040).
000230 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ŒJ‰„‹àŠz‚S 
                                             PIC S9(013) COMP-3.
000240 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ðŒ•¶Œ¾‚S 
                                             PIC  X(040).
000250 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ŒJ‰„‹àŠz‚T 
                                             PIC S9(013) COMP-3.
000260 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|Žx•¥ðŒ•¶Œ¾‚T 
                                             PIC  X(040).
000270 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|“s“¹•{Œ§ PIC  X(010).
000280 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|ZŠ‚P PIC  X(040).
000290 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m|ZŠ‚Q PIC  X(040).
