000010************************************************
000020* (KEI_WK_YOTEI3)
000030************************************************
000040 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|˜A”Ô PIC S9(003) COMP-3.
000060 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|’[––”Ô† PIC  X(016).
000070 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|‰ñ”‚P PIC S9(003) COMP-3.
000080 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|Žx•¥Šú“ú‚P PIC  X(010).
000090 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|Žx•¥‹àŠz‚P PIC S9(013) COMP-3.
000100 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|Žx•¥Žc‚‚P PIC S9(013) COMP-3.
000110 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|‰ñ”‚Q PIC S9(003) COMP-3.
000120 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|Žx•¥Šú“ú‚Q PIC  X(010).
000130 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|Žx•¥‹àŠz‚Q PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚R|Žx•¥Žc‚‚Q PIC S9(013) COMP-3.
