000010************************************************
000020* (KEI_LOST)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚n‚r‚s|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚n‚r‚s|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚j‚d‚h|‚k‚n‚r‚s|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚j‚d‚h|‚k‚n‚r‚s|ŒÚ‹qƒR[ƒh PIC  X(006).
000080 01  ‚j‚d‚h|‚k‚n‚r‚s|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚j‚d‚h|‚k‚n‚r‚s|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000100 01  ‚j‚d‚h|‚k‚n‚r‚s|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000110 01  ‚j‚d‚h|‚k‚n‚r‚s|Œ_–ñ“ú PIC  X(008).
000120 01  ‚j‚d‚h|‚k‚n‚r‚s|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000130 01  ‚j‚d‚h|‚k‚n‚r‚s|ŽÐ“à‹à—˜ PIC S9(002)V9(2) COMP-3.
000140 01  ‚j‚d‚h|‚k‚n‚r‚s|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚k‚n‚r‚s|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚k‚n‚r‚s|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000170 01  ‚j‚d‚h|‚k‚n‚r‚s|‘e—˜‰v PIC S9(013) COMP-3.
000180 01  ‚j‚d‚h|‚k‚n‚r‚s|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000190 01  ‚j‚d‚h|‚k‚n‚r‚s|•¨Œ–¼ PIC  X(060).
000200 01  ‚j‚d‚h|‚k‚n‚r‚s|Žó’ƒŠ[ƒX‰ïŽÐ PIC  X(040).
000210 01  ‚j‚d‚h|‚k‚n‚r‚s|‘¼ŽÐŽó’—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000220 01  ‚j‚d‚h|‚k‚n‚r‚s|ƒƒXƒg——R‹æ•ª PIC  X(002).
000230 01  ‚j‚d‚h|‚k‚n‚r‚s|ƒƒXƒgˆÄŒ–ž—¹“ú PIC  X(008).
000240 01  ‚j‚d‚h|‚k‚n‚r‚s|ƒƒXƒgƒRƒƒ“ƒg PIC  X(100).
000250 01  ‚j‚d‚h|‚k‚n‚r‚s|“o˜^“ú PIC  X(008).
000260 01  ‚j‚d‚h|‚k‚n‚r‚s|“o˜^Žž PIC  X(006).
000270 01  ‚j‚d‚h|‚k‚n‚r‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000280 01  ‚j‚d‚h|‚k‚n‚r‚s|XV“ú PIC  X(008).
000290 01  ‚j‚d‚h|‚k‚n‚r‚s|XVŽž PIC  X(006).
000300 01  ‚j‚d‚h|‚k‚n‚r‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
