000010************************************************
000020* (KEI_KIHON)
000030************************************************
000040 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|âg‹c‚m‚n PIC  X(010).
000070 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|âg‹c‹æ•ª PIC  X(001).
000080 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Žæˆøæ‹æ•ª PIC  X(001).
000090 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000100 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000110 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Žæˆøæ–¼ PIC  X(060).
000120 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000130 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000140 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Â–±‹¦’²ƒR[ƒh PIC  X(002).
000150 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000160 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000170 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|•¨ŒŠm”FŠî€ PIC  X(001).
000180 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|•¨Œ” PIC S9(003) COMP-3.
000190 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|w“üæ” PIC S9(001) COMP-3.
000200 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000210 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒŸŽû—\’è“ú PIC  X(008).
000220 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000230 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒvŽZ•ûŽ® PIC  X(001).
000240 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000250 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000260 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
000270 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|˜’uŒŽ” PIC S9(002)V9(2) COMP-3.
000280 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‘OŽóŒŽ” PIC S9(002) COMP-3.
000290 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(2) COMP-3.
000300 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒŽŠz•½‹Ï•ÛŽç—¿ PIC S9(013) COMP-3.
000310 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‚»‚Ì‘¼””ï—p‘Šz PIC S9(013) COMP-3.
000320 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‘O“n‹à—˜‘§ PIC S9(013) COMP-3.
000330 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000340 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Á”ïÅ’¥Žû‹æ•ª PIC  X(001).
000350 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000360 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000370 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000380 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|’P”N“xŒ_–ñ PIC  X(002).
000390 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|[“–|‘ŠŽE‹æ•ª PIC  X(001).
000400 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‘O“n‹à‹æ•ª PIC  X(001).
000410 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ÄƒŠ[ƒX—¿•\Ž¦‹æ•ª PIC  X(001).
000420 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ÄƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000430 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|•ÛŽçŒ_–ñæ–¼ PIC  X(060).
000440 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‘¹ŠQ”…ž‹à•¶Œ¾ PIC  X(136).
000450 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|“Á–ñ PIC  X(800).
000460 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000470 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Žc‰¿Šz‡Œv PIC S9(013) COMP-3.
000480 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000490 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000500 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‘e—˜‰v PIC S9(013) COMP-3.
000510 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000520 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿—¦ PIC S9(002)V9(8) COMP-3.
000530 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿—¦ PIC S9(002)V9(8) COMP-3.
000540 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅ‘Šz PIC S9(013) COMP-3.
000550 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯—¿‘Šz PIC S9(013) COMP-3.
000560 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚P PIC S9(013) COMP-3.
000570 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚Q PIC S9(013) COMP-3.
000580 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚R PIC S9(013) COMP-3.
000590 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚S PIC S9(013) COMP-3.
000600 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚T PIC S9(013) COMP-3.
000610 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚U PIC S9(013) COMP-3.
000620 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚V PIC S9(013) COMP-3.
000630 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚W PIC S9(013) COMP-3.
000640 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚X PIC S9(013) COMP-3.
000650 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚P‚O PIC S9(013) COMP-3.
000660 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚P‚P PIC S9(013) COMP-3.
000670 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚P‚Q PIC S9(013) COMP-3.
000680 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à•¨Œ‹àŠz PIC S9(013) COMP-3.
000690 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒvŽZ•û–@|‹K’è‘¹Ž¸‹à PIC  X(002).
000700 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ƒƒ“ƒRƒ~•t‹c‚m‚n PIC  X(007).
000710 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒˆÏ‹æ•ª PIC  X(001).
000720 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‚a‚d‚f‚h‚m‰ñ” PIC  X(001).
000730 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‰‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000740 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|I‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000750 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000760 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒŽŠzŒÅ’èŽ‘ŽYÅ‘Šz PIC S9(013) COMP-3.
000770 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒŽŠz“®‘•ÛŒ¯—¿‘Šz PIC S9(013) COMP-3.
000780 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒŽŠz‘OŽóƒƒŠƒbƒg PIC S9(013) COMP-3.
000790 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŒŽŠzŒJ‰„ƒƒŠƒbƒg PIC S9(013) COMP-3.
000800 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|ŽÀŽ¿ƒŠ[ƒX—¿‚o‚u PIC S9(013) COMP-3.
000810 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Žc‰¿‚o‚u PIC S9(013) COMP-3.
000820 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|Š²Ž–|”ñŠ²Ž–‹æ•ª PIC  X(001).
000830 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‚n‚o‚d‚m|‚b‚k‚n‚r‚d‹æ•ª PIC  X(001).
000840 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|‹¦’²‰ñŽûŽè‡ PIC  X(001).
000850 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000860 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000870 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000880 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000890 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000900 01  ‚j‚d‚h|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
