000010************************************************
000020* (KEI_MONGON)
000030************************************************
000040 01  ‚j‚d‚h|‚l‚n‚m‚f‚n‚m|Žx•¥ðŒƒR[ƒh PIC  X(002).
000050 01  ‚j‚d‚h|‚l‚n‚m‚f‚n‚m|Žx•¥ðŒ PIC  X(060).
000060 01  ‚j‚d‚h|‚l‚n‚m‚f‚n‚m|“o˜^“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚l‚n‚m‚f‚n‚m|“o˜^Žž PIC  X(006).
000080 01  ‚j‚d‚h|‚l‚n‚m‚f‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚l‚n‚m‚f‚n‚m|XV“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚l‚n‚m‚f‚n‚m|XVŽž PIC  X(006).
000110 01  ‚j‚d‚h|‚l‚n‚m‚f‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
