000010************************************************
000020* (KEI_LPWK_KEI_MEISAI)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j˜A”Ô 
                                             PIC S9(005) COMP-3.
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|’[––”Ô† 
                                             PIC  X(016).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|•¨Œ‚m‚n 
                                             PIC  X(003).
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|•¨Œ–¼|Š¿Žš 
                                             PIC  X(040).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žd—l»‘¢”Ô† 
                                             PIC  X(020).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|»‘¢‹ÆŽÒ 
                                             PIC  X(060).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|’P‰¿ 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|”—Ê 
                                             PIC S9(004) COMP-3.
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|w“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Ž‘ŽYƒR[ƒh 
                                             PIC  X(007).
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Œ^Ž®”Ô† 
                                             PIC  X(015).
000180 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Å‹æ•ª 
                                             PIC  X(001).
000190 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Å•‰’SƒR[ƒh 
                                             PIC  X(001).
000200 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼|Š¿Žš 
                                             PIC  X(040).
000210 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|”[•tæƒR[ƒh 
                                             PIC  X(006).
000220 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Ý’uêŠZŠ 
                                             PIC  X(100).
000230 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žw’è“dŽqŒvŽZ‹@ 
                                             PIC  X(040).
000240 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žg—pŒ Ý’èŽÒ 
                                             PIC  X(060).
000250 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ŒvŽZ•ûŽ® 
                                             PIC  X(001).
000260 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žæˆøæ–¼ 
                                             PIC  X(060).
000270 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|w“üæ–¼ 
                                             PIC  X(060).
000280 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|w“üæZŠ 
                                             PIC  X(100).
000290 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|w“üæw“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000300 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|w“üæŽd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000310 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|•¨Œ–¾×” 
                                             PIC S9(005) COMP-3.
000320 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Œ_–ñ“ú PIC  X(008).
000330 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ŒŸŽû—\’è“ú 
                                             PIC  X(008).
000340 01  ‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
