000010************************************************
000020* (KEI_EDA_WK_THUMON2)
000030************************************************
000040 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000060 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|’[––”Ô† PIC  X(016).
000070 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ŒJ‰„‹àŠz‚P 
                                             PIC S9(013) COMP-3.
000080 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ðŒ•¶Œ¾‚P 
                                             PIC  X(040).
000090 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ŒJ‰„‹àŠz‚Q 
                                             PIC S9(013) COMP-3.
000100 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ðŒ•¶Œ¾‚Q 
                                             PIC  X(040).
000110 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ŒJ‰„‹àŠz‚R 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ðŒ•¶Œ¾‚R 
                                             PIC  X(040).
000130 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ŒJ‰„‹àŠz‚S
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ðŒ•¶Œ¾‚S 
                                             PIC  X(040).
000150 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ŒJ‰„‹àŠz‚T 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚Q|Žx•¥ðŒ•¶Œ¾‚T 
                                             PIC  X(040).
