000010************************************************
000020* (KEI_KIHON_IMP)
000030************************************************
000040 01  KEI_KIHON_IMP-WD1 PIC  X(009).
000050 01  KEI_KIHON_IMP-WD2 PIC  X(004).
000060 01  KEI_KIHON_IMP-WD3 PIC  X(010).
000070 01  KEI_KIHON_IMP-WD4 PIC  X(001).
000080 01  KEI_KIHON_IMP-WD5 PIC  X(001).
000090 01  KEI_KIHON_IMP-WD6 PIC  X(008).
000100 01  KEI_KIHON_IMP-WD7 PIC  X(006).
000110 01  KEI_KIHON_IMP-WD8 PIC  X(060).
000120 01  KEI_KIHON_IMP-WD9 PIC  X(004).
000130 01  KEI_KIHON_IMP-WD10 PIC  X(002).
000140 01  KEI_KIHON_IMP-WD11 PIC  X(002).
000150 01  KEI_KIHON_IMP-WD12 PIC  X(002).
000160 01  KEI_KIHON_IMP-WD13 PIC  X(001).
000170 01  KEI_KIHON_IMP-WD14 PIC  X(001).
000180 01  KEI_KIHON_IMP-WD15 PIC  X(003).
000190 01  KEI_KIHON_IMP-WD16 PIC  X(001).
000200 01  KEI_KIHON_IMP-WD17 PIC  X(008).
000210 01  KEI_KIHON_IMP-WD18 PIC  X(008).
000220 01  KEI_KIHON_IMP-WD19 PIC  X(008).
000230 01  KEI_KIHON_IMP-WD20 PIC  X(001).
000240 01  KEI_KIHON_IMP-WD21 PIC  X(003).
000250 01  KEI_KIHON_IMP-WD22 PIC  X(002).
000260 01  KEI_KIHON_IMP-WD23 PIC  X(003).
000270 01  KEI_KIHON_IMP-WD24 PIC  X(005).
000280 01  KEI_KIHON_IMP-WD25 PIC  X(002).
000290 01  KEI_KIHON_IMP-WD26 PIC  X(005).
000300 01  KEI_KIHON_IMP-WD27 PIC  X(013).
000310 01  KEI_KIHON_IMP-WD28 PIC  X(013).
000320 01  KEI_KIHON_IMP-WD29 PIC  X(013).
000330 01  KEI_KIHON_IMP-WD30 PIC  X(004).
000340 01  KEI_KIHON_IMP-WD31 PIC  X(001).
000350 01  KEI_KIHON_IMP-WD32 PIC  X(013).
000360 01  KEI_KIHON_IMP-WD33 PIC  X(013).
000370 01  KEI_KIHON_IMP-WD34 PIC  X(002).
000380 01  KEI_KIHON_IMP-WD35 PIC  X(002).
000390 01  KEI_KIHON_IMP-WD36 PIC  X(001).
000400 01  KEI_KIHON_IMP-WD37 PIC  X(001).
000410 01  KEI_KIHON_IMP-WD38 PIC  X(001).
000420 01  KEI_KIHON_IMP-WD39 PIC  X(013).
000430 01  KEI_KIHON_IMP-WD40 PIC  X(060).
000440 01  KEI_KIHON_IMP-WD41 PIC  X(800).
000450 01  KEI_KIHON_IMP-WD42 PIC  X(013).
000460 01  KEI_KIHON_IMP-WD43 PIC  X(013).
000470 01  KEI_KIHON_IMP-WD44 PIC  X(011).
000480 01  KEI_KIHON_IMP-WD45 PIC  X(011).
000490 01  KEI_KIHON_IMP-WD46 PIC  X(013).
000500 01  KEI_KIHON_IMP-WD47 PIC  X(013).
000510 01  KEI_KIHON_IMP-WD48 PIC  X(011).
000520 01  KEI_KIHON_IMP-WD49 PIC  X(011).
000530 01  KEI_KIHON_IMP-WD50 PIC  X(013).
000540 01  KEI_KIHON_IMP-WD51 PIC  X(013).
000550 01  KEI_KIHON_IMP-WD52 PIC  X(013).
000560 01  KEI_KIHON_IMP-WD53 PIC  X(013).
000570 01  KEI_KIHON_IMP-WD54 PIC  X(013).
000580 01  KEI_KIHON_IMP-WD55 PIC  X(013).
000590 01  KEI_KIHON_IMP-WD56 PIC  X(013).
000600 01  KEI_KIHON_IMP-WD57 PIC  X(013).
000610 01  KEI_KIHON_IMP-WD58 PIC  X(013).
000620 01  KEI_KIHON_IMP-WD59 PIC  X(013).
000630 01  KEI_KIHON_IMP-WD60 PIC  X(013).
000640 01  KEI_KIHON_IMP-WD61 PIC  X(013).
000650 01  KEI_KIHON_IMP-WD62 PIC  X(013).
000660 01  KEI_KIHON_IMP-WD63 PIC  X(013).
000670 01  KEI_KIHON_IMP-WD64 PIC  X(013).
000680 01  KEI_KIHON_IMP-WD65 PIC  X(002).
000690 01  KEI_KIHON_IMP-WD66 PIC  X(007).
000700 01  KEI_KIHON_IMP-WD67 PIC  X(001).
000710 01  KEI_KIHON_IMP-WD68 PIC  X(001).
000720 01  KEI_KIHON_IMP-WD69 PIC  X(013).
000730 01  KEI_KIHON_IMP-WD70 PIC  X(013).
