000010************************************************
000020* (KEI_LPWK_BACKDATE)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|Žæˆøæ–¼ PIC  X(060).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|ŒŸŽû“ú PIC  X(008).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|Š¨’èˆ—ƒR[ƒh
                                             PIC  X(002).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|w“ü‹àŠz‡Œv
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|Žd“üÁ”ïÅ‡Œv 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|[“–|‘ŠŽE‹æ•ª 
                                             PIC  X(001).
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|ŒvŽZ•ûŽ® PIC  X(001).
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000180 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000190 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|‘æ‚P‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000200 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000210 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|‘æ‚Q‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000220 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|‚a‚d‚f‚h‚m‰ñ” 
                                             PIC  X(001).
000230 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|‘e—˜‰v 
                                             PIC S9(013) COMP-3.
000240 01  ‚j‚d‚h|‚k‚o‚v‚j|‚a‚`‚b‚j‚c‚`‚s‚d|ˆ—“ú PIC  X(008).
