000010************************************************
000020* (KOK_HSZAN)
000030************************************************
000040 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000060 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒOƒ‹[ƒvƒR[ƒh PIC  X(008).
000070 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000080 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒOƒ‹[ƒv|‘OŒŽ––Œ_–ñŒ” PIC  X(006).
000100 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒOƒ‹[ƒv|‘OŒŽ––ÂŒ Žc‚ 
                                             PIC S9(013) COMP-3.
000110 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒOƒ‹[ƒv|“–ŒŽŒŸŽûŒ” PIC  X(006).
000120 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒOƒ‹[ƒv|“–ŒŽŒŸŽû‹àŠz 
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒOƒ‹[ƒv|“–ŒŽ‰ñŽûŠz 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒOƒ‹[ƒv|‘OŽóƒŠ[ƒX—¿Žc‚ 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|–¼Šñ‚¹|‘OŒŽ––Œ_–ñŒ” PIC  X(006).
000160 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|–¼Šñ‚¹|‘OŒŽ––ÂŒ Žc‚ 
                                             PIC S9(013) COMP-3.
000170 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|–¼Šñ‚¹|“–ŒŽŒŸŽûŒ” PIC  X(006).
000180 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|–¼Šñ‚¹|“–ŒŽŒŸŽû‹àŠz 
                                             PIC S9(013) COMP-3.
000190 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|–¼Šñ‚¹|“–ŒŽ‰ñŽûŠz PIC S9(013) COMP-3.
000200 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|–¼Šñ‚¹|‘OŽóƒŠ[ƒX—¿Žc‚ 
                                             PIC S9(013) COMP-3.
000210 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒ†[ƒU[|‘OŒŽ––Œ_–ñŒ” PIC  X(006).
000220 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒ†[ƒU[|‘OŒŽ––ÂŒ Žc‚ 
                                             PIC S9(013) COMP-3.
000230 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒ†[ƒU[|“–ŒŽŒŸŽûŒ” PIC  X(006).
000240 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒ†[ƒU[|“–ŒŽŒŸŽû‹àŠz 
                                             PIC S9(013) COMP-3.
000250 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒ†[ƒU[|“–ŒŽ‰ñŽûŠz 
                                             PIC S9(013) COMP-3.
000260 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ƒ†[ƒU[|‘OŽóƒŠ[ƒX—¿Žc‚ 
                                             PIC S9(013) COMP-3.
000270 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|ŽåŠÇŽ–‹ÆŠƒR[ƒh PIC  X(004).
000280 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|Ši•t PIC  X(003).
000290 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|“o˜^“ú PIC  X(008).
000300 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|“o˜^Žž PIC  X(006).
000310 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000320 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|XV“ú PIC  X(008).
000330 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|XVŽž PIC  X(006).
000340 01  ‚j‚n‚j|‚g‚r‚y‚`‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
