000010************************************************
000020* (KOK_HOUMON)
000030************************************************
000040 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|–Ê’k“ú PIC  X(008).
000060 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|Œß‘OŒßŒã PIC  X(001).
000070 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|ŽæˆøŒ©ž‚Ý‹æ•ª PIC  X(001).
000080 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|Hì•ûj‹æ•ª PIC  X(001).
000090 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|–K–â–Ú“I‹æ•ª PIC  X(001).
000100 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|æ•û’S“–ŽÒ‚P PIC  X(014).
000110 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|–ðE’S“–‚P PIC  X(014).
000120 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|æ•û’S“–ŽÒ‚Q PIC  X(014).
000130 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|–ðE’S“–‚Q PIC  X(014).
000140 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|æ•û’S“–ŽÒ‚R PIC  X(014).
000150 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|–ðE’S“–‚R PIC  X(014).
000160 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|“–ŽÐ–Ê’kŽÒ‚P PIC  X(014).
000170 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|“–ŽÐ–Ê’kŽÒ‚Q PIC  X(014).
000180 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|“–ŽÐ–Ê’kŽÒ‚R PIC  X(014).
000190 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|–Ê’k“à—e PIC  X(2000).
000200 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|Ž©—Rƒƒ‚ PIC  X(100).
000210 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|–K–âŽÒ–¼ PIC  X(020).
000220 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|“o˜^“ú PIC  X(008).
000230 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|“o˜^Žž PIC  X(006).
000240 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000250 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|XV“ú PIC  X(008).
000260 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|XVŽž PIC  X(006).
000270 01  ‚j‚n‚j|‚g‚n‚t‚l‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
