000010************************************************
000020* (KOK_KIHON)
000030************************************************
000040 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ƒT[ƒo[”Ô† PIC  X(002).
000060 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000080 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|Žæˆøæ–¼Š¿Žš PIC  X(060).
000090 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|Žæˆøæ–¼ƒJƒi PIC  X(030).
000100 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|e‰ïŽÐ–¼ PIC  X(060).
000110 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|Žæˆøæ•”–¼ PIC  X(040).
000120 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|—X•Ö”Ô†‚RŒ… PIC  X(003).
000130 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|—X•Ö”Ô†‚SŒ… PIC  X(004).
000140 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|“s“¹•{Œ§ PIC  X(010).
000150 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ZŠ‚P PIC  X(040).
000160 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ZŠ‚Q PIC  X(040).
000170 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|“d˜b”Ô† PIC  X(015).
000180 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|‚e‚`‚w”Ô† PIC  X(015).
000190 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ƒz[ƒ€ƒy[ƒWƒAƒhƒŒƒX PIC  X(040).
000200 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ãê‹æ•ª PIC  X(001).
000210 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|‘åŠé‹ÆƒR[ƒh PIC  X(001).
000220 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|]‹Æˆõ” PIC S9(006) COMP-3.
000230 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|‚a‚s‚lŽæˆø‹æ•ª PIC  X(001).
000240 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|‚a‚s‚l’S“–•”“X PIC  X(030).
000250 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|—˜—pƒŠ[ƒX‰ïŽÐ PIC  X(070).
000260 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|–{ŽÐ—X•Ö”Ô†‚RŒ… PIC  X(003).
000270 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|–{ŽÐ—X•Ö”Ô†‚SŒ… PIC  X(004).
000280 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|–{ŽÐ“s“¹•{Œ§ PIC  X(010).
000290 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|–{ŽÐZŠ‚P PIC  X(040).
000300 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|–{ŽÐZŠ‚Q PIC  X(040).
000310 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|–{ŽÐ“d˜b”Ô† PIC  X(015).
000320 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|–{ŽÐ‚e‚`‚w”Ô† PIC  X(015).
000330 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|‹ÆŽí PIC  X(030).
000340 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|Ž‘–{‹à PIC S9(006) COMP-3.
000350 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ŽæˆøŠJŽn“ú PIC  X(008).
000360 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ŽæˆøŽí—Þ PIC  X(030).
000370 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|Ý—§”NŒŽ“ú PIC  X(008).
000380 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ŒˆŽZŒŽ PIC  X(002).
000390 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ƒNƒŒƒ‰ƒCƒ“ŠúŒÀ”NŒŽ PIC  X(002).
000400 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ŒˆŽZ”NŒŽ PIC  X(006).
000410 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|”„ã‚ PIC S9(013) COMP-3.
000420 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|Œoí—˜‰v PIC S9(013) COMP-3.
000430 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|“–Šú—˜‰v PIC S9(013) COMP-3.
000440 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|\Š“¾ PIC S9(013) COMP-3.
000450 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|Ž©ŒÈŽ‘–{ PIC S9(013) COMP-3.
000460 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|‘Ž‘ŽY PIC S9(013) COMP-3.
000470 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000480 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000490 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|’é‘ƒR[ƒh PIC  X(010).
000500 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|’é‘“_” PIC  X(003).
000510 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|‹ÆŽíƒR[ƒh PIC  X(002).
000520 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|•ÏXƒtƒ‰ƒO PIC  X(001).
000530 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ŒÚ‹q‹æ•ª PIC  X(001).
000540 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000550 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000560 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000570 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000580 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000590 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000600 01  ‚j‚n‚j|‚j‚h‚g‚n‚m|ƒOƒ‹[ƒvƒR[ƒh PIC  X(008).
