000010************************************************
000020* (KSL_WK_ERR2)
000030************************************************
000040 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚Q|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚Q|“à—e PIC  X(060).
000060 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚Q|•¨Œ‚m‚n PIC  X(004).
000070 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚Q|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000080 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚Q|‚q‚d‚e‚m‚n‚P PIC S9(013) COMP-3.
000090 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚Q|ƒ`ƒFƒbƒN PIC  X(001).
