000010************************************************
000020* (LCF_CLTMST)
000030************************************************
000040 01  LCF-CLTMST-CLTCOD PIC  X(007).
000050 01  LCF-CLTMST-CLTNAM PIC  X(040).
000060 01  LCF-CLTMST-BNKCOD PIC  X(004).
000070 01  LCF-CLTMST-BRCCOD PIC  X(003).
000080 01  LCF-CLTMST-DEPKND PIC  X(001).
000090 01  LCF-CLTMST-DEPNUM PIC  X(007).
000100 01  LCF-CLTMST-DEPNAM PIC  X(040).
