000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(’ZkƒR[ƒh•ÏŠ·E‹âsŒûÀ)(LTRCDM0030)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(001).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|’ZkƒR[ƒh PIC  X(002).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(008).
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|‹âsƒR[ƒh‚P PIC  X(007).
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|—a‹àŽí—Þ‚P PIC  X(001).
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ŒûÀ”Ô†‚P PIC  X(007).
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ƒ_ƒ~[‚P PIC  X(008).
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|‹âsƒR[ƒh‚Q PIC  X(007).
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|—a‹àŽí—Þ‚Q PIC  X(001).
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ŒûÀ”Ô†‚Q PIC  X(007).
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ƒ_ƒ~[‚Q PIC  X(008).
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|‹âsƒR[ƒh‚R PIC  X(007).
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|—a‹àŽí—Þ‚R PIC  X(001).
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ŒûÀ”Ô†‚R PIC  X(007).
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ƒ_ƒ~[‚R PIC  X(008).
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|‹âsƒR[ƒh‚S PIC  X(007).
000290 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|—a‹àŽí—Þ‚S PIC  X(001).
000300 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ŒûÀ”Ô†‚S PIC  X(007).
000310 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ƒ_ƒ~[‚S PIC  X(008).
000320 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000340 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|‹âsƒR[ƒh‚T PIC  X(007).
000350 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|—a‹àŽí—Þ‚T PIC  X(001).
000360 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ŒûÀ”Ô†‚T PIC  X(007).
000370 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|ƒ_ƒ~[‚T PIC  X(008).
000380 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚R‚O|‹¤’Êî•ñ PIC  X(035).
