000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(“®‘’ZŠú—¿—¦ƒƒ“ƒo[)(LTRCDT1120)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(011).
000060 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I 
                                             PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú 
                                             PIC  X(006).
000080 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|“K—pŒp‘±‹æ•ª PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔŒŽ”‚P PIC S9(002) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔ“ú”‚P PIC S9(002) COMP-3.
000110 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|“®‘’ZŠú•ÛŒ¯—¿—¦‚P 
                                             PIC S9(004)V9(6) COMP-3.
000120 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ƒ_ƒ~[‚P PIC  X(002).
000130 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔŒŽ”‚Q PIC S9(002) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔ“ú”‚Q PIC S9(002) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|“®‘’ZŠú•ÛŒ¯—¿—¦‚Q 
                                             PIC S9(004)V9(6) COMP-3.
000160 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ƒ_ƒ~[‚Q PIC  X(002).
000170 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔŒŽ”‚R PIC S9(002) COMP-3.
000180 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔ“ú”‚R PIC S9(002) COMP-3.
000190 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|“®‘’ZŠú•ÛŒ¯—¿—¦‚R 
                                             PIC S9(004)V9(6) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ƒ_ƒ~[‚R PIC  X(002).
000210 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔŒŽ”‚S PIC S9(002) COMP-3.
000220 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔ“ú”‚S PIC S9(002) COMP-3.
000230 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|“®‘’ZŠú•ÛŒ¯—¿—¦‚S 
                                             PIC S9(004)V9(6) COMP-3.
000240 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ƒ_ƒ~[‚S PIC  X(002).
000250 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔŒŽ”‚T PIC S9(002) COMP-3.
000260 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ŠùŒo‰ßŠúŠÔ“ú”‚T PIC S9(002) COMP-3.
000270 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|“®‘’ZŠú•ÛŒ¯—¿—¦‚T 
                                             PIC S9(004)V9(6) COMP-3.
000280 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ƒ_ƒ~[‚T PIC  X(002).
000290 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(002).
000300 01  ‚k‚s‚q‚b‚c‚s‚P‚P‚Q‚O|‹¤’Êî•ñ PIC  X(035).
