000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(ŽèŒ`ˆóŽ†Å)(LTRCDM1430)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚R‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚R‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(011).
000060 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚R‚O|“K—p“ú|¢‹I PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚R‚O|“K—p“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚R‚O|‹Œƒe[ƒuƒ‹ PIC S9(003) COMP-3.
000090 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚R‚O|Vƒe[ƒuƒ‹ PIC S9(003) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚R‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(139).
000110 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚R‚O|‹¤’Êî•ñ PIC  X(035).
