000010************************************************
000020* Œ_–ñi•¨Œî•ñj(LTRKEB)
000030************************************************
000040 01  ‚k‚s‚q‚j‚d‚a|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚j‚d‚a|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚j‚d‚a|‚j‚d‚x€–Ú•¨Œ”Ô† PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚j‚d‚a|•¨Œ–¼Š¿Žš PIC  X(060).
000080 01  ‚k‚s‚q‚j‚d‚a|•¨Œ–¼ƒJƒi PIC  X(030).
000090 01  ‚k‚s‚q‚j‚d‚a|Žd—l»‘¢”Ô† PIC  X(020).
000100 01  ‚k‚s‚q‚j‚d‚a|”—Ê PIC S9(004) COMP-3.
000110 01  ‚k‚s‚q‚j‚d‚a|w“üæƒR[ƒh PIC  X(008).
000120 01  ‚k‚s‚q‚j‚d‚a|w“ü‹àŠz PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚j‚d‚a|ƒfƒB[ƒ‰[ PIC  X(005).
000140 01  ‚k‚s‚q‚j‚d‚a|Žc‰¿•ÛØ‹æ•ª PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚j‚d‚a|Žc‰¿•ÛØæƒR[ƒh PIC  X(008).
000160 01  ‚k‚s‚q‚j‚d‚a|Žc‰¿•ÛØæ–¼Š¿Žš PIC  X(060).
000170 01  ‚k‚s‚q‚j‚d‚a|Žc‰¿Šz PIC S9(013) COMP-3.
000180 01  ‚k‚s‚q‚j‚d‚a|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚j‚d‚a|ƒ_ƒ~[‚O‚O‚P PIC  X(025).
000200 01  ‚k‚s‚q‚j‚d‚a|Ž‘ŽYƒR[ƒh PIC S9(007) COMP-3.
000210 01  ‚k‚s‚q‚j‚d‚a|‘Ï—p”N” PIC S9(002) COMP-3.
000220 01  ‚k‚s‚q‚j‚d‚a|ŠúŠÔ PIC  X(002).
000230 01  ‚k‚s‚q‚j‚d‚a|•ªŽq PIC S9(002) COMP-3.
000240 01  ‚k‚s‚q‚j‚d‚a|•ª•ê PIC S9(003) COMP-3.
000250 01  ‚k‚s‚q‚j‚d‚a|’†ŒÃŽ‘ŽYƒR[ƒh PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚j‚d‚a|”[•tæƒR[ƒh PIC  X(006).
000270 01  ‚k‚s‚q‚j‚d‚a|Å‹æ•ª PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚j‚d‚a|Å•‰’SƒR[ƒh PIC  X(001).
000290 01  ‚k‚s‚q‚j‚d‚a|‘Ï—p”N”’Zk PIC  X(001).
000300 01  ‚k‚s‚q‚j‚d‚a|Ý’uêŠ–¼Š¿Žš PIC  X(040).
000310 01  ‚k‚s‚q‚j‚d‚a|Ý’uêŠ–¼ƒJƒi PIC  X(020).
000320 01  ‚k‚s‚q‚j‚d‚a|e PIC  X(003).
000330 01  ‚k‚s‚q‚j‚d‚a|Žq PIC  X(004).
000340 01  ‚k‚s‚q‚j‚d‚a|Ý’uêŠZŠŠ¿Žš PIC  X(100).
000350 01  ‚k‚s‚q‚j‚d‚a|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000360 01  ‚k‚s‚q‚j‚d‚a|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000370 01  ‚k‚s‚q‚j‚d‚a|•t•Û‹æ•ª PIC  X(001).
000380 01  ‚k‚s‚q‚j‚d‚a|ƒŠ[ƒX‚w‚w‹æ•ª PIC  X(001).
000390 01  ‚k‚s‚q‚j‚d‚a|‹@ŠB‹æ•ª PIC  X(002).
000400 01  ‚k‚s‚q‚j‚d‚a|‹@Ží‹æ•ª PIC  X(002).
000410 01  ‚k‚s‚q‚j‚d‚a|Œ^Ž®”Ô† PIC  X(015).
000420 01  ‚k‚s‚q‚j‚d‚a|Žd“üÁ”ïÅŠz PIC S9(013) COMP-3.
000430 01  ‚k‚s‚q‚j‚d‚a|ƒ_ƒ~[‚O‚O‚Q PIC  X(030).
000440 01  ‚k‚s‚q‚j‚d‚a|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P PIC  X(012).
000450 01  ‚k‚s‚q‚j‚d‚a|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚Q PIC  X(012).
000460 01  ‚k‚s‚q‚j‚d‚a|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚R PIC  X(012).
000470 01  ‚k‚s‚q‚j‚d‚a|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚S PIC  X(012).
000480 01  ‚k‚s‚q‚j‚d‚a|Žx•¥æƒR[ƒh PIC  X(004).
000490 01  ‚k‚s‚q‚j‚d‚a|ƒ_ƒ~[‚O‚O‚R PIC  X(008).
000500 01  ‚k‚s‚q‚j‚d‚a|ˆ—”NŒŽ“x[¢‹I PIC  X(001).
000510 01  ‚k‚s‚q‚j‚d‚a|ˆ—”NŒŽ“x[”NŒŽ PIC  X(004).
000520 01  ‚k‚s‚q‚j‚d‚a|‹¤’Êî•ñ PIC  X(035).
