000010************************************************
000020* ŽØ“ü‹àŠÇ—iŽØ“ü‹àŠî–{j(LTRKRK)
000030************************************************
000040 01  ‚k‚s‚q‚j‚q‚j|ŠÇ—‚m‚n PIC  X(007).
000050 01  ‚k‚s‚q‚j‚q‚j|Ž}”Ô PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚j‚q‚j|“o˜^íœ PIC  X(001).
000070 01  ‚k‚s‚q‚j‚q‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000080 01  ‚k‚s‚q‚j‚q‚j|“Í—p‹æ•ª PIC  X(001).
000090 01  ‚k‚s‚q‚j‚q‚j|XV‹æ•ª PIC  X(001).
000100 01  ‚k‚s‚q‚j‚q‚j|V‹K‘‘Ö‹æ•ª PIC  X(001).
000110 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏ‹æ•ª PIC  X(001).
000120 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏ•û–@ PIC  X(001).
000130 01  ‚k‚s‚q‚j‚q‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(005).
000140 01  ‚k‚s‚q‚j‚q‚j|ŽØ“üæƒR[ƒh PIC  X(007).
000150 01  ‚k‚s‚q‚j‚q‚j|ŽØ“ü“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚j‚q‚j|ŽØ“ü“ú|ŽØ“ü“ú PIC S9(006) COMP-3.
000170 01  ‚k‚s‚q‚j‚q‚j|•¼Ží PIC  X(003).
000180 01  ‚k‚s‚q‚j‚q‚j|ŽØ“ü‹àŠz PIC S9(014)V9(2) COMP-3.
000190 01  ‚k‚s‚q‚j‚q‚j|‚d‚w‹æ•ª PIC  X(004).
000200 01  ‚k‚s‚q‚j‚q‚j|Š·ŽZ‘Šê PIC S9(004)V9(6) COMP-3.
000210 01  ‚k‚s‚q‚j‚q‚j|‰~‰Ý‹àŠz PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚j‚q‚j|‘Î‰¿‚e‚h‚w PIC  X(001).
000230 01  ‚k‚s‚q‚j‚q‚j|ŽØ“üŒ`‘Ô PIC  X(001).
000240 01  ‚k‚s‚q‚j‚q‚j|’·’Z‹æ•ª PIC  X(001).
000250 01  ‚k‚s‚q‚j‚q‚j|ŽØ“üŠ¨’èƒR[ƒh PIC  X(001).
000260 01  ‚k‚s‚q‚j‚q‚j|‘O•¥Œã•¥‹æ•ª PIC  X(001).
000270 01  ‚k‚s‚q‚j‚q‚j|—˜—¦Šî” PIC  X(001).
000280 01  ‚k‚s‚q‚j‚q‚j|•Ð’[—¼’[‹æ•ª PIC  X(001).
000290 01  ‚k‚s‚q‚j‚q‚j|’[”ˆ— PIC  X(001).
000300 01  ‚k‚s‚q‚j‚q‚j|‹à—˜•ÏXŠî€ PIC  X(001).
000310 01  ‚k‚s‚q‚j‚q‚j|ŽØ“üŽí•Ê PIC  X(001).
000320 01  ‚k‚s‚q‚j‚q‚j|”[•t‹æ•ª PIC  X(001).
000330 01  ‚k‚s‚q‚j‚q‚j|—˜‘§Šî€“ú|¢‹I PIC S9(001) COMP-3.
000340 01  ‚k‚s‚q‚j‚q‚j|—˜‘§Šî€“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000350 01  ‚k‚s‚q‚j‚q‚j|—˜—¦ PIC S9(003)V9(7) COMP-3.
000360 01  ‚k‚s‚q‚j‚q‚j|“ü‹àî•ñ’ZkƒR[ƒh PIC  X(002).
000370 01  ‚k‚s‚q‚j‚q‚j|“ü‹àŒûÀ‹âsƒR[ƒh PIC  X(007).
000380 01  ‚k‚s‚q‚j‚q‚j|“ü‹àŒûÀ—a‹àŽí–Ú PIC  X(001).
000390 01  ‚k‚s‚q‚j‚q‚j|“ü‹àŒûÀŒûÀ”Ô† PIC  X(007).
000400 01  ‚k‚s‚q‚j‚q‚j|ƒ_ƒ~[‚O‚O‚R PIC  X(015).
000410 01  ‚k‚s‚q‚j‚q‚j|Žc‚î•ñ|Œ³–{Žc‚ PIC S9(014)V9(2) COMP-3.
000420 01  ‚k‚s‚q‚j‚q‚j|Žc‚î•ñ|Š·ŽZ‘Šê PIC S9(004)V9(6) COMP-3.
000430 01  ‚k‚s‚q‚j‚q‚j|Žc‚î•ñ|‰~‰ÝŽc‚I’l PIC S9(013) COMP-3.
000440 01  ‚k‚s‚q‚j‚q‚j|Žc‚î•ñ|–¢•ÔÏ“WŠJ” PIC S9(003) COMP-3.
000450 01  ‚k‚s‚q‚j‚q‚j|Žc‚î•ñ|‘OŒŽŠ·ŽZ‘Šê 
                                             PIC S9(004)V9(6) COMP-3.
000460 01  ‚k‚s‚q‚j‚q‚j|ƒ_ƒ~[‚O‚O‚S PIC  X(010).
000470 01  ‚k‚s‚q‚j‚q‚j|‹x“ú‘Î‰ž‹æ•ª PIC  X(001).
000480 01  ‚k‚s‚q‚j‚q‚j|–ñ’è“úŒvŽZ PIC  X(001).
000490 01  ‚k‚s‚q‚j‚q‚j|‚í‚©‚¿ŒvŽZ PIC  X(001).
000500 01  ‚k‚s‚q‚j‚q‚j|—˜—¦•ÏX“ú PIC S9(002) COMP-3.
000510 01  ‚k‚s‚q‚j‚q‚j|•ÔÏŠî€“ú PIC S9(002) COMP-3.
000520 01  ‚k‚s‚q‚j‚q‚j|˜A“®‹à—˜‹æ•ª PIC  X(002).
000530 01  ‚k‚s‚q‚j‚q‚j|‚r‚o‚q‚d‚`‚c PIC S9(003)V9(5) COMP-3.
000540 01  ‚k‚s‚q‚j‚q‚j|—˜•¥ƒTƒCƒNƒ‹ PIC S9(003) COMP-3.
000550 01  ‚k‚s‚q‚j‚q‚j|‰‰ñ“à“ü“ú|¢‹I PIC S9(001) COMP-3.
000560 01  ‚k‚s‚q‚j‚q‚j|‰‰ñ“à“ü“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000570 01  ‚k‚s‚q‚j‚q‚j|“à“üƒTƒCƒNƒ‹ PIC S9(003) COMP-3.
000580 01  ‚k‚s‚q‚j‚q‚j|“à“ü‰ñ” PIC S9(003) COMP-3.
000590 01  ‚k‚s‚q‚j‚q‚j|“à“ü‹àŠz PIC S9(014)V9(2) COMP-3.
000600 01  ‚k‚s‚q‚j‚q‚j|ƒ_ƒ~[‚O‚O‚T PIC  X(015).
000610 01  ‚k‚s‚q‚j‚q‚j|Šú“ú|¢‹I PIC S9(001) COMP-3.
000620 01  ‚k‚s‚q‚j‚q‚j|Šú“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000630 01  ‚k‚s‚q‚j‚q‚j|‹à—˜•Ï“®‹æ•ª PIC  X(001).
000640 01  ‚k‚s‚q‚j‚q‚j|Ž‘ŽYŽg“r‹æ•ª PIC  X(001).
000650 01  ‚k‚s‚q‚j‚q‚j|Ž‘‹àŒ´‰¿‹æ•ª PIC  X(001).
000660 01  ‚k‚s‚q‚j‚q‚j|’S•Û‹æ•ª PIC  X(001).
000670 01  ‚k‚s‚q‚j‚q‚j|–ñ’è•ÙÏ‹æ•ª PIC  X(001).
000680 01  ‚k‚s‚q‚j‚q‚j|‚f‚`‚o•ªÍ•\‹æ•ª PIC  X(001).
000690 01  ‚k‚s‚q‚j‚q‚j|‚l‚t‚k‚s‚h‚b‚t‚q‚q‚d‚m‚b‚x PIC  X(001).
000700 01  ‚k‚s‚q‚j‚q‚j|‚o‚q‚d‚o‚`‚x‚l‚d‚m‚s PIC  X(001).
000710 01  ‚k‚s‚q‚j‚q‚j|‘I‘ð‹à—˜ŠúŠÔ PIC  X(020).
000720 01  ‚k‚s‚q‚j‚q‚j|‚q‚d‚l‚`‚q‚j‚r PIC  X(020).
000730 01  ‚k‚s‚q‚j‚q‚j|Œ´Â–±ŽØ“üæƒR[ƒh PIC  X(007).
000740 01  ‚k‚s‚q‚j‚q‚j|Œ´Â–±•¼Ží PIC  X(003).
000750 01  ‚k‚s‚q‚j‚q‚j|Œ´Â–±ŽØ“ü‹àŠz PIC S9(014)V9(2) COMP-3.
000760 01  ‚k‚s‚q‚j‚q‚j|Œ´Â–±‚d‚w‹æ•ª PIC  X(004).
000770 01  ‚k‚s‚q‚j‚q‚j|Œ´Â–±Š·ŽZ‘Šê PIC S9(003)V9(6) COMP-3.
000780 01  ‚k‚s‚q‚j‚q‚j|Œ´Â–±‰~‰Ý‹àŠz PIC S9(013) COMP-3.
000790 01  ‚k‚s‚q‚j‚q‚j|Œ´Â–±‘Î‰¿‚e‚h‚w PIC  X(001).
000800 01  ‚k‚s‚q‚j‚q‚j|Žx•¥î•ñ•ÔÏ•û–@ PIC  X(001).
000810 01  ‚k‚s‚q‚j‚q‚j|Žx•¥î•ñ’ZkƒR[ƒh PIC  X(002).
000820 01  ‚k‚s‚q‚j‚q‚j|Žx•¥ŒûÀ‹âsƒR[ƒh PIC  X(007).
000830 01  ‚k‚s‚q‚j‚q‚j|Žx•¥ŒûÀ—a‹àŽí–Ú PIC  X(001).
000840 01  ‚k‚s‚q‚j‚q‚j|Žx•¥ŒûÀŒûÀ”Ô† PIC  X(007).
000850 01  ‚k‚s‚q‚j‚q‚j|VŽØ“üŽí•Ê•ÏX“ú|¢‹I PIC S9(001) COMP-3.
000860 01  ‚k‚s‚q‚j‚q‚j|VŽØ“üŽí•Ê•ÏX“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000870 01  ‚k‚s‚q‚j‚q‚j|•ÏXŽØ“üŽí•Ê PIC  X(001).
000880 01  ‚k‚s‚q‚j‚q‚j|V”[•t‹æ•ª•ÏX“ú|¢‹I PIC S9(001) COMP-3.
000890 01  ‚k‚s‚q‚j‚q‚j|V”[•t‹æ•ª•ÏX“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000900 01  ‚k‚s‚q‚j‚q‚j|–¢‹L“ü PIC  X(001).
000910 01  ‚k‚s‚q‚j‚q‚j|ƒ_ƒ~[‚O‚O‚U PIC  X(015).
000920 01  ‚k‚s‚q‚j‚q‚j|‘‘Ö“ú|¢‹I PIC S9(001) COMP-3.
000930 01  ‚k‚s‚q‚j‚q‚j|‘‘Ö“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000940 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|ŠÇ—‚m‚n‚P PIC  X(007).
000950 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|Ž}”Ô‚P PIC S9(002) COMP-3.
000960 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|ŽØ“üŠ¨’èƒR[ƒh‚P PIC  X(001).
000970 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|Œ³–{Žc‚‚P PIC S9(013) COMP-3.
000980 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|—˜‘§Šz‚P PIC S9(013) COMP-3.
000990 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|ŠÇ—‚m‚n‚Q PIC  X(007).
001000 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|Ž}”Ô‚Q PIC S9(002) COMP-3.
001010 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|ŽØ“üŠ¨’èƒR[ƒh‚Q PIC  X(001).
001020 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|Œ³–{Žc‚‚Q PIC S9(013) COMP-3.
001030 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|—˜‘§Šz‚Q PIC S9(013) COMP-3.
001040 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|ŠÇ—‚m‚n‚R PIC  X(007).
001050 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|Ž}”Ô‚R PIC S9(002) COMP-3.
001060 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|ŽØ“üŠ¨’èƒR[ƒh‚R PIC  X(001).
001070 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|Œ³–{Žc‚‚R PIC S9(013) COMP-3.
001080 01  ‚k‚s‚q‚j‚q‚j|‹ŒŽØ“üî•ñ|—˜‘§Šz‚R PIC S9(013) COMP-3.
001090 01  ‚k‚s‚q‚j‚q‚j|‘‘Öî•ñ|‘‘Ö•û–@ PIC  X(001).
001100 01  ‚k‚s‚q‚j‚q‚j|‘‘Öî•ñ|•ÔÏ•û–@ PIC  X(001).
001110 01  ‚k‚s‚q‚j‚q‚j|‘‘Öî•ñ|’ZkƒR[ƒh PIC  X(002).
001120 01  ‚k‚s‚q‚j‚q‚j|‹âsƒR[ƒh PIC  X(007).
001130 01  ‚k‚s‚q‚j‚q‚j|—a‹àŽí–Ú PIC  X(001).
001140 01  ‚k‚s‚q‚j‚q‚j|ŒûÀ”Ô† PIC  X(007).
001150 01  ‚k‚s‚q‚j‚q‚j|ƒ_ƒ~[‚O‚O‚V PIC  X(015).
001160 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏ“ú|¢‹I PIC S9(001) COMP-3.
001170 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏ“ú|”NŒŽ“ú PIC S9(006) COMP-3.
001180 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏî•ñ|Œ³–{Žc‚ PIC S9(013) COMP-3.
001190 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏî•ñ|—˜‘§Šz PIC S9(013) COMP-3.
001200 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏî•ñ|–ß‚µ—˜‘§Šz PIC S9(014)V9(2) COMP-3.
001210 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏî•ñ|—˜—¦ PIC S9(003)V9(7) COMP-3.
001220 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏî•ñ|“ú” PIC S9(004) COMP-3.
001230 01  ‚k‚s‚q‚j‚q‚j|ŒˆÏî•ñ|–ß‚µ—˜‘§‘ŠŽEƒR[ƒh PIC  X(001).
001240 01  ‚k‚s‚q‚j‚q‚j|ƒ_ƒ~[‚O‚O‚W PIC  X(062).
001250 01  ‚k‚s‚q‚j‚q‚j|‹¤’Êî•ñ PIC  X(035).
