000010************************************************
000020* ‘Ý•t‹à(Šî–{)(LTRKGK)
000030************************************************
000040 01  ‚k‚s‚q‚j‚f‚j|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚j‚f‚j|ƒ†[ƒUƒR[ƒh PIC  X(008).
000060 01  ‚k‚s‚q‚j‚f‚j|¿‹æƒR[ƒh PIC  X(008).
000070 01  ‚k‚s‚q‚j‚f‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000080 01  ‚k‚s‚q‚j‚f‚j|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000090 01  ‚k‚s‚q‚j‚f‚j|Œ_–ñ“ú PIC  X(007).
000100 01  ‚k‚s‚q‚j‚f‚j|ŽÀs“ú PIC  X(007).
000110 01  ‚k‚s‚q‚j‚f‚j|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000120 01  ‚k‚s‚q‚j‚f‚j|ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000130 01  ‚k‚s‚q‚j‚f‚j|ŒŽ—˜•¡—˜—¦Šî–{ PIC S9(002)V9(8) COMP-3.
000140 01  ‚k‚s‚q‚j‚f‚j|‘e—˜‰v PIC S9(013) COMP-3.
000150 01  ‚k‚s‚q‚j‚f‚j|Œ³–{‘Ý•t‹àŠz PIC S9(013) COMP-3.
000160 01  ‚k‚s‚q‚j‚f‚j|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000170 01  ‚k‚s‚q‚j‚f‚j|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000180 01  ‚k‚s‚q‚j‚f‚j|ŽóŽæŽè”—¿Á”ïÅ“™Šz PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚j‚f‚j|Šú“ú PIC  X(007).
000200 01  ‚k‚s‚q‚j‚f‚j|V‹K‘‘Ö‹æ•ª PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚j‚f‚j|‘Ý•tŽí—Þ PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚j‚f‚j|’·’Z‹æ•ª PIC S9(001) COMP-3.
000230 01  ‚k‚s‚q‚j‚f‚j|Œ³–{Œ³—˜‹æ•ª PIC S9(001) COMP-3.
000240 01  ‚k‚s‚q‚j‚f‚j|—˜•¥ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000250 01  ‚k‚s‚q‚j‚f‚j|˜’uŠúŠÔ PIC S9(002)V9(2) COMP-3.
000260 01  ‚k‚s‚q‚j‚f‚j|Œ_–ñŠúŠÔ PIC S9(003) COMP-3.
000270 01  ‚k‚s‚q‚j‚f‚j|Žx•¥“ú PIC  X(007).
000280 01  ‚k‚s‚q‚j‚f‚j|Žx•¥æƒR[ƒh PIC  X(004).
000290 01  ‚k‚s‚q‚j‚f‚j|Žx•¥•û–@ƒR[ƒh PIC S9(002) COMP-3.
000300 01  ‚k‚s‚q‚j‚f‚j|Žx•¥‹âsƒR[ƒh PIC  X(007).
000310 01  ‚k‚s‚q‚j‚f‚j|Žx•¥ŒûÀ”Ô† PIC  X(007).
000320 01  ‚k‚s‚q‚j‚f‚j|Žx•¥—a‹àŽí—Þ PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚j‚f‚j|—˜—¦Šî”ƒR[ƒh PIC S9(001) COMP-3.
000340 01  ‚k‚s‚q‚j‚f‚j|—˜‘§’[”ˆ—‚b‚c PIC S9(001) COMP-3.
000350 01  ‚k‚s‚q‚j‚f‚j|‘OŽæŒãŽæ‹æ•ª PIC S9(001) COMP-3.
000360 01  ‚k‚s‚q‚j‚f‚j|•Ð’[—¼’[‹æ•ª PIC S9(001) COMP-3.
000370 01  ‚k‚s‚q‚j‚f‚j|‹à—˜•Ï“®‹æ•ª PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚j‚f‚j|˜A“®‹à—˜‹æ•ª PIC S9(002) COMP-3.
000390 01  ‚k‚s‚q‚j‚f‚j|Œ©’¼‚µƒTƒCƒNƒ‹ PIC S9(003) COMP-3.
000400 01  ‚k‚s‚q‚j‚f‚j|ƒXƒvƒŒƒbƒh PIC S9(002)V9(8) COMP-3.
000410 01  ‚k‚s‚q‚j‚f‚j|‰‰ñ“úŠ„‹æ•ª PIC S9(001) COMP-3.
000420 01  ‚k‚s‚q‚j‚f‚j|—˜—¦Šm’èŠúŒÀ PIC  X(007).
000430 01  ‚k‚s‚q‚j‚f‚j|³”F‚m‚n PIC  X(006).
000440 01  ‚k‚s‚q‚j‚f‚j|Žx•¥³”F“ú PIC  X(007).
000450 01  ‚k‚s‚q‚j‚f‚j|Žx•¥’S“–ŽÒƒR[ƒh PIC  X(004).
000460 01  ‚k‚s‚q‚j‚f‚j|ŠúŒÀ‘OŒˆÏ“ú PIC  X(007).
000470 01  ‚k‚s‚q‚j‚f‚j|–ß‚µ—˜‘§Šz PIC S9(013) COMP-3.
000480 01  ‚k‚s‚q‚j‚f‚j|•ÔÏŽè”—¿ PIC S9(013) COMP-3.
000490 01  ‚k‚s‚q‚j‚f‚j|•ÔÏŽè”—¿Á”ïÅŠz PIC S9(013) COMP-3.
000500 01  ‚k‚s‚q‚j‚f‚j|ŒˆÏŽžŒ³–{Žc‚ PIC S9(013) COMP-3.
000510 01  ‚k‚s‚q‚j‚f‚j|ŒˆÏŽž—˜‘§Šz PIC S9(013) COMP-3.
000520 01  ‚k‚s‚q‚j‚f‚j|–ß‚µ—˜—¦ PIC S9(002)V9(8) COMP-3.
000530 01  ‚k‚s‚q‚j‚f‚j|–ß‚µ“ú” PIC S9(004) COMP-3.
000540 01  ‚k‚s‚q‚j‚f‚j|–ß‚µ—˜‘§‘ŠŽEƒR[ƒh PIC S9(001) COMP-3.
000550 01  ‚k‚s‚q‚j‚f‚j|Šú“úŠÇ—ŽÀs“ú PIC  X(007).
000560 01  ‚k‚s‚q‚j‚f‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(055).
000570 01  ‚k‚s‚q‚j‚f‚j|–ñ’è•ÙÏ‹æ•ª PIC S9(001) COMP-3.
000580 01  ‚k‚s‚q‚j‚f‚j|Žx•¥ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000590 01  ‚k‚s‚q‚j‚f‚j|Žx•¥æ–¼ PIC  X(040).
000600 01  ‚k‚s‚q‚j‚f‚j|‹x“ú‘Î‰ž‹æ•ª PIC S9(001) COMP-3.
000610 01  ‚k‚s‚q‚j‚f‚j|“ü‹à“ú PIC S9(002) COMP-3.
000620 01  ‚k‚s‚q‚j‚f‚j|‘æ‚P‰ñ“à“ü“ú PIC  X(007).
000630 01  ‚k‚s‚q‚j‚f‚j|“à“üƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000640 01  ‚k‚s‚q‚j‚f‚j|“à“ü‰ñ” PIC S9(003) COMP-3.
000650 01  ‚k‚s‚q‚j‚f‚j|‘æ‚P‰ñ—˜•¥“ú PIC  X(007).
000660 01  ‚k‚s‚q‚j‚f‚j|—˜•¥‰ñ” PIC S9(003) COMP-3.
000670 01  ‚k‚s‚q‚j‚f‚j|–ñ’è“úŒvŽZ‹æ•ª PIC S9(001) COMP-3.
000680 01  ‚k‚s‚q‚j‚f‚j|‚í‚©‚¿ŒvŽZ‹æ•ª PIC S9(001) COMP-3.
000690 01  ‚k‚s‚q‚j‚f‚j|‹à—˜•ÏXŠî€“úƒR[ƒh PIC S9(001) COMP-3.
000700 01  ‚k‚s‚q‚j‚f‚j|—˜—¦ PIC S9(002)V9(8) COMP-3.
000710 01  ‚k‚s‚q‚j‚f‚j|ŒŽ—˜•¡—˜—¦ŽÀŽ¿ PIC S9(002)V9(8) COMP-3.
000720 01  ‚k‚s‚q‚j‚f‚j|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000730 01  ‚k‚s‚q‚j‚f‚j|âg‹c‹æ•ª PIC S9(001) COMP-3.
000740 01  ‚k‚s‚q‚j‚f‚j|ŽØ“ü•ûŽ® PIC S9(001) COMP-3.
000750 01  ‚k‚s‚q‚j‚f‚j|Ž‘‹àŽg“r‹æ•ª PIC S9(001) COMP-3.
000760 01  ‚k‚s‚q‚j‚f‚j|•¨Œ–¼‘ÎÛ‹Æ–±–¼ PIC  X(040).
000770 01  ‚k‚s‚q‚j‚f‚j|Ý’uêŠ–¼ PIC  X(040).
000780 01  ‚k‚s‚q‚j‚f‚j|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000790 01  ‚k‚s‚q‚j‚f‚j|Ý’uêŠZŠ PIC  X(100).
000800 01  ‚k‚s‚q‚j‚f‚j|‹âsƒR[ƒh PIC  X(007).
000810 01  ‚k‚s‚q‚j‚f‚j|ŒûÀ”Ô† PIC  X(007).
000820 01  ‚k‚s‚q‚j‚f‚j|—a‹àŽí—Þ PIC S9(001) COMP-3.
000830 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ_–ñ”Ô†‚P PIC  X(009).
000840 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ³–{Žc‚‚P PIC S9(013) COMP-3.
000850 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³—˜‘§Šz‚P PIC S9(013) COMP-3.
000860 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ_–ñ”Ô†‚Q PIC  X(009).
000870 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ³–{Žc‚‚Q PIC S9(013) COMP-3.
000880 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³—˜‘§Šz‚Q PIC S9(013) COMP-3.
000890 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ_–ñ”Ô†‚R PIC  X(009).
000900 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ³–{Žc‚‚R PIC S9(013) COMP-3.
000910 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³—˜‘§Šz‚R PIC S9(013) COMP-3.
000920 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ_–ñ”Ô†‚S PIC  X(009).
000930 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ³–{Žc‚‚S PIC S9(013) COMP-3.
000940 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³—˜‘§Šz‚S PIC S9(013) COMP-3.
000950 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ_–ñ”Ô†‚T PIC  X(009).
000960 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³Œ³–{Žc‚‚T PIC S9(013) COMP-3.
000970 01  ‚k‚s‚q‚j‚f‚j|‘‘ÖŒ³—˜‘§Šz‚T PIC S9(013) COMP-3.
000980 01  ‚k‚s‚q‚j‚f‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(059).
000990 01  ‚k‚s‚q‚j‚f‚j|‹¤’Êî•ñ PIC  X(035).
