000010************************************************
000020* ‘Ý•t‹ài‹àÁ“WŠJj(LTRKGT)
000030************************************************
000040 01  ‚k‚s‚q‚j‚f‚s|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚j‚f‚s|“WŠJ”Ô† PIC S9(003) COMP-3.
000060 01  ‚k‚s‚q‚j‚f‚s|—˜‘§Šî€“ú‰ñŽû“ú PIC  X(007).
000070 01  ‚k‚s‚q‚j‚f‚s|Œ³–{“à“ü PIC S9(013) COMP-3.
000080 01  ‚k‚s‚q‚j‚f‚s|—˜‘§Šz PIC S9(013) COMP-3.
000090 01  ‚k‚s‚q‚j‚f‚s|Œ³—˜‡Œv PIC S9(013) COMP-3.
000100 01  ‚k‚s‚q‚j‚f‚s|Œ³–{Žc‚ PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚j‚f‚s|ŠúŠÔŒŽ” PIC S9(003) COMP-3.
000120 01  ‚k‚s‚q‚j‚f‚s|ŠúŠÔ“ú” PIC S9(004) COMP-3.
000130 01  ‚k‚s‚q‚j‚f‚s|—˜—¦ PIC S9(002)V9(8) COMP-3.
000140 01  ‚k‚s‚q‚j‚f‚s|ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000150 01  ‚k‚s‚q‚j‚f‚s|‰ñŽû•ûŽ®Œ³–{ PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚j‚f‚s|‰ñŽû•ûŽ®—˜‘§ PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚j‚f‚s|—˜—¦Šm’è‹æ•ª PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚j‚f‚s|‰ñŽûÏ‹æ•ªŒ³–{ PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚j‚f‚s|‰ñŽûÏ‹æ•ª—˜‘§ PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚j‚f‚s|‹x“ú‹æ•ª PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚j‚f‚s|–ñ’è•ÔÏ“ú PIC  X(007).
000220 01  ‚k‚s‚q‚j‚f‚s|—\”õ PIC  X(030).
