000010************************************************
000020* ƒVƒƒ[ƒv‰ð–ñi‚a‚n‚s‚kŠî–{j(LTRKBK)
000030************************************************
000040 01  ‚k‚s‚q‚j‚a‚j|‚a‚n‚s‚kŒ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚j‚a‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000060 01  ‚k‚s‚q‚j‚a‚j|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚k‚s‚q‚j‚a‚j|¿‹æƒR[ƒh PIC  X(008).
000080 01  ‚k‚s‚q‚j‚a‚j|Ž–‹ÆŠ–¼ PIC  X(020).
000090 01  ‚k‚s‚q‚j‚a‚j|ƒ†[ƒU[–¼ PIC  X(020).
000100 01  ‚k‚s‚q‚j‚a‚j|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000110 01  ‚k‚s‚q‚j‚a‚j|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000120 01  ‚k‚s‚q‚j‚a‚j|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚j‚a‚j|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000140 01  ‚k‚s‚q‚j‚a‚j|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚j‚a‚j|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000160 01  ‚k‚s‚q‚j‚a‚j|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000170 01  ‚k‚s‚q‚j‚a‚j|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000180 01  ‚k‚s‚q‚j‚a‚j|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚j‚a‚j|‘O“n‹à—˜‘§Šz PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚j‚a‚j|ŒÅ’èŽ‘ŽYÅŒŽŠz PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚j‚a‚j|•ÛŒ¯—¿ŒŽŠz PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚j‚a‚j|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚j‚a‚j|”—Ê‡Œv PIC S9(005) COMP-3.
000240 01  ‚k‚s‚q‚j‚a‚j|Šî–{—˜‰ñ‚è PIC S9(003)V9(8) COMP-3.
000250 01  ‚k‚s‚q‚j‚a‚j|ŽÀŽ¿—˜‰ñ‚è PIC S9(003)V9(8) COMP-3.
000260 01  ‚k‚s‚q‚j‚a‚j|ŽÐ“à‹à—˜ PIC S9(003)V9(8) COMP-3.
000270 01  ‚k‚s‚q‚j‚a‚j|Ý’uŠúŠÔ PIC S9(003) COMP-3.
000280 01  ‚k‚s‚q‚j‚a‚j|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000290 01  ‚k‚s‚q‚j‚a‚j|Žx•¥‰ñ” PIC S9(003) COMP-3.
000300 01  ‚k‚s‚q‚j‚a‚j|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000310 01  ‚k‚s‚q‚j‚a‚j|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000320 01  ‚k‚s‚q‚j‚a‚j|“ü‹à“ú PIC S9(002) COMP-3.
000330 01  ‚k‚s‚q‚j‚a‚j|Á”ïÅ—¦ PIC S9(003)V9(1) COMP-3.
000340 01  ‚k‚s‚q‚j‚a‚j|ŽcŒŽ” PIC S9(003) COMP-3.
000350 01  ‚k‚s‚q‚j‚a‚j|‘OŽóŒŽ” PIC S9(003) COMP-3.
000360 01  ‚k‚s‚q‚j‚a‚j|‘OŽóŽcŒŽ” PIC S9(003) COMP-3.
000370 01  ‚k‚s‚q‚j‚a‚j|ÅV“ü—ÍÁ”ïÅ—¦ PIC S9(003)V9(1) COMP-3.
000380 01  ‚k‚s‚q‚j‚a‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(011).
000390 01  ‚k‚s‚q‚j‚a‚j|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000400 01  ‚k‚s‚q‚j‚a‚j|ŽÀƒŠ[ƒX—¿Šî–{ PIC S9(013) COMP-3.
000410 01  ‚k‚s‚q‚j‚a‚j|Œ³–{“à“ü PIC S9(013) COMP-3.
000420 01  ‚k‚s‚q‚j‚a‚j|Œ³–{Žc PIC S9(013) COMP-3.
000430 01  ‚k‚s‚q‚j‚a‚j|ÂŒ ŽcŠî–{ PIC S9(013) COMP-3.
000440 01  ‚k‚s‚q‚j‚a‚j|‘OŽó[“–•\Ž¦ PIC S9(001) COMP-3.
000450 01  ‚k‚s‚q‚j‚a‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(032).
000460 01  ‚k‚s‚q‚j‚a‚j|‹¤’Êî•ñ PIC  X(035).
