000010************************************************
000020* –¼Ìƒ}ƒXƒ^iŽ–‹ÆŠ–¼)(LTRMEI011)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000070 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000080 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|•”Žx“X–¼ PIC  X(020).
000090 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|•”Žx“X–¼—ªÌ PIC  X(010).
000100 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|•”Žx“X–¼ƒJƒi PIC  X(025).
000110 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|•”Žx“X–¼ƒJƒi—ªÌ PIC  X(012).
000120 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|“K—p“ú|¢‹I PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|“K—p“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000140 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|“d˜b”Ô† PIC  X(015).
000150 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|ƒOƒ‹[ƒv‚m‚n PIC  X(002).
000160 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(059).
000170 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚P|‹¤’Êî•ñ PIC  X(035).
