000010************************************************
000020* ‚r‚e‚b–ž—¹—\’è(‚r‚e‚bŠî–{)(LTRMSK)
000030************************************************
000040 01  ‚k‚s‚q‚l‚r‚j|‚a‚n‚s‚kŒ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚l‚r‚j|‚r‚e‚bŒ_–ñ‚m‚n PIC  X(012).
000060 01  ‚k‚s‚q‚l‚r‚j|‚r‚e‚bŒ_–ñ‚m‚n‚l‚s PIC  X(012).
000070 01  ‚k‚s‚q‚l‚r‚j|XV‹æ•ª PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚l‚r‚j|ˆ—‹æ•ª PIC  X(001).
000090 01  ‚k‚s‚q‚l‚r‚j|ˆ—Œ‹‰ÊÄƒŠ[ƒX PIC  X(001).
000100 01  ‚k‚s‚q‚l‚r‚j|ˆ—Œ‹‰Ê“]”„ PIC  X(001).
000110 01  ‚k‚s‚q‚l‚r‚j|ˆ—Œ‹‰Ê”pŠü PIC  X(001).
000120 01  ‚k‚s‚q‚l‚r‚j|V‚r‚e‚bŒ_–ñ‚m‚n PIC  X(012).
000130 01  ‚k‚s‚q‚l‚r‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(005).
000140 01  ‚k‚s‚q‚l‚r‚j|‰ïŽÐƒR[ƒh PIC  X(002).
000150 01  ‚k‚s‚q‚l‚r‚j|‰ïŽÐ–¼ PIC  X(030).
000160 01  ‚k‚s‚q‚l‚r‚j|Žx“XƒR[ƒh PIC  X(002).
000170 01  ‚k‚s‚q‚l‚r‚j|Žx“X–¼ PIC  X(020).
000180 01  ‚k‚s‚q‚l‚r‚j|‚a‚n‚s‚kÝ’uêŠ–¼ PIC  X(020).
000190 01  ‚k‚s‚q‚l‚r‚j|‚a‚n‚s‚kÄƒŠ[ƒX—¿‡Œv PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚l‚r‚j|‚a‚n‚s‚kÄƒŠ[ƒXÁ”ïÅ PIC S9(011) COMP-3.
000210 01  ‚k‚s‚q‚l‚r‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(017).
000220 01  ‚k‚s‚q‚l‚r‚j|‚r‚e‚bÝ’uêŠ–¼ PIC  X(025).
000230 01  ‚k‚s‚q‚l‚r‚j|‚r‚e‚bÄƒŠ[ƒX—¿‡Œv PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚l‚r‚j|‚r‚e‚bÄƒŠ[ƒXÁ”ïÅ PIC S9(011) COMP-3.
000250 01  ‚k‚s‚q‚l‚r‚j|ƒ_ƒ~[‚O‚O‚R PIC  X(017).
000260 01  ‚k‚s‚q‚l‚r‚j|ƒ_ƒ~[‚O‚O‚S PIC  X(037).
000270 01  ‚k‚s‚q‚l‚r‚j|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000280 01  ‚k‚s‚q‚l‚r‚j|”„‹p‹àŠz PIC S9(013) COMP-3.
000290 01  ‚k‚s‚q‚l‚r‚j|”„‹p‹àÁ”ïÅ PIC S9(011) COMP-3.
000300 01  ‚k‚s‚q‚l‚r‚j|‹¤’Êî•ñ PIC  X(035).
