000010************************************************
000020* –¼Ìƒ}ƒXƒ^iƒVƒƒ[ƒvŽx“X–¼j(LTRMEI510)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|Žx“XƒR[ƒh PIC  X(002).
000070 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000080 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|‰ïŽÐ–¼Š¿Žš PIC  X(030).
000090 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|‰ïŽÐ–¼ƒJƒi PIC  X(020).
000100 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|Žx“X–¼Š¿Žš PIC  X(020).
000110 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|Žx“X–¼ƒJƒi PIC  X(020).
000120 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(060).
000130 01  ‚k‚s‚q‚l‚d‚h‚T‚P‚O|‹¤’Êî•ñ PIC  X(035).
