000010************************************************
000020* –¼Ìƒ}ƒXƒ^iŒ_–ñŒ`‘Ô–¼)(LTRMEI020)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|Œ_–ñŒ`‘ÔƒR[ƒh PIC  X(002).
000070 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|Œ`‘Ô•â• PIC  X(001).
000080 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000090 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|Œ_–ñŒ`‘Ô–¼ PIC  X(020).
000100 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|Œ_–ñŒ`‘Ô–¼—ªÌ PIC  X(010).
000110 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|Œ_–ñŒ`‘Ô–¼ƒJƒi PIC  X(025).
000120 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|Œ_–ñŒ`‘Ô–¼ƒJƒi—ªÌ PIC  X(012).
000130 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(083).
000140 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚O|‹¤’Êî•ñ PIC  X(035).
