000010************************************************
000020* Ž‘ŽYiŽ‘ŽYŠî–{j(LTRSIK)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚j|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚r‚h‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000060 01  ‚k‚s‚q‚r‚h‚j|ƒ†[ƒUƒR[ƒh PIC  X(008).
000070 01  ‚k‚s‚q‚r‚h‚j|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000080 01  ‚k‚s‚q‚r‚h‚j|Œ´Œ_–ñ PIC  X(001).
000090 01  ‚k‚s‚q‚r‚h‚j|Œp‘± PIC  X(001).
000100 01  ‚k‚s‚q‚r‚h‚j|ÄƒŠ[ƒX PIC  X(001).
000110 01  ‚k‚s‚q‚r‚h‚j|Š„•Š PIC  X(001).
000120 01  ‚k‚s‚q‚r‚h‚j|Žè”—¿ PIC  X(001).
000130 01  ‚k‚s‚q‚r‚h‚j|ƒtƒ@ƒNƒ^ƒŠƒ“ƒO PIC  X(001).
000140 01  ‚k‚s‚q‚r‚h‚j|‹àÁ PIC  X(001).
000150 01  ‚k‚s‚q‚r‚h‚j|Žx•¥•ÛØ PIC  X(001).
000160 01  ‚k‚s‚q‚r‚h‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(005).
000170 01  ‚k‚s‚q‚r‚h‚j|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚r‚h‚j|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000190 01  ‚k‚s‚q‚r‚h‚j|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚j|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000210 01  ‚k‚s‚q‚r‚h‚j|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚j|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000230 01  ‚k‚s‚q‚r‚h‚j|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚h‚j|Žc‰¿‡ŒvŠz PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚j|•¨ŒŽ}”Ô† PIC S9(003) COMP-3.
000260 01  ‚k‚s‚q‚r‚h‚j|”—Ê‡Œv PIC S9(005) COMP-3.
000270 01  ‚k‚s‚q‚r‚h‚j|’P”N“xŒ_–ñ PIC  X(002).
000280 01  ‚k‚s‚q‚r‚h‚j|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000290 01  ‚k‚s‚q‚r‚h‚j|ÂŒ ‹¦’²ƒR[ƒh PIC  X(002).
000300 01  ‚k‚s‚q‚r‚h‚j|Žd“üÁ”ïÅŠz‡Œv PIC S9(013) COMP-3.
000310 01  ‚k‚s‚q‚r‚h‚j|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000320 01  ‚k‚s‚q‚r‚h‚j|âg‹c‹æ•ª PIC  X(001).
000330 01  ‚k‚s‚q‚r‚h‚j|ÅI•¨Œ‚m‚n PIC S9(003) COMP-3.
000340 01  ‚k‚s‚q‚r‚h‚j|Š²Ž–”ñŠ²Ž–‹æ•ª PIC  X(001).
000350 01  ‚k‚s‚q‚r‚h‚j|‚n‚o‚d‚m‚b‚k‚n‚r‚d‹æ•ª PIC  X(001).
000360 01  ‚k‚s‚q‚r‚h‚j|‰ñŽûŽè‡ PIC  X(001).
000370 01  ‚k‚s‚q‚r‚h‚j|”Û”F‹æ•ª PIC  X(001).
000380 01  ‚k‚s‚q‚r‚h‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(033).
000390 01  ‚k‚s‚q‚r‚h‚j|Œ³Œ_–ñ‚m‚n PIC  X(009).
000400 01  ‚k‚s‚q‚r‚h‚j|Œ³ÅI•¨Œ‚m‚n PIC S9(003) COMP-3.
000410 01  ‚k‚s‚q‚r‚h‚j|Œ³Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000420 01  ‚k‚s‚q‚r‚h‚j|Œ³ƒ†[ƒUƒR[ƒh PIC  X(008).
000430 01  ‚k‚s‚q‚r‚h‚j|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚r‚h‚j|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000450 01  ‚k‚s‚q‚r‚h‚j|‹¤’Êî•ñ PIC  X(035).
