000010************************************************
000020* —š—ðƒ}ƒbƒ`ÂŒ ÄƒŠ[ƒX“WŠJ(LTRSAS_M)
000030************************************************
000040 01  ‚k‚s‚q‚r‚`‚r|‚l|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚`‚r|‚l|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚k‚s‚q‚r‚`‚r|‚l|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚r‚`‚r|‚l|•¨Œ‚m‚n PIC S9(003) COMP-3.
000080 01  ‚k‚s‚q‚r‚`‚r|‚l|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000090 01  ‚k‚s‚q‚r‚`‚r|‚l|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000100 01  ‚k‚s‚q‚r‚`‚r|‚l|‰ð–ñ‹æ•ª PIC  X(001).
000110 01  ‚k‚s‚q‚r‚`‚r|‚l|”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚r‚`‚r|‚l|”NŒŽ“x|”NŒŽ PIC  X(004).
000130 01  ‚k‚s‚q‚r‚`‚r|‚l|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000140 01  ‚k‚s‚q‚r‚`‚r|‚l|¿‹‹àŠz PIC S9(013) COMP-3.
000150 01  ‚k‚s‚q‚r‚`‚r|‚l|ÂŒ Žc‚ PIC S9(013) COMP-3.
000160 01  ‚k‚s‚q‚r‚`‚r|‚l|Á”ïÅ|Šz PIC S9(011) COMP-3.
000170 01  ‚k‚s‚q‚r‚`‚r|‚l|Á”ïÅ|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚r‚`‚r|‚l|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚r‚`‚r|‚l|‰ñŽûÏ•\Ž¦ PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚r‚`‚r|‚l|‘OŽó[“–•\Ž¦ PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚r‚`‚r|‚l|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000220 01  ‚k‚s‚q‚r‚`‚r|‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(024).
