000010************************************************                
000020* Â–±iÂ–±–¾×j(LTRSMM)                                      
000030************************************************                
000040 01  ‚k‚s‚q‚r‚l‚l|Â–±Œ_–ñ‚m‚n              PIC  X(010).       
000050 01  ‚k‚s‚q‚r‚l‚l|ÄƒŠ[ƒXƒR[ƒh            PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚r‚l‚l|Œ_–ñ–¾×‚m‚n              PIC S9(002) COMP-3.
000070 01  ‚k‚s‚q‚r‚l‚l|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX        PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚r‚l‚l|Â–±ŽæˆøƒR[ƒh            PIC  X(008).       
000090 01  ‚k‚s‚q‚r‚l‚l|Â–±‹¦’²ƒR[ƒh            PIC  X(002).       
000100 01  ‚k‚s‚q‚r‚l‚l|‚q‚d‚e”Ô†                PIC  X(016).       
000110 01  ‚k‚s‚q‚r‚l‚l|Œ_–ñ“ú|¢‹I              PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚r‚l‚l|Œ_–ñ“ú|”NŒŽ“ú            PIC  X(006).       
000130 01  ‚k‚s‚q‚r‚l‚l|ŒŸŽû“ú|¢‹I              PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚r‚l‚l|ŒŸŽû“ú|”NŒŽ“ú            PIC  X(006).       
000150 01  ‚k‚s‚q‚r‚l‚l|•”•ª‰ð–ñ“ú|¢‹I          PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚r‚l‚l|•”•ª‰ð–ñ“ú|”NŒŽ“ú        PIC  X(006).       
000170 01  ‚k‚s‚q‚r‚l‚l|“à—e•ÏX“ú|¢‹I          PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚r‚l‚l|“à—e•ÏX“ú|”NŒŽ“ú        PIC  X(006).       
000190 01  ‚k‚s‚q‚r‚l‚l|•”•ª‰ð–ñ”NŒŽ“x|¢‹I      PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚r‚l‚l|•”•ª‰ð–ñ”NŒŽ“x|”NŒŽ      PIC  X(004).       
000210 01  ‚k‚s‚q‚r‚l‚l|ƒ_ƒ~[‚O‚O‚P              PIC  X(010).       
000220 01  ‚k‚s‚q‚r‚l‚l|‰ñŽû•¨Œ‹àŠz              PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚l‚l|”„ãÁ”ïÅ                PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚l‚l|•¨Œ‘ã‹à‰ñŽû“ú|¢‹I      PIC S9(001) COMP-3.
000250 01  ‚k‚s‚q‚r‚l‚l|•¨Œ‘ã‹à‰ñŽû“ú|”NŒŽ“ú    PIC  X(006).       
000260 01  ‚k‚s‚q‚r‚l‚l|‰ñŽû•ûŽ®ƒR[ƒh            PIC S9(001) COMP-3.
000270 01  ‚k‚s‚q‚r‚l‚l|”„ãÁ”ïÅ‘ŠŽE‹æ•ª        PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚r‚l‚l|¿‹ƒf[ƒ^ì¬“ú|¢‹I    PIC S9(001) COMP-3.
000290 01  ‚k‚s‚q‚r‚l‚l|¿‹ƒf[ƒ^ì¬“ú|”NŒŽ“ú  PIC  X(006).       
000300 01  ‚k‚s‚q‚r‚l‚l|ƒ_ƒ~[‚O‚O‚Q              PIC  X(010).       
000310 01  ‚k‚s‚q‚r‚l‚l|ƒŠ[ƒXŠJŽn“ú|¢‹I        PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚r‚l‚l|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú      PIC  X(006).       
000330 01  ‚k‚s‚q‚r‚l‚l|ƒŠ[ƒXI—¹“ú|¢‹I        PIC S9(001) COMP-3.
000340 01  ‚k‚s‚q‚r‚l‚l|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú      PIC  X(006).       
000350 01  ‚k‚s‚q‚r‚l‚l|ƒŠ[ƒXŠúŠÔ                PIC S9(003) COMP-3.
000360 01  ‚k‚s‚q‚r‚l‚l|ƒtƒ@ƒCƒiƒ“ƒXŠJŽn“ú|¢‹I                     
000361                                             PIC S9(001) COMP-3.
000370 01  ‚k‚s‚q‚r‚l‚l|ƒtƒ@ƒCƒiƒ“ƒXŠJŽn“ú|”NŒŽ“ú     PIC  X(006).  
000380 01  ‚k‚s‚q‚r‚l‚l|ƒtƒ@ƒCƒiƒ“ƒX|¢‹I                           
000381                                             PIC S9(001) COMP-3.
000390 01  ‚k‚s‚q‚r‚l‚l|ƒtƒ@ƒCƒiƒ“ƒX|”NŒŽ“ú      PIC  X(006).       
000400 01  ‚k‚s‚q‚r‚l‚l|ƒtƒ@ƒCƒiƒ“ƒXŠúŠÔ          PIC S9(003) COMP-3.
000410 01  ‚k‚s‚q‚r‚l‚l|Â–±Š¨’èˆ—ƒR[ƒh        PIC S9(002) COMP-3.
000420 01  ‚k‚s‚q‚r‚l‚l|ƒŠ[ƒX—¿                  PIC S9(013) COMP-3.
000430 01  ‚k‚s‚q‚r‚l‚l|Žx•¥ƒTƒCƒNƒ‹              PIC S9(002) COMP-3.
000440 01  ‚k‚s‚q‚r‚l‚l|Žx•¥‰ñ”                  PIC S9(003) COMP-3.
000450 01  ‚k‚s‚q‚r‚l‚l|–ˆŒŽŽx•¥“ú                PIC S9(002) COMP-3.
000460 01  ‚k‚s‚q‚r‚l‚l|ŒvŽZ•ûŽ®                  PIC S9(001) COMP-3.
000470 01  ‚k‚s‚q‚r‚l‚l|˜’uŠúŠÔ                  PIC S9(003) COMP-3.
000480 01  ‚k‚s‚q‚r‚l‚l|‚a‚d‚f‚h‚m‰ñ”            PIC S9(001) COMP-3.
000490 01  ‚k‚s‚q‚r‚l‚l|‘æ‚P‰ñƒŠ[ƒX—¿–ñ’èŽx•¥“ú¢‹I
000491                                             PIC S9(001) COMP-3.
000500 01  ‚k‚s‚q‚r‚l‚l|‘æ‚P‰ñƒŠ[ƒX—¿–ñ’èŽx•¥“ú”NŒŽ“ú PIC  X(006).  
000510 01  ‚k‚s‚q‚r‚l‚l|‘æ‚P‰ñƒŠ[ƒX—¿Žx•¥“ú|¢‹I                   
000511                                             PIC S9(001) COMP-3.
000520 01  ‚k‚s‚q‚r‚l‚l|‘æ‚P‰ñƒŠ[ƒX—¿Žx•¥“ú|”NŒŽ“ú   PIC  X(006).  
000530 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿Žx•¥“ú|¢‹I                     
000531                                             PIC S9(001) COMP-3.
000540 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿Žx•¥“ú|”NŒŽ“ú     PIC  X(006).  
000550 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿              PIC S9(013) COMP-3.
000560 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿Á”ïÅ        PIC S9(013) COMP-3.
000570 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿ŽÀŽx•¥Šz      PIC S9(013) COMP-3.
000580 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿””ï—p        PIC S9(013) COMP-3.
000590 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿[“–ŠJŽn”NŒŽ¢‹I                 
000591                                             PIC S9(001) COMP-3.
000600 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿[“–ŠJŽn”NŒŽ”NŒŽ“ú PIC  X(006).  
000610 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿[“–I—¹”NŒŽ¢‹I                 
000611                                             PIC S9(001) COMP-3.
000620 01  ‚k‚s‚q‚r‚l‚l|‘O•¥ƒŠ[ƒX—¿[“–I—¹”NŒŽ”NŒŽ“ú PIC  X(006).  
000630 01  ‚k‚s‚q‚r‚l‚l|‘O•¥[“–ŒŽ”              PIC S9(003) COMP-3.
000640 01  ‚k‚s‚q‚r‚l‚l|—˜‰ñ‚èŠî–{           PIC S9(003)V9(9) COMP-3.
000650 01  ‚k‚s‚q‚r‚l‚l|—˜‰ñ‚èŽÀŽ¿           PIC S9(003)V9(9) COMP-3.
000660 01  ‚k‚s‚q‚r‚l‚l|‘Žx•¥‹àŠz                PIC S9(013) COMP-3.
000670 01  ‚k‚s‚q‚r‚l‚l|—˜‘§‡Œv                  PIC S9(013) COMP-3.
000680 01  ‚k‚s‚q‚r‚l‚l|‘e—˜‰v                    PIC S9(013) COMP-3.
000690 01  ‚k‚s‚q‚r‚l‚l|Á”ïÅ‘Šz                PIC S9(013) COMP-3.
000700 01  ‚k‚s‚q‚r‚l‚l|Á”ïÅŽx•¥‹æ•ª            PIC S9(001) COMP-3.
000710 01  ‚k‚s‚q‚r‚l‚l|Á”ïÅÅ—¦           PIC S9(003)V9(1) COMP-3.
000720 01  ‚k‚s‚q‚r‚l‚l|Á”ïÅƒR[ƒh              PIC S9(002) COMP-3.
000730 01  ‚k‚s‚q‚r‚l‚l|””ï—pŒÅ’èŽ‘ŽYÅ          PIC S9(013) COMP-3.
000740 01  ‚k‚s‚q‚r‚l‚l|””ï—p•ÛŒ¯—¿              PIC S9(013) COMP-3.
000750 01  ‚k‚s‚q‚r‚l‚l|””ï—p•ÛŽç—¿              PIC S9(013) COMP-3.
000760 01  ‚k‚s‚q‚r‚l‚l|””ï—p‚»‚Ì‚½‚P            PIC S9(013) COMP-3.
000770 01  ‚k‚s‚q‚r‚l‚l|””ï—p‚»‚Ì‚½‚Q            PIC S9(013) COMP-3.
000780 01  ‚k‚s‚q‚r‚l‚l|””ï—p‹æ•ª                PIC S9(001) COMP-3.
000790 01  ‚k‚s‚q‚r‚l‚l|Žx•¥æƒR[ƒh                   PIC  X(004).  
000800 01  ‚k‚s‚q‚r‚l‚l|‹âsƒR[ƒh                     PIC  X(007).  
000810 01  ‚k‚s‚q‚r‚l‚l|ŒûÀ”Ô†                       PIC  X(007).  
000820 01  ‚k‚s‚q‚r‚l‚l|—a‹àŽí—Þ                       PIC  X(001).  
000830 01  ‚k‚s‚q‚r‚l‚l|Žx•¥Šm’è“ú|¢‹I          PIC S9(001) COMP-3.
000840 01  ‚k‚s‚q‚r‚l‚l|Žx•¥Šm’è“ú|”NŒŽ“ú             PIC  X(006).  
000850 01  ‚k‚s‚q‚r‚l‚l|Žx•¥Šm’è”NŒŽ“x|¢‹I      PIC S9(001) COMP-3.
000860 01  ‚k‚s‚q‚r‚l‚l|Žx•¥Šm’è”NŒŽ“x|”NŒŽ           PIC  X(004).  
000870 01  ‚k‚s‚q‚r‚l‚l|Žx•¥³”Fî•ñƒTƒuƒVƒXƒeƒ€‹æ•ª   PIC  X(001).  
000880 01  ‚k‚s‚q‚r‚l‚l|Žx•¥³”Fî•ñƒV[ƒPƒ“ƒX                       
000881                                             PIC S9(005) COMP-3.
000890 01  ‚k‚s‚q‚r‚l‚l|Žx•¥³”Fî•ñŽx•¥³”F“ú|¢‹I                 
000891                                             PIC S9(001) COMP-3.
000900 01  ‚k‚s‚q‚r‚l‚l|Žx•¥³”Fî•ñŽx•¥³”F“ú|”NŒŽ“ú PIC  X(006).  
000910 01  ‚k‚s‚q‚r‚l‚l|Žx•¥³”Fî•ñ’S“–ŽÒƒR[ƒh                     
000911                                             PIC S9(004) COMP-3.
000920 01  ‚k‚s‚q‚r‚l‚l|Žc‰¿Žx•¥³”FƒTƒuƒVƒXƒeƒ€‹æ•ª   PIC  X(001).  
000930 01  ‚k‚s‚q‚r‚l‚l|Žc‰¿Žx•¥³”FƒV[ƒPƒ“ƒX                       
000931                                             PIC S9(005) COMP-3.
000940 01  ‚k‚s‚q‚r‚l‚l|Žc‰¿Žx•¥³”FŽx•¥³”F“ú|¢‹I                 
000941                                             PIC S9(001) COMP-3.
000950 01  ‚k‚s‚q‚r‚l‚l|Žc‰¿Žx•¥³”FŽx•¥³”F“ú|”NŒŽ“ú PIC  X(006).  
000960 01  ‚k‚s‚q‚r‚l‚l|Žc‰¿Žx•¥³”F’S“–ŽÒƒR[ƒh  PIC S9(004) COMP-3.
000970 01  ‚k‚s‚q‚r‚l‚l|‘OŒŽ––Â–±Žc‚            PIC S9(013) COMP-3.
000980 01  ‚k‚s‚q‚r‚l‚l|‘OŒŽ––Œ³–{Žc‚            PIC S9(013) COMP-3.
000990 01  ‚k‚s‚q‚r‚l‚l|‘OŠú––Á”ïÅŽc‚          PIC S9(013) COMP-3.
001000 01  ‚k‚s‚q‚r‚l‚l|Žc‰¿Šz                    PIC S9(013) COMP-3.
001010 01  ‚k‚s‚q‚r‚l‚l|Žc‰¿Žx•¥“ú|¢‹I          PIC S9(001) COMP-3.
001020 01  ‚k‚s‚q‚r‚l‚l|Žc‰¿Žx•¥“ú|”NŒŽ“ú             PIC  X(006).  
001030 01  ‚k‚s‚q‚r‚l‚l|ƒ_ƒ~[‚O‚O‚R                   PIC  X(024).  
001040 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñŽÀƒŠ[ƒX—¿        PIC S9(013) COMP-3.
001050 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñ‚m‚d‚sƒŠ[ƒX—¿    PIC S9(013) COMP-3.
001060 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñ—˜‘§              PIC S9(013) COMP-3.
001070 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñŒ³–{Žx•¥Šz        PIC S9(013) COMP-3.
001080 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñŒ³–{Žc‚          PIC S9(013) COMP-3.
001090 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñÂ–±Žc‚          PIC S9(013) COMP-3.
001100 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñÁ”ïÅŠz          PIC S9(013) COMP-3.
001110 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñÁ”ïÅŽc‚        PIC S9(013) COMP-3.
001120 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñ””ï—p            PIC S9(013) COMP-3.
001130 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñŽÀŽx•¥Šz          PIC S9(013) COMP-3.
001140 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñÁ”ïÅ—¦     PIC S9(003)V9(1) COMP-3.
001150 01  ‚k‚s‚q‚r‚l‚l|‰‰ñî•ñƒ_ƒ~[                 PIC  X(014).  
001160 01  ‚k‚s‚q‚r‚l‚l|Žx•¥ƒf[ƒ^ì¬“ú|¢‹I    PIC S9(001) COMP-3.
001170 01  ‚k‚s‚q‚r‚l‚l|Žx•¥ƒf[ƒ^ì¬“ú|”NŒŽ“ú       PIC  X(006).  
001180 01  ‚k‚s‚q‚r‚l‚l|¿‹ƒf[ƒ^ì¬“ú|¢‹I‚Q  PIC S9(001) COMP-3.
001190 01  ‚k‚s‚q‚r‚l‚l|¿‹ƒf[ƒ^ì¬“ú|”NŒŽ“ú‚Q     PIC  X(006).  
001200 01  ‚k‚s‚q‚r‚l‚l|Žd–óƒf[ƒ^ì¬“ú|¢‹I    PIC S9(001) COMP-3.
001210 01  ‚k‚s‚q‚r‚l‚l|Žd–óƒf[ƒ^ì¬“ú|”NŒŽ“ú       PIC  X(006).  
001220 01  ‚k‚s‚q‚r‚l‚l|ƒ_ƒ~[‚O‚O‚S                   PIC  X(018).  
001230 01  ‚k‚s‚q‚r‚l‚l|‹¤’Êî•ñ                       PIC  X(035).  
