000010************************************************
000020* ’ñŒgƒR[ƒhƒ}ƒXƒ^(‚g‚n‚x‚`¤•iƒR[ƒh)(LTRSCD0710)
000030************************************************
000040 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|‚g‚n‚x‚`¤•i‚b‚c PIC  X(003).
000060 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000070 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|“K—p“ú•t‚P PIC  X(007).
000080 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|Ž‘ŽYƒR[ƒh‚P PIC S9(007) COMP-3.
000090 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|ƒ_ƒ~[‚P PIC  X(016).
000100 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|“K—p“ú•t‚Q PIC  X(007).
000110 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|Ž‘ŽYƒR[ƒh‚Q PIC S9(007) COMP-3.
000120 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|ƒ_ƒ~[‚Q PIC  X(016).
000130 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|“K—p“ú•t‚R PIC  X(007).
000140 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|Ž‘ŽYƒR[ƒh‚R PIC S9(007) COMP-3.
000150 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|ƒ_ƒ~[‚R PIC  X(016).
000160 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|“K—p“ú•t‚S PIC  X(007).
000170 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|Ž‘ŽYƒR[ƒh‚S PIC S9(007) COMP-3.
000180 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|ƒ_ƒ~[‚S PIC  X(016).
000190 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|“K—p“ú•t‚T PIC  X(007).
000200 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|Ž‘ŽYƒR[ƒh‚T PIC S9(007) COMP-3.
000210 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|ƒ_ƒ~[‚T PIC  X(016).
000220 01  ‚k‚s‚q‚r‚b‚c‚O‚V‚P‚O|‹¤’Êî•ñ PIC  X(035).
