000010************************************************
000020* Æ¸ƒtƒ@ƒCƒ‹(‰È–ÚŽc‚ƒŒƒR[ƒh)(LTRSYZ)
000030************************************************
000040 01  ‚k‚s‚q‚r‚x‚y|‰È–ÚƒR[ƒh PIC  X(003).
000050 01  ‚k‚s‚q‚r‚x‚y|ŽæˆøƒR[ƒh PIC  X(002).
000060 01  ‚k‚s‚q‚r‚x‚y|“o˜^íœ PIC  X(001).
000070 01  ‚k‚s‚q‚r‚x‚y|‰È–Úƒ^ƒCƒv PIC  X(001).
000080 01  ‚k‚s‚q‚r‚x‚y|ƒ_ƒ~[‚O‚O‚P PIC  X(003).
000090 01  ‚k‚s‚q‚r‚x‚y|ŒûÀ“o˜^” PIC S9(005) COMP-3.
000100 01  ‚k‚s‚q‚r‚x‚y|ŽØ•û‡Œv PIC S9(015) COMP-3.
000110 01  ‚k‚s‚q‚r‚x‚y|‘Ý•û‡Œv PIC S9(015) COMP-3.
000120 01  ‚k‚s‚q‚r‚x‚y|Žc‰¿ PIC S9(015) COMP-3.
000130 01  ‚k‚s‚q‚r‚x‚y|ƒ_ƒ~[‚O‚O‚Q PIC  X(028).
000140 01  ‚k‚s‚q‚r‚x‚y|‹¤’Êî•ñ PIC  X(035).
