000010************************************************
000020* —š—ðƒAƒ“ƒ}ƒbƒ`Ž‘ŽYž‹p(LTRSIS_U)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚r|‚t|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚h‚r|‚t|Œ_–ñ‚m‚n PIC  X(009).
000060 01  ‚k‚s‚q‚r‚h‚r|‚t|•¨Œ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚r‚h‚r|‚t|‰ð–ñ‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚r‚h‚r|‚t|Ä¶‹æ•ª PIC  X(001).
000090 01  ‚k‚s‚q‚r‚h‚r|‚t|‘OŠú––•ë‰¿‰ïŽÐ PIC S9(013) COMP-3.
000100 01  ‚k‚s‚q‚r‚h‚r|‚t|“–ŒŽž‹p‚ PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚r‚h‚r|‚t|“–Šúž‹p‚ PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚r‚h‚r|‚t|Œ»Ý•ë‰¿ PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚r‚h‚r|‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(010).
000140 01  ‚k‚s‚q‚r‚h‚r|‚t|ž‹p‹æ•ª PIC S9(002) COMP-3.
000150 01  ‚k‚s‚q‚r‚h‚r|‚t|Š„‘‹æ•ª PIC S9(002) COMP-3.
000160 01  ‚k‚s‚q‚r‚h‚r|‚t|“Á•Êž‹p—¦|•ªŽq PIC S9(002) COMP-3.
000170 01  ‚k‚s‚q‚r‚h‚r|‚t|“Á•Êž‹p—¦|•ª•ê PIC S9(003) COMP-3.
000180 01  ‚k‚s‚q‚r‚h‚r|‚t|‘OŠú––•ë‰¿–@’è PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚r‚h‚r|‚t|•’Êž‹p”ï PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚r|‚t|Š„‘ž‹p”ï PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚h‚r|‚t|“Á•Êž‹p”ï PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚r|‚t|“–Šú––•ë‰¿ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚h‚r|‚t|ŒJ‰z’´‰ßŠz PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚h‚r|‚t|ž‹pŒÀ“xŠz PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚r|‚t|ƒ_ƒ~[‚O‚O‚Q PIC  X(015).
000260 01  ‚k‚s‚q‚r‚h‚r|‚t|‰ïŽÐ—˜_‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
000270 01  ‚k‚s‚q‚r‚h‚r|‚t|‰ïŽÐ—˜_“–Šú––•ë‰¿ PIC S9(013) COMP-3.
000280 01  ‚k‚s‚q‚r‚h‚r|‚t|“–Šúž‹p‰ß•s‘«Šz PIC S9(013) COMP-3.
000290 01  ‚k‚s‚q‚r‚h‚r|‚t|ƒ_ƒ~[‚O‚O‚R PIC  X(028).
000300 01  ‚k‚s‚q‚r‚h‚r|‚t|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000310 01  ‚k‚s‚q‚r‚h‚r|‚t|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000320 01  ‚k‚s‚q‚r‚h‚r|‚t|‹¤’Êî•ñ PIC  X(035).
