000010************************************************
000020* ¿‹i¿‹æî•ñj(LTRSKS)
000030************************************************
000040 01  ‚k‚s‚q‚r‚j‚r|‚j‚d‚x€–Ú¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚k‚s‚q‚r‚j‚r|“ü‹àŒ³ƒR[ƒh PIC  X(008).
000060 01  ‚k‚s‚q‚r‚j‚r|¿‹‹àŠz PIC S9(013) COMP-3.
000070 01  ‚k‚s‚q‚r‚j‚r|Áž‹àŠz PIC S9(013) COMP-3.
000080 01  ‚k‚s‚q‚r‚j‚r|ÁžŽc‚ PIC S9(013) COMP-3.
000090 01  ‚k‚s‚q‚r‚j‚r|¿‹æ–¼ PIC  X(030).
000100 01  ‚k‚s‚q‚r‚j‚r|ƒ_ƒ~[‚O‚O‚P PIC  X(048).
000110 01  ‚k‚s‚q‚r‚j‚r|‹¤’Êî•ñ PIC  X(035).
