000010************************************************
000020* ˆ—’Ê”Ô(M—p•ÛŒ¯’Ê’m‘”Ô†)(LTRTUUC010)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚b‚O‚P‚O|‚j‚d‚x‚P PIC  X(004).
000050 01  ‚k‚s‚q‚s‚t‚t‚b‚O‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000060 01  ‚k‚s‚q‚s‚t‚t‚b‚O‚P‚O|ˆ—’Ê”Ô PIC S9(005) COMP-3.
000070 01  ‚k‚s‚q‚s‚t‚t‚b‚O‚P‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(050).
000080 01  ‚k‚s‚q‚s‚t‚t‚b‚O‚P‚O|‹¤’Êî•ñ PIC  X(035).
