000010************************************************
000020* ˆ—’Ê”Ô(“ü‹à’Ê”Ô)(LTRTUUT1)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚s‚P|‚j‚d‚x‚P PIC  X(002).
000050 01  ‚k‚s‚q‚s‚t‚t‚s‚P|‚j‚d‚x‚Q PIC  X(008).
000060 01  ‚k‚s‚q‚s‚t‚t‚s‚P|ŒŽ PIC S9(002) COMP-3.
000070 01  ‚k‚s‚q‚s‚t‚t‚s‚P|“ú PIC S9(002) COMP-3.
000080 01  ‚k‚s‚q‚s‚t‚t‚s‚P|”N PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚s‚t‚t‚s‚P|ˆê˜A”Ô† PIC S9(004) COMP-3.
000100 01  ‚k‚s‚q‚s‚t‚t‚s‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(046).
000110 01  ‚k‚s‚q‚s‚t‚t‚s‚P|‹¤’Êî•ñ PIC  X(035).
