000010************************************************
000020* ˆ—’Ê”Ô(ŽO—m¬–ñ)(LTRTUU000)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚O|‚j‚d‚x‚P PIC  X(004).
000050 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000060 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚O|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚O|‘OŒŽ“x|¢‹I PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚O|‘OŒŽ“x|”NŒŽ“ú PIC S9(006) COMP-3.
000090 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(039).
000100 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚O|‹¤’Êî•ñ PIC  X(035).
