000010************************************************
000020* ˆ—’Ê”Ô(Žx•¥ŠÇ—Žd–ó—p)(LTRTUUE000)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚d‚O‚O‚O|‚j‚d‚x‚P PIC  X(004).
000050 01  ‚k‚s‚q‚s‚t‚t‚d‚O‚O‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000060 01  ‚k‚s‚q‚s‚t‚t‚d‚O‚O‚O|ˆ—’Ê”Ô PIC S9(005) COMP-3.
000070 01  ‚k‚s‚q‚s‚t‚t‚d‚O‚O‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(050).
000080 01  ‚k‚s‚q‚s‚t‚t‚d‚O‚O‚O|‹¤’Êî•ñ PIC  X(035).
