000010************************************************
000020* “–“úŽæˆø(Ø±Ù)i“–“úŽæˆø(‹Æ–±))(LTRTTR)
000030************************************************
000040 01  ‚k‚s‚q‚s‚s‚q|‹Æ–±Ž¯•ÊƒR[ƒh‚P PIC  X(004).
000050 01  ‚k‚s‚q‚s‚s‚q|ˆê˜A”Ô†‚P PIC S9(005) COMP-3.
000060 01  ‚k‚s‚q‚s‚s‚q|Ž}”Ô‚P PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚s‚s‚q|“o˜^íœ PIC  X(001).
000080 01  ‚k‚s‚q‚s‚s‚q|’ •[o—Í PIC  X(001).
000090 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚O‚O‚P PIC  X(002).
000100 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚O‚O‚Q PIC  X(002).
000110 01  ‚k‚s‚q‚s‚s‚q|‹Æ–±ƒR[ƒh PIC  X(003).
000120 01  ‚k‚s‚q‚s‚s‚q|“ü—Í”ñ“ü—Í PIC  X(001).
000130 01  ‚k‚s‚q‚s‚s‚q|‹Æ–±Ž¯•ÊƒR[ƒh‚Q PIC  X(004).
000140 01  ‚k‚s‚q‚s‚s‚q|ˆê˜A”Ô†‚Q PIC S9(005) COMP-3.
000150 01  ‚k‚s‚q‚s‚s‚q|Ž}”Ô‚Q PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚s‚s‚q|“ü—ÍŽžŠÔ PIC S9(006) COMP-3.
000170 01  ‚k‚s‚q‚s‚s‚q|’[––”Ô† PIC  X(008).
000180 01  ‚k‚s‚q‚s‚s‚q|‰æ–Ê”Ô† PIC  X(004).
000190 01  ‚k‚s‚q‚s‚s‚q|’S“–ŽÒƒR[ƒh PIC  X(004).
000200 01  ‚k‚s‚q‚s‚s‚q|Š‘®Ž–‹ÆŠ PIC S9(004) COMP-3.
000210 01  ‚k‚s‚q‚s‚s‚q|©ƒJƒi PIC  X(010).
000220 01  ‚k‚s‚q‚s‚s‚q|“ü—Í“ú PIC  X(008).
000230 01  ‚k‚s‚q‚s‚s‚q|Žæˆø“ú PIC  X(008).
000240 01  ‚k‚s‚q‚s‚s‚q|ƒoƒŠƒ…[“ú PIC  X(008).
000250 01  ‚k‚s‚q‚s‚s‚q|“–‰Žæˆø“ú PIC  X(008).
000260 01  ‚k‚s‚q‚s‚s‚q|ˆ—‹æ•ª PIC  X(001).
000270 01  ‚k‚s‚q‚s‚s‚q|Ž–‹ÆŠ‚P PIC  X(004).
000280 01  ‚k‚s‚q‚s‚s‚q|ˆê˜A”Ô†‚R PIC S9(005) COMP-3.
000290 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚O‚O‚R PIC  X(003).
000300 01  ‚k‚s‚q‚s‚s‚q|Ž–‹ÆŠ‚Q PIC  X(004).
000310 01  ‚k‚s‚q‚s‚s‚q|ŽØ•ûŒÂ” PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚s‚s‚q|‘Ý•ûŒÂ” PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚s‚s‚q|Žd–óƒR[ƒh PIC  X(004).
000340 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚P PIC  X(003).
000350 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚P PIC  X(001).
000360 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚P PIC S9(002) COMP-3.
000370 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚P PIC S9(003) COMP-3.
000380 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚P PIC S9(012)V9(2) COMP-3.
000390 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚P PIC  X(004).
000400 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚P PIC S9(004)V9(2) COMP-3.
000410 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚P PIC S9(013) COMP-3.
000420 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚P PIC  X(001).
000430 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚P PIC  X(008).
000440 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚P PIC S9(003) COMP-3.
000450 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚P PIC  X(004).
000460 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚P PIC  X(016).
000470 01  ‚k‚s‚q‚s‚s‚q|“E—v‚P PIC  X(035).
000480 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚P PIC S9(001) COMP-3.
000490 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚P PIC S9(006) COMP-3.
000500 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚P PIC S9(001) COMP-3.
000510 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚P PIC S9(006) COMP-3.
000520 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚P PIC S9(003)V9(7) COMP-3.
000530 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚P PIC  X(001).
000540 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚P PIC  X(001).
000550 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚P PIC  X(001).
000560 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚P PIC  X(007).
000570 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚Q PIC  X(003).
000580 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚Q PIC  X(001).
000590 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚Q PIC S9(002) COMP-3.
000600 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚Q PIC S9(003) COMP-3.
000610 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚Q PIC S9(012)V9(2) COMP-3.
000620 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚Q PIC  X(004).
000630 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚Q PIC S9(004)V9(2) COMP-3.
000640 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚Q PIC S9(013) COMP-3.
000650 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚Q PIC  X(001).
000660 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚Q PIC  X(008).
000670 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚Q PIC S9(003) COMP-3.
000680 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q PIC  X(004).
000690 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚Q PIC  X(016).
000700 01  ‚k‚s‚q‚s‚s‚q|“E—v‚Q PIC  X(035).
000710 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚Q PIC S9(001) COMP-3.
000720 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚Q PIC S9(006) COMP-3.
000730 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚Q PIC S9(001) COMP-3.
000740 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚Q PIC S9(006) COMP-3.
000750 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚Q PIC S9(003)V9(7) COMP-3.
000760 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚Q PIC  X(001).
000770 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚Q PIC  X(001).
000780 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚Q PIC  X(001).
000790 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚Q PIC  X(007).
000800 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚R PIC  X(003).
000810 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚R PIC  X(001).
000820 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚R PIC S9(002) COMP-3.
000830 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚R PIC S9(003) COMP-3.
000840 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚R PIC S9(012)V9(2) COMP-3.
000850 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚R PIC  X(004).
000860 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚R PIC S9(004)V9(2) COMP-3.
000870 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚R PIC S9(013) COMP-3.
000880 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚R PIC  X(001).
000890 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚R PIC  X(008).
000900 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚R PIC S9(003) COMP-3.
000910 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚R PIC  X(004).
000920 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚R PIC  X(016).
000930 01  ‚k‚s‚q‚s‚s‚q|“E—v‚R PIC  X(035).
000940 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚R PIC S9(001) COMP-3.
000950 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚R PIC S9(006) COMP-3.
000960 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚R PIC S9(001) COMP-3.
000970 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚R PIC S9(006) COMP-3.
000980 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚R PIC S9(003)V9(7) COMP-3.
000990 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚R PIC  X(001).
001000 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚R PIC  X(001).
001010 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚R PIC  X(001).
001020 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚R PIC  X(007).
001030 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚S PIC  X(003).
001040 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚S PIC  X(001).
001050 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚S PIC S9(002) COMP-3.
001060 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚S PIC S9(003) COMP-3.
001070 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚S PIC S9(012)V9(2) COMP-3.
001080 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚S PIC  X(004).
001090 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚S PIC S9(004)V9(2) COMP-3.
001100 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚S PIC S9(013) COMP-3.
001110 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚S PIC  X(001).
001120 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚S PIC  X(008).
001130 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚S PIC S9(003) COMP-3.
001140 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚S PIC  X(004).
001150 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚S PIC  X(016).
001160 01  ‚k‚s‚q‚s‚s‚q|“E—v‚S PIC  X(035).
001170 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚S PIC S9(001) COMP-3.
001180 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚S PIC S9(006) COMP-3.
001190 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚S PIC S9(001) COMP-3.
001200 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚S PIC S9(006) COMP-3.
001210 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚S PIC S9(003)V9(7) COMP-3.
001220 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚S PIC  X(001).
001230 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚S PIC  X(001).
001240 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚S PIC  X(001).
001250 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚S PIC  X(007).
001260 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚T PIC  X(003).
001270 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚T PIC  X(001).
001280 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚T PIC S9(002) COMP-3.
001290 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚T PIC S9(003) COMP-3.
001300 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚T PIC S9(012)V9(2) COMP-3.
001310 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚T PIC  X(004).
001320 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚T PIC S9(004)V9(2) COMP-3.
001330 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚T PIC S9(013) COMP-3.
001340 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚T PIC  X(001).
001350 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚T PIC  X(008).
001360 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚T PIC S9(003) COMP-3.
001370 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚T PIC  X(004).
001380 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚T PIC  X(016).
001390 01  ‚k‚s‚q‚s‚s‚q|“E—v‚T PIC  X(035).
001400 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚T PIC S9(001) COMP-3.
001410 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚T PIC S9(006) COMP-3.
001420 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚T PIC S9(001) COMP-3.
001430 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚T PIC S9(006) COMP-3.
001440 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚T PIC S9(003)V9(7) COMP-3.
001450 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚T PIC  X(001).
001460 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚T PIC  X(001).
001470 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚T PIC  X(001).
001480 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚T PIC  X(007).
001490 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚U PIC  X(003).
001500 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚U PIC  X(001).
001510 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚U PIC S9(002) COMP-3.
001520 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚U PIC S9(003) COMP-3.
001530 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚U PIC S9(012)V9(2) COMP-3.
001540 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚U PIC  X(004).
001550 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚U PIC S9(004)V9(2) COMP-3.
001560 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚U PIC S9(013) COMP-3.
001570 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚U PIC  X(001).
001580 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚U PIC  X(008).
001590 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚U PIC S9(003) COMP-3.
001600 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚U PIC  X(004).
001610 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚U PIC  X(016).
001620 01  ‚k‚s‚q‚s‚s‚q|“E—v‚U PIC  X(035).
001630 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚U PIC S9(001) COMP-3.
001640 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚U PIC S9(006) COMP-3.
001650 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚U PIC S9(001) COMP-3.
001660 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚U PIC S9(006) COMP-3.
001670 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚U PIC S9(003)V9(7) COMP-3.
001680 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚U PIC  X(001).
001690 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚U PIC  X(001).
001700 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚U PIC  X(001).
001710 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚U PIC  X(007).
001720 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚V PIC  X(003).
001730 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚V PIC  X(001).
001740 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚V PIC S9(002) COMP-3.
001750 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚V PIC S9(003) COMP-3.
001760 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚V PIC S9(012)V9(2) COMP-3.
001770 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚V PIC  X(004).
001780 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚V PIC S9(004)V9(2) COMP-3.
001790 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚V PIC S9(013) COMP-3.
001800 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚V PIC  X(001).
001810 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚V PIC  X(008).
001820 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚V PIC S9(003) COMP-3.
001830 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚V PIC  X(004).
001840 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚V PIC  X(016).
001850 01  ‚k‚s‚q‚s‚s‚q|“E—v‚V PIC  X(035).
001860 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚V PIC S9(001) COMP-3.
001870 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚V PIC S9(006) COMP-3.
001880 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚V PIC S9(001) COMP-3.
001890 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚V PIC S9(006) COMP-3.
001900 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚V PIC S9(003)V9(7) COMP-3.
001910 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚V PIC  X(001).
001920 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚V PIC  X(001).
001930 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚V PIC  X(001).
001940 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚V PIC  X(007).
001950 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚W PIC  X(003).
001960 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚W PIC  X(001).
001970 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚W PIC S9(002) COMP-3.
001980 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚W PIC S9(003) COMP-3.
001990 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚W PIC S9(012)V9(2) COMP-3.
002000 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚W PIC  X(004).
002010 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚W PIC S9(004)V9(2) COMP-3.
002020 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚W PIC S9(013) COMP-3.
002030 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚W PIC  X(001).
002040 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚W PIC  X(008).
002050 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚W PIC S9(003) COMP-3.
002060 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚W PIC  X(004).
002070 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚W PIC  X(016).
002080 01  ‚k‚s‚q‚s‚s‚q|“E—v‚W PIC  X(035).
002090 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚W PIC S9(001) COMP-3.
002100 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚W PIC S9(006) COMP-3.
002110 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚W PIC S9(001) COMP-3.
002120 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚W PIC S9(006) COMP-3.
002130 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚W PIC S9(003)V9(7) COMP-3.
002140 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚W PIC  X(001).
002150 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚W PIC  X(001).
002160 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚W PIC  X(001).
002170 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚W PIC  X(007).
002180 01  ‚k‚s‚q‚s‚s‚q|•¼Ží‚X PIC  X(003).
002190 01  ‚k‚s‚q‚s‚s‚q|ƒƒOƒ^ƒCƒv‚X PIC  X(001).
002200 01  ‚k‚s‚q‚s‚s‚q|‚r‚d‚p‚m‚n‚X PIC S9(002) COMP-3.
002210 01  ‚k‚s‚q‚s‚s‚q|ŠÇ”Ì”ïƒR[ƒh‚X PIC S9(003) COMP-3.
002220 01  ‚k‚s‚q‚s‚s‚q|ŠO‰Ý‹àŠz‚X PIC S9(012)V9(2) COMP-3.
002230 01  ‚k‚s‚q‚s‚s‚q|‚d‚w‹æ•ª‚X PIC  X(004).
002240 01  ‚k‚s‚q‚s‚s‚q|Š·ŽZƒŒ[ƒg‚X PIC S9(004)V9(2) COMP-3.
002250 01  ‚k‚s‚q‚s‚s‚q|‰~‰Ý‹àŠz‚X PIC S9(013) COMP-3.
002260 01  ‚k‚s‚q‚s‚s‚q|‘Î‰¿‚e‚h‚w‚X PIC  X(001).
002270 01  ‚k‚s‚q‚s‚s‚q|ŒûÀ”Ô†‚X PIC  X(008).
002280 01  ‚k‚s‚q‚s‚s‚q|‰ÛÅƒR[ƒh‚X PIC S9(003) COMP-3.
002290 01  ‚k‚s‚q‚s‚s‚q|ŒûÀŽåŠÇŽ–‹ÆŠ‚X PIC  X(004).
002300 01  ‚k‚s‚q‚s‚s‚q|‚q‚d‚e‚m‚n‚X PIC  X(016).
002310 01  ‚k‚s‚q‚s‚s‚q|“E—v‚X PIC  X(035).
002320 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|¢‹I‚X PIC S9(001) COMP-3.
002330 01  ‚k‚s‚q‚s‚s‚q|ŽnŠú|”NŒŽ“ú‚X PIC S9(006) COMP-3.
002340 01  ‚k‚s‚q‚s‚s‚q|IŠú|¢‹I‚X PIC S9(001) COMP-3.
002350 01  ‚k‚s‚q‚s‚s‚q|IŠú|”NŒŽ“ú‚X PIC S9(006) COMP-3.
002360 01  ‚k‚s‚q‚s‚s‚q|—˜—¦‚X PIC S9(003)V9(7) COMP-3.
002370 01  ‚k‚s‚q‚s‚s‚q|•Ð’[—¼’[‹æ•ª‚X PIC  X(001).
002380 01  ‚k‚s‚q‚s‚s‚q|‘OŽæŒãŽæ‹æ•ª‚X PIC  X(001).
002390 01  ‚k‚s‚q‚s‚s‚q|—˜—¦Šî”‚X PIC  X(001).
002400 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚X PIC  X(007).
002410 01  ‚k‚s‚q‚s‚s‚q|Á”ïÅ—¦ PIC S9(003)V9(1) COMP-3.
002420 01  ‚k‚s‚q‚s‚s‚q|ƒ_ƒ~[‚O‚O‚S PIC  X(031).
002430 01  ‚k‚s‚q‚s‚s‚q|‹¤’Êî•ñ PIC  X(035).
