000010************************************************
000020* Žæˆøæƒ}ƒXƒ^[i¿‹æƒŒƒR[ƒhj(LTRTRS)
000030************************************************
000040 01  ‚k‚s‚q‚s‚q‚r|ŽæˆøæƒR[ƒh PIC  X(008).
000050 01  ‚k‚s‚q‚s‚q‚r|¿‹æƒR[ƒh PIC  X(008).
000060 01  ‚k‚s‚q‚s‚q‚r|¿‹‘”­s—lŽ® PIC  X(001).
000070 01  ‚k‚s‚q‚s‚q‚r|¿‹‘”­sŒŽ‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚s‚q‚r|ƒŠ[ƒX—¿“ü‹à’PˆÊ PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚s‚q‚r|UžŽè”—¿•‰’S PIC S9(001) COMP-3.
000100 01  ‚k‚s‚q‚s‚q‚r|‹âsî•ñŽ©U‹âsƒR[ƒh PIC  X(007).
000110 01  ‚k‚s‚q‚s‚q‚r|‹âsî•ñŽ©UŒûÀ”Ô† PIC  X(007).
000120 01  ‚k‚s‚q‚s‚q‚r|‹âsî•ñŽ©U—a‹àŽí—Þ PIC  X(001).
000130 01  ‚k‚s‚q‚s‚q‚r|ÄƒŠ[ƒXî•ñŒvŽZ—¦•ªŽq PIC S9(003) COMP-3.
000140 01  ‚k‚s‚q‚s‚q‚r|ÄƒŠ[ƒXî•ñŒvŽZ—¦•ª•ê PIC S9(004) COMP-3.
000150 01  ‚k‚s‚q‚s‚q‚r|ÄƒŠ[ƒXî•ñŒvŽZ’PˆÊ PIC  X(001).
000160 01  ‚k‚s‚q‚s‚q‚r|ÄƒŠ[ƒXî•ñŒvŽZ•ûŽ® PIC  X(001).
000170 01  ‚k‚s‚q‚s‚q‚r|¿‹æ•”–å³Ž®–¼ÌŠ¿Žš PIC  X(040).
000180 01  ‚k‚s‚q‚s‚q‚r|¿‹æ•”–å³Ž®–¼Ì PIC  X(020).
000190 01  ‚k‚s‚q‚s‚q‚r|–ž—¹’Ê’m‘”­s—lŽ® PIC  X(001).
000200 01  ‚k‚s‚q‚s‚q‚r|Ž©“®XV“K—pœŠO‹æ•ª PIC  X(001).
000210 01  ‚k‚s‚q‚s‚q‚r|ƒ_ƒ~[‚O‚O‚P PIC  X(069).
000220 01  ‚k‚s‚q‚s‚q‚r|‹¤’Êî•ñ‚b‚o‚c‚j‚x‚n‚s‚t PIC  X(035).
