000010************************************************
000020* (MAN_PATCH_WK_JUSIN)
000030************************************************
000040 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|¿‹æƒR[ƒh 
                                             PIC  X(008).
000060 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|‰ñŽû•ûŽ® PIC  X(001).
000070 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|‹âsƒR[ƒh 
                                             PIC  X(007).
000080 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|ŒûÀ”Ô† PIC  X(007).
000090 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|—a‹àŽí—Þ PIC  X(001).
000100 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|XV‰ñŽû•ûŽ® 
                                             PIC  X(001).
000110 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|XV‹âsƒR[ƒh 
                                             PIC  X(007).
000120 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|XVŒûÀ”Ô† 
                                             PIC  X(007).
000130 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚i‚t‚r‚h‚m|XV—a‹àŽí—Þ 
                                             PIC  X(001).
