000010************************************************
000020* (MAN_WK_KALPIS_KAISHI)
000030************************************************
000040 01  ‚l‚`‚m|‚v‚j|‚j‚`‚k‚o‚h‚r|‚j‚`‚h‚r‚g‚h|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚l‚`‚m|‚v‚j|‚j‚`‚k‚o‚h‚r|‚j‚`‚h‚r‚g‚h|•¨Œ‚m‚n 
                                             PIC  X(003).
000060 01  ‚l‚`‚m|‚v‚j|‚j‚`‚k‚o‚h‚r|‚j‚`‚h‚r‚g‚h|ƒŠ[ƒXI—¹“ú 
                                             PIC  X(008).
000070 01  ‚l‚`‚m|‚v‚j|‚j‚`‚k‚o‚h‚r|‚j‚`‚h‚r‚g‚h|ÄƒŠ[ƒXŠJŽn“ú 
                                             PIC  X(008).
