000010************************************************
000020* (MAN_PATAN)
000030************************************************
000040 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000050 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ƒ†[ƒU[–¼|Š¿Žš PIC  X(060).
000060 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ƒ†[ƒU[–¼|ƒJƒi PIC  X(050).
000070 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ˆø“n‹æ•ª PIC  X(001).
000080 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|”„‹p‹àŠz“ü‹àæƒR[ƒh PIC  X(008).
000090 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ˆø“næ–¼|Š¿Žš PIC  X(060).
000100 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ˆø“næ–¼|ƒJƒi PIC  X(050).
000110 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|”„‹pˆÏ‘õŽè”—¿Š„‡ 
                                             PIC S9(002)V9(2) COMP-3.
000120 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|”„‹p‘ã‹à“ü‹à—\’è“úƒvƒ‰ƒXŒŽ” 
                                             PIC S9(002) COMP-3.
000130 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|”„‹p‘ã‹à“ü‹à—\’è“ú“ú PIC  X(002).
000140 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|Žó“nŠúŒÀ PIC  X(030).
000150 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|Žx•¥ðŒ PIC  X(040).
000160 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ÄƒŠ[ƒX—¿ŒvŽZ—¦ PIC S9(004) COMP-3.
000170 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ÄƒŠ[ƒX—¿ŒvŽZ’PˆÊ PIC  X(001).
000180 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ÄƒŠ[ƒX—¿’[”ˆ—ƒR[ƒh PIC  X(001).
000190 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|Žx•¥ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000200 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
000210 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000220 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ÄƒŠ[ƒX—¿“ü‹à“úƒvƒ‰ƒXŒŽ” 
                                             PIC S9(002) COMP-3.
000230 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ÄƒŠ[ƒX—¿“ü‹à“ú“ú PIC  X(002).
000240 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|“ü‹àŠî€“ú PIC  X(002).
000250 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|‰ñŽû•ûŽ®|‚P PIC  X(001).
000260 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|‰ñŽû•ûŽ®|‚Q PIC  X(001).
000270 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ÄƒŠ[ƒXŽæˆµŽè”—¿Š„‡ 
                                             PIC S9(002)V9(2) COMP-3.
000280 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹‘‘—•tæZŠ PIC  X(100).
000290 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹‘‘—•tæ‰ïŽÐ–¼ PIC  X(060).
000300 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚P PIC  X(008).
000310 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚Q PIC  X(008).
000320 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚R PIC  X(008).
000330 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚S PIC  X(008).
000340 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚T PIC  X(008).
000350 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚U PIC  X(008).
000360 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚V PIC  X(008).
000370 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚W PIC  X(008).
000380 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚X PIC  X(008).
000390 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚P‚O PIC  X(008).
000400 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚P‚P PIC  X(008).
000410 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚P‚Q PIC  X(008).
000420 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚P‚R PIC  X(008).
000430 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚P‚S PIC  X(008).
000440 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|¿‹æƒR[ƒh|‚P‚T PIC  X(008).
000450 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|’ •[o—Í”NŒŽ“úƒvƒ‰ƒXŒŽ” 
                                             PIC S9(002) COMP-3.
000460 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|’ •[o—Í”NŒŽ“ú“ú PIC  X(002).
000470 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|“o˜^“ú PIC  X(008).
000480 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|“o˜^Žž PIC  X(006).
000490 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000500 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|XV“ú PIC  X(008).
000510 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|XVŽž PIC  X(006).
000520 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000530 01  ‚l‚`‚m|‚o‚`‚s‚`‚m|ˆø“næ‹æ•ª|”pŠü PIC  X(001).
