000010************************************************
000020* (MAN_PATCH_WK_MEISAI)
000030************************************************
000040 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|•¨Œ‚m‚n 
                                             PIC  X(003).
000060 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|¿‹æƒR[ƒh 
                                             PIC  X(008).
000070 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|‰ñŽû•ûŽ®‚P 
                                             PIC  X(001).
000080 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|‰ñŽû•ûŽ®‚Q 
                                             PIC  X(001).
000090 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|‹âsƒR[ƒh 
                                             PIC  X(007).
000100 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|ŒûÀ”Ô† 
                                             PIC  X(007).
000110 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|—a‹àŽí—Þ 
                                             PIC  X(001).
000120 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|XV‰ñŽû•ûŽ®‚P 
                                             PIC  X(001).
000130 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|XV‰ñŽû•ûŽ®‚Q 
                                             PIC  X(001).
000140 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|XV‹âsƒR[ƒh 
                                             PIC  X(007).
000150 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|XVŒûÀ”Ô† 
                                             PIC  X(007).
000160 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚l‚d‚h‚r‚`‚h|XV—a‹àŽí—Þ 
                                             PIC  X(001).
