000010************************************************
000020* (MFS_TORERA)
000030************************************************
000040 01  ‚l‚e‚r|‚s‚n‚q‚d‚q‚`|ƒf[ƒ^‹æ•ª PIC  X(001).
000050 01  ‚l‚e‚r|‚s‚n‚q‚d‚q‚`|¿‹‡ŒvŒ” PIC S9(006) COMP-3.
000060 01  ‚l‚e‚r|‚s‚n‚q‚d‚q‚`|¿‹‡Œv‹àŠz PIC S9(012) COMP-3.
000070 01  ‚l‚e‚r|‚s‚n‚q‚d‚q‚`|U‘ÖÏ‡ŒvŒ” PIC  X(006).
000080 01  ‚l‚e‚r|‚s‚n‚q‚d‚q‚`|U‘ÖÏ‡Œv‹àŠz PIC  X(012).
000090 01  ‚l‚e‚r|‚s‚n‚q‚d‚q‚`|U‘Ö•s”\‡ŒvŒ” PIC  X(006).
000100 01  ‚l‚e‚r|‚s‚n‚q‚d‚q‚`|U‘Ö•s”\‡Œv‹àŠz PIC  X(012).
000110 01  ‚l‚e‚r|‚s‚n‚q‚d‚q‚`|ƒ_ƒ~[‚O‚O‚P PIC  X(065).
