000010************************************************
000020* (MFS_WK_ERR)
000030************************************************
000040 01  ‚l‚e‚r|‚v‚j|‚d‚q‚q|‹âsƒR[ƒh PIC  X(004).
000050 01  ‚l‚e‚r|‚v‚j|‚d‚q‚q|Žx“XƒR[ƒh PIC  X(003).
000060 01  ‚l‚e‚r|‚v‚j|‚d‚q‚q|—a‹àŽí—Þ PIC  X(001).
000070 01  ‚l‚e‚r|‚v‚j|‚d‚q‚q|ŒûÀ”Ô† PIC  X(007).
000080 01  ‚l‚e‚r|‚v‚j|‚d‚q‚q|—a‹àŽÒ–¼ PIC  X(030).
000090 01  ‚l‚e‚r|‚v‚j|‚d‚q‚q|¿‹‹àŠz PIC S9(010) COMP-3.
000100 01  ‚l‚e‚r|‚v‚j|‚d‚q‚q|¿‹æƒR[ƒh PIC  X(008).
000110 01  ‚l‚e‚r|‚v‚j|‚d‚q‚q|‚o‚`‚x‚c‚`‚x PIC  X(004).
