000010************************************************
000020* (MFS_KOBETU)
000030************************************************
000040 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|‹âsƒR[ƒh PIC  X(004).
000060 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|Žx“XƒR[ƒh PIC  X(003).
000070 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|—a‹àŽí—Þ PIC  X(001).
000080 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|ŒûÀ”Ô† PIC  X(007).
000090 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|ŒûÀ–¼‹`l–¼ PIC  X(030).
000100 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|¿‹‹àŠz PIC S9(010) COMP-3.
000110 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|V‹KƒR[ƒh PIC  X(001).
000120 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|ŒÚ‹q”Ô† PIC  X(012).
000130 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|“o˜^“ú PIC  X(008).
000140 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|“o˜^Žž PIC  X(006).
000150 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000160 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|XV“ú PIC  X(008).
000170 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|XVŽž PIC  X(006).
000180 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000190 01  ‚l‚e‚r|‚j‚n‚a‚d‚s‚t|“ü‹à“ú PIC  X(002).
