000010************************************************
000020* (MFS_DATMOD)
000030************************************************
000040 01  MFS_DATMOD-JOBTYP PIC  X(004).
000050 01  MFS_DATMOD-REGTIM PIC  X(006).
000060 01  MFS_DATMOD-PAYNUM PIC  X(008).
000070 01  MFS_DATMOD-PAYDAY PIC  X(004).
000080 01  MFS_DATMOD-BNKCOD PIC  X(004).
000090 01  MFS_DATMOD-BNKNAM PIC  X(015).
000100 01  MFS_DATMOD-BRCCOD PIC  X(003).
000110 01  MFS_DATMOD-BRCNAM PIC  X(015).
000120 01  MFS_DATMOD-CSTNAM PIC  X(030).
000130 01  MFS_DATMOD-DEPKND PIC  X(001).
000140 01  MFS_DATMOD-DEPNUM PIC  X(007).
000150 01  MFS_DATMOD-TRNAMT PIC S9(010) COMP-3.
000160 01  MFS_DATMOD-BNKCOD_O PIC  X(004).
000170 01  MFS_DATMOD-BNKNAM_O PIC  X(015).
000180 01  MFS_DATMOD-BRCCOD_O PIC  X(003).
000190 01  MFS_DATMOD-BRCNAM_O PIC  X(015).
000200 01  MFS_DATMOD-CSTNAM_O PIC  X(030).
000210 01  MFS_DATMOD-DEPKND_O PIC  X(001).
000220 01  MFS_DATMOD-DEPNUM_O PIC  X(007).
000230 01  MFS_DATMOD-TRNAMT_O PIC S9(010) COMP-3.
000240 01  MFS_DATMOD-BNKCOD_M PIC  X(001).
000250 01  MFS_DATMOD-BNKNAM_M PIC  X(001).
000260 01  MFS_DATMOD-BRCCOD_M PIC  X(001).
000270 01  MFS_DATMOD-BRCNAM_M PIC  X(001).
000280 01  MFS_DATMOD-CSTNAM_M PIC  X(001).
000290 01  MFS_DATMOD-DEPKND_M PIC  X(001).
000300 01  MFS_DATMOD-DEPNUM_M PIC  X(001).
000310 01  MFS_DATMOD-TRNAMT_M PIC  X(001).
