000010************************************************
000020* (MST_SINYO_KISHU)
000030************************************************
000040 01  MST_SINYO_KISHU-ﾘｰｽ_割賦区分 PIC  X(001).
000050 01  MST_SINYO_KISHU-信用保険ｺｰﾄﾞ_機種区分 PIC  X(002).
000060 01  MST_SINYO_KISHU-信用保険機種ｺｰﾄﾞ PIC  X(040).
000070 01  MST_SINYO_KISHU-登録日 PIC  X(008).
000080 01  MST_SINYO_KISHU-登録時刻 PIC  X(006).
000090 01  MST_SINYO_KISHU-登録担当者ｺｰﾄﾞ PIC  X(004).
000100 01  MST_SINYO_KISHU-更新日 PIC  X(008).
000110 01  MST_SINYO_KISHU-更新時刻 PIC  X(006).
000120 01  MST_SINYO_KISHU-更新担当者ｺｰﾄﾞ PIC  X(004).
000130 01  MST_SINYO_KISHU-信用保険ｺｰﾄﾞ_機械区分 PIC  X(002).
