000010************************************************
000020* (MST_SINYO)
000030************************************************
000040 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|M—p•ÛŒ¯—¿—¦ƒR[ƒh PIC  X(004).
000050 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|“K—p“ú|‚P PIC  X(008).
000060 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|M—p•ÛŒ¯•ÛŒ¯—¿—¦|‚P 
                                             PIC S9(002)V9(8) COMP-3.
000070 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|“K—p“ú|‚Q PIC  X(008).
000080 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|M—p•ÛŒ¯•ÛŒ¯—¿—¦|‚Q 
                                             PIC S9(002)V9(8) COMP-3.
000090 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|“K—p“ú|‚R PIC  X(008).
000100 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|M—p•ÛŒ¯•ÛŒ¯—¿—¦|‚R 
                                             PIC S9(002)V9(8) COMP-3.
000110 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|M—p•ÛŒ¯—¿—¦‹æ•ª PIC  X(001).
000120 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|ƒŠ[ƒX|Š„•Š‹æ•ª PIC  X(001).
000130 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|M—p•ÛŒ¯ƒR[ƒh|‹@ŠB‹æ•ª PIC  X(002).
000140 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|M—p•ÛŒ¯ƒR[ƒh|‹@Ží‹æ•ª PIC  X(002).
000150 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|“o˜^“ú PIC  X(008).
000160 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|“o˜^Žž PIC  X(006).
000170 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000180 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|XV“ú PIC  X(008).
000190 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|XVŽž PIC  X(006).
000200 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000210 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|•t•Û‹æ•ª PIC  X(001).
000220 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|•ÛŒ¯ŠúŠÔŒŽ”|‚P PIC  X(003).
000230 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|Š„‘Š„ˆø‹æ•ª|‚P PIC  X(001).
000240 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|Š„‘Š„ˆø—¦|‚P PIC S9(002)V9(8) COMP-3.
000250 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|•ÛŒ¯ŠúŠÔŒŽ”|‚Q PIC  X(003).
000260 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|Š„‘Š„ˆø‹æ•ª|‚Q PIC  X(001).
000270 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|Š„‘Š„ˆø—¦|‚Q PIC S9(002)V9(8) COMP-3.
000280 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|•ÛŒ¯ŠúŠÔŒŽ”|‚R PIC  X(003).
000290 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|Š„‘Š„ˆø‹æ•ª|‚R PIC  X(001).
000300 01  ‚l‚r‚s|‚r‚h‚m‚x‚n|Š„‘Š„ˆø—¦|‚R PIC S9(002)V9(8) COMP-3.
