000010************************************************
000020* (MST_RENDO)
000030************************************************
000040 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|˜A“®‹à—˜ƒR[ƒh PIC  X(002).
000050 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú PIC  X(008).
000060 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|˜A“®‹à—˜–¼ PIC  X(020).
000070 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚P PIC S9(002)V9(8) COMP-3.
000080 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚P PIC  X(008).
000090 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚Q PIC S9(002)V9(8) COMP-3.
000100 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚Q PIC  X(008).
000110 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚R PIC S9(002)V9(8) COMP-3.
000120 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚R PIC  X(008).
000130 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚S PIC S9(002)V9(8) COMP-3.
000140 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚S PIC  X(008).
000150 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚T PIC S9(002)V9(8) COMP-3.
000160 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚T PIC  X(008).
000170 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚U PIC S9(002)V9(8) COMP-3.
000180 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚U PIC  X(008).
000190 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚V PIC S9(002)V9(8) COMP-3.
000200 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚V PIC  X(008).
000210 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚W PIC S9(002)V9(8) COMP-3.
000220 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚W PIC  X(008).
000230 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚X PIC S9(002)V9(8) COMP-3.
000240 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚X PIC  X(008).
000250 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚P‚O PIC S9(002)V9(8) COMP-3.
000260 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚P‚O PIC  X(008).
000270 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚P‚P PIC S9(002)V9(8) COMP-3.
000280 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚P‚P PIC  X(008).
000290 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚P‚Q PIC S9(002)V9(8) COMP-3.
000300 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚P‚Q PIC  X(008).
000310 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚P‚R PIC S9(002)V9(8) COMP-3.
000320 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚P‚R PIC  X(008).
000330 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚P‚S PIC S9(002)V9(8) COMP-3.
000340 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚P‚S PIC  X(008).
000350 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|—˜—¦‚P‚T PIC S9(002)V9(8) COMP-3.
000360 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“K—p“ú‚P‚T PIC  X(008).
000370 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“o˜^“ú PIC  X(008).
000380 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“o˜^Žž PIC  X(006).
000390 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000400 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|XV“ú PIC  X(008).
000410 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|XVŽž PIC  X(006).
000420 01  ‚l‚r‚s|‚q‚d‚m‚c‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
