000010************************************************
000020* (MST_GYOSHU)
000030************************************************
000040 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|‹ÆŽíƒR[ƒh PIC  X(002).
000050 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|‹ÆŽí–¼ PIC  X(030).
000060 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|‹ÆŽí–¼|—ªÌ PIC  X(010).
000070 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|“o˜^“ú PIC  X(008).
000080 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|“o˜^Žž PIC  X(006).
000090 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000100 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|XV“ú PIC  X(008).
000110 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|XVŽž PIC  X(006).
000120 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000130 01  ‚l‚r‚s|‚f‚x‚n‚r‚g‚t|Žå—v‹ÆŽí“à—e PIC  X(2000).
