000010************************************************
000020* (MST_SISAN)
000030************************************************
000040 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|Ž‘ŽYƒR[ƒh PIC  X(007).
000050 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|Ž‘ŽY–¼ PIC  X(030).
000060 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|Ž‘ŽY–¼|—ªÌ PIC  X(010).
000070 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|‘Ï—p”N”|”N” PIC S9(003) COMP-3.
000080 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|“K—p“ú|‚P PIC  X(008).
000090 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|–@’èŒ¸‰¿ž‹p—¦|‚P 
                                             PIC S9(002)V9(8) COMP-3.
000100 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|“K—p“ú|‚Q PIC  X(008).
000110 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|–@’èŒ¸‰¿ž‹p—¦|‚Q 
                                             PIC S9(002)V9(8) COMP-3.
000120 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|“o˜^“ú PIC  X(008).
000130 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|“o˜^Žž PIC  X(006).
000140 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|XV“ú PIC  X(008).
000160 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|XVŽž PIC  X(006).
000170 01  ‚l‚r‚s|‚r‚h‚r‚`‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
