000010************************************************
000020* (NTL_SUPPLIER)
000030************************************************
000040 01  ‚m‚s‚k|‚r‚t‚o‚o‚k‚h‚d‚q|ƒŒƒR[ƒhŽí•Ê PIC  X(001).
000050 01  ‚m‚s‚k|‚r‚t‚o‚o‚k‚h‚d‚q|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(006).
000060 01  ‚m‚s‚k|‚r‚t‚o‚o‚k‚h‚d‚q|‚r‚oŒÚ‹q‚h‚c PIC  X(012).
000070 01  ‚m‚s‚k|‚r‚t‚o‚o‚k‚h‚d‚q|ƒTƒvƒ‰ƒCƒ„[–¼ PIC  X(064).
000080 01  ‚m‚s‚k|‚r‚t‚o‚o‚k‚h‚d‚q|ì¬‚h‚c PIC  X(010).
000090 01  ‚m‚s‚k|‚r‚t‚o‚o‚k‚h‚d‚q|ì¬“ú PIC  X(010).
000100 01  ‚m‚s‚k|‚r‚t‚o‚o‚k‚h‚d‚q|XV‚h‚c PIC  X(010).
000110 01  ‚m‚s‚k|‚r‚t‚o‚o‚k‚h‚d‚q|XV“ú PIC  X(010).
