000010************************************************
000020* (NTL_CONTRACT_CSV)
000030************************************************
000040 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ƒŠ[ƒX‰ïŽÐ‚h‚c 
                                             PIC  X(008).
000060 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ŒÚ‹q‚h‚c PIC  X(014).
000070 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|Œ_–ñ‚h‚c PIC  X(024).
000080 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|‘ã•\‚r‚oŒÚ‹q‚h‚c 
                                             PIC  X(014).
000090 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ŽæˆøŽí—Þ‚b‚c PIC  X(004).
000100 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|•½‹ÏŒŽŠzƒŠ[ƒX—¿ 
                                             PIC  X(015).
000110 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ŽŸ‰ñ–ñ’è‰ñŽûŠz 
                                             PIC  X(014).
000120 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|¬–ñ“ú PIC  X(012).
000130 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ŒŸŽû“ú PIC  X(012).
000140 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ƒŠ[ƒXŠúŠÔ PIC  X(006).
000150 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ÄƒŠ[ƒX‰ñ” PIC  X(006).
000160 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|‘ã•\•¨Œ–¼ PIC  X(082).
000170 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|–ž—¹“ú PIC  X(012).
000180 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|Žc‰ñ”|–ñ’èƒx[ƒX 
                                             PIC  X(006).
000190 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ÂŒ Žc‚|–ñ’èƒx[ƒX 
                                             PIC  X(016).
000200 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|¿‹æ•”–¼ PIC  X(066).
000210 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ŒŸõ—pŒ_–ñ”Ô† 
                                             PIC  X(024).
000220 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|Œ_–ñ‚h‚c“X”Ô PIC  X(005).
000230 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|Œ_–ñ‚h‚cŽ}”Ô PIC  X(004).
000240 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|‹Ï“™|•s‹Ï“™‹æ•ª 
                                             PIC  X(014).
000250 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|‘OŽó‹æ•ª PIC  X(014).
000260 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|Žc‰¿—L–³‹æ•ª PIC  X(014).
000270 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|‘ã—‰ñŽû•ÛŽç—¿‹æ•ª 
                                             PIC  X(006).
000280 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|‘ã—‰ñŽû•ÛŽç—¿ 
                                             PIC  X(014).
000290 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|Œ_–ñ’S“–•”–¼ 
                                             PIC  X(066).
000300 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|Œ_–ñ”õ–Yî•ñ PIC  X(062).
000310 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ŽÐˆõ‚h‚c PIC  X(010).
000320 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ƒ\[ƒgê—p€–Ú 
                                             PIC  X(032).
000330 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|Œ_–ñŽí—Þ PIC  X(012).
000340 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ì¬‚h‚c PIC  X(012).
000350 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|ì¬“ú PIC  X(012).
000360 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|XV‚h‚c PIC  X(012).
000370 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‚b‚r‚u|XV“ú PIC  X(012).
