000010************************************************
000020* (NYU_BANKMAST)
000030************************************************
000040 01  NYU_BANKMAST-BNKCOD PIC  X(004).
000050 01  NYU_BANKMAST-BRCCOD PIC  X(003).
000060 01  NYU_BANKMAST-BNKNAM PIC  X(015).
000070 01  NYU_BANKMAST-BRCNAM PIC  X(015).
000080 01  NYU_BANKMAST-DEPKND PIC  X(001).
000090 01  NYU_BANKMAST-DEPNUM PIC  X(007).
000100 01  NYU_BANKMAST-CONSIG PIC  X(010).
000110 01  NYU_BANKMAST-FILNAM PIC  X(008).
000120 01  NYU_BANKMAST-BNKKNJ PIC  X(016).
