000010************************************************
000020* (NYU_AUTOEROR)
000030************************************************
000040 01  NYU_AUTOEROR-BNKCOD PIC  X(004).
000050 01  NYU_AUTOEROR-BNKNAM PIC  X(015).
000060 01  NYU_AUTOEROR-BRCCOD PIC  X(003).
000070 01  NYU_AUTOEROR-BRCNAM PIC  X(015).
000080 01  NYU_AUTOEROR-DEPKND PIC  X(001).
000090 01  NYU_AUTOEROR-DEPNUM PIC  X(007).
000100 01  NYU_AUTOEROR-PAYNUM PIC  X(008).
000110 01  NYU_AUTOEROR-CSTNAM PIC  X(030).
000120 01  NYU_AUTOEROR-TRNAMT PIC S9(010) COMP-3.
000130 01  NYU_AUTOEROR-CONTAX PIC S9(008) COMP-3.
000140 01  NYU_AUTOEROR-PAYDAY PIC  X(004).
000150 01  NYU_AUTOEROR-ERRFLG PIC  X(005).
