000010************************************************
000020* (NYU_AUTOADML)
000030************************************************
000040 01  NYU_AUTOADML-JOBTYP PIC  X(004).
000050 01  NYU_AUTOADML-REGTIM PIC  X(006).
000060 01  NYU_AUTOADML-PAYNUM PIC  X(008).
000070 01  NYU_AUTOADML-PAYDAY PIC  X(004).
000080 01  NYU_AUTOADML-BNKCOD PIC  X(004).
000090 01  NYU_AUTOADML-BNKNAM PIC  X(015).
000100 01  NYU_AUTOADML-BRCCOD PIC  X(003).
000110 01  NYU_AUTOADML-BRCNAM PIC  X(015).
000120 01  NYU_AUTOADML-CSTNAM PIC  X(030).
000130 01  NYU_AUTOADML-DEPKND PIC  X(001).
000140 01  NYU_AUTOADML-DEPNUM PIC  X(007).
000150 01  NYU_AUTOADML-TRNAMT PIC S9(010) COMP-3.
000160 01  NYU_AUTOADML-PAYDAY_O PIC  X(004).
000170 01  NYU_AUTOADML-BNKCOD_O PIC  X(004).
000180 01  NYU_AUTOADML-BNKNAM_O PIC  X(015).
000190 01  NYU_AUTOADML-BRCCOD_O PIC  X(003).
000200 01  NYU_AUTOADML-BRCNAM_O PIC  X(015).
000210 01  NYU_AUTOADML-CSTNAM_O PIC  X(030).
000220 01  NYU_AUTOADML-DEPKND_O PIC  X(001).
000230 01  NYU_AUTOADML-DEPNUM_O PIC  X(007).
000240 01  NYU_AUTOADML-TRNAMT_O PIC S9(010) COMP-3.
000250 01  NYU_AUTOADML-PAYDAY_M PIC  X(001).
000260 01  NYU_AUTOADML-BNKCOD_M PIC  X(001).
000270 01  NYU_AUTOADML-BNKNAM_M PIC  X(001).
000280 01  NYU_AUTOADML-BRCCOD_M PIC  X(001).
000290 01  NYU_AUTOADML-BRCNAM_M PIC  X(001).
000300 01  NYU_AUTOADML-CSTNAM_M PIC  X(001).
000310 01  NYU_AUTOADML-DEPKND_M PIC  X(001).
000320 01  NYU_AUTOADML-DEPNUM_M PIC  X(001).
000330 01  NYU_AUTOADML-TRNAMT_M PIC  X(001).
