000010************************************************
000020* (NYU_JOBCHK)
000030************************************************
000040 01  NYU_JOBCHK-OPEDAY PIC  X(004).
000050 01  NYU_JOBCHK-PAYDAY PIC  X(004).
000060 01  NYU_JOBCHK-GETTXT PIC  X(001).
000070 01  NYU_JOBCHK-DATMAK PIC  X(001).
000080 01  NYU_JOBCHK-LSTPRT PIC  X(001).
000090 01  NYU_JOBCHK-PUTFDD PIC  X(001).
000100 01  NYU_JOBCHK-SNDDAT PIC  X(001).
