000010************************************************
000020* (NYU_NAMECONV)
000030************************************************
000040 01  NYU-NAMECONV-BNKCOD          PIC  X(004).
000050 01  NYU-NAMECONV-PAYNUM          PIC  X(008).
000060 01  NYU-NAMECONV-CSTNAM          PIC  X(030).
000070 01  NYU-NAMECONV-PAYDAY          PIC  X(002).
