000010************************************************
000020* (OBA_ASTMST)
000030************************************************
000040 01  OBA_ASTMST-CNTNUM PIC  X(009).
000050 01  OBA_ASTMST-TRNTYP PIC  X(001).
000060 01  OBA_ASTMST-DIVCOD PIC  X(004).
000070 01  OBA_ASTMST-DIVNAM PIC  X(020).
000080 01  OBA_ASTMST-USRCOD PIC  X(008).
000090 01  OBA_ASTMST-USRNAM PIC  X(060).
000100 01  OBA_ASTMST-OBJNAM PIC  X(040).
000110 01  OBA_ASTMST-TRNDAY PIC  X(008).
000120 01  OBA_ASTMST-BGNDAY PIC  X(008).
000130 01  OBA_ASTMST-BASDAY PIC  X(008).
000140 01  OBA_ASTMST-CRERNK PIC  X(004).
000150 01  OBA_ASTMST-CNTAMT PIC S9(013) COMP-3.
000160 01  OBA_ASTMST-RCVAMT PIC S9(013) COMP-3.
000170 01  OBA_ASTMST-BALAMT PIC S9(013) COMP-3.
000180 01  OBA_ASTMST-REGDAY PIC  X(008).
000190 01  OBA_ASTMST-REGTIM PIC  X(006).
000200 01  OBA_ASTMST-REGPSN PIC  X(004).
000210 01  OBA_ASTMST-MODDAY PIC  X(008).
000220 01  OBA_ASTMST-MODTIM PIC  X(006).
000230 01  OBA_ASTMST-MODPSN PIC  X(004).
