000010************************************************
000020* (OBA_CNVWRK)
000030************************************************
000040 01  OBA_CNVWRK-CNTNUM PIC  X(018).
000050 01  OBA_CNVWRK-USRNAM PIC  X(060).
000060 01  OBA_CNVWRK-CNTAMT PIC S9(013) COMP-3.
000070 01  OBA_CNVWRK-TRNDAY PIC  X(008).
