000010************************************************
000020* (PAY_TAXADD)
000030************************************************
000040 01  PAY_TAXADD-DIVCOD PIC  X(004).
000050 01  PAY_TAXADD-DOCTYP PIC  X(001).
000060 01  PAY_TAXADD-TAXTYP PIC S9(006) COMP-3.
000070 01  PAY_TAXADD-TAXCNT PIC S9(004) COMP-3.
000080 01  PAY_TAXADD-TAXAMT PIC S9(012) COMP-3.
000090 01  PAY_TAXADD-BILCNT PIC S9(004) COMP-3.
000100 01  PAY_TAXADD-BILAMT PIC S9(012) COMP-3.
