000010************************************************
000020* (PAY_GAFPAY)
000030************************************************
000040 01  PAY_GAFPAY-CNTNUM PIC  X(009).
000050 01  PAY_GAFPAY-RELEAS PIC  X(001).
000060 01  PAY_GAFPAY-RECNUM PIC  X(004).
000070 01  PAY_GAFPAY-TRNTYP PIC  X(001).
000080 01  PAY_GAFPAY-DIVCOD PIC  X(004).
000090 01  PAY_GAFPAY-PAYCLT PIC  X(008).
000100 01  PAY_GAFPAY-PLNDAY PIC  X(008).
000110 01  PAY_GAFPAY-TRNDAY PIC  X(008).
000120 01  PAY_GAFPAY-TRNAMT PIC S9(013) COMP-3.
000130 01  PAY_GAFPAY-TRNTAX PIC S9(013) COMP-3.
000140 01  PAY_GAFPAY-PAYAMT PIC S9(013) COMP-3.
000150 01  PAY_GAFPAY-DEMFLG PIC  X(001).
000160 01  PAY_GAFPAY-PAYFLG PIC  X(001).
000170 01  PAY_GAFPAY-REGDAY PIC  X(008).
000180 01  PAY_GAFPAY-REGTIM PIC  X(006).
000190 01  PAY_GAFPAY-REGPSN PIC  X(004).
000200 01  PAY_GAFPAY-MODDAY PIC  X(008).
000210 01  PAY_GAFPAY-MODTIM PIC  X(006).
000220 01  PAY_GAFPAY-MODPSN PIC  X(004).
