000010************************************************
000020* (PAY_CNVMOD)
000030************************************************
000040 01  PAY_CNVMOD-JOBTYP PIC  X(004).
000050 01  PAY_CNVMOD-REGTIM PIC  X(006).
000060 01  PAY_CNVMOD-BNKCOD PIC  X(004).
000070 01  PAY_CNVMOD-BRCCOD PIC  X(003).
000080 01  PAY_CNVMOD-DEPKND PIC  X(001).
000090 01  PAY_CNVMOD-DEPNUM PIC  X(007).
000100 01  PAY_CNVMOD-CSTNAM PIC  X(030).
000110 01  PAY_CNVMOD-CSTNAM_O PIC  X(030).
