000010************************************************
000020* (PAY_CHKLST)
000030************************************************
000040 01  PAY_CHKLST-DATTYP PIC  X(001).
000050 01  PAY_CHKLST-BNKCOD PIC  X(004).
000060 01  PAY_CHKLST-BNKNAM PIC  X(015).
000070 01  PAY_CHKLST-BRCCOD PIC  X(003).
000080 01  PAY_CHKLST-BRCNAM PIC  X(015).
000090 01  PAY_CHKLST-PAYDAY PIC  X(004).
000100 01  PAY_CHKLST-DEPKND PIC  X(001).
000110 01  PAY_CHKLST-DEPNUM PIC  X(007).
000120 01  PAY_CHKLST-CSTNAM PIC  X(030).
000130 01  PAY_CHKLST-TRNAMT PIC S9(010) COMP-3.
000140 01  PAY_CHKLST-TRNTYP PIC  X(001).
000150 01  PAY_CHKLST-TRNNUM PIC  X(004).
000160 01  PAY_CHKLST-DUMMY1 PIC  X(006).
000170 01  PAY_CHKLST-OPEDAY PIC  X(004).
000180 01  PAY_CHKLST-OFCCOD PIC  X(004).
000190 01  PAY_CHKLST-DUMMY2 PIC  X(002).
000200 01  PAY_CHKLST-PAYTYP PIC  X(001).
000210 01  PAY_CHKLST-USRDEP PIC  X(008).
000220 01  PAY_CHKLST-CHGAMT PIC S9(005) COMP-3.
000230 01  PAY_CHKLST-BNKSEQ PIC  X(001).
000240 01  PAY_CHKLST-REGDAY PIC  X(008).
000250 01  PAY_CHKLST-REGTIM PIC  X(006).
000260 01  PAY_CHKLST-REGPSN PIC  X(004).
000270 01  PAY_CHKLST-MODDAY PIC  X(008).
000280 01  PAY_CHKLST-MODTIM PIC  X(006).
000290 01  PAY_CHKLST-MODPSN PIC  X(004).
000300 01  PAY_CHKLST-ERRFLG PIC  X(005).
