000010************************************************
000020* (PAY_BNSCLM)
000030************************************************
000040 01  PAY_BNSCLM-JOBTYP PIC  X(001).
000050 01  PAY_BNSCLM-JOBTIM PIC  X(006).
000060 01  PAY_BNSCLM-CNTNUM PIC  X(009).
000070 01  PAY_BNSCLM-RELEAS PIC  X(001).
000080 01  PAY_BNSCLM-PLNDAY PIC  X(008).
000090 01  PAY_BNSCLM-PAYDAY PIC  X(008).
000100 01  PAY_BNSCLM-PAYCLT PIC  X(008).
000110 01  PAY_BNSCLM-PAYNAM PIC  X(060).
000120 01  PAY_BNSCLM-TRNAMT PIC S9(013) COMP-3.
000130 01  PAY_BNSCLM-DEMFLG PIC  X(001).
000140 01  PAY_BNSCLM-DEMFLG_O PIC  X(001).
000150 01  PAY_BNSCLM-REGDAY PIC  X(008).
000160 01  PAY_BNSCLM-REGTIM PIC  X(006).
000170 01  PAY_BNSCLM-REGPSN PIC  X(004).
000180 01  PAY_BNSCLM-MODDAY PIC  X(008).
000190 01  PAY_BNSCLM-MODTIM PIC  X(006).
000200 01  PAY_BNSCLM-MODPSN PIC  X(004).
