000010************************************************
000020* (PAY_EDTREC)
000030************************************************
000040 01  PAY_EDTREC-DATTYP PIC  X(001).
000050 01  PAY_EDTREC-BNKCOD PIC  X(004).
000060 01  PAY_EDTREC-BNKNAM PIC  X(015).
000070 01  PAY_EDTREC-BRCCOD PIC  X(003).
000080 01  PAY_EDTREC-BRCNAM PIC  X(015).
000090 01  PAY_EDTREC-PAYDAY PIC  X(004).
000100 01  PAY_EDTREC-DEPKND PIC  X(001).
000110 01  PAY_EDTREC-DEPNUM PIC  X(007).
000120 01  PAY_EDTREC-CSTNAM PIC  X(030).
000130 01  PAY_EDTREC-TRNAMT PIC S9(010) COMP-3.
000140 01  PAY_EDTREC-TRNTYP PIC  X(001).
000150 01  PAY_EDTREC-TRNNUM PIC  X(004).
000160 01  PAY_EDTREC-DUMMY1 PIC  X(006).
000170 01  PAY_EDTREC-OPEDAY PIC  X(004).
000180 01  PAY_EDTREC-OFCCOD PIC  X(004).
000190 01  PAY_EDTREC-DUMMY2 PIC  X(002).
000200 01  PAY_EDTREC-PAYTYP PIC  X(001).
000210 01  PAY_EDTREC-USRDEP PIC  X(008).
000220 01  PAY_EDTREC-CHGAMT PIC S9(005) COMP-3.
000230 01  PAY_EDTREC-BNKSEQ PIC  X(001).
000240 01  PAY_EDTREC-REGDAY PIC  X(008).
000250 01  PAY_EDTREC-REGTIM PIC  X(006).
000260 01  PAY_EDTREC-REGPSN PIC  X(004).
000270 01  PAY_EDTREC-MODDAY PIC  X(008).
000280 01  PAY_EDTREC-MODTIM PIC  X(006).
000290 01  PAY_EDTREC-MODPSN PIC  X(004).
000300 01  PAY_EDTREC-ERRFLG PIC  X(005).
