000010************************************************
000020* (PAY_SNDREC)
000030************************************************
000040 01  PAY_SNDREC-DATTYP PIC  X(001).
000050 01  PAY_SNDREC-BNKCOD PIC  X(004).
000060 01  PAY_SNDREC-BNKNAM PIC  X(015).
000070 01  PAY_SNDREC-BRCCOD PIC  X(003).
000080 01  PAY_SNDREC-BRCNAM PIC  X(015).
000090 01  PAY_SNDREC-PAYDAY PIC  X(004).
000100 01  PAY_SNDREC-DEPKND PIC  X(001).
000110 01  PAY_SNDREC-DEPNUM PIC  X(007).
000120 01  PAY_SNDREC-CSTNAM PIC  X(030).
000130 01  PAY_SNDREC-TRNAMT PIC S9(010) COMP-3.
000140 01  PAY_SNDREC-TRNTYP PIC  X(001).
000150 01  PAY_SNDREC-TRNNUM PIC  X(004).
000160 01  PAY_SNDREC-DUMMY1 PIC  X(006).
000170 01  PAY_SNDREC-OPEDAY PIC  X(004).
000180 01  PAY_SNDREC-OFCCOD PIC  X(004).
000190 01  PAY_SNDREC-DUMMY2 PIC  X(002).
000200 01  PAY_SNDREC-PAYTYP PIC  X(001).
000210 01  PAY_SNDREC-USRDEP PIC  X(008).
000220 01  PAY_SNDREC-CHGAMT PIC S9(005) COMP-3.
000230 01  PAY_SNDREC-BNKSEQ PIC  X(001).
000240 01  PAY_SNDREC-REGDAY PIC  X(008).
000250 01  PAY_SNDREC-REGTIM PIC  X(006).
000260 01  PAY_SNDREC-REGPSN PIC  X(004).
000270 01  PAY_SNDREC-MODDAY PIC  X(008).
000280 01  PAY_SNDREC-MODTIM PIC  X(006).
000290 01  PAY_SNDREC-MODPSN PIC  X(004).
000300 01  PAY_SNDREC-ERRFLG PIC  X(005).
