000010************************************************
000020* (POK_LPWK_TORIHIKI)
000030************************************************
000040 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|˜A”Ô PIC  X(003).
000060 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|•¨Œ–¼ PIC  X(040).
000070 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|»‘¢‹ÆŽÒ–¼ PIC  X(060).
000080 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|ŠÇ—‚m‚n PIC  X(009).
000090 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|‹@ŽíƒR[ƒh PIC  X(015).
000100 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|‹@”Ô PIC  X(012).
000110 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|‰Šú”­’‚m‚n 
                                             PIC  X(011).
000120 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|‹@ŠB‘ã‹à 
                                             PIC S9(013) COMP-3.
000130 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|ŒŽŠzƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000140 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|ƒŠ[ƒXŽx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000150 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Ý’uæ–¼Ì PIC  X(100).
000160 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Ý’uæs­‹æ•ª‚P 
                                             PIC  X(002).
000170 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Ý’uæs­‹æ•ª‚Q 
                                             PIC  X(003).
000180 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Ý’uæ“s“¹•{Œ§–¼ 
                                             PIC  X(008).
000190 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Ý’uæŽs‹æ’¬‘º–¼ 
                                             PIC  X(022).
000200 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Ý’uæ’¬ˆæ–¼ 
                                             PIC  X(074).
000210 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Ý’uæ•â•ZŠ 
                                             PIC  X(060).
000220 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|Ý’uæ“d˜b”Ô† 
                                             PIC  X(012).
000230 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|‹@ŠB•ª—Þ–¼Ì 
                                             PIC  X(016).
000240 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|ƒ[ƒJ[ƒR[ƒh 
                                             PIC  X(002).
000250 01  ‚o‚n‚j|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h|ƒrƒ‹ƒoƒŠ—L–³–¼Ì 
                                             PIC  X(020).
