000010************************************************
000020* (SEC_WK_ITIRAN)
000030************************************************
000040 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|˜A”Ô PIC S9(005) COMP-3.
000050 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|Ž–‹ÆŠ–¼Ì PIC  X(020).
000070 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000080 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|’S“–ŽÒ–¼Ì PIC  X(020).
000090 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|Œ“–±Ž–‹ÆŠƒR[ƒh PIC  X(004).
000100 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|Œ“–±Ž–‹ÆŠ–¼Ì PIC  X(020).
000110 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|ƒXƒe[ƒ^ƒX PIC  X(002).
000120 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|—LŒøŠúŒÀ PIC  X(010).
000130 01  ‚r‚d‚b|‚v‚j|‚h‚s‚h‚q‚`‚m|’[––”Ô† PIC  X(016).
