000010************************************************
000020* (SFC_MEISAI)
000030************************************************
000040 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|ƒVƒƒ[ƒvŒ_–ñ”Ô† PIC  X(012).
000050 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|ƒVƒƒ[ƒv¤•i˜A”Ô PIC  X(003).
000060 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|•¨Œ‚m‚n PIC  X(003).
000080 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|ƒVƒƒ[ƒv¤•iƒR[ƒh PIC  X(004).
000090 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|•¨Œ–¼ PIC  X(015).
000100 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|‹@Ží–¼ PIC  X(015).
000110 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|”—Ê PIC S9(004) COMP-3.
000120 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|w“ü‹àŠz PIC S9(013) COMP-3.
000130 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|Žd“üÁ”ïÅ“™Šz PIC S9(013) COMP-3.
000140 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000150 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000160 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|“®‘•ÛŒ¯—¿—¦ PIC S9(002)V9(3) COMP-3.
000170 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|Ž‘ŽYƒR[ƒh PIC  X(007).
000180 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|‘Ï—p”N” PIC  X(002).
000190 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|M—p•ÛŒ¯ƒR[ƒh PIC  X(006).
000200 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|Å‹æ•ª PIC  X(001).
000210 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|ŒÅ’èŽ‘ŽYÅ—¦ PIC S9(002)V9(2) COMP-3.
000220 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|”[•tæƒR[ƒh PIC  X(006).
000230 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|“o˜^“ú PIC  X(008).
000240 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|“o˜^Žž PIC  X(006).
000250 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000260 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|XV“ú PIC  X(008).
000270 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|XVŽž PIC  X(006).
000280 01  ‚r‚e‚b|‚l‚d‚h‚r‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
