000010************************************************
000020* (SFC_SITEN)
000030************************************************
000040 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|•ïŠ‡ƒGƒŠƒAƒR[ƒh PIC  X(001).
000050 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|ƒGƒŠƒAƒR[ƒh PIC  X(002).
000060 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|Žx“XƒR[ƒh PIC  X(002).
000070 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|•ïŠ‡ƒGƒŠƒA–¼ PIC  X(060).
000080 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|ƒGƒŠƒA–¼ PIC  X(060).
000090 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|Žx“X–¼ PIC  X(060).
000100 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|“o˜^“ú PIC  X(008).
000110 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|“o˜^Žž PIC  X(006).
000120 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000130 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|XV“ú PIC  X(008).
000140 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|XVŽž PIC  X(006).
000150 01  ‚r‚e‚b|‚r‚h‚s‚d‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
