000010************************************************
000020* (SFC_WK_ERROR)
000030************************************************
000040 01  ‚r‚e‚b|‚v‚j|‚d‚q‚q‚n‚q|’[––”Ô† PIC  X(016).
000050 01  ‚r‚e‚b|‚v‚j|‚d‚q‚q‚n‚q|ƒVƒƒ[ƒvŒ_–ñ”Ô† PIC  X(012).
000060 01  ‚r‚e‚b|‚v‚j|‚d‚q‚q‚n‚q|ƒGƒ‰[˜A”Ô PIC S9(002) COMP-3.
000070 01  ‚r‚e‚b|‚v‚j|‚d‚q‚q‚n‚q|ƒVƒƒ[ƒv¤•i˜A”Ô PIC  X(003).
000080 01  ‚r‚e‚b|‚v‚j|‚d‚q‚q‚n‚q|€–Ú˜A”Ô PIC S9(002) COMP-3.
000090 01  ‚r‚e‚b|‚v‚j|‚d‚q‚q‚n‚q|ƒƒbƒZ[ƒW PIC  X(060).
