000010************************************************
000020* (SFC_WK_KEIYAKU)
000030************************************************
000040 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|’[––”Ô† PIC  X(016).
000050 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒVƒƒ[ƒvŒ_–ñ”Ô† PIC  X(012).
000060 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒVƒƒ[ƒv¤•i˜A”Ô PIC  X(003).
000070 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|•ïŠ‡ƒGƒŠƒAƒR[ƒh PIC  X(001).
000080 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|•ïŠ‡ƒGƒŠƒA–¼ PIC  X(060).
000090 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒGƒŠƒAƒR[ƒh PIC  X(002).
000100 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Žx“XƒR[ƒh PIC  X(002).
000110 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000120 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Žæˆøæ–¼ PIC  X(060).
000130 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Œ_–ñ“ú PIC  X(008).
000140 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Œ_–ñ”Ô† PIC  X(009).
000150 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|˜’uŠúŠÔ PIC S9(003) COMP-3.
000160 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000170 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‘OŽóŒŽ” PIC S9(002) COMP-3.
000180 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000190 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000200 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|w“ü‹àŠz|Œv 
                                             PIC S9(014) COMP-3.
000210 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒŠ[ƒX—¿|Œv 
                                             PIC S9(014) COMP-3.
000220 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‘ƒŠ[ƒX—¿|Œv 
                                             PIC S9(014) COMP-3.
000230 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‘OŽóƒŠ[ƒX—¿|Œv 
                                             PIC S9(014) COMP-3.
000240 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|w“ü‹àŠzÁ”ïÅ|Œv 
                                             PIC S9(013) COMP-3.
000250 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒŠ[ƒX—¿Á”ï|Œv 
                                             PIC S9(013) COMP-3.
000260 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‘OŽóƒŠ[ƒX—¿Á”ï|Œv 
                                             PIC S9(013) COMP-3.
000270 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|w“ü‹àŠz|‡Œv 
                                             PIC S9(015) COMP-3.
000280 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒŠ[ƒX—¿|‡Œv 
                                             PIC S9(015) COMP-3.
000290 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‘OŽóƒŠ[ƒX—¿|‡Œv 
                                             PIC S9(015) COMP-3.
000300 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|•¨Œ” PIC S9(003) COMP-3.
000310 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|”[•tæƒR[ƒh PIC  X(006).
000320 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Ý’uêŠ–¼ PIC  X(025).
000330 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|•¨Œ–¼ PIC  X(015).
000340 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|”—Ê PIC S9(004) COMP-3.
000350 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‘Ï—p”N” PIC  X(002).
000360 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|w“ü‹àŠz PIC S9(013) COMP-3.
000370 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000380 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‘ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000390 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000400 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000410 01  ‚r‚e‚b|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|˜A”Ô PIC S9(013) COMP-3.
