000010************************************************
000020* (SFC_WK_YOTEI)
000030************************************************
000040 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|’[––”Ô† PIC  X(016).
000050 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|Œ_–ñ”Ô† PIC  X(007).
000060 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|Žæˆøæ–¼ PIC  X(060).
000080 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|Œ_–ñ“ú PIC  X(008).
000090 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000100 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|“ü‹àŠî€“ú PIC  X(002).
000110 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|Žx•¥ŒŽ PIC S9(006) COMP-3.
000120 01  ‚r‚e‚b|‚v‚j|‚x‚n‚s‚d‚h|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
