000010************************************************
000020* (SIN_KEY)
000030************************************************
000040 01  ‚r‚h‚m|‚j‚d‚x|âg‹c‚m‚n PIC  X(010).
000050 01  ‚r‚h‚m|‚j‚d‚x|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚r‚h‚m|‚j‚d‚x|’S“–ŽÒƒR[ƒh PIC  X(004).
000070 01  ‚r‚h‚m|‚j‚d‚x|ˆ—ƒXƒe[ƒ^ƒX PIC  X(001).
000080 01  ‚r‚h‚m|‚j‚d‚x|íœ‹æ•ª PIC  X(001).
000090 01  ‚r‚h‚m|‚j‚d‚x|ˆÄŒ”Ô† PIC  X(010).
000100 01  ‚r‚h‚m|‚j‚d‚x|Œ©ÏŽ}”Ô PIC  X(002).
000110 01  ‚r‚h‚m|‚j‚d‚x|•¨Œ–¾×•ÊŽ†ƒtƒ‰ƒO PIC  X(001).
000120 01  ‚r‚h‚m|‚j‚d‚x|w“üæ–¾×•ÊŽ†ƒtƒ‰ƒO PIC  X(001).
000130 01  ‚r‚h‚m|‚j‚d‚x|•ÛØæ–¾×•ÊŽ†ƒtƒ‰ƒO PIC  X(001).
000140 01  ‚r‚h‚m|‚j‚d‚x|“o˜^“ú PIC  X(008).
000150 01  ‚r‚h‚m|‚j‚d‚x|“o˜^Žž PIC  X(006).
000160 01  ‚r‚h‚m|‚j‚d‚x|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000170 01  ‚r‚h‚m|‚j‚d‚x|XV“ú PIC  X(008).
000180 01  ‚r‚h‚m|‚j‚d‚x|XVŽž PIC  X(006).
000190 01  ‚r‚h‚m|‚j‚d‚x|XV’S“–ŽÒƒR[ƒh PIC  X(004).
