000010************************************************
000020* (SIN_KOUNYU)
000030************************************************
000040 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|âg‹c‚m‚n PIC  X(010).
000050 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|w“üæŽ¯•Ê‚m‚n PIC  X(001).
000060 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|w“üæƒR[ƒh PIC  X(008).
000070 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|w“üæ–¼ PIC  X(060).
000080 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|w“üæ’S“–ŽÒ PIC  X(020).
000090 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|w“üæZŠ PIC  X(100).
000100 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|“d˜b”Ô† PIC  X(015).
000110 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|w“ü‹àŠz PIC S9(013) COMP-3.
000120 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚P PIC S9(013) COMP-3.
000130 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚P 
                                             PIC S9(002)V9(2) COMP-3.
000140 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚P PIC  X(040).
000150 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚Q PIC S9(013) COMP-3.
000160 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚Q 
                                             PIC S9(002)V9(2) COMP-3.
000170 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚Q PIC  X(040).
000180 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚R PIC S9(013) COMP-3.
000190 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚R 
                                             PIC S9(002)V9(2) COMP-3.
000200 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚R PIC  X(040).
000210 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚S PIC S9(013) COMP-3.
000220 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚S 
                                             PIC S9(002)V9(2) COMP-3.
000230 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚S PIC  X(040).
000240 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚T PIC S9(013) COMP-3.
000250 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚T 
                                             PIC S9(002)V9(2) COMP-3.
000260 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚T PIC  X(040).
000270 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|ŽèŒ`Žó“n•û–@‚P PIC  X(001).
000280 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|ŽèŒ`Žó“n•û–@‚Q PIC  X(001).
000290 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|ŽèŒ`Žó“n•û–@‚R PIC  X(001).
000300 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|ŽèŒ`Žó“n•û–@‚S PIC  X(001).
000310 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|ŽèŒ`Žó“n•û–@‚T PIC  X(001).
000320 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000330 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|“o˜^“ú PIC  X(008).
000340 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|“o˜^Žž PIC  X(006).
000350 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000360 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|XV“ú PIC  X(008).
000370 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|XVŽž PIC  X(006).
000380 01  ‚r‚h‚m|‚j‚n‚t‚m‚x‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
