000010************************************************
000020* (SSF_KEI_KEY)
000030************************************************
000040 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|ˆ—ƒXƒe[ƒ^ƒX PIC  X(001).
000070 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|\¿‘ì¬Ï‹æ•ª PIC  X(001).
000080 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|ŒŸŽûÏ|íœ‹æ•ª PIC  X(001).
000090 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|‘—M‹æ•ª PIC  X(001).
000100 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|Œ_–ñ”Ô†Ì”Ô“ú PIC  X(008).
000110 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|Œ_–ñ”Ô†Ì”ÔŽž PIC  X(006).
000120 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|Œ_–ñ”Ô†Ì”Ô’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000130 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|“o˜^“ú PIC  X(008).
000140 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|“o˜^Žž PIC  X(006).
000150 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000160 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|XV“ú PIC  X(008).
000170 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|XVŽž PIC  X(006).
000180 01  ‚r‚r‚e|‚j‚d‚h|‚j‚d‚x|XV’S“–ŽÒƒR[ƒh PIC  X(004).
