000010************************************************
000020* (SSF_LPWK_CHOHYO)
000030************************************************
000040 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|Т[ЦЦФ╘НЖ PIC  X(016).
000050 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ШAФ╘ PIC S9(004) COMP-3.
000060 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВP PIC S9(001) COMP-3.
000070 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВQ PIC S9(001) COMP-3.
000080 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВR PIC S9(001) COMP-3.
000090 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВS PIC S9(001) COMP-3.
000100 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВT PIC S9(001) COMP-3.
000110 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВU PIC S9(001) COMP-3.
000120 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВV PIC S9(001) COMP-3.
000130 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВW PIC S9(001) COMP-3.
000140 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВX PIC S9(001) COMP-3.
000150 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВO PIC S9(001) COMP-3.
000160 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВP PIC S9(001) COMP-3.
000170 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВQ PIC S9(001) COMP-3.
000180 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВR PIC S9(001) COMP-3.
000190 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВS PIC S9(001) COMP-3.
000200 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВT PIC S9(001) COMP-3.
000210 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВU PIC S9(001) COMP-3.
000220 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВV PIC S9(001) COMP-3.
000230 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВW PIC S9(001) COMP-3.
000240 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВPВX PIC S9(001) COMP-3.
000250 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ТаХ[ВQВO PIC S9(001) COMP-3.
000260 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|ОxХеКJОnУ· PIC  X(008).
000270 01  ВrВrВeБ|ВkВoВvВjБ|ВbВgВnВgВxВnБ|СцВQЙёЦ┌И╚Н~ОxХеКJОnУ· 
                                             PIC  X(008).
