000010************************************************
000020* (SSF_WK_SEIKYUSYO)
000030************************************************
000040 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|ŒŸŽû“ú PIC  X(008).
000060 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Œ_–ñ‹àŠzƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000070 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Œ_–ñ‹àŠzŠ„•Š 
                                             PIC S9(013) COMP-3.
000080 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Š„•ŠˆêŠ‡Á”ïÅ 
                                             PIC S9(013) COMP-3.
000090 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|’èŠzƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000100 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|’èŠzŠ„•Š 
                                             PIC S9(013) COMP-3.
000110 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|’èŠzÁ”ïÅƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000120 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|’èŠzÁ”ïÅŠ„•Š 
                                             PIC S9(013) COMP-3.
000130 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‰‰ñƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000140 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‰‰ñŠ„•Š 
                                             PIC S9(013) COMP-3.
000150 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‰‰ñÁ”ïÅƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000160 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‰‰ñÁ”ïÅŠ„•Š 
                                             PIC S9(013) COMP-3.
000170 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‘OŽóƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000180 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‘OŽóŠ„•Š 
                                             PIC S9(013) COMP-3.
000190 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‘OŽóÁ”ïÅƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000200 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‘OŽóÁ”ïÅŠ„•Š 
                                             PIC S9(013) COMP-3.
000210 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|¿‹ŠzƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000220 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|¿‹ŠzŠ„•Š 
                                             PIC S9(013) COMP-3.
000230 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000240 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Žd“ü‚êÁ”ïÅ 
                                             PIC S9(013) COMP-3.
000250 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|ƒŠ[ƒXŒ»‹à 
                                             PIC S9(013) COMP-3.
000260 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|ƒŠ[ƒX‚P 
                                             PIC S9(013) COMP-3.
000270 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|ƒŠ[ƒX‚Q 
                                             PIC S9(013) COMP-3.
000280 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|ƒŠ[ƒX‚R 
                                             PIC S9(013) COMP-3.
000290 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|ƒŠ[ƒX‚S 
                                             PIC S9(013) COMP-3.
000300 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|ƒŠ[ƒX‚T 
                                             PIC S9(013) COMP-3.
000310 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Š„•ŠŒ»‹à 
                                             PIC S9(013) COMP-3.
000320 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Š„•Š‚P PIC S9(013) COMP-3.
000330 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Š„•Š‚Q PIC S9(013) COMP-3.
000340 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Š„•Š‚R PIC S9(013) COMP-3.
000350 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Š„•Š‚S PIC S9(013) COMP-3.
000360 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Š„•Š‚T PIC S9(013) COMP-3.
000370 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|•½‹Ï—˜‰ñƒŠ[ƒX 
                                             PIC S9(002)V9(8) COMP-3.
000380 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|•½‹Ï—˜‰ñŠ„•Š 
                                             PIC S9(002)V9(8) COMP-3.
000390 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‘e—˜‰vƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000400 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‘e—˜‰vŠ„•Š 
                                             PIC S9(013) COMP-3.
000410 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|•¨Œƒn[ƒhƒŠ[ƒX 
                                             PIC S9(013) COMP-3.
000420 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|•¨Œƒn[ƒhŠ„•Š 
                                             PIC S9(013) COMP-3.
000430 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|•¨Œƒ\ƒtƒg 
                                             PIC S9(013) COMP-3.
000440 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|Žd“üÁ”ïÅƒ\ƒtƒg 
                                             PIC S9(013) COMP-3.
000450 01  ‚r‚r‚e|‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|•½‹Ï—˜‰ñ‡Œv 
                                             PIC S9(002)V9(8) COMP-3.
