000010************************************************
000020* (SWP_PRTTMP)
000030************************************************
000040 01  SWP_PRTTMP-CTLNUM PIC  X(004).
000050 01  SWP_PRTTMP-BASDAY PIC  X(008).
000060 01  SWP_PRTTMP-CCYCOD PIC  X(003).
000070 01  SWP_PRTTMP-BNKCOD PIC  X(004).
000080 01  SWP_PRTTMP-BRCCOD PIC  X(003).
000090 01  SWP_PRTTMP-BNKNAM PIC  X(050).
000100 01  SWP_PRTTMP-INTBGN PIC  X(008).
000110 01  SWP_PRTTMP-PAYDAY PIC  X(008).
000120 01  SWP_PRTTMP-DUEDAY PIC  X(008).
000130 01  SWP_PRTTMP-DAYCNT PIC S9(004) COMP-3.
000140 01  SWP_PRTTMP-UNPDAY PIC S9(004) COMP-3.
000150 01  SWP_PRTTMP-CNTCAP PIC S9(013) COMP-3.
000160 01  SWP_PRTTMP-BALCAP PIC S9(013) COMP-3.
000170 01  SWP_PRTTMP-AVEBAL PIC S9(013) COMP-3.
000180 01  SWP_PRTTMP-RCVRAT PIC S9(002)V9(6) COMP-3.
000190 01  SWP_PRTTMP-RCVAVE PIC S9(002)V9(6) COMP-3.
000200 01  SWP_PRTTMP-RCVYLD PIC S9(002)V9(6) COMP-3.
000210 01  SWP_PRTTMP-RCVINT PIC S9(013)V9(2) COMP-3.
000220 01  SWP_PRTTMP-RCVYEN PIC S9(013) COMP-3.
000230 01  SWP_PRTTMP-PAYRAT PIC S9(002)V9(6) COMP-3.
000240 01  SWP_PRTTMP-PAYAVE PIC S9(002)V9(6) COMP-3.
000250 01  SWP_PRTTMP-PAYYLD PIC S9(002)V9(6) COMP-3.
000260 01  SWP_PRTTMP-PAYINT PIC S9(013)V9(2) COMP-3.
000270 01  SWP_PRTTMP-PAYYEN PIC S9(013) COMP-3.
000280 01  SWP_PRTTMP-MARGIN PIC S9(002)V9(6) COMP-3.
000290 01  SWP_PRTTMP-UNPINT PIC S9(013)V9(2) COMP-3.
000300 01  SWP_PRTTMP-DIFINT PIC S9(013)V9(2) COMP-3.
000310 01  SWP_PRTTMP-CCYRAT PIC S9(004)V9(2) COMP-3.
000320 01  SWP_PRTTMP-DIFYEN PIC S9(013) COMP-3.
