000010************************************************
000020* (SWP_ALMDAT)
000030************************************************
000040 01  SWP_ALMDAT-GENREC PIC  X(120).
