000010************************************************
000020* (SWP_CORTMP)
000030************************************************
000040 01  SWP_CORTMP-JOBTYP PIC  X(001).
000050 01  SWP_CORTMP-REGDAY PIC  X(008).
000060 01  SWP_CORTMP-REGTIM PIC  X(006).
000070 01  SWP_CORTMP-CTLNUM PIC  X(004).
000080 01  SWP_CORTMP-BNKCOD PIC  X(004).
000090 01  SWP_CORTMP-BRCCOD PIC  X(003).
000100 01  SWP_CORTMP-BNKNAM PIC  X(050).
000110 01  SWP_CORTMP-CONDAY PIC  X(008).
000120 01  SWP_CORTMP-CCYCOD PIC  X(003).
000130 01  SWP_CORTMP-CNTCAP PIC S9(013) COMP-3.
000140 01  SWP_CORTMP-BALCAP PIC S9(013) COMP-3.
000150 01  SWP_CORTMP-COLAMT PIC S9(013) COMP-3.
000160 01  SWP_CORTMP-COLLST PIC S9(013) COMP-3.
000170 01  SWP_CORTMP-COLCNT PIC S9(003) COMP-3.
000180 01  SWP_CORTMP-RCVRAT PIC S9(002)V9(6) COMP-3.
000190 01  SWP_CORTMP-PAYRAT PIC S9(002)V9(6) COMP-3.
000200 01  SWP_CORTMP-MARGIN PIC S9(002)V9(6) COMP-3.
000210 01  SWP_CORTMP-INTBGN PIC  X(008).
000220 01  SWP_CORTMP-DUEDAY PIC  X(008).
000230 01  SWP_CORTMP-BNKCOD_O PIC  X(004).
000240 01  SWP_CORTMP-BRCCOD_O PIC  X(003).
000250 01  SWP_CORTMP-CONDAY_O PIC  X(008).
000260 01  SWP_CORTMP-CCYCOD_O PIC  X(003).
000270 01  SWP_CORTMP-CNTCAP_O PIC S9(013) COMP-3.
000280 01  SWP_CORTMP-COLAMT_O PIC S9(013) COMP-3.
000290 01  SWP_CORTMP-COLLST_O PIC S9(013) COMP-3.
000300 01  SWP_CORTMP-RCVRAT_O PIC S9(002)V9(6) COMP-3.
000310 01  SWP_CORTMP-PAYRAT_O PIC S9(002)V9(6) COMP-3.
000320 01  SWP_CORTMP-MARGIN_O PIC S9(002)V9(6) COMP-3.
000330 01  SWP_CORTMP-INTBGN_O PIC  X(008).
000340 01  SWP_CORTMP-DUEDAY_O PIC  X(008).
000350 01  SWP_CORTMP-BNKCOD_M PIC  X(001).
000360 01  SWP_CORTMP-BRCCOD_M PIC  X(001).
000370 01  SWP_CORTMP-CONDAY_M PIC  X(001).
000380 01  SWP_CORTMP-CCYCOD_M PIC  X(001).
000390 01  SWP_CORTMP-CNTCAP_M PIC  X(001).
000400 01  SWP_CORTMP-COLAMT_M PIC  X(001).
000410 01  SWP_CORTMP-COLLST_M PIC  X(001).
000420 01  SWP_CORTMP-RCVRAT_M PIC  X(001).
000430 01  SWP_CORTMP-PAYRAT_M PIC  X(001).
000440 01  SWP_CORTMP-MARGIN_M PIC  X(001).
000450 01  SWP_CORTMP-INTBGN_M PIC  X(001).
000460 01  SWP_CORTMP-DUEDAY_M PIC  X(001).
