000010************************************************
000020* (SWP_BNKMST)
000030************************************************
000040 01  SWP_BNKMST-BNKCOD PIC  X(004).
000050 01  SWP_BNKMST-BRCCOD PIC  X(003).
000060 01  SWP_BNKMST-BNKNAM PIC  X(030).
000070 01  SWP_BNKMST-BRCNAM PIC  X(020).
000080 01  SWP_BNKMST-PRTSEQ PIC  X(003).
000090 01  SWP_BNKMST-LBLTYP PIC  X(001).
000100 01  SWP_BNKMST-DIVCOD PIC  X(004).
000110 01  SWP_BNKMST-ZIPCOD PIC  X(007).
000120 01  SWP_BNKMST-ADRES1 PIC  X(050).
000130 01  SWP_BNKMST-ADRES2 PIC  X(050).
