000010************************************************
000020* (TSL_INTMST)
000030************************************************
000040 01  TSL_INTMST-CNTNUM PIC  X(009).
000050 01  TSL_INTMST-PRFCOD PIC  X(002).
000060 01  TSL_INTMST-PRFNAM PIC  X(006).
000070 01  TSL_INTMST-BNKCOD PIC  X(004).
000080 01  TSL_INTMST-BNKNAM PIC  X(020).
000090 01  TSL_INTMST-BRCNAM PIC  X(020).
000100 01  TSL_INTMST-PROGRE PIC  X(001).
000110 01  TSL_INTMST-USRCOD PIC  X(008).
000120 01  TSL_INTMST-USRNAM PIC  X(030).
000130 01  TSL_INTMST-BUYNAM PIC  X(030).
000140 01  TSL_INTMST-OBJNAM PIC  X(040).
000150 01  TSL_INTMST-CNTDAY PIC  X(008).
000160 01  TSL_INTMST-APRDAY PIC  X(008).
000170 01  TSL_INTMST-DUEDAY PIC  X(008).
000180 01  TSL_INTMST-BASDAY PIC  X(008).
000190 01  TSL_INTMST-INDCOD PIC  X(002).
000200 01  TSL_INTMST-INTTYP PIC  X(001).
000210 01  TSL_INTMST-RELEAS PIC  X(001).
000220 01  TSL_INTMST-DELFLG PIC  X(001).
000230 01  TSL_INTMST-MONCNT PIC S9(004) COMP-3.
000240 01  TSL_INTMST-OBJAMT PIC S9(013) COMP-3.
000250 01  TSL_INTMST-CNTAMT PIC S9(013) COMP-3.
000260 01  TSL_INTMST-LEAAMT PIC S9(013) COMP-3.
000270 01  TSL_INTMST-DEPAMT PIC S9(013) COMP-3.
000280 01  TSL_INTMST-INTRAT PIC S9(002)V9(6) COMP-3.
000290 01  TSL_INTMST-REGDAY PIC  X(008).
000300 01  TSL_INTMST-REGTIM PIC  X(006).
000310 01  TSL_INTMST-REGPSN PIC  X(004).
000320 01  TSL_INTMST-MODDAY PIC  X(008).
000330 01  TSL_INTMST-MODTIM PIC  X(006).
000340 01  TSL_INTMST-MODPSN PIC  X(004).
