000010************************************************
000020* Ž©“®ŽÔƒŠ[ƒXŠÇ—(XINCARTS)
000030************************************************
000040 01  ‚w‚h‚m‚b‚`‚q‚s‚r|Œ_–ñ‚m‚n  PIC  X(009).
000050 01  ‚w‚h‚m‚b‚`‚q‚s‚r|•¨Œ‚m‚n  PIC  X(003).
000060 01  ‚w‚h‚m‚b‚`‚q‚s‚r|Ž–‹ÆŠƒR[ƒh  PIC  X(004).
000070 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ƒ†[ƒU[ƒR[ƒh  PIC  X(008).
000080 01  ‚w‚h‚m‚b‚`‚q‚s‚r|¿‹æƒR[ƒh  PIC  X(008).
000090 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ƒ†[ƒU[–¼Ì  PIC  X(025).
000100 01  ‚w‚h‚m‚b‚`‚q‚s‚r|Žc‰¿Šz‚P  PIC S9(013) COMP-3.
000110 01  ‚w‚h‚m‚b‚`‚q‚s‚r|“o˜^”Ô†  PIC  X(030).
000120 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŒŸŽû“ú|¢‹I  PIC  X(001).
000130 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŒŸŽû“ú|”NŒŽ“ú  PIC  X(006).
000140 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ƒŠ[ƒXI—¹“ú|¢‹I  PIC  X(001).
000150 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú  PIC  X(006).
000160 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ƒŠ[ƒXŠúŠÔ  PIC  X(003).
000170 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ÄƒŠ[ƒXƒR[ƒh  PIC  X(001).
000180 01  ‚w‚h‚m‚b‚`‚q‚s‚r|Ž©“®ŽÔŒ_–ñŒ`‘Ô  PIC  X(001).
000190 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú¢‹I‚P  PIC  X(001).
000200 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú‚P  PIC  X(006).
000210 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú¢‹I‚Q  PIC  X(001).
000220 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú‚Q  PIC  X(006).
000230 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú¢‹I‚R  PIC  X(001).
000240 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú‚R  PIC  X(006).
000250 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú¢‹I‚S  PIC  X(001).
000260 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú‚S  PIC  X(006).
000270 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú¢‹I‚T  PIC  X(001).
000280 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŽÔŒŸ–ž—¹“ú‚T  PIC  X(006).
000290 01  ‚w‚h‚m‚b‚`‚q‚s‚r|Ž©Å•‰’SƒR[ƒh  PIC  X(001).
000300 01  ‚w‚h‚m‚b‚`‚q‚s‚r|Ž©“®ŽÔÅŠz  PIC S9(013) COMP-3.
000310 01  ‚w‚h‚m‚b‚`‚q‚s‚r|Ž©”…Ó•ÛŒ¯ƒR[ƒh  PIC  X(001).
000320 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û•‰’SƒR[ƒh  PIC  X(001).
000330 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û‘ã—“XƒR[ƒh  PIC  X(002).
000340 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û•t•ÛæƒR[ƒh  PIC  X(002).
000350 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú¢‹I‚P  PIC  X(001).
000360 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú‚P  PIC  X(006).
000370 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú¢‹I‚Q  PIC  X(001).
000380 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú‚Q  PIC  X(006).
000390 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú¢‹I‚R  PIC  X(001).
000400 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú‚R  PIC  X(006).
000410 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú¢‹I‚S  PIC  X(001).
000420 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú‚S  PIC  X(006).
000430 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú¢‹I‚T  PIC  X(001).
000440 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”C•Û–ž—¹“ú‚T  PIC  X(006).
000450 01  ‚w‚h‚m‚b‚`‚q‚s‚r|‚lŒ_–ñæƒR[ƒh  PIC  X(002).
000460 01  ‚w‚h‚m‚b‚`‚q‚s‚r|ŒŽŠzƒƒ“ƒe—¿  PIC S9(013) COMP-3.
000470 01  ‚w‚h‚m‚b‚`‚q‚s‚r|Ý’èŽc‰¿  PIC S9(013) COMP-3.
000480 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”õl‚P  PIC  X(060).
000490 01  ‚w‚h‚m‚b‚`‚q‚s‚r|”õl‚Q  PIC  X(030).
000500 01  ‚w‚h‚m‚b‚`‚q‚s‚r|íœƒtƒ‰ƒO  PIC  X(001).
