000010************************************************
000020* (ZJK_DAYTBL)
000030************************************************
000040 01  ZJK_DAYTBL-PSNCOD PIC  X(007).
000050 01  ZJK_DAYTBL-PSNNAM PIC  X(018).
000060 01  ZJK_DAYTBL-SEXTYP PIC  X(001).
000070 01  ZJK_DAYTBL-DIVCOD PIC  X(004).
000080 01  ZJK_DAYTBL-BASDAY PIC  X(008).
000090 01  ZJK_DAYTBL-WEKTYP PIC  X(001).
000100 01  ZJK_DAYTBL-HOLFLG PIC  X(001).
000110 01  ZJK_DAYTBL-HWKFLG PIC  X(001).
000120 01  ZJK_DAYTBL-VACFLG PIC  X(001).
000130 01  ZJK_DAYTBL-BGNTIM PIC  X(004).
000140 01  ZJK_DAYTBL-ENDTIM PIC  X(004).
000150 01  ZJK_DAYTBL-ATMHOR PIC S9(003) COMP-3.
000160 01  ZJK_DAYTBL-ATMMIN PIC S9(002) COMP-3.
000170 01  ZJK_DAYTBL-BTMHOR PIC S9(003) COMP-3.
000180 01  ZJK_DAYTBL-BTMMIN PIC S9(002) COMP-3.
000190 01  ZJK_DAYTBL-CTMHOR PIC S9(003) COMP-3.
000200 01  ZJK_DAYTBL-CTMMIN PIC S9(002) COMP-3.
000210 01  ZJK_DAYTBL-DTMHOR PIC S9(003) COMP-3.
000220 01  ZJK_DAYTBL-DTMMIN PIC S9(002) COMP-3.
000230 01  ZJK_DAYTBL-ETMHOR PIC S9(003) COMP-3.
000240 01  ZJK_DAYTBL-ETMMIN PIC S9(002) COMP-3.
000250 01  ZJK_DAYTBL-MONATM PIC S9(004) COMP-3.
000260 01  ZJK_DAYTBL-MONBTM PIC S9(004) COMP-3.
000270 01  ZJK_DAYTBL-MONCTM PIC S9(004) COMP-3.
000280 01  ZJK_DAYTBL-MONDTM PIC S9(004) COMP-3.
000290 01  ZJK_DAYTBL-MONETM PIC S9(004) COMP-3.
000300 01  ZJK_DAYTBL-MONWRK PIC S9(004) COMP-3.
000310 01  ZJK_DAYTBL-MONVAC PIC S9(002) COMP-3.
000320 01  ZJK_DAYTBL-MONHOL PIC S9(002) COMP-3.
