//C200300C     JOB    CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=C200300  00010000
//GO1   EXEC PGM=ACCEPT1                                                00020000
//STEPLIB DD DSN=C200300.TEST.LOADLIB,DISP=SHR                          00030000
//SYSIN  DD *                                                           00040000
123452200100                                                            00040100
123452200200                                                            00040200
123452200300                                                            00040300
9999999
/*                                                                      00040400
//                                                                      00041000
//                                                                      00042000
//                                                                      00043000
