000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. GUBIAO.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060      SELECT DISK-F ASSIGN TO DISK-MSD.
000080 DATA DIVISION.
000090 FILE SECTION.
000100 FD DISK-F LABEL RECORD IS STANDARD
000110           VALUE OF IDENTIFICATION IS "STORE.DAT".
000120 01 MS-REC.
000130    02 PART-NO PIC 99.
000140    02 UNIT-PRICE PIC 99..
000150    02 PART-DESC PIC X(20).
000160    02 REORDER-POINT PIC 99.
000170 WORKING-STORAGE SECTION.
000180 77 SWITCH-E PIC 9 VALUE 0.
000190 SCREEN SECTION.
000200 SD SCREEN-MAIN
000210       END STATUS IS SCREEN-END.
000220 01 SCREEN-S.
000230*    02 BLANK SCREEN.
000240    02 LINE 3  COLUMN 33 VALUE "STORE ACCOUNT".
000250    02 LINE 8  COLUMN 5 VALUE "PART NO".
000260    02 LINE 8  COLUMN 30 PIC 99 INTO PART-NO.
000270    02 LINE 8  COLUMN 50 VALUE "UNIT PRICE".
000280    02 LINE 8  COLUMN 70 PIC 99 INTO UNIT-PRICE.
000290    02 LINE 11 COLUMN 5 VALUE "PART DESCRIPTION".
000300    02 LINE 11 COLUMN 30 PIC X(20) INTO PART-DESC.
000310    02 LINE 14 COLUMN 5 VALUE "REORDER POINT".
000320    02 LINE 14 COLUMN 30 PIC 99 INTO REORDER-POINT.
000330    02 LINE 15 COLUMN 40 VALUE "PRESS ESCAPE KEY TO END".
000331* 01 CLEAR-E.
000332*    02 CLEAR SCREEN-S.
000340 PROCEDURE DIVISION.
000350 MAIN.
000360       OPEN OUTPUT DISK-F.
000370       PERFORM INPUT-RE THRU INPUT-END UNTIL SWITCH-E = 1.
000380       CLOSE DISK-F.
000390       STOP 1.
000400 INPUT-RE.
000410       DISPLAY SCREEN-S.
000411       ACCEPT SCREEN-S.
             
000412*      DISPLAY CLEAR-E.
000420*       ACCEPT SCREEN-S ON ESCAPE MOVE 1 TO SWITCH-E 
000430*                         GO TO INPUT-END.
000440       WRITE MS-REC.
000450 INPUT-END.
000460       EXIT.
000470                       
000480    