000010******************************************************************
000020*         ＜東銀リース＞                                         *
000030*      1. プログラム名  : 前受金受払残高ファイル作成             *
000040*      2. プログラムID  : AAASED25                               *
000050*      3. 処理概要      : 経理締処理（帳票作成）                 *
000060*                            （リース前受関連帳票抽出）          *
000070*                                                                *
000080*      4. 作成者        : 李大偉                                 *
000090*      5. 作成日        : 2005.03.25                             *
000100******************************************************************
000110*                                                                 
000120******************************************************************
000130*    ＩＤＥＮＴＩＦＩＣＡＴＩＯＮ  ＤＩＶＩＳＩＯＮ              *
000140******************************************************************
000150 IDENTIFICATION                       DIVISION.                   
000160*                                                                 
000170 PROGRAM-ID.                          AAASED25.                   
000180******************************************************************
000190*    ＥＮＶＩＲＯＮＭＥＮＴ        ＤＩＶＩＳＩＯＮ              *
000200******************************************************************
000210 ENVIRONMENT                          DIVISION.                   
000220******************************************************************
000230*    ＤＡＴＡ                      ＤＩＶＩＳＩＯＮ              *
000240******************************************************************
000250 DATA                                 DIVISION.                   
000260******************************************************************
000270*  ＷＯＲＫＩＮＧ－ＳＴＯＲＡＧＥ  ＳＥＣＴＩＯＮ                *
000280******************************************************************
000290 WORKING-STORAGE                      SECTION.                     
000300*----------------------------------------------------------------*
000310*    ホスト変数定義エリア                                        *
000320*----------------------------------------------------------------*
000330  EXEC  SQL  BEGIN  DECLARE        SECTION  END-EXEC.          
003560*                                                                 
003561*
003562*
003563*                                                                 
003570*--< ＯＲＡＣＬＥ共通変数 >                                       
003580     
003590*    EXEC  SQL  INCLUDE  SQLCOM.CBL            END-EXEC.          
003600*                                                                 
003610*--< ＯＲＡＣＬＥ  ＳＱＬ実行情報 >                               
003620*--＜ＳＱＬ共通変数＞   01  SQLSTATE           PIC  X(005).       
003920*
003921*
003922*
003923*                    
003930*--< 移行後_債権展開 >                                            
003940     
003950*    EXEC  SQL  INCLUDE  D411STK.CBL           END-EXEC.
003960*                                                                 
003970*--< 移行後_債権 >                                               
003980******************************************************************
007890
007891    END-EXEC.
007900*                                                                 
007910*----------------------------------------------------------------*
007920*    ＷＯＲＫエリア                                              *
007930*----------------------------------------------------------------*
007940 01  ＷＯＲＫ－エリア.                                            
007950*--< エラー判定用 >                                               
007960     03  Ｗ－エラーコード             PIC S9(04).                 
007970*                                                                 
007980*--< フラグアリア >                                               
007990     03  フラグアリア.                                            
008000         05  Ｗ－終了－フラグ         PIC  X(01).                 
008010         05  Ｗ－異常終了－フラグ     PIC  X(01).                 
008020*                                                                                                                          
008080*--< キーエリア >                                                 
008090     03  ＫＥＹ－エリア.                                          
008100        05  ＮＥＷキー.                                           
008110            07 Ｎ－契約番号           PIC  X(09).                 
008120*                                                                 
008210*--< 共通情報 >                                                   
008220 01  Ｗ－共通情報.                                                
008230     03  Ｗ－システム日付.                                        
008240         05  Ｗ－世紀                 PIC  X(02) VALUE  "20".     
008250         05  Ｗ－年月日               PIC  X(06).                 
008260     03  Ｗ－システム時刻             PIC  X(08).                 
008270     03  Ｗ－担当者                   PIC  X(08) VALUE "IKOPG   ".
008280*                                                                 
008290*----------------------------------------------------------------*
008300*    サブルーチン名                                              *
008310*----------------------------------------------------------------*
008320 01  CALL-AREA.                                                   
008330*--< 共通ログサブルーチン >                                       
008340     03  CLOCO001                     PIC  X(08) VALUE "CLOCO001".
008350     03  COBCO001                     PIC  X(08) VALUE "COBCO001".
008360*                                                                 
008370*----------------------------------------------------------------*
008380*    ＣＯＰＹ領域                                                *
008390*----------------------------------------------------------------*
008400*--< 共通ログ用パラメータ >                                       
008410 01  IF-CHOCO001.                                                 
008420     COPY  CHOCO001  REPLACING  ==()==  BY  ==共１－==.           
008430*                                                                 
008440*----------------------------------------------------------------*
008450*    ＩＮＩファイル読込サブルーチン用パラメタ領域                *
008460*----------------------------------------------------------------*
008470 01  PARA-AREA.                                                   
008480     COPY CPBCO001.                                               
008490******************************************************************
008500*    定数用データ定義エリア                                      *
008510******************************************************************
008520 CONSTANT                             SECTION.                    
008530 01  定数領域.                                                    
008540     03  定数－プログラムＩＤ         PIC  X(08) VALUE "COBIS430".
008550     03  定数－プログラム名           PIC  X(80)                  
008560******************************************************************
008620*    ＰＲＯＣＥＤＵＲＥ            ＤＩＶＩＳＩＯＮ              *
008630******************************************************************
008640 PROCEDURE                            DIVISION.                   
008650*                                                                 
008660     PERFORM  初期処理.                                           
008670*                                                                 
008680     PERFORM  主処理  UNTIL  Ｗ－終了－フラグ  =  "Y".            
008690*                                                                 
008700     PERFORM  終了処理.                                           
008710*                                                                 
008720     STOP     RUN.                                                
008730*                                                                 
008740******************************************************************
008750*    初期処理                                                    *
008760******************************************************************
008770 初期処理                             SECTION.                    
008780 初期処理－ＳＴＡＲＴ.                                            
008790*                                                                 
008800*----------------------------------------------------------------*
008810*    開始メッセージ出力処理                                      *
008820*----------------------------------------------------------------*
008830     INITIALIZE                       IF-CHOCO001.                           
008900*                                                                 
008910*----------------------------------------------------------------*
008920*    作業領域の初期値処理                                        *
008930*----------------------------------------------------------------*
008940     MOVE  SPACE                      TO  ＷＯＲＫ－エリア.       
008950     INITIALIZE                           ＷＯＲＫ－エリア.       
008960*                                                                 
008970     MOVE  LOW-VALUE                  TO  ＯＬＤキー.             
008980*                                                                 
008990*--< ＣＰＵ日付を取得 >                                           
009000     ACCEPT  Ｗ－年月日               FROM  DATE.                 
009010*                                                                 
009020*--< ＣＰＵ時刻を取得 >                                           
009030     ACCEPT  Ｗ－システム時刻         FROM  TIME.                 
009040*----------------------------------------------------------------*
009050*    ＯＲＡＣＬＥ接続                                            *
009060*----------------------------------------------------------------*
009070     PERFORM   ＯＲＡＣＬＥ接続.                                  
009080*                                                                 
009090*----------------------------------------------------------------*
009100*    結合テーブルカーソル定義                                    *
009110*----------------------------------------------------------------*
009120     PERFORM  結合テーブルカーソル定義.                           
009130*                                                                 
009140*----------------------------------------------------------------*
009150*    結合テーブルカーソル読込(1件目)                             *
009160*----------------------------------------------------------------*
009170     PERFORM  結合テーブルカーソル読込.                           
009180*                                                                 
009190 初期処理－ＥＸＩＴ.                                              
009200     EXIT.                                                        
009210******************************************************************
009220*    ＯＲＡＣＬＥ接続                                            *
009230******************************************************************
009240 ＯＲＡＣＬＥ接続                     SECTION.                    
009250 ＯＲＡＣＬＥ接続－ＳＴＡＲＴ.                                    
009260*                                                                 
009270*--< ＤＢ接続用情報を取得処理 >                                   
009280     CALL  COBCO001                USING  PARA-AREA.              
009290*                                                                 
009300     MOVE  PARA-DBSTRING              TO  DB-STRING.              
009310     MOVE  PARA-USERNAME              TO  USERNAME.               
009320     MOVE  PARA-PASSWORD              TO  PASSWD.                 
009330*                                                                 
009340*----------------------------------------------------------------*
009350*    開始接続                                                    *
009360*----------------------------------------------------------------*
009370     IF    DB-STRING  =  SPACE                                    
009380        
009390*       EXEC SQL                                                  
009400*          CONNECT  :USERNAME IDENTIFIED BY :PASSWD               
009410*       END-EXEC 
009420     *       EXEC SQL                                                  
010010*          CONNECT  :USERNAME IDENTIFIED BY :PASSWD               
010020*            USING  :DB-STRING                                    
010030*       END-EXEC 
010040     END-IF.                                                      
010690*                                                                 
010700*----------------------------------------------------------------*
010710*    接続確認                                                    *
010720*----------------------------------------------------------------*
010730     EVALUATE  SQLCODE                                            
010740        WHEN   定数－ＳＱＬＯＫ                                   
010750           CONTINUE                                               
010760        WHEN   OTHER                                              
010770*--<       接続エラー >                                           
010780           MOVE     -10               TO  Ｗ－エラーコード        
010790           PERFORM  エラー判定処理                                
010800     END-EVALUATE.                                                
010810*                                                                 
010820 ＯＲＡＣＬＥ接続－ＥＸＩＴ.                                      
010830     EXIT.                                                        
010840******************************************************************
010850*        結合テーブルカーソル定義                                *
010860******************************************************************
010870 結合テーブルカーソル定義             SECTION.                    
010880 結合テーブルカーソル定義－ＳＴＡＲＴ.                            
010890*                                                                 
010900*----------------------------------------------------------------*
010910*    カーソルＯＰＥＮ処理                                        *
010920*----------------------------------------------------------------*
010930     
010940*    EXEC SQL                                                     
010950*       DECLARE CUR1  CURSOR FOR                                  
010960*          SELECT  D411STK_TBL.契約番号                           
010970*                 ,D411STK_TBL.再リース回数                       
010980*                 ,D411STK_TBL.契約種類                           
010990*                 ,D411STK_TBL.請求額                             
011000*                 ,D411STK_TBL.請求消費税                         
011010*                 ,D411STK_TBL.売上年月                           
011020*                 ,D411STK_TBL.連番                               
011030*            FROM  D32SAK_TBL                                     
011040*                 ,D411STK_TBL                                    
011050*           WHERE  D32SAK_TBL.変則払       =  '1'                 
011060*             AND  D32SAK_TBL.契約番号     =  D411STK_TBL.契約番号
011070*             AND  D32SAK_TBL.再リース回数 =                      
011080*                                         D411STK_TBL.再リース回数
011090*             AND  D32SAK_TBL.契約種類     =  D411STK_TBL.契約種類
011100*        ORDER BY  D411STK_TBL.契約番号                           
011110*                 ,D411STK_TBL.再リース回数                       
011120*                 ,D411STK_TBL.契約種類                           
011130*                 ,D411STK_TBL.請求額                             
011140*    END-EXEC.
011150*                                                                 
011160*----------------------------------------------------------------*
011170*    カーソルＯＰＥＮ処理                                        *
011180*----------------------------------------------------------------*
011190     
011200*    EXEC  SQL                                                    
011210*       OPEN  CUR1                                                
011220*    END-EXEC.
011230     CALL "SQLADR" USING SQ0001 SQL-STMT
011240     MOVE 1 TO SQL-ITERS
011250     MOVE 67 TO SQL-OFFSET
011260     MOVE 0 TO SQL-OCCURS
011270     MOVE 1 TO SQL-SELERR
011280     CALL "SQLADR" USING
011290         SQLCUD
011300         SQL-CUD
011310     CALL "SQLADR" USING
011320         SQLCA
011330         SQL-SQLEST
011340     MOVE 256 TO SQL-SQLETY
011350
011360     CALL "SQLBEX" USING
011370         SQLCTX
011380         SQLEXD
011390         SQLFPN
011400
011410     CALL "SQLGSS" USING
011420        SQLSTATE
011430         .
011440*                                                                 
011450*----------------------------------------------------------------*
011460*    カーソルＯＰＥＮ確認                                        *
011470*----------------------------------------------------------------*
011480     EVALUATE  SQLCODE                                            
011490        WHEN  定数－ＳＱＬＯＫ                                    
011500*--<       正常 >                                                 
011510           CONTINUE                                               
011520        WHEN  OTHER                                               
011530*--<       カーソルＯＰＥＮエラー >                               
011540           MOVE -20                   TO  Ｗ－エラーコード        
011550           PERFORM  エラー判定処理                                
011560     END-EVALUATE.                                                
011570*                                                                 
011580 結合テーブルカーソル定義－ＥＸＩＴ.                              
011590     EXIT.                                                        
011600******************************************************************
011610*    結合テーブルカーソル読込                                    *
011620******************************************************************
011630 結合テーブルカーソル読込             SECTION.                    
011640 結合テーブルカーソル読込－ＳＴＡＲＴ.                            
011650*                                                                 
011660*--< 結合テーブルカーソル読込 >                                   
011670     
011680*    EXEC SQL                                                     
011690*        FETCH  CUR1                                              
011700*         INTO  :Ｄ４１１－契約番号                               
011710*              ,:Ｄ４１１－再リース回数                           
011720*              ,:Ｄ４１１－契約種類                               
011730*              ,:Ｄ４１１－請求額                                 
011740*              ,:Ｄ４１１－請求消費税                             
011750*              ,:Ｄ４１１－売上年月                               
011760*              ,:Ｄ４１１－連番                                   
011770*    END-EXEC.
011780*                                                                 
012830*----------------------------------------------------------------*
012840*    結合テーブルカーソル読込を確認                              *
012850*----------------------------------------------------------------*
012860     EVALUATE   SQLCODE                                           
012870        WHEN   定数－ＳＱＬＯＫ                                   
012880*--<       正常 >                                                 
012890           MOVE  Ｄ４１１－契約番号   TO  Ｎ－契約番号            
012900           MOVE  Ｄ４１１－再リース回数                           
012910                                      TO  Ｎ－再リース回数        
012920           MOVE  Ｄ４１１－契約種類   TO  Ｎ－契約種類            
012930           MOVE  Ｄ４１１－請求額     TO  Ｎ－請求額              
012940*                                                                 
012950           COMPUTE  Ｗ－入力－件数  =  Ｗ－入力－件数  +  1       
012960        WHEN   定数－ＳＱＬＥＮＤ                                 
012970*--<       読込終了 >                                             
012980           MOVE  "Y"                  TO  Ｗ－終了－フラグ        
012990        WHEN   OTHER                                              
013000*--<       読込エラー >                                           
013010           MOVE     -30               TO  Ｗ－エラーコード        
013020           PERFORM  エラー判定処理                                
013030     END-EVALUATE.                                                
013040*                                                                 
013050 結合テーブルカーソル読込－ＥＸＩＴ.                              
013060     EXIT.                                                        
013070******************************************************************
013080*    主処理                                                      *
013090******************************************************************
013100 主処理                               SECTION.                    
013110 主処理－ＳＴＡＲＴ.                                              
013120*                                                                 
013130     PERFORM  編集出力処理.                                       
013140*                                                                 
013150*--< 結合テーブルカーソル読込（２件目以降） >                     
013160     PERFORM  結合テーブルカーソル読込.                           
013170*                                                                 
013180     IF  Ｗ－終了－フラグ  =  "Y"                                 
013190*--<    入力データ終わる時 >                                      
013200        PERFORM  出力処理                                         
013210     END-IF.                                                      
013220*                                                                 
013230 主処理－ＥＸＩＴ.                                                
013240     EXIT.                                                        
013250******************************************************************
013260*     編集出力処理                                               *
013270******************************************************************
013280 編集出力処理                         SECTION.                    
013290 編集出力処理－ＳＴＡＲＴ.                                        
013300*                                                                 
013310*                                                                 
013410*                                                                 
013420*----------------------------------------------------------------*
013430*       初期化処理                                               *
013440*----------------------------------------------------------------*
013450        MOVE  SPACE                   TO  変則払                  
013460        INITIALIZE                        変則払                  
013470*                                                                 
013480*----------------------------------------------------------------*
013490*       項目編集処理                                             *
013500*----------------------------------------------------------------*
013510*--<    No.01 >                                                   
013520        MOVE  Ｄ４１１－契約番号(1:9) TO  Ｄ３４－契約番号        
013530*                                                                 
013540*--<    No.02 >                                                   
013550         
013560                                                                  
013570*--<    No.03 >                                                   
013580                 
013590*                                                                 
013600*--<    No.04 >                                                                     
013980                                                                  
014000*                                                                 
014010     MOVE ＮＥＷキー                  TO  ＯＬＤキー.             
014020*                                                                 
014030 編集出力処理－ＥＸＩＴ.                                          
014040     EXIT.                                                        
014050******************************************************************
014060*    出力処理                                                    *
014070******************************************************************
014080 出力処理                             SECTION.                    
014090 出力処理－ＳＴＡＲＴ.                                            
014100*                                                                 
014110       
014120*      EXEC  SQL                                                  
014130*                                      
014470*      END-EXEC.
014480                .
016330*                                                                 
016340*----------------------------------------------------------------*
016350*    追加処理を確認                                              *
016360*----------------------------------------------------------------*
016370     EVALUATE  SQLCODE                                            
016380        WHEN   定数－ＳＱＬＯＫ                                   
016390*--<       追加成功 >                                             
016400           COMPUTE  Ｗ－出力－件数  =  Ｗ－出力－件数  +  1       
016410        WHEN   OTHER                                              
016420*--<       追加処理エラー >                                       
016430           MOVE     -40               TO  Ｗ－エラーコード        
016440           PERFORM  エラー判定処理                                
016450     END-EVALUATE.                                                
016460*                                                                 
016470 出力処理－ＥＸＩＴ.                                              
016480     EXIT.                                                        
016490******************************************************************
016500*    終了処理                                                    *
016510******************************************************************
016520 終了処理                             SECTION.                    
016530 終了処理－ＳＴＡＲＴ.                                            
016540*                                                                 
016550*--< ＤＢクローズ >                                               
016560     PERFORM  ＤＢクローズ処理.                                   
016570*                                                                 
016580*--< ＤＢコミット処理 >                                           
016590     PERFORM  ＤＢコミット処理.                                   
016600*                                                                 
016610*--< 終了メッセージ出力処理 >                                     
016620     PERFORM  終了メッセージ出力.                                 
016630*                                                                 
016640*--< プログラム正常終了 >                                         
016650     MOVE  定数－正常状態             TO  PROGRAM-STATUS.         
016660*                                                                 
016670 終了処理－ＥＸＩＴ.                                              
016680     EXIT.                                                        
016690******************************************************************
016700*    終了メッセージ出力                                          *
016710******************************************************************
016720 終了メッセージ出力                   SECTION.                    
016730 終了メッセージ出力－ＳＴＡＲＴ.                                  
016740*                                                                 
016750*----------------------------------------------------------------*
016760*    件数メッセージ出力処理                                      *
016770*----------------------------------------------------------------*
016780     INITIALIZE                       IF-CHOCO001.                
016790     MOVE  "3"                        TO  共１－イベント種別.
016800*
016810*
016820*
016830*          MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
016990*----------------------------------------------------------------*
017000*    終了メッセージ出力                                          *
017010*----------------------------------------------------------------*
017020     INITIALIZE                       IF-CHOCO001.                
017030     MOVE  "3"                        TO  共１－イベント種別.     
017040*
017050*
017060*                                                                 
017100 終了メッセージ出力－ＥＸＩＴ.                                    
017110     EXIT.                                                        
017120******************************************************************
017130*    ＤＢクローズ                                                *
017140******************************************************************
017150 ＤＢクローズ処理                     SECTION.                    
017160 ＤＢクローズ処理－ＳＴＡＲＴ.                                    
017170*                                                                 
017180*--< カーソル クローズ >                                          
017190     
017200*    EXEC SQL                                                     
017210*       CLOSE  CUR1                                               
017220*    END-EXEC.
017230*
017240*
017250*
017260*                                                                 
017430 ＤＢクローズ処理－ＥＸＩＴ.                                      
017440     EXIT.                                                        
017450******************************************************************
017460*    ＤＢコミット処理                                            *
017470******************************************************************
017480 ＤＢコミット処理                     SECTION.                    
017490 ＤＢコミット処理－ＳＴＡＲＴ.                                    
017500*                                                                 
017510     
017520*    EXEC  SQL                                                    
017530*       COMMIT  WORK  RELEASE                                     
017540*    END-EXEC.
017550     MOVE 1 TO SQL-ITERS
017560*                                                                 
017750     INITIALIZE                       IF-CHOCO001.                
017760*        
017820*
017821*                                                                 
017830 ＤＢコミット処理－ＥＸＩＴ.                                      
017840     EXIT.                                                        
017850******************************************************************
017860*    ＤＢロールバック処理                                        *
017870******************************************************************
017880 ＤＢロールバック処理                 SECTION.                    
017890 ＤＢロールバック処理－ＳＴＡＲＴ.                                
017900*                                                                 
017910     
017920*    EXEC  SQL                                                    
017930*       ROLLBACK WORK  RELEASE                                    
017940*    END-EXEC.
017950     MOVE 1 TO SQL-ITERS
017960*       
018220*                                                                 
018230 ＤＢロールバック処理－ＥＸＩＴ.                                  
018240     EXIT.                                                        
018250******************************************************************
018260*    エラー処理                                                  *
018270******************************************************************
018280 エラー判定処理                       SECTION.                    
018290 エラー判定処理－ＳＴＡＲＴ.                                      
018300*                                                                 
018310     MOVE  "Y"                        TO Ｗ－異常終了－フラグ.    
018320     INITIALIZE                       IF-CHOCO001.                
018330*                                                                 
018340     EVALUATE  Ｗ－エラーコード                                   
018350        WHEN  -10                                                 
018360*--<       ＯＲＡＣＬＥ接続失敗 >                                 
018370           MOVE  "1"                  TO  共１－イベント種別      
018430           CALL  CLOCO001          USING  IF-CHOCO001             
018440*                                                                 
018770*                                                                 
018780        WHEN  OTHER                                               
018790           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
018800     END-EVALUATE.                                                
018810*                                                                 
018820     IF Ｗ－異常終了－フラグ  =  "Y"                              
018830        PERFORM  ＤＢロールバック処理                             
018840*                                                                 
018850        PERFORM  終了メッセージ出力                               
018860*                                                                 
018870*--<    プログラムリターンコード >                                
018880        MOVE  定数－異常状態          TO  PROGRAM-STATUS          
018890*                                                                 
018900        EXIT  PROGRAM                                             
018910     END-IF.                                                      
018920*                                                                 
018930 エラー処理－ＥＸＩＴ.                                            
018940     EXIT.                                                        
018950******************************************************************
018960*                  END OF PROGRAM                                *
018970******************************************************************
