      *****************************************************************
      *   Œ_–ñ“à—e(D31KYK_TBL)
      *****************************************************************
       01  Œ_–ñ“à—e.
           03  ‚c‚R‚P|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚R‚P|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|Œ©Ï”Ô†      PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚P|Œ©Ï”Ô†Ž}”Ô  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚R‚P|âg‹cŒˆÙ“ú    PIC  X(008).
           03  ‚c‚R‚P|‘Ý•tŽÀs—\’è“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|¬–ñ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚P|ˆø“n”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚P|Œ_–ñŠJŽn“ú    PIC  X(008).
           03  ‚c‚R‚P|Œ_–ñI—¹“ú    PIC  X(008).
           03  ‚c‚R‚P|ŠúŠÔ          PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚P|Œ_–ñŒ–¼      PIC  X(060).
           03  ‚c‚R‚P|ƒGƒ“ƒhƒ†[ƒUƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚P|Œ_–ñ‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|Ð‰îƒ‹[ƒg    PIC  X(001).
           03  ‚c‚R‚P|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚P|’S“–ŽÒƒR[ƒh  PIC  X(008).
           03  ‚c‚R‚P|•Ï‘¥•¥        PIC  X(001).
           03  ‚c‚R‚P|ŒŽŠz—¿‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|Œ_–ñ‘Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|M—p•ÛŒ¯‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|’S•Û‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|‹¦’²‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|Œ_–ñæƒR[ƒh  PIC  X(005).
           03  ‚c‚R‚P|ŽåŠ²Ž–æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚P|—˜‰ñ‚è        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ƒ†[ƒU—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|’·ƒvƒ‰‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽÐ“à‹à—˜      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|¿‹æƒR[ƒh  PIC  X(005).
           03  ‚c‚R‚P|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|¿‹Œ–¼      PIC  X(060).
           03  ‚c‚R‚P|‘æ‚P‰ñ‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚R‚P|‘æ‚P‰ñ‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|‘æ‚P‰ñ‰ñŽû“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|‘æ‚P‰ñ‰ñŽû‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|U‘ÖŠJŽn”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|‘O•¥‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|“ª‹à‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|‰c‹ÆƒRƒƒ“ƒg—“‚P
                                     PIC  X(080).
           03  ‚c‚R‚P|‰c‹ÆƒRƒƒ“ƒg—“‚Q
                                     PIC  X(080).
           03  ‚c‚R‚P|ó‘Ôƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚P|–ž—¹ˆÄ“à‘—•t‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|–ž—¹ˆÄ“à‰ñ“š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|ŽåŒ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚P|‘k‹yˆ—‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|‘k‹yˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|ŒŸŽûŽæÁ“ú    PIC  X(008).
           03  ‚c‚R‚P|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|ŒŸŽûˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|ŒŸŽûŽæÁ”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|“–‰‰ñŽûŠúŠÔ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚P|ÅV‰ñŽûŠúŠÔ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚P|ÅI•¨Œ”Ô†  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚P|ÄƒŠ[ƒXƒf[ƒ^ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|ÄƒŠ[ƒXŽ©“®ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|ƒŠ[ƒXŠ„•Š‘O•¥ŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|“ª‹à¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|‘O•¥¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|“ª‹à¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|‘O•¥¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|‰ð–ñƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚P|‰ð–ñ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚P|‘‰ñŽû‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚P|•¨ŒŠm”F      PIC  X(001).
           03  ‚c‚R‚P|‚Ü‚é‚ß’PˆÊ    PIC  X(001).
           03  ‚c‚R‚P|“à–óˆóü•û–@  PIC  X(001).
           03  ‚c‚R‚P|Œ_–ñŠúŠÔ‰ñ”ˆóü—L–³
                                     PIC  X(001).
           03  ‚c‚R‚P|¬–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|¬–ñˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|¬–ñŽæÁ”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|ÄƒŠ[ƒX¿‹ŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|ÄƒŠ[ƒX‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚P|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚R‚P|XVŽÒ        PIC  X(008).
           03  ‚c‚R‚P|“–‰—˜‰ñ‚è    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|“–‰‘e—˜Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|“–‰ŒŽŠz—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|“–‰Œ_–ñ‘Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆÈ~‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆÈ~‰ñŽû“ú    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆÈ~‰ñŽûŠÔŠu  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|‹ŒŽæˆø”Ô†    PIC  X(010).
           03  ‚c‚R‚P|‰ð–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|‰ð–ñˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|‰ð–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚P|–ž—¹—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|–ž—¹—\–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|–ž—¹ˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|ÄƒŠ[ƒXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚P|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|ÄƒŠ[ƒXŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚P|³ŒpƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|³Œpˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|³ŒpŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|³ŒpŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚P|”„‹pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|”„‹pˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚R‚P|ðŒ•ÏXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|ðŒ•ÏXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚P|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚R‚P|Œ_–ñ—¿—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|‘e—˜Šz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|“–‰Œ_–ñ—¿—¦  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆÈ~‰ñŽû•û–@  PIC  X(001).
           03  ‚c‚R‚P|¿‹ƒTƒCƒg    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|¿‹ŠÔŠu      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|¿‹Šî€ŒŽ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|Œ_–ñŽæˆø‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|Ó”C‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|‘ŠŽE‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|’•¶‘o—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|–ž—¹ˆÄ“à’ •[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|ÄƒŠ[ƒX—¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|Œ_–ñ‘Ž®      PIC  X(001).
           03  ‚c‚R‚P|•¨Œ•ÛŠÇêŠ  PIC  X(001).
           03  ‚c‚R‚P|¿‹æ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚P|•s“®ŽY’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|—L‰¿ØŒ”’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|‚»‚Ì‘¼’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|•ÛØl—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|–¢ŽûŽc‚‘ÎÛŠOƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|•ÛŒ¯‰ïŽÐ‹æ•ª  PIC  X(004).
           03  ‚c‚R‚P|“®‘•ÛŒ¯—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|“®‘•t•ÛŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚P|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚P|–â‡‚¹”Ô†    PIC  X(010).
           03  ‚c‚R‚P|ÄƒŠ[ƒX‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|‹ŒŒ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚P|w“ü‘I‘ðŒ •tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|ÄƒŠ[ƒX\¿‘—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|ÄƒŠ[ƒX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|³Œp\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|\¿˜A”Ô      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|ƒŠƒXƒPƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚P|‘e—˜‰vŠz|•\  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|‚¨Žx•¥–¾×‘ì¬Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|‚¨Žx•¥–¾×‘—v”Û
                                     PIC  X(001).
           03  ‚c‚R‚P|\¿”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚P|‘ÎÛŒ³–{Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|Á”ïÅ—¦‹æ•ª  PIC  X(002).
           03  ‚c‚R‚P|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|ÄƒŠ[ƒX\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|¿‹Šî€      PIC  X(001).
           03  ‚c‚R‚P|ŽŸ‰ñÄƒŠ[ƒX‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽŸ‰ñÄƒŠ[ƒX‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽG”ï•ÛŽç—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽG”ï”Ì‘£”ï    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽG”ïM—p•ÛŒ¯  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽG”ï‚»‚Ì‘¼    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|’¥‹Š®—¹ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|’¥‹Š®—¹ŽæÁƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|ŽŸ‰ñÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|Œ_–ñ‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|’•¶‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|‚»‚Ì‘¼”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|‰c‹ÆƒRƒƒ“ƒg—“‚R
                                     PIC  X(080).
           03  ‚c‚R‚P|ŽÐ“à‹à—˜‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|ŽG”ï’²®Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|‹¦’²‰ñŽû‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|’P”N“xŒ_–ñ    PIC  X(001).
           03  ‚c‚R‚P|ƒoƒbƒNŽæˆø    PIC  X(001).
           03  ‚c‚R‚P|”Û”F‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|‘O“n‹à‹æ•ª    PIC  X(001).
           03  ‚c‚R‚P|”ñ‰ÛÅ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚P|•ïŠ‡‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|ŠCŠOÝ’u‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|•¨ŒƒRƒƒ“ƒg  PIC  X(040).
           03  ‚c‚R‚P|‰ð–ñ‹àŒvŽZ•û–@
                                     PIC  X(001).
           03  ‚c‚R‚P|”À“ü—\’è“ú    PIC  X(008).
           03  ‚c‚R‚P|\¿Œ_–ñŠz‰ÁŽZƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|Ð‰îæŽæˆøæ  PIC  X(009).
           03  ‚c‚R‚P|Ð‰îæŒ_–ñæ  PIC  X(005).
           03  ‚c‚R‚P|Ð‰îæ‚a‚s‚l  PIC  X(004).
           03  ‚c‚R‚P|Ð‰îæ—»“X    PIC  X(004).
           03  ‚c‚R‚P|Ð‰îæ‹âs    PIC  X(004).
           03  ‚c‚R‚P|Ð‰îæŽx“X    PIC  X(003).
           03  ‚c‚R‚P|¿‹“ú        PIC  X(002).
           03  ‚c‚R‚P|Œ_–ñŽæÁ——R‚P
                                     PIC  X(080).
           03  ‚c‚R‚P|Œ_–ñŽæÁ——R‚Q
                                     PIC  X(080).
           03  ‚c‚R‚P|Œ_–ñŽæÁ\¿‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|ŒˆÙ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|Œ_–ñ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|ŒŸŽû“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|Œ_–ñŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|ŒŸŽûŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|•ÏX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|•ÏXƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚P|•ÏX”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚P|Â–±‹¦’²ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚P|ˆê”Ê‘åŒû‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|§“xƒŠ[ƒX    PIC  X(001).
           03  ‚c‚R‚P|Šî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|‘e—˜Šz‘Šz•ª  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆê”ÊŽÐ“à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆê”ÊŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆê”Ê‘e—˜Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆê”ÊŠî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆê”ÊŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆê”Ê‘e—˜ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|‹­§•Û‘¶ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚P|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚R‚P|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚R‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚P|ˆ´ùŽè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|‹Æ–±‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|”ƒ–ß‹`–±‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|‘ã—‰ñŽû      PIC  X(001).
           03  ‚c‚R‚P|”ƒŽæ‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|‹à—˜•Ï“®‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|˜A“®‹à—˜‹æ•ª  PIC  X(002).
           03  ‚c‚R‚P|Š„ˆø—¦        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|‘Ý•t‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P|‘Ý•t‹à—˜      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|Ž‘‹àŽg“r‹æ•ª  PIC  X(002).
           03  ‚c‚R‚P|Ž‘‹àŽg“r•¶Œ¾  PIC  X(080).
           03  ‚c‚R‚P|Žx•¥ˆÏ‘õŽæˆøŒ`‘Ô
                                     PIC  X(001).
           03  ‚c‚R‚P|—ZŽ‘•û–@      PIC  X(001).
           03  ‚c‚R‚P|•ÔÏðŒ      PIC  X(001).
           03  ‚c‚R‚P|ƒŠ[ƒXŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|Ž‘ŽY‰È–Ú‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|d—v«Šî€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|‘O“n‹à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ƒgƒŠƒvƒ‹ƒIƒvƒVƒ‡ƒ“•ûŽ®
                                     PIC  X(001).
           03  ‚c‚R‚P|ˆø‡’†Ž~‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|“à—e•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|³Œp•ªŠ„Ží—Þ  PIC  X(001).
           03  ‚c‚R‚P|³Œp‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|–ž—¹ðŒ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|‘æ‚P‰ñ–Ú‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚R‚P|‘æ‚Q‰ñ–ÚˆÈ~‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚R‚P|÷“nðŒ•tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|ÂŒ ”ƒŽæ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|Žx•¥Šî€ŒŽ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|‘¹ŠQ”…ž‹à•¶Œ¾
                                     PIC  X(080).
           03  ‚c‚R‚P|—¬“®‰»”Ô†    PIC  X(006).
           03  ‚c‚R‚P|—¬“®‰»æ      PIC  X(007).
           03  ‚c‚R‚P|M‘õæÝ’è“ú  PIC  X(008).
           03  ‚c‚R‚P|M‘õI—¹“ú    PIC  X(008).
           03  ‚c‚R‚P|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|·“ü—\–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|ÂŒ ”ƒŽæ“ú    PIC  X(008).
           03  ‚c‚R‚P|‘ŠŽEð€‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|÷“n‹ÖŽ~“Á–ñ  PIC  X(001).
           03  ‚c‚R‚P|æ•ûŒ_–ñ”Ô†  PIC  X(016).
           03  ‚c‚R‚P|ÄƒŠ[ƒX—¿•ªŽq
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚P|ÄƒŠ[ƒX—¿•ª•ê
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚P|‰c‹ÆƒRƒƒ“ƒg—“‚S
                                     PIC  X(080).
           03  ‚c‚R‚P|V‹Kæ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚P|e–§æ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚P|à–±•”‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ˆê”Ê‘O“n‹à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P|ŒˆÙƒ‰ƒ“ƒN    PIC  X(001).
           03  ‚c‚R‚P|‚¨—çó”­sƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|ˆÚsƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚R‚P|ÄƒŠ[ƒX\¿ðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚P|–â‚¢‡‚í‚¹’S“–•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚P|–â‚¢‡‚í‚¹’S“–ŽÒ–¼
                                     PIC  X(020).
           03  ‚c‚R‚P|ÄƒŠ[ƒX—¿Žx•¥—\’è“ú
                                     PIC  X(008).
           03  ‚c‚R‚P|–ž—¹’Ê’m‘‰ñ“šŠúŒÀ
                                     PIC  X(008).
           03  ‚c‚R‚P|\¿‹æ•ª      PIC  X(001).
           03  ‚c‚R‚P|“à—e\¿‘ˆóü‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P|“à—e\¿‘ˆóüÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P|Œ_–ñŒ–¼Ž©“®“o˜^‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P|•ÔÏŒ´Ž‘      PIC  X(080).
           03  ‚c‚R‚P|”Û”Fˆ—‹æ•ª  PIC  X(001).
           03  ‚c‚R‚P|‰ð–ñ——R      PIC  X(002).
           03  ‚c‚R‚P|—¬“®‰»æŒ_–ñæƒR[ƒh
                                     PIC  X(005).
