000010************************************************
000020* 契約（契約基本）(CPBIS032)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()請求コード             PIC S9(2).
000070    03  ()事業所コード           PIC S9(4).
000080    03  ()ユーザコード           PIC  X(8).
000090    03  ()担当者コード           PIC S9(4).
000100    03  ()契約日.
000110     05  ()契約日－世紀           PIC S9(1).
000120     05  ()契約日－年月日         PIC  X(6).
000130    03  ()検収日.
000140     05  ()検収日－世紀           PIC S9(1).
000150     05  ()検収日－年月日         PIC  X(6).
000160    03  ()検収予定日.
000170     05  ()検収予定日－世紀       PIC S9(1).
000180     05  ()検収予定日－年月日     PIC  X(6).
000190    03  ()リース開始日.
000200     05  ()リース開始日－世紀     PIC S9(1).
000210     05  ()リース開始日－年月日   PIC  X(6).
000220    03  ()リース終了日.
000230     05  ()リース終了日－世紀     PIC S9(1).
000240     05  ()リース終了日－年月日   PIC  X(6).
000250    03  ()リース期間             PIC S9(3)  SIGN LEADING SEPARATE.
000260    03  ()物件枝番数             PIC S9(3)  SIGN LEADING SEPARATE.
000270    03  ()展開数                 PIC S9(3)  SIGN LEADING SEPARATE.
000280    03  ()数量合計               PIC S9(5)  SIGN LEADING SEPARATE.
000290    03  ()最終物件数ＮＯ         PIC S9(3).
000300    03  ()協調.
000310     05  ()幹事非幹事             PIC  X(1).
000320     05  ()ＯＰＥＮＣＬＯＳＥ区分 PIC  X(1).
000330     05  ()回収手順               PIC  X(1).
000340    03  FILLER           PIC  X(9).
000350    03  ()否認区分               PIC  X(1).
000360    03  ()契約情報.
000370     05  ()残価保証区分           PIC S9(1).
000380     05  ()債務協調区分           PIC  X(2).
000390     05  ()単年度契約             PIC  X(2).
000400     05  ()支払繰延月数           PIC S9(2)V9(2)  SIGN LEADING SEPARATE.
000410     05  ()勘定処理コード         PIC S9(2).
000420     05  ()支払回数               PIC S9(3)  SIGN LEADING SEPARATE.
000430     05  ()据置期間               PIC S9(3)  SIGN LEADING SEPARATE.
000440     05  ()契約種類               PIC  X(1).
000450     05  ()ＢＥＧＩＮ回数         PIC S9(1).
000460     05  ()計算方式               PIC S9(1).
000470     05  ()利回り.
000480      07  ()基本利回り             PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000490      07  ()実質利回り             PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000500     05  ()金利基準               PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000510     05  ()第１回リース料入金日.
000520      07  ()第１回リース料入金日－世紀 PIC S9(1).
000530      07  ()第１回リース料入金日－年月日 PIC  X(6).
000540     05  ()残価回収日.
000550      07  ()残価回収日－世紀       PIC S9(1).
000560      07  ()残価回収日－年月日     PIC  X(6).
000570     05  ()前受リース料入金日.
000580      07  ()前受リース料入金日－世紀 PIC S9(1).
000590      07  ()前受リース料入金日－年月日 PIC  X(6).
000600     05  ()契約金額               PIC S9(13)  SIGN LEADING SEPARATE.
000610     05  ()購入金額合計           PIC S9(13)  SIGN LEADING SEPARATE.
000620     05  ()リース料               PIC S9(13)  SIGN LEADING SEPARATE.
000630     05  ()リース料初回           PIC S9(13)  SIGN LEADING SEPARATE.
000640     05  ()リース料最回           PIC S9(13)  SIGN LEADING SEPARATE.
000650     05  ()前受リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000660     05  ()残価額合計             PIC S9(13)  SIGN LEADING SEPARATE.
000670     05  ()前渡金利息額           PIC S9(13)  SIGN LEADING SEPARATE.
000680     05  ()初期費用               PIC S9(13)  SIGN LEADING SEPARATE.
000690     05  ()諸経費.
000700      07  ()固定資産税             PIC S9(13)  SIGN LEADING SEPARATE.
000710      07  ()保険料                 PIC S9(13)  SIGN LEADING SEPARATE.
000720      07  ()保守料                 PIC S9(13)  SIGN LEADING SEPARATE.
000730      07  ()その他１               PIC S9(13)  SIGN LEADING SEPARATE.
000740      07  ()その他２               PIC S9(13)  SIGN LEADING SEPARATE.
000750     05  ()諸経費合計             PIC S9(13)  SIGN LEADING SEPARATE.
000760     05  ()第２回リース料入金日.
000770      07  ()第２回リース料入金日－世紀 PIC S9(1).
000780      07  ()第２回リース料入金日－年月日 PIC  X(6).
000790     05  ()充当相殺区分           PIC  X(1).
000800     05  ()前渡金区分             PIC  X(1).
000810     05  ()案件発生区分           PIC  X(1).
000820     05  ()稟議区分               PIC  X(1).
000830    03  FILLER           PIC  X(4).
000840    03  ()請求情報.
000850     05  ()請求先コード           PIC  X(8).
000860     05  ()回収方式.
000870      07  ()回収方式初回           PIC S9(1).
000880      07  ()回収方式以降           PIC S9(1).
000890     05  ()振込入金銀行情報.
000900      07  ()銀行コード             PIC  X(7).
000910      07  ()口座番号               PIC  X(7).
000920      07  ()預金種類               PIC  X(1).
000930     05  ()入金日                 PIC S9(2)  SIGN LEADING SEPARATE.
000940     05  ()請求サイクル           PIC S9(2)  SIGN LEADING SEPARATE.
000950    03  FILLER           PIC  X(10).
000960    03  ()消費税情報.
000970     05  ()仕入消費税額合計       PIC S9(13)  SIGN LEADING SEPARATE.
000980     05  ()消費税徴収区分         PIC S9(1).
000990     05  ()消費税率               PIC S9(2)V9(1)  SIGN LEADING SEPARATE.
001000     05  ()消費税.
001010      07  ()消費税合計             PIC S9(11)  SIGN LEADING SEPARATE.
001020      07  ()回収方式コード         PIC S9(1).
001030     05  ()消費税コード           PIC  X(2).
001040    03  FILLER           PIC  X(1).
001050    03  ()関連契約ＮＯ           PIC  X(9).
001060    03  ()契約統計.
001070     05  ()転リース提携先コード   PIC  X(2).
001080     05  ()訂正区分.
001090      07  ()訂正区分１             PIC  X(1).
001100      07  ()訂正区分２             PIC  X(1).
001110      07  ()訂正区分３             PIC  X(1).
001120      07  ()訂正区分４             PIC  X(1).
001130      07  ()訂正区分５             PIC  X(1).
001140     05  ()粗利                   PIC S9(13)  SIGN LEADING SEPARATE.
001150     05  ()営業貸付金区分         PIC S9(1).
001160     05  ()データ識別             PIC S9(2).
001170    03  ()入金情報.
001180     05  ()入金通番                          OCCURS 5.
001190      07  ()当日日付               PIC  X(4).
001200      07  ()入金通番－連番号       PIC S9(5).
001210    03  FILLER           PIC  X(8).
001220    03  ()与信先                            OCCURS 5.
001230     05  ()名寄せコード           PIC  X(8).
001240     05  ()与信先名漢字           PIC  X(60).
001250     05  ()保証損保内容           PIC  X(2).
001260     05  ()保全範囲               PIC  X(2).
001270     05  ()負担割合               PIC S9(3)  SIGN LEADING SEPARATE.
001280    03  FILLER           PIC  X(23).
001290    03  ()検収済区分             PIC S9(1).
001300    03  ()処理完了済区分         PIC S9(1).
001310    03  ()処理年月度.
001320     05  ()処理年月度－世紀       PIC  X(1).
001330     05  ()処理年月度－年月       PIC  X(4).
001340    03  ()共通情報               PIC  X(35).
