000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CH105.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060       SELECT STOCK-FILE ASSIGN TO DISK-MSD.
000070       SELECT PRINT-FILE ASSIGN TO PRINTER-MSD.
000080 DATA DIVISION.
000090 FILE SECTION.
000100 FD STOCK-FILE LABEL RECORD IS STANDARD
000110                 VALUE OF IDENTIFICATION IS "STOCK-DAT".
000120 01 STOCK-REC.                           
000130     03 NUMBERS PIC 9(3).
000140     03 PRICE   PIC 9(4)V99.
000150 FD PRINT-FILE LABEL RECORD  IS STANDARD
000160           VALUE OF IDENTIFICATION IS "PRINT-DAT".  
000170 01  P-REC PIC X(80).
000180 WORKING-STORAGE SECTION.
000190 77  N     PIC 9.
000200 77  E-W   PIC X(3).
000210 01  SALE-OUT.
000220      03 N-O    PIC 9(3).
000230      03 N-A    PIC 9(6)V99.
000240 01 P-W.
000250      03 P-NUMBER  PIC 9(3).
000260      03 P-PRICE   PIC Z(6).99.
000270      03 P-AMOUNT  PIC Z(8).99.
000280      03 P-SUM     PIC Z(8).99.                              
000290 01  STOCK-TABLE.              
000300      03 S-P OCCURS 40 INDEXED BY J.      
000310      03 N-T PIC 9(3).
000320      03 P-T PIC 9(4)V99.
000330 PROCEDURE DIVISION.
000340 G.     
000350      OPEN INPUT STOCK-FILE.
000360      MOVE SPACE TO E-W.
000370      MOVE ZERO TO N STOCK-TABLE.
000380      READ STOCK-FILE AT END MOVE "EOF" TO E-W.
000390      PERFORM F UNTIL E-W = "EOF".
000400      CLOSE STOCK-FILE.
000410 G1.   
000420      OPEN OUTPUT PRINT-FILE.
000430      DISPLAY "INPUT NUMBERS".
000440      ACCEPT N-O.
000450      PERFORM A UNTIL N-O = 999.
000460      CLOSE PRINT-FILE.
000470      STOP RUN.
000480 F.   
000490      ADD 1 TO N.
000500      MOVE STOCK-REC TO S-P(N).
000510      DISPLAY S-P(N) N.
000520      READ STOCK-FILE AT END MOVE "EOF" TO E-W.
000530 A.   
000540      SET J TO 1.
000550      SEARCH S-P AT END DISPLAY "NUMBERS NOT EXIT"
000560      WHEN N-O = N-T(J) PERFORM P.
000570      DISPLAY "INPUT NUMBERS".
000580      ACCEPT N-O.
000590 P.   
000600      DISPLAY "INPUT AMOUNT".
000610      ACCEPT N-A.
000620      MOVE P-T(J) TO P-PRICE.
000630      MULTIPLY P-T(J) BY N-A GIVING P-SUM.
000640      MOVE N-O TO P-NUMBER
000650      MOVE N-A TO P-AMOUNT.
000660      MOVE P-W TO P-REC.
000670      WRITE P-REC