000010*****************************************************************
000020*   Ž‘ŽYŽí—Þƒ}ƒXƒ^(D12SIB_TBL)
000030*****************************************************************
000040 01  Ž‘ŽYŽí—Þƒ}ƒXƒ^.
000050     03  ‚c‚P‚Q|Ž‘ŽYŽí—Þ      PIC  X(007).
000060     03  ‚c‚P‚Q|“K—p”NŒŽ“ú    PIC  X(008).
000070     03  ‚c‚P‚Q|Ž‘ŽY‘å•ª—Þ–¼Ì
000080                               PIC  X(040).
000090     03  ‚c‚P‚Q|Ž‘ŽY–¼Ì      PIC  X(060).
000100     03  ‚c‚P‚Q|‘Ï—p”N”      PIC S9(002) PACKED-DECIMAL.
000110     03  ‚c‚P‚Q|Å–@‹æ•ª      PIC  X(001).
000120     03  ‚c‚P‚Q|XV“úŽž      PIC  X(016).
000130     03  ‚c‚P‚Q|XVŽÒ        PIC  X(008).
000140     03  ‚c‚P‚Q|\—p”»’èƒR[ƒh
000150                               PIC  X(001).
000160     03  ‚c‚P‚Q|ŠJŽ¦—p”»’èƒR[ƒh
000170                               PIC  X(001).
000180     03  ‚c‚P‚Q|”NŽŸ“Œv—p”»’èƒR[ƒh
000190                               PIC  X(001).
000200     03  ‚c‚P‚Q|“ü—Í’S“–ŽÒƒR[ƒh
000210                               PIC  X(008).
000220     03  ‚c‚P‚Q|Ž‘ŽY–¼ÌƒJƒi  PIC  X(040).
000230     03  ‚c‚P‚Q|Ž‘ŽY—ªÌ      PIC  X(010).
000240     03  ‚c‚P‚Q|Ž‘ŽY—ªÌƒJƒi  PIC  X(012).
000250     03  ‚c‚P‚Q|“o˜^”NŒŽ“ú    PIC  X(008).
000260     03  ‚c‚P‚Q|“o˜^ŽžŠÔ      PIC  X(008).
000270     03  ‚c‚P‚Q|“o˜^’S“–ŽÒ    PIC  X(008).
000280     03  ‚c‚P‚Q|XV”NŒŽ“ú    PIC  X(008).
000290     03  ‚c‚P‚Q|XVŽžŠÔ      PIC  X(008).
