000010 IDENTIFICATION                   DIVISION.
000020 PROGRAM-ID.                      99SUB2.
000030 ENVIRONMENT                      DIVISION.
000040 DATA                             DIVISION.
000050 WORKING-STORAGE                  SECTION.
000060 01 L-MARK                   PIC       9.
000070 01 R-MARK                   PIC       99.
000080 01 DATA-SET.
000090  02 MULTI-NUM          PIC       9.
000100  02 MULTI-MARK         PIC       X VALUE "*".
000110  02 MULTIED-NUM        PIC       9.
000120  02 EQUAL-MARK         PIC       X VALUE "=".
000130  02 RESULT             PIC       99.
000140  02 FILLER             PIC       X VALUE " ".
000150 LINKAGE                          SECTION.
000160 01 TABLE-99.
000170   02 L OCCURS 9 TIMES.
000180    03 R OCCURS 9 TIMES PIC 9(7).
000190 77 NUM                 PIC       X.
000200 PROCEDURE                        DIVISION USING TABLE-99 NUM.
000210 PRG-BEGIN.
000220     PERFORM L-PART THRU L-END UNTIL L-MARK = NUM.
000230 PRG-END.
000240     EXIT PROGRAM.
000250 L-PART.
000260     IF L-MARK NOT = NUM
000270     MOVE 10 TO R-MARK
000280     ADD 1 TO L-MARK
000290     PERFORM R-PART THRU R-END UNTIL R-MARK = L-MARK
000300     DISPLAY L(L-MARK).
000310 L-END.
000320     EXIT.
000330 R-PART.
000340     IF R-MARK NOT = L-MARK
000350     SUBTRACT 1 FROM R-MARK
000360     MOVE L-MARK TO MULTI-NUM 
000370     COMPUTE MULTIED-NUM = 10 - R-MARK
000380     COMPUTE RESULT = MULTI-NUM * MULTIED-NUM
000390     MOVE DATA-SET TO R(L-MARK, R-MARK).
000400 R-END.
000410     EXIT.    
