 TEST1:PROC OPTIONS(MAIN);
 DCL I  FIXED DEC(5) INIT(1),
     SUM FIXED DEC(5)INIT(0);
 LOOP: SUM = SUM + I;
 SELECT(SUM);
 WHEN(1) PUT SKIP EDIT('I=',I,'  ','SUM=',SUM) (A);
 WHEN(6) PUT SKIP EDIT('I=',I,'  ','SUM=',SUM) (A);
 OTHER   PUT SKIP EDIT('NO') (A);
 END;
 IF SUM<11 THEN GO TO LOOP;
 END TEST1;
