 TEST1:PROC OPTIONS(MAIN);
 DCL I   FIXED DEC(5) INIT(1),
     SUM FIXED DEC(5) INIT(0);
 DO UNTIL(I > 10);
    SUM=SUM+I;
    I=I+1;
 END;
 PUT LIST('UNTIL SUM='||SUM);
 END TEST1;
