 TEST1:PROC OPTIONS(MAIN);
 DCL
   HELLO_A FIXED(5) INIT(100),
   HELLO_B FIXED(5) INIT(200),
   HELLO_C FIXED(5) INIT(0);
 HELLO_C = HELLO_A + HELLO_B;
 PUT EDIT(HELLO_A) (A);
 PUT SKIP EDIT(HELLO_C) (A);
 END TEST1;
