 TEST1:PROC OPTIONS(MAIN);
 DCL I  FIXED DEC(5) INIT(1),
     SUM FIXED DEC(5)INIT(0);
 LOOP: SUM = SUM + I;
 SELECT;
 WHEN(SUM = 3)
     PUT SKIP EDIT('WHEN=1','  ','SUM=',SUM) (A);
 WHEN((SUM = 6) | (SUM = 10))
     PUT SKIP EDIT('WHEN=2','  ','SUM=',SUM) (A);
 OTHER
     PUT SKIP EDIT('NO') (A);
 END;
 IF SUM<11 THEN GO TO LOOP;
 END TEST1;
