 TEST1:PROC OPTIONS(MAIN);
 DCL I  FIXED DEC(5) INIT(1),
     SUM FIXED DEC(5)INIT(0);
 LOOP:  SUM = SUM + I;
 IF    SUM < 50
 THEN  GO TO LOOP;
 ELSE DO;
     PUT EDIT(I) (A);
     PUT SKIP EDIT(SUM) (A);
 END;
 END TEST1;
