       IDENTIFICATION                             DIVISION.             00010005
       PROGRAM-ID. HELLO.                                               00020004
       DATA                                       DIVISION.             00030005
       WORKING-STORAGE                            SECTION.              00040005
       PROCEDURE                                  DIVISION.             00080005
       MAIN-PROCESS                               SECTION.              00090005
           DISPLAY 'HELLO WORLD'.                                       00110003
           STOP RUN.                                                    00120001
       END PROGRAM HELLO.                                               00130005
