000010 IDENTIFICATION DIVISION.    
000020 PROGRAM-ID. EXAM411.         
000030 ENVIRONMENT DIVISION.        
000040 DATA DIVISION.               
000050 WORKING-STORAGE SECTION.     
000060 77  S PIC 9(4)V99.              
000070   88 S1 VALUE 0 THRU 999.99.    
000080   88 S2 VALUE 1000 THRU 1999.99.
000090   88 S3 VALUE 2000 THRU 2999.99.
000100   88 S4 VALUE 3000 THRU 3999.99.
000110 77 S-K PIC Z(4).99.             
000120 77 AMOUNT PIC Z(3).99.         
000130 PROCEDURE DIVISION.             
000140      DISPLAY "S-?".              
000150      ACCEPT S.                   
000160      IF S1 OOMPUTE AMOUNT=O.O6*S  
000180      IF S2 OOMPUTE AMOUNT=0,l*S.  
000190      IF S3 OOMPUTE AMOUNT-0.15*S. 
000200      IF S4 OOMPUTE AMOUNT=0.2.S.  
000210      MOVE S TO S-K.              
000220      DISPLAY "S=",S-E.            
000230      DISPLAY "AMOUNT=", AMOUNT.  
000240      STOP RUN.                   