000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. DEMO.
000030*
000040 ENVIRONMENT DIVISION.
000050 INPUT-OUTPUT SECTION.
000080*
000090 DATA DIVISION.

000191 WORKING-STORAGE SECTION.
000200*
000210 PROCEDURE DIVISION.
000250 MAIN-PROCESS.
           DISPLAY "THIS IS A COBOL PROGRAM.".
           STOP 1.
000320     STOP RUN.
