000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. L92091.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060     SELECT NOTE-FILE ASSIGN TO NOTE-MSD
000070     ORGANIZATION IS INDEXED  
000080     ACCESS MODE IS  RANDOM 
000081     RECORD KEY  IS NAME.
000100* 
000110 DATA DIVISION.
000120 FILE SECTION.
000130 FD NOTE-FILE LABEL RECORD IS STANDARD
000140         VALUE OF IDENTIFICATION IS "NOTE".
000150 01 NOTE-TEC.
000161     02 NAME       PIC X(10).
000170     02 POSTCODE   PIC 9(6).
000180     02 ADDRE      PIC X(20).
000190     02 TELEPHONE  PIC 9(7).
000200 PROCEDURE DIVISION.
000210 B.
000220     OPEN OUTPUT NOTE-FILE.
000230*    
000240 P. 
000250     DISPLAY "NAME Z IS THE END.".
000260     ACCEPT NAME.
000270     IF NAME = "Z" 
000280             CLOSE NOTE-FILE 
000290             STOP RUN.
000300     DISPLAY "POSTCODE?".   
000310     ACCEPT   POSTCODE.
000320     DISPLAY "ADDRE? ".
000330     ACCEPT ADDRE.
000340     DISPLAY "TELEPHONE? ".  
000350     ACCEPT   TELEPHONE.
000360     WRITE NOTE-TEC INVALID KEY 
000370         DISPLAY "SHU CHU CUO WU"
000380         GO TO P.
000390     GO TO P.
000400