000010******************************************************************
000020*         ＜海輝軟件(大連)＞                                     *
000030*      1. プログラム名  : 受取手形移行処理                       *
000040*      2. プログラムID  : COBIS630                               *
000050*      3. 処理概要      : ＜受取手形テーブル＞受取手形の情報を代 *
000060*                         表契約番号、束数位で管理したもの       *
000070*                         ＜受取手形展開テーブル＞受取手形の情報 *
000080*                         を代表契約番号、束数、連番（代表契約番 *
000090*                         号、束数単位)単位で管理したもの        *
000100*      4. 作成者        : 柳占鋒                                 *
000110*      5. 作成日        : 2005.04.04                             *
000120******************************************************************
000130*                                                                 
000140******************************************************************
000150*    ＩＤＥＮＴＩＦＩＣＡＴＩＯＮ  ＤＩＶＩＳＩＯＮ              *
000160******************************************************************
000170 IDENTIFICATION                       DIVISION.                   
000180*                                                                 
000190 PROGRAM-ID.                          COBIS630.                   
000200******************************************************************
000210*    ＥＮＶＩＲＯＮＭＥＮＴ        ＤＩＶＩＳＩＯＮ              *
000220******************************************************************
000230 ENVIRONMENT                          DIVISION.                   
000240******************************************************************
000250*    ＩＮＰＵＴ－ＯＵＴＰＵＴ      ＳＥＣＴＩＯＮ                *
000260******************************************************************
000270 INPUT-OUTPUT                         SECTION.                    
000280*                                                                 
000290 FILE-CONTROL.                                                    
000300     SELECT    入力ファイル１         ASSIGN    TO     U01        
000310     FILE      STATUS     IS          Ｗ－状態                    
000320     ORGANIZATION         IS          LINE      SEQUENTIAL.       
000330*                                                                 
000340     SELECT    入力ファイル２         ASSIGN    TO     U02        
000350     FILE      STATUS     IS          Ｗ－状態                    
000360     ORGANIZATION         IS          LINE      SEQUENTIAL.       
000370*                                                                 
000380******************************************************************
000390*    ＤＡＴＡ                      ＤＩＶＩＳＩＯＮ              *
000400******************************************************************
000410 DATA                                 DIVISION.                   
000420******************************************************************
000430*    ＦＩＬＥ                      ＳＥＣＴＩＯＮ                *
000440******************************************************************
000450 FILE                                 SECTION.                    
000460*----------------------------------------------------------------*
000470*    入力ファイル                                                *
000480*----------------------------------------------------------------*
000490 FD  入力ファイル１                                               
000500     LABEL     RECORD     IS          STANDARD                    
000510     BLOCK     CONTAINS   0           RECORDS.                    
000520*                                                                 
000530 01  入力－レコード１.                                            
000540     COPY  CPBIS061  REPLACING  ==()==  BY  ==入力１－==.         
000550*                                                                 
000560 FD  入力ファイル２                                               
000570     LABEL     RECORD     IS          STANDARD                    
000580     BLOCK     CONTAINS   0           RECORDS.                    
000590*                                                                 
000600 01  入力－レコード２.                                            
000610     COPY  CPBIS062  REPLACING  ==()==  BY  ==入力２－==.         
000620*                                                                 
000630******************************************************************
000640*  ＷＯＲＫＩＮＧ－ＳＴＯＲＡＧＥ  ＳＥＣＴＩＯＮ                *
000650******************************************************************
000660  WORKING-STORAGE                     SECTION.                    
000670*----------------------------------------------------------------*
000680*    ホスト変数定義エリア                                        *
000690*----------------------------------------------------------------*
000700     EXEC  SQL  BEGIN  DECLARE        SECTION  END-EXEC.          
000710*                                                                 
000720 01  ＷＳ－取引先コード               PIC  X(08).                 
000730 01  ＷＳ－目的ＣＤ                   PIC  X(01)  VALUE "2".      
000740 01  ＷＳ－契約ＮＯ                   PIC  X(09).                 
000750 01  ＷＳ－支払人コード               PIC  X(08).                 
000760*--< ＯＲＡＣＬＥ共通変数 >                                       
000770     EXEC  SQL  INCLUDE  SQLCOM.CBL            END-EXEC.          
000780*                                                                 
000790*--< ＯＲＡＣＬＥ  ＳＱＬ実行情報 >                               
000800     EXEC  SQL  INCLUDE  SQLCA.COB             END-EXEC.          
000810*                                                                 
000820*--< 受取手形テーブル >                                           
000830     EXEC  SQL  INCLUDE  D642UTG.CBL           END-EXEC.          
000840*                                                                 
000850*--< 受取手形展開テーブル >                                       
000860     EXEC  SQL  INCLUDE  D645UTT.CBL           END-EXEC.          
000870*                                                                 
000880*--< 変換テーブル >                                               
000890     EXEC  SQL  INCLUDE  IKOTBL001.CBL         END-EXEC.          
000900*                                                                 
000910*--< 契約種類等変換テーブル >                                     
000920     EXEC  SQL  INCLUDE  IKOTBL002.CBL         END-EXEC.          
000930*                                                                 
000940     EXEC  SQL  END  DECLARE          SECTION  END-EXEC.          
000950*                                                                 
000960*----------------------------------------------------------------*
000970*    ＷＯＲＫエリア                                              *
000980*----------------------------------------------------------------*
000990 01  ＷＯＲＫ－エリア.                                            
001000*--< エラー判定用 >                                               
001010     03  Ｗ－エラーコード             PIC S9(04).                 
001020*--< 日期処理 >                                                   
001030     03  Ｗ－入力日期                 PIC  X(07).                 
001040     03  Ｗ－出力日期                 PIC  X(08).                 
001050*                                                                 
001060*--< フラグアリア >                                               
001070     03  フラグアリア.                                            
001080         05  Ｗ－終了－フラグ１       PIC  X(01).                 
001090         05  Ｗ－終了－フラグ２       PIC  X(01).                 
001100         05  Ｗ－異常終了－フラグ     PIC  X(01).                 
001110*                                                                 
001120*--< 件数エリア >                                                 
001130     03  件数エリア.                                              
001140         05  Ｗ－入力－件数１         PIC  9(09).                 
001150         05  Ｗ－入力－件数２         PIC  9(09).                 
001160         05  Ｗ－出力－件数１         PIC  9(09).                 
001170         05  Ｗ－出力－件数２         PIC  9(09).                 
001180*                                                                 
001190*--< 連番エリア >                                                 
001200     03  連番エリア.                                              
001210         05  Ｗ－連番                 PIC S9(03).                 
001220*                                                                 
001230*--< ファイル状態 >                                               
001240     03  Ｗ－状態エリア.                                          
001250         05  Ｗ－状態                 PIC  X(02).                 
001260*--< キーエリア >                                                 
001270     03  ＫＥＹ－エリア.                                          
001280         05  ＮＥＷキー.                                          
001290             07 Ｗ－契約ＮＯ１        PIC  X(09).                 
001300             07 Ｗ－契約ＮＯ２        PIC  X(09).                 
001310             07 Ｎ－束数              PIC S9(02).                 
001320         05  ＯＬＤキー.                                          
001330             07 Ｏ－契約ＮＯ１        PIC  X(09).                 
001340             07 Ｏ－束数              PIC S9(02).                 
001350*                                                                 
001360*--< 共通情報 >                                                   
001370 01  Ｗ－共通情報.                                                
001380     03  Ｗ－システム日付.                                        
001390         05  Ｗ－世紀                 PIC  X(02) VALUE  "20".     
001400         05  Ｗ－年月日               PIC  X(06).                 
001410     03  Ｗ－システム時刻             PIC  X(08).                 
001420     03  Ｗ－担当者                   PIC  X(08) VALUE "IKOPG   ".
001430*                                                                 
001440*----------------------------------------------------------------*
001450*    サブルーチン名                                              *
001460*----------------------------------------------------------------*
001470 01  CALL-AREA.                                                   
001480*--< 共通ログサブルーチン >                                       
001490     03  CLOCO001                     PIC  X(08) VALUE "CLOCO001".
001500     03  COBCO001                     PIC  X(08) VALUE "COBCO001".
001510*                                                                 
001520*----------------------------------------------------------------*
001530*    ＣＯＰＹ領域                                                *
001540*----------------------------------------------------------------*
001550*--< 共通ログ用パラメータ >                                       
001560 01  IF-CHOCO001.                                                 
001570     COPY  CHOCO001  REPLACING  ==()==  BY  ==共通－==.           
001580*                                                                 
001590*----------------------------------------------------------------*
001600*    ＩＮＩファイル読込サブルーチン用パラメタ領域                *
001610*----------------------------------------------------------------*
001620 01  PARA-AREA.                                                   
001630     COPY CPBCO001.                                               
001640*                                                                 
001650******************************************************************
001660*    定数用データ定義エリア                                      *
001670******************************************************************
001680 CONSTANT                             SECTION.                    
001690 01  定数領域.                                                    
001700     03  定数－プログラムＩＤ         PIC  X(08) VALUE "COBIS630".
001710     03  定数－プログラム名           PIC  X(80)                  
001720                                        VALUE  "受取手形移行処理".
001730     03  定数－ＳＱＬＯＫ             PIC S9(04)  VALUE  ZERO.    
001740     03  定数－ＳＱＬＣＤＤＥＯＫ     PIC S9(04)  VALUE -2112.    
001750     03  定数－ＳＱＬＥＮＤ           PIC S9(04)  VALUE  0100.    
001760     03  定数－正常状態               PIC S9(04)  VALUE  ZERO.    
001770     03  定数－異常状態               PIC S9(04)  VALUE  0009.    
001780******************************************************************
001790*    ＰＲＯＣＥＤＵＲＥ            ＤＩＶＩＳＩＯＮ              *
001800******************************************************************
001810 PROCEDURE                            DIVISION.                   
001820*                                                                 
001830     PERFORM  初期処理.                                           
001840*                                                                 
001850     PERFORM  主処理  UNTIL  (Ｗ－終了－フラグ１  =  "Y"          
001860                        AND   Ｗ－終了－フラグ２  =  "Y").        
001870*                                                                 
001880     PERFORM  終了処理.                                           
001890*                                                                 
001900     STOP     RUN.                                                
001910*                                                                 
001920******************************************************************
001930*    初期処理                                                    *
001940******************************************************************
001950 初期処理                             SECTION.                    
001960 初期処理－ＳＴＡＲＴ.                                            
001970*                                                                 
001980*----------------------------------------------------------------*
001990*    開始メッセージ出力処理                                      *
002000*----------------------------------------------------------------*
002010     INITIALIZE                       IF-CHOCO001.                
002020     MOVE  "3"                        TO  共通－イベント種別.     
002030     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
002040     MOVE  "0"                        TO  共通－復帰コード.       
002050     MOVE  "START"                    TO  共通－処理識別.         
002060     MOVE  定数－プログラム名         TO  共通－その他メッセージ. 
002070     CALL  CLOCO001                USING  IF-CHOCO001.            
002080*                                                                 
002090*----------------------------------------------------------------*
002100*    作業領域の初期値処理                                        *
002110*----------------------------------------------------------------*
002120     MOVE  SPACE                      TO  ＷＯＲＫ－エリア.       
002130     INITIALIZE                           ＷＯＲＫ－エリア.       
002140*                                                                 
002150*--< ＣＰＵ日付を取得 >                                           
002160     ACCEPT  Ｗ－年月日               FROM  DATE.                 
002170*                                                                 
002180*--< ＣＰＵ時刻を取得 >                                           
002190     ACCEPT  Ｗ－システム時刻         FROM  TIME.                 
002200*                                                                 
002210     PERFORM  手形基本ファイルオープン.                           
002220*                                                                 
002230     PERFORM  受取手形ファイルオープン.                           
002240*                                                                 
002250     PERFORM  ＯＲＡＣＬＥ接続.                                   
002260*                                                                 
002270*--< 手形基本ファイル読込(１件目) >                               
002280     PERFORM  手形基本ファイル読込処理.                           
002290*                                                                 
002300*--< 受取手形ファイル読込(１件目) >                               
002310     PERFORM  受取手形ファイル読込処理.                           
002320*                                                                 
002330 初期処理－ＥＸＩＴ.                                              
002340     EXIT.                                                        
002350******************************************************************
002360*    ＯＲＡＣＬＥ接続                                            *
002370******************************************************************
002380 ＯＲＡＣＬＥ接続                     SECTION.                    
002390 ＯＲＡＣＬＥ接続－ＳＴＡＲＴ.                                    
002400*                                                                 
002410*--< ＤＢ接続用情報を取得処理 >                                   
002420     CALL  COBCO001                USING  PARA-AREA.              
002430*                                                                 
002440     MOVE  PARA-DBSTRING              TO  DB-STRING.              
002450     MOVE  PARA-USERNAME              TO  USERNAME.               
002460     MOVE  PARA-PASSWORD              TO  PASSWD.                 
002470*                                                                 
002480*----------------------------------------------------------------*
002490*    開始接続                                                    *
002500*----------------------------------------------------------------*
002510     IF    DB-STRING  =  SPACE                                    
002520        EXEC SQL                                                  
002530           CONNECT  :USERNAME IDENTIFIED BY :PASSWD               
002540        END-EXEC                                                  
002550     ELSE                                                         
002560        EXEC SQL                                                  
002570           CONNECT  :USERNAME IDENTIFIED BY :PASSWD               
002580             USING  :DB-STRING                                    
002590        END-EXEC                                                  
002600     END-IF.                                                      
002610*                                                                 
002620*----------------------------------------------------------------*
002630*    接続確認                                                    *
002640*----------------------------------------------------------------*
002650     EVALUATE  SQLCODE                                            
002660        WHEN   定数－ＳＱＬＯＫ                                   
002670           CONTINUE                                               
002680        WHEN   OTHER                                              
002690*--<       接続エラー >                                           
002700           MOVE     -10               TO  Ｗ－エラーコード        
002710           PERFORM  エラー判定処理                                
002720     END-EVALUATE.                                                
002730*                                                                 
002740 ＯＲＡＣＬＥ接続－ＥＸＩＴ.                                      
002750     EXIT.                                                        
002760******************************************************************
002770*    手形基本、受取手形ファイルオープン                          *
002780******************************************************************
002790*                                                                 
002800*----------------------------------------------------------------*
002810*    手形基本ファイルのオープン                                  *
002820*----------------------------------------------------------------*
002830 手形基本ファイルオープン             SECTION.                    
002840 手形基本ファイルオープン－ＳＴＡＲＴ.                            
002850*                                                                 
002860     OPEN  INPUT   入力ファイル１.                                
002870*                                                                 
002880*--< 入力ファイル１オープンの状態判定 >                           
002890     EVALUATE  Ｗ－状態                                           
002900        WHEN  ZERO                                                
002910           CONTINUE                                               
002920        WHEN  OTHER                                               
002930*--<       入力ファイル１オープンエラー >                         
002940           MOVE     -1                TO  Ｗ－エラーコード        
002950           PERFORM  エラー判定処理                                
002960     END-EVALUATE.                                                
002970*                                                                 
002980 手形基本ファイルオープン－ＥＸＩＴ.                              
002990     EXIT.                                                        
003000*----------------------------------------------------------------*
003010*    受取手形ファイルのオープン                                  *
003020*----------------------------------------------------------------*
003030 受取手形ファイルオープン             SECTION.                    
003040 受取手形ファイルオープン－ＳＴＡＲＴ.                            
003050*                                                                 
003060     OPEN  INPUT    入力ファイル２.                               
003070*                                                                 
003080*--< 入力ファイル２オープンの状態判定 >                           
003090     EVALUATE  Ｗ－状態                                           
003100        WHEN  ZERO                                                
003110           CONTINUE                                               
003120        WHEN  OTHER                                               
003130*--<       入力ファイル２オープンエラー >                         
003140           MOVE     -2                TO  Ｗ－エラーコード        
003150           PERFORM  エラー判定処理                                
003160     END-EVALUATE.                                                
003170*                                                                 
003180 受取手形ファイルオープン－ＥＸＩＴ.                              
003190     EXIT.                                                        
003200******************************************************************
003210*    手形基本、受取手形ファイル読込処理                          *
003220******************************************************************
003230*                                                                 
003240*----------------------------------------------------------------*
003250*    手形基本ファイル読込処理                                    *
003260*----------------------------------------------------------------*
003270 手形基本ファイル読込処理             SECTION.                    
003280 手形基本ファイル読込処理－ＳＴＡＲＴ.                            
003290*                                                                 
003300     READ  入力ファイル１                                         
003310        AT END                                                    
003320           MOVE  "Y"                  TO  Ｗ－終了－フラグ１      
003330           MOVE  HIGH-VALUE           TO  Ｗ－契約ＮＯ１          
003340           GO    TO   手形基本ファイル読込処理－ＥＸＩＴ          
003350     END-READ.                                                    
003360*                                                                 
003370*--< 手形基本ファイル読込状態判定 >                               
003380     EVALUATE  Ｗ－状態                                           
003390        WHEN  ZERO                                                
003400           MOVE  入力１－契約ＮＯ     TO  Ｗ－契約ＮＯ１          
003410           MOVE  入力１－契約ＮＯ     TO  ＷＳ－契約ＮＯ          
003420           MOVE  入力１－取引先コード TO  ＷＳ－取引先コード      
003430*--<       手形基本ファイル入力件数のカウント >                   
003440           COMPUTE  Ｗ－入力－件数１  =  Ｗ－入力－件数１ + 1     
003450        WHEN  OTHER                                               
003460*--<       手形基本ファイル読込エラー >                           
003470           MOVE     -3                TO  Ｗ－エラーコード        
003480           PERFORM  エラー判定処理                                
003490     END-EVALUATE.                                                
003500*                                                                 
003510 手形基本ファイル読込処理－ＥＸＩＴ.                              
003520     EXIT.                                                        
003530*----------------------------------------------------------------*
003540*    受取手形ファイル読込処理                                    *
003550*----------------------------------------------------------------*
003560 受取手形ファイル読込処理             SECTION.                    
003570 受取手形ファイル読込処理－ＳＴＡＲＴ.                            
003580*                                                                 
003590     READ  入力ファイル２                                         
003600        AT END                                                    
003610           MOVE  "Y"                  TO  Ｗ－終了－フラグ２      
003620           MOVE  HIGH-VALUE           TO  Ｗ－契約ＮＯ２          
003630           GO    TO   受取手形ファイル読込処理－ＥＸＩＴ          
003640     END-READ.                                                    
003650*                                                                 
003660*--< 受取手形ファイル読込状態判定 >                               
003670     EVALUATE  Ｗ－状態                                           
003680        WHEN  ZERO                                                
003690           MOVE  入力２－契約ＮＯ     TO  Ｗ－契約ＮＯ２          
003700           MOVE  入力２－束数         TO  Ｎ－束数                
003710           MOVE  入力２－支払人コード TO  ＷＳ－支払人コード      
003720*--<       受取手形ファイル入力件数のカウント >                   
003730           COMPUTE  Ｗ－入力－件数２  =  Ｗ－入力－件数２ + 1     
003740        WHEN  OTHER                                               
003750*--<       受取手形ファイル読込エラー >                           
003760           MOVE     -4                TO  Ｗ－エラーコード        
003770           PERFORM  エラー判定処理                                
003780     END-EVALUATE.                                                
003790*                                                                 
003800 受取手形ファイル読込処理－ＥＸＩＴ.                              
003810     EXIT.                                                        
003820*                                                                 
003830******************************************************************
003840*    主処理                                                      *
003850******************************************************************
003860 主処理                               SECTION.                    
003870 主処理－ＳＴＡＲＴ.                                              
003880*                                                                 
003890     EVALUATE  TRUE                                               
003900*--<    ファイルのみの場合 >                                      
003910        WHEN  Ｗ－契約ＮＯ１ > Ｗ－契約ＮＯ２                     
003920           PERFORM  受取手形ファイル読込処理                      
003930*                                                                 
003940*--<    マッチングの場合 >                                        
003950        WHEN  Ｗ－契約ＮＯ１ = Ｗ－契約ＮＯ２                     
003960           PERFORM  編集出力処理                                  
003970*                                                                 
003980           PERFORM  受取手形ファイル読込処理                      
003990*                                                                 
004000*--<    ファイルのみの場合 >                                      
004010        WHEN  Ｗ－契約ＮＯ１ < Ｗ－契約ＮＯ２                     
004020*                                                                 
004030           IF Ｗ－契約ＮＯ１ NOT  =  Ｏ－契約ＮＯ１               
004040		    DISPLAY "***** COBIS630:受取手形ファイルなし ",     
004050                      "契約ＮＯ=" , Ｗ－契約ＮＯ１                
004060           END-IF                                                 
004070           PERFORM  手形基本ファイル読込処理                      
004080*                                                                 
004090     END-EVALUATE.                                                
004100*                                                                 
004110 主処理－ＥＸＩＴ.                                                
004120     EXIT.                                                        
004130******************************************************************
004140*     手形基本、受取手形編集出力処理                             *
004150******************************************************************
004160 編集出力処理                         SECTION.                    
004170 編集出力処理－ＳＴＡＲＴ.                                        
004180*                                                                 
004190     PERFORM  受取手形編集処理.                                   
004200*                                                                 
004210     PERFORM  受取手形展開編集処理.                               
004220*                                                                 
004230     IF     Ｗ－契約ＮＯ１ = Ｏ－契約ＮＯ１                       
004240        AND Ｎ－束数       = Ｏ－束数                             
004250        PERFORM  受取手形展開出力処理                             
004260     ELSE                                                         
004270        PERFORM  受取手形出力処理                                 
004280        PERFORM  受取手形展開出力処理                             
004290     END-IF.                                                      
004300*                                                                 
004310     MOVE Ｗ－契約ＮＯ１              TO  Ｏ－契約ＮＯ１.         
004320     MOVE Ｎ－束数                    TO  Ｏ－束数.               
004330*                                                                 
004340 編集出力処理－ＥＸＩＴ.                                          
004350     EXIT.                                                        
004360*                                                                 
004370******************************************************************
004380*    受取手形編集処理                                            *
004390******************************************************************
004400 受取手形編集処理                     SECTION.                    
004410 受取手形編集処理－ＳＴＡＲＴ.                                    
004420*--< 初期化処理 >                                                 
004430*                                                                 
004440     MOVE  SPACE                      TO  受取手形.               
004450     INITIALIZE                           受取手形.               
004460*----------------------------------------------------------------*
004470*       項目編集処理                                             *
004480*----------------------------------------------------------------*
004490*                                                                 
004500*--< No.01 >                                                      
004510     MOVE  入力１－契約ＮＯ           TO  Ｄ６４２－代表契約番号. 
004520*--< No.02 >                                                      
004530     MOVE  入力２－束数               TO  Ｄ６４２－束数.         
004540*--< No.03 >                                                      
004550     PERFORM  新取引先コード抽出.                                 
004560     MOVE  ＩＫＯ００１－新取引先コード                           
004570                                      TO  Ｄ６４２－取引先コード. 
004580*--< No.04 >                                                      
004590     MOVE  ＩＫＯ００１－枝番         TO  Ｄ６４２－契約先コード. 
004600*--< No.05 >                                                      
004610     MOVE  入力１－名称漢字           TO  Ｄ６４２－契約先名称.   
004620*--< No.06 >                                                      
004630     MOVE  入力１－名称カナ          TO  Ｄ６４２－契約先名称カナ.
004640*--< No.07 >                                                      
004650     MOVE  入力１－事業所コード       TO  Ｄ６４２－部店コード.   
004660*--< No.08 >                                                      
004670     PERFORM  主契約区分抽出.                                     
004680     MOVE  ＩＫＯ００２－主契約区分   TO  Ｄ６４２－主契約区分.   
004690*--< No.09 >                                                      
004700     MOVE  ZERO                       TO  Ｄ６４２－手形状態.     
004710*--< No.10 >                                                      
004720     MOVE  入力２－取引日             TO  Ｄ６４２－取引日.       
004730*--< No.11>                                                       
004740     MOVE  入力２－伝票発行日         TO  Ｄ６４２－伝票発行日.   
004750*--< No.12 >                                                      
004760     MOVE  入力２－手形種類           TO  Ｄ６４２－手形種類.     
004770*--< No.13 >                                                      
004780     MOVE  入力２－期日基準日         TO  Ｄ６４２－期日基準日.   
004790*--< No.14 >                                                      
004800     MOVE  入力２－期日サイクル       TO  Ｄ６４２－期日サイクル. 
004810*--< No.15 >                                                      
004820     MOVE  入力２－束合計金額         TO  Ｄ６４２－束合計金額.   
004830*--< No.16 >                                                      
004840     MOVE  入力２－手形枚数           TO  Ｄ６４２－手形枚数.     
004850*--< No.17 >                                                      
004860     MOVE  入力２－取立依頼銀行コード                             
004870                                     TO  Ｄ６４２－取立銀行コード.
004880*--< No.18 >                                                      
004890     MOVE  入力２－支払人コード      TO  Ｄ６４２－支払銀行コード.
004900*--< No.19 >                                                      
004910     MOVE  入力１－契約ＮＯ１         TO  Ｄ６４２－契約番号１.   
004920*--< No.20 >                                                      
004930     MOVE  入力１－契約ＮＯ２         TO  Ｄ６４２－契約番号２.   
004940*--< No.21 >                                                      
004950     MOVE  入力１－契約ＮＯ３         TO  Ｄ６４２－契約番号３.   
004960*--< No.22 >                                                      
004970     MOVE  入力１－契約ＮＯ４         TO  Ｄ６４２－契約番号４.   
004980*--< No.23 >                                                      
004990     MOVE  入力１－契約ＮＯ５         TO  Ｄ６４２－契約番号５.   
005000*--< No.24 >                                                      
005010     MOVE  入力１－契約ＮＯ６         TO  Ｄ６４２－契約番号６.   
005020*--< No.25 >                                                      
005030     MOVE  入力１－契約ＮＯ７         TO  Ｄ６４２－契約番号７.   
005040*--< No.26 >                                                      
005050     MOVE  入力１－契約ＮＯ８         TO  Ｄ６４２－契約番号８.   
005060*--< No.27 >                                                      
005070     MOVE  入力１－契約ＮＯ９         TO  Ｄ６４２－契約番号９.   
005080*--< No.28 >                                                      
005090     MOVE  入力１－契約ＮＯ１０       TO  Ｄ６４２－契約番号１０. 
005100*--< No.29 >                                                      
005110     MOVE  入力２－備考欄             TO  Ｄ６４２－備考欄.       
005120*--< No.30 >                                                      
005130     MOVE  ZERO                       TO  Ｄ６４２－手形内容種別. 
005140*--< No.31 >                                                      
005150     MOVE  Ｗ－システム日付           TO  Ｄ６４２－登録年月日.   
005160*--< No.32 >                                                      
005170     MOVE  Ｗ－システム時刻           TO  Ｄ６４２－登録時間.     
005180*--< No.33 >                                                      
005190     MOVE  Ｗ－担当者                 TO  Ｄ６４２－登録担当者.   
005200*--< No.34 >                                                      
005210     MOVE  Ｗ－システム日付           TO  Ｄ６４２－更新年月日.   
005220*--< No.35 >                                                      
005230     MOVE  Ｗ－システム時刻           TO  Ｄ６４２－更新時間.     
005240*--< No.36 >                                                      
005250     MOVE  Ｗ－担当者                 TO  Ｄ６４２－更新者.       
005260*--< No.37 >                                                      
005270     MOVE  Ｗ－担当者              TO  Ｄ６４２－入力担当者コード.
005280*--< No.38 >                                                      
005290     MOVE  ZERO                       TO  Ｄ６４２－売却代金区分. 
005300*--< No.39 >                                                      
005310     PERFORM  枝番抽出.                                           
005320     MOVE  ＩＫＯ００１－新取引先コード                           
005330                                 TO  Ｄ６４２－振出人取引先コード.
005340*--< No.40 >                                                      
005350     MOVE  ＩＫＯ００１－枝番    TO  Ｄ６４２－振出人契約先コード.
005360*--< No.41 >                                                      
005370     MOVE  入力２－名称漢字           TO  Ｄ６４２－振出人名称.   
005380*--< No.42 >                                                      
005390     MOVE  入力２－名称カナ          TO  Ｄ６４２－振出人名称カナ.
005400 受取手形編集処理－ＥＸＩＴ.                                      
005410     EXIT.                                                        
005420******************************************************************
005430*    項目抽出                                                    *
005440******************************************************************
005450*----------------------------------------------------------------*
005460*    新取引先コード抽出                                          *
005470*----------------------------------------------------------------*
005480 新取引先コード抽出                   SECTION.                    
005490 新取引先コード抽出－ＳＴＡＲＴ.                                  
005500     EXEC  SQL                                                    
005510        SELECT  新取引先コード                                    
005520               ,枝番                                              
005530          INTO :ＩＫＯ００１－新取引先コード                      
005540              ,:ＩＫＯ００１－枝番                                
005550          FROM  IKOTBL001                                         
005560         WHERE  取引先コード  =  :ＷＳ－取引先コード              
005570           AND  目的ＣＤ      =  :ＷＳ－目的ＣＤ                  
005580     END-EXEC.                                                    
005590*--< 項目抽出状態判定 >                                           
005600     EVALUATE  SQLCODE                                            
005610        WHEN   定数－ＳＱＬＯＫ                                   
005620*--<       正常 >                                                 
005630           CONTINUE                                               
005640        WHEN   OTHER                                              
005650*--<       項目抽出失敗 >                                         
005660           MOVE      -7               TO  Ｗ－エラーコード        
005670           PERFORM   エラー判定処理                               
005680     END-EVALUATE.                                                
005690 新取引先コード抽出－ＥＸＩＴ.                                    
005700     EXIT.                                                        
005710*----------------------------------------------------------------*
005720*    主契約区分抽出                                              *
005730*----------------------------------------------------------------*
005740 主契約区分抽出                       SECTION.                    
005750 主契約区分抽出－ＳＴＡＲＴ.                                      
005760     EXEC  SQL                                                    
005770        SELECT  主契約区分                                        
005780          INTO :ＩＫＯ００２－主契約区分                          
005790          FROM  IKOTBL002                                         
005800         WHERE  契約ＮＯ  =  :ＷＳ－契約ＮＯ                      
005810     END-EXEC.                                                    
005820*--< 項目抽出状態判定 >                                           
005830     EVALUATE  SQLCODE                                            
005840        WHEN   定数－ＳＱＬＯＫ                                   
005850*--<       正常 >                                                 
005860           CONTINUE                                               
005870        WHEN   定数－ＳＱＬＣＤＤＥＯＫ                           
005880*--<       正常 >                                                 
005890           CONTINUE                                               
005900        WHEN   OTHER                                              
005910*--<       項目抽出失敗 >                                         
005920           MOVE      -8               TO  Ｗ－エラーコード        
005930           PERFORM   エラー判定処理                               
005940     END-EVALUATE.                                                
005950 新取引先コード抽出－ＥＸＩＴ.                                    
005960     EXIT.                                                        
005970*----------------------------------------------------------------*
005980*    枝番抽出                                                    *
005990*----------------------------------------------------------------*
006000 枝番抽出                             SECTION.                    
006010 枝番抽出－ＳＴＡＲＴ.                                            
006020     EXEC  SQL                                                    
006030        SELECT  新取引先コード                                    
006040               ,枝番                                              
006050          INTO :ＩＫＯ００１－新取引先コード                      
006060              ,:ＩＫＯ００１－枝番                                
006070          FROM  IKOTBL001                                         
006080         WHERE  取引先コード  =  :ＷＳ－支払人コード              
006090           AND  目的ＣＤ      =  :ＷＳ－目的ＣＤ                  
006100     END-EXEC.                                                    
006110*--< 項目抽出状態判定 >                                           
006120     EVALUATE  SQLCODE                                            
006130        WHEN   定数－ＳＱＬＯＫ                                   
006140*--<       正常 >                                                 
006150           CONTINUE                                               
006160        WHEN   OTHER                                              
006170*--<       項目抽出失敗 >                                         
006180           MOVE      -9               TO  Ｗ－エラーコード        
006190           PERFORM   エラー判定処理                               
006200     END-EVALUATE.                                                
006210 枝番抽出－ＥＸＩＴ.                                              
006220     EXIT.                                                        
006230******************************************************************
006240*    受取手形展開編集処理                                        *
006250******************************************************************
006260 受取手形展開編集処理                 SECTION.                    
006270 受取手形展開編集処理－ＳＴＡＲＴ.                                
006280*--< 初期化処理 >                                                 
006290*                                                                 
006300     MOVE  SPACE                      TO  受取手形展開.           
006310     INITIALIZE                           受取手形展開.           
006320*----------------------------------------------------------------*
006330*       項目編集処理                                             *
006340*----------------------------------------------------------------*
006350*                                                                 
006360*--< No.01 >                                                      
006370     MOVE  入力１－契約ＮＯ           TO  Ｄ６４５－代表契約番号. 
006380*--< No.02 >                                                      
006390     MOVE  入力２－束数               TO  Ｄ６４５－束数.         
006400*--< No.03 >                                                      
006410     IF    ( Ｗ－契約ＮＯ１ = Ｏ－契約ＮＯ１                      
006420        AND  Ｎ－束数       = Ｏ－束数 )                          
006430        COMPUTE      Ｗ－連番  =  Ｗ－連番 + 1                    
006440     ELSE                                                         
006450        MOVE    1                     TO  Ｗ－連番                
006460     END-IF.                                                      
006470     MOVE  Ｗ－連番                   TO  Ｄ６４５－連番.         
006480*--< No.04 >                                                      
006490     MOVE  入力２－手形ＮＯ           TO  Ｄ６４５－手形番号.     
006500*--< No.05 >                                                      
006510     MOVE  入力２－期日               TO  Ｄ６４５－期日.         
006520*--< No.06 >                                                      
006530     MOVE  入力２－金額               TO  Ｄ６４５－金額.         
006540*--< No.07 >                                                      
006550     MOVE  ＩＫＯ００１－新取引先コード                           
006560                                 TO  Ｄ６４５－振出人取引先コード.
006570*--< No.08 >                                                      
006580     MOVE  ＩＫＯ００１－枝番    TO  Ｄ６４５－振出人契約先コード.
006590*--< No.09 >                                                      
006600     MOVE  入力２－名称漢字           TO  Ｄ６４５－振出人名称.   
006610*--< No.10 >                                                      
006620     MOVE  入力２－名称カナ          TO  Ｄ６４５－振出人名称カナ.
006630*--< No.11 >                                                      
006640     MOVE  Ｗ－システム日付           TO  Ｄ６４５－登録年月日.   
006650*--< No.12 >                                                      
006660     MOVE  Ｗ－システム時刻           TO  Ｄ６４５－登録時間.     
006670*--< No.13 >                                                      
006680     MOVE  Ｗ－担当者                 TO  Ｄ６４５－登録担当者.   
006690*--< No.14 >                                                      
006700     MOVE  Ｗ－システム日付           TO  Ｄ６４５－更新年月日.   
006710*--< No.15 >                                                      
006720     MOVE  Ｗ－システム時刻           TO  Ｄ６４５－更新時間.     
006730*--< No.16 >                                                      
006740     MOVE  Ｗ－担当者                 TO  Ｄ６４５－更新者.       
006750*--< No.17 >                                                      
006760     MOVE  Ｗ－担当者              TO  Ｄ６４５－入力担当者コード.
006770*--< No.18 >                                                      
006780     MOVE  入力２－手形区分           TO  Ｄ６４５－手形状態.     
006790 受取手形編集処理－ＥＸＩＴ.                                      
006800     EXIT.                                                        
006810******************************************************************
006820*    出力処理                                                    *
006830******************************************************************
006840 受取手形出力処理                     SECTION.                    
006850 受取手形出力処理－ＳＴＡＲＴ.                                    
006860*                                                                 
006870     EXEC  SQL                                                    
006880        INSERT  INTO  D642UTG_TBL                                 
006890           ( 代表契約番号                                         
006900            ,束数                                                 
006910            ,取引先コード                                         
006920            ,契約先コード                                         
006930            ,契約先名称                                           
006940            ,契約先名称カナ                                       
006950            ,部店コード                                           
006960            ,主契約区分                                           
006970            ,手形状態                                             
006980            ,取引日                                               
006990            ,伝票発行日                                           
007000            ,手形種類                                             
007010            ,期日基準日                                           
007020            ,期日サイクル                                         
007030            ,束合計金額                                           
007040            ,手形枚数                                             
007050            ,取立銀行コード                                       
007060            ,支払銀行コード                                       
007070            ,契約番号１                                           
007080            ,契約番号２                                           
007090            ,契約番号３                                           
007100            ,契約番号４                                           
007110            ,契約番号５                                           
007120            ,契約番号６                                           
007130            ,契約番号７                                           
007140            ,契約番号８                                           
007150            ,契約番号９                                           
007160            ,契約番号１０                                         
007170            ,備考欄                                               
007180            ,手形内容種別                                         
007190            ,登録年月日                                           
007200            ,登録時間                                             
007210            ,登録担当者                                           
007220            ,更新年月日                                           
007230            ,更新時間                                             
007240            ,更新者                                               
007250            ,入力担当者コード                                     
007260            ,売却代金区分                                         
007270            ,振出人取引先コード                                   
007280            ,振出人契約先コード                                   
007290            ,振出人名称                                           
007300            ,振出人名称カナ)                                      
007310        VALUES                                                    
007320           ( :Ｄ６４２－代表契約番号                              
007330            ,:Ｄ６４２－束数                                      
007340            ,:Ｄ６４２－取引先コード                              
007350            ,:Ｄ６４２－契約先コード                              
007360            ,:Ｄ６４２－契約先名称                                
007370            ,:Ｄ６４２－契約先名称カナ                            
007380            ,:Ｄ６４２－部店コード                                
007390            ,:Ｄ６４２－主契約区分                                
007400            ,:Ｄ６４２－手形状態                                  
007410            ,:Ｄ６４２－取引日                                    
007420            ,:Ｄ６４２－伝票発行日                                
007430            ,:Ｄ６４２－手形種類                                  
007440            ,:Ｄ６４２－期日基準日                                
007450            ,:Ｄ６４２－期日サイクル                              
007460            ,:Ｄ６４２－束合計金額                                
007470            ,:Ｄ６４２－手形枚数                                  
007480            ,:Ｄ６４２－取立銀行コード                            
007490            ,:Ｄ６４２－支払銀行コード                            
007500            ,:Ｄ６４２－契約番号１                                
007510            ,:Ｄ６４２－契約番号２                                
007520            ,:Ｄ６４２－契約番号３                                
007530            ,:Ｄ６４２－契約番号４                                
007540            ,:Ｄ６４２－契約番号５                                
007550            ,:Ｄ６４２－契約番号６                                
007560            ,:Ｄ６４２－契約番号７                                
007570            ,:Ｄ６４２－契約番号８                                
007580            ,:Ｄ６４２－契約番号９                                
007590            ,:Ｄ６４２－契約番号１０                              
007600            ,:Ｄ６４２－備考欄                                    
007610            ,:Ｄ６４２－手形内容種別                              
007620            ,:Ｄ６４２－登録年月日                                
007630            ,:Ｄ６４２－登録時間                                  
007640            ,:Ｄ６４２－登録担当者                                
007650            ,:Ｄ６４２－更新年月日                                
007660            ,:Ｄ６４２－更新時間                                  
007670            ,:Ｄ６４２－更新者                                    
007680            ,:Ｄ６４２－入力担当者コード                          
007690            ,:Ｄ６４２－売却代金区分                              
007700            ,:Ｄ６４２－振出人取引先コード                        
007710            ,:Ｄ６４２－振出人契約先コード                        
007720            ,:Ｄ６４２－振出人名称                                
007730            ,:Ｄ６４２－振出人名称カナ)                           
007740     END-EXEC.                                                    
007750*--< 受取手形出力状態判定 >                                       
007760     EVALUATE  SQLCODE                                            
007770        WHEN   定数－ＳＱＬＯＫ                                   
007780*--<       追加成功 >                                             
007790           COMPUTE  Ｗ－出力－件数１  =  Ｗ－出力－件数１  +  1   
007800        WHEN   OTHER                                              
007810*--<       追加処理エラー >                                       
007820           MOVE     -5                TO  Ｗ－エラーコード        
007830           PERFORM  エラー判定処理                                
007840     END-EVALUATE.                                                
007850*                                                                 
007860 受取手形出力処理－ＥＸＩＴ.                                      
007870     EXIT.                                                        
007880*----------------------------------------------------------------*
007890 受取手形展開出力処理                 SECTION.                    
007900 受取手形展開出力処理－ＳＴＡＲＴ.                                
007910*                                                                 
007920     EXEC  SQL                                                    
007930        INSERT  INTO  D645UTT_TBL                                 
007940           ( 代表契約番号                                         
007950            ,束数                                                 
007960            ,連番                                                 
007970            ,手形番号                                             
007980            ,期日                                                 
007990            ,金額                                                 
008000            ,振出人取引先コード                                   
008010            ,振出人契約先コード                                   
008020            ,振出人名称                                           
008030            ,振出人名称カナ                                       
008040            ,登録年月日                                           
008050            ,登録時間                                             
008060            ,登録担当者                                           
008070            ,更新年月日                                           
008080            ,更新時間                                             
008090            ,更新者                                               
008100            ,入力担当者コード                                     
008110            ,手形状態)                                            
008120        VALUES                                                    
008130           ( :Ｄ６４５－代表契約番号                              
008140            ,:Ｄ６４５－束数                                      
008150            ,:Ｄ６４５－連番                                      
008160            ,:Ｄ６４５－手形番号                                  
008170            ,:Ｄ６４５－期日                                      
008180            ,:Ｄ６４５－金額                                      
008190            ,:Ｄ６４５－振出人取引先コード                        
008200            ,:Ｄ６４５－振出人契約先コード                        
008210            ,:Ｄ６４５－振出人名称                                
008220            ,:Ｄ６４５－振出人名称カナ                            
008230            ,:Ｄ６４５－登録年月日                                
008240            ,:Ｄ６４５－登録時間                                  
008250            ,:Ｄ６４５－登録担当者                                
008260            ,:Ｄ６４５－更新年月日                                
008270            ,:Ｄ６４５－更新時間                                  
008280            ,:Ｄ６４５－更新者                                    
008290            ,:Ｄ６４５－入力担当者コード                          
008300            ,:Ｄ６４５－手形状態)                                 
008310     END-EXEC.                                                    
008320*--< 受取手形展開出力状態判定 >                                   
008330     EVALUATE  SQLCODE                                            
008340        WHEN   定数－ＳＱＬＯＫ                                   
008350*--<       追加成功 >                                             
008360           COMPUTE  Ｗ－出力－件数２  =  Ｗ－出力－件数２  +  1   
008370        WHEN   OTHER                                              
008380*--<       追加処理エラー >                                       
008390           MOVE     -6                TO  Ｗ－エラーコード        
008400           PERFORM  エラー判定処理                                
008410     END-EVALUATE.                                                
008420 受取手形展開出力処理－ＥＸＩＴ.                                  
008430     EXIT.                                                        
008440******************************************************************
008450*    終了処理                                                    *
008460******************************************************************
008470 終了処理                             SECTION.                    
008480 終了処理－ＳＴＡＲＴ.                                            
008490*                                                                 
008500     PERFORM  ファイルクローズ処理.                               
008510*                                                                 
008520     PERFORM  ＤＢコミット処理.                                   
008530*                                                                 
008540     PERFORM  終了メッセージ出力.                                 
008550*                                                                 
008560*--< プログラム正常終了 >                                         
008570     MOVE  定数－正常状態             TO  PROGRAM-STATUS.         
008580*                                                                 
008590 終了処理－ＥＸＩＴ.                                              
008600     EXIT.                                                        
008610******************************************************************
008620*    ファイルクローズ処理                                        *
008630******************************************************************
008640 ファイルクローズ処理                 SECTION.                    
008650 ファイルクローズ処理－ＳＴＡＲＴ.                                
008660*                                                                 
008670     CLOSE  入力ファイル１.                                       
008680     CLOSE  入力ファイル２.                                       
008690*                                                                 
008700 ファイルクローズ処理－ＥＸＩＴ.                                  
008710     EXIT.                                                        
008720******************************************************************
008730*    終了メッセージ出力                                          *
008740******************************************************************
008750 終了メッセージ出力                   SECTION.                    
008760 終了メッセージ出力－ＳＴＡＲＴ.                                  
008770*                                                                 
008780*----------------------------------------------------------------*
008790*    件数メッセージ出力処理                                      *
008800*----------------------------------------------------------------*
008810     INITIALIZE                       IF-CHOCO001.                
008820     MOVE  "3"                        TO  共通－イベント種別.     
008830     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
008840     MOVE  "0"                        TO  共通－復帰コード.       
008850     MOVE  "D411STK"                  TO  共通－処理テーブルＩＤ. 
008860     MOVE  "COUNT"                    TO  共通－処理識別.         
008870     MOVE  Ｗ－入力－件数１           TO  共通－データ内容.       
008880     MOVE  "手形基本読込件数"         TO  共通－その他メッセージ. 
008890     CALL  CLOCO001                USING  IF-CHOCO001.            
008900*                                                                 
008910     INITIALIZE                       IF-CHOCO001.                
008920     MOVE  "3"                        TO  共通－イベント種別.     
008930     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
008940     MOVE  "0"                        TO  共通－復帰コード.       
008950     MOVE  "D411STK"                  TO  共通－処理テーブルＩＤ. 
008960     MOVE  "COUNT"                    TO  共通－処理識別.         
008970     MOVE  Ｗ－入力－件数２           TO  共通－データ内容.       
008980     MOVE  "受取手形読込件数"         TO  共通－その他メッセージ. 
008990     CALL  CLOCO001                USING  IF-CHOCO001.            
009000*                                                                 
009010     INITIALIZE                       IF-CHOCO001.                
009020     MOVE  "3"                        TO  共通－イベント種別.     
009030     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
009040     MOVE  "0"                        TO  共通－復帰コード.       
009050     MOVE  "D34HNS"                   TO  共通－処理テーブルＩＤ. 
009060     MOVE  "COUNT"                    TO  共通－処理識別.         
009070     MOVE  Ｗ－出力－件数１           TO  共通－データ内容.       
009080     MOVE  "受取手形出力件数"         TO  共通－その他メッセージ. 
009090     CALL  CLOCO001                USING  IF-CHOCO001.            
009100*                                                                 
009110     INITIALIZE                       IF-CHOCO001.                
009120     MOVE  "3"                        TO  共通－イベント種別.     
009130     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
009140     MOVE  "0"                        TO  共通－復帰コード.       
009150     MOVE  "D34HNS"                   TO  共通－処理テーブルＩＤ. 
009160     MOVE  "COUNT"                    TO  共通－処理識別.         
009170     MOVE  Ｗ－出力－件数２           TO  共通－データ内容.       
009180     MOVE  "受取手形展開出力件数"     TO  共通－その他メッセージ. 
009190     CALL  CLOCO001                USING  IF-CHOCO001.            
009200*                                                                 
009210*----------------------------------------------------------------*
009220*    終了メッセージ出力                                          *
009230*----------------------------------------------------------------*
009240     INITIALIZE                       IF-CHOCO001.                
009250     MOVE  "3"                        TO  共通－イベント種別.     
009260     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
009270     MOVE  "0"                        TO  共通－復帰コード.       
009280     MOVE  "END"                      TO  共通－処理識別.         
009290     MOVE  定数－プログラム名         TO  共通－その他メッセージ. 
009300     CALL  CLOCO001                USING  IF-CHOCO001.            
009310*                                                                 
009320 終了メッセージ出力－ＥＸＩＴ.                                    
009330     EXIT.                                                        
009340******************************************************************
009350*    ＤＢコミット処理                                            *
009360******************************************************************
009370 ＤＢコミット処理                     SECTION.                    
009380 ＤＢコミット処理－ＳＴＡＲＴ.                                    
009390*                                                                 
009400     EXEC  SQL                                                    
009410        COMMIT  WORK  RELEASE                                     
009420     END-EXEC.                                                    
009430*                                                                 
009440     INITIALIZE                       IF-CHOCO001.                
009450     MOVE  "3"                        TO  共通－イベント種別.     
009460     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
009470     MOVE  "0"                        TO  共通－復帰コード.       
009480     MOVE  "COMMIT"                   TO  共通－処理識別.         
009490     MOVE  "コミット実施"             TO  共通－その他メッセージ. 
009500     CALL  CLOCO001                USING  IF-CHOCO001.            
009510*                                                                 
009520 ＤＢコミット処理－ＥＸＩＴ.                                      
009530     EXIT.                                                        
009540******************************************************************
009550*    ＤＢロールバック処理                                        *
009560******************************************************************
009570 ＤＢロールバック処理                 SECTION.                    
009580 ＤＢロールバック処理－ＳＴＡＲＴ.                                
009590*                                                                 
009600     EXEC  SQL                                                    
009610        ROLLBACK WORK  RELEASE                                    
009620     END-EXEC.                                                    
009630*                                                                 
009640     INITIALIZE                       IF-CHOCO001.                
009650     MOVE  "1"                        TO  共通－イベント種別.     
009660     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
009670     MOVE  "9"                        TO  共通－復帰コード.       
009680     MOVE  "ROLLBACK"                 TO  共通－処理識別.         
009690     MOVE  "ロールバック実施"         TO  共通－その他メッセージ. 
009700     CALL  CLOCO001                USING  IF-CHOCO001.            
009710*                                                                 
009720 ＤＢロールバック処理－ＥＸＩＴ.                                  
009730     EXIT.                                                        
009740******************************************************************
009750*    エラー処理                                                  *
009760******************************************************************
009770 エラー判定処理                       SECTION.                    
009780 エラー判定処理－ＳＴＡＲＴ.                                      
009790*                                                                 
009800     MOVE  "Y"                        TO Ｗ－異常終了－フラグ.    
009810     INITIALIZE                           IF-CHOCO001.            
009820*                                                                 
009830     EVALUATE  Ｗ－エラーコード                                   
009840        WHEN  -1                                                  
009850*--<       手形基本ファイルオープンエラー >                       
009860           MOVE  "1"                  TO  共通－イベント種別      
009870           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
009880           MOVE  "9"                  TO  共通－復帰コード        
009890           MOVE  "FFUIS630"           TO  共通－処理テーブルＩＤ  
009900           MOVE  "OPEN"               TO  共通－処理識別          
009910           MOVE  Ｗ－状態             TO  共通－データ内容        
009920           MOVE  "手形基本ファイルオープンエラー "                
009930                                      TO  共通－その他メッセージ  
009940           CALL  CLOCO001          USING  IF-CHOCO001             
009950*                                                                 
009960        WHEN  -2                                                  
009970*--<       受取手形ファイルオープンエラー >                       
009980           MOVE  "1"                  TO  共通－イベント種別      
009990           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010000           MOVE  "9"                  TO  共通－復帰コード        
010010           MOVE  "FFUIS631"           TO  共通－処理テーブルＩＤ  
010020           MOVE  "OPEN"               TO  共通－処理識別          
010030           MOVE  Ｗ－状態             TO  共通－データ内容        
010040           MOVE  "受取手形ファイルオープンエラー "                
010050                                      TO  共通－その他メッセージ  
010060           CALL  CLOCO001          USING  IF-CHOCO001             
010070*                                                                 
010080        WHEN  -3                                                  
010090*--<       手形基本ファイル読込エラー >                           
010100           MOVE  "1"                  TO  共通－イベント種別      
010110           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010120           MOVE  "9"                  TO  共通－復帰コード        
010130           MOVE  "FFUIS630"           TO  共通－処理テーブルＩＤ  
010140           MOVE  "READ"               TO  共通－処理識別          
010150           MOVE  Ｗ－状態             TO  共通－データ内容        
010160           MOVE  "手形基本ファイル読込エラー "                    
010170                                      TO  共通－その他メッセージ  
010180           CALL  CLOCO001          USING  IF-CHOCO001             
010190*                                                                 
010200        WHEN  -4                                                  
010210*--<       受取手形ファイル読込エラー >                           
010220           MOVE  "1"                  TO  共通－イベント種別      
010230           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010240           MOVE  "9"                  TO  共通－復帰コード        
010250           MOVE  "FFUIS631"           TO  共通－処理テーブルＩＤ  
010260           MOVE  "READ"               TO  共通－処理識別          
010270           MOVE  Ｗ－状態             TO  共通－データ内容        
010280           MOVE  "受取手形ファイル読込エラー "                    
010290                                      TO  共通－その他メッセージ  
010300           CALL  CLOCO001          USING  IF-CHOCO001             
010310*                                                                 
010320        WHEN  -5                                                  
010330*--<       受取手形テーブル追加失敗 >                             
010340           MOVE  "1"                  TO  共通－イベント種別      
010350           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010360           MOVE  "9"                  TO  共通－復帰コード        
010370           MOVE  "D642UTG"            TO  共通－処理テーブルＩＤ  
010380           MOVE  "SELECT"             TO  共通－処理識別          
010390           MOVE  SQLCODE              TO  共通－データ内容        
010400           MOVE  SQLERRMC             TO  共通－その他メッセージ  
010410           CALL  CLOCO001          USING  IF-CHOCO001             
010420*                                                                 
010430        WHEN  -6                                                  
010440*--<       受取手形展開テーブル追加失敗 >                         
010450           MOVE  "1"                  TO  共通－イベント種別      
010460           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010470           MOVE  "9"                  TO  共通－復帰コード        
010480           MOVE  "D645UTT"            TO  共通－処理テーブルＩＤ  
010490           MOVE  "SELECT"             TO  共通－処理識別          
010500           MOVE  SQLCODE              TO  共通－データ内容        
010510           MOVE  SQLERRMC             TO  共通－その他メッセージ  
010520           CALL  CLOCO001          USING  IF-CHOCO001             
010530*                                                                 
010540        WHEN  -7                                                  
010550*--<       項目抽出失敗 >                                         
010560           MOVE  "2"                  TO  共通－イベント種別      
010570           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010580           MOVE  "9"                  TO  共通－復帰コード        
010590           MOVE  "IKOTL001"           TO  共通－処理テーブルＩＤ  
010600           MOVE  "SELECT"             TO  共通－処理識別          
010610           MOVE  SQLCODE              TO  共通－データ内容        
010620           MOVE  SQLERRMC             TO  共通－その他メッセージ  
010630           CALL  CLOCO001          USING  IF-CHOCO001             
010640           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
010650*                                                                 
010660        WHEN  -8                                                  
010670*--<       項目抽出失敗 >                                         
010680           MOVE  "2"                  TO  共通－イベント種別      
010690           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010700           MOVE  "9"                  TO  共通－復帰コード        
010710           MOVE  "IKOTL002"           TO  共通－処理テーブルＩＤ  
010720           MOVE  "SELECT"             TO  共通－処理識別          
010730           MOVE  SQLCODE              TO  共通－データ内容        
010740           MOVE  SQLERRMC             TO  共通－その他メッセージ  
010750           CALL  CLOCO001          USING  IF-CHOCO001             
010760           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
010770*                                                                 
010780        WHEN  -9                                                  
010790*--<       項目抽出失敗 >                                         
010800           MOVE  "2"                  TO  共通－イベント種別      
010810           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010820           MOVE  "9"                  TO  共通－復帰コード        
010830           MOVE  "IKOTL001"           TO  共通－処理テーブルＩＤ  
010840           MOVE  "SELECT"             TO  共通－処理識別          
010850           MOVE  SQLCODE              TO  共通－データ内容        
010860           MOVE  SQLERRMC             TO  共通－その他メッセージ  
010870           CALL  CLOCO001          USING  IF-CHOCO001             
010880           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
010890*                                                                 
010900        WHEN  -10                                                 
010910*--<       ＯＲＡＣＬＥ接続失敗 >                                 
010920           MOVE  "1"                  TO  共通－イベント種別      
010930           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
010940           MOVE  "9"                  TO  共通－復帰コード        
010950           MOVE  "CONNECT"            TO  共通－処理識別          
010960           MOVE  SQLCODE              TO  共通－データ内容        
010970           MOVE  SQLERRMC             TO  共通－その他メッセージ  
010980           CALL  CLOCO001          USING  IF-CHOCO001             
010990*                                                                 
011000        WHEN  OTHER                                               
011010           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
011020     END-EVALUATE.                                                
011030*                                                                 
011040*                                                                 
011050     IF  Ｗ－異常終了－フラグ  =  "Y"                             
011060        PERFORM  ＤＢロールバック処理                             
011070*                                                                 
011080        PERFORM  終了メッセージ出力                               
011090*                                                                 
011100*--<    プログラム異常終了のリターンコード >                      
011110        MOVE  定数－異常状態          TO  PROGRAM-STATUS          
011120*                                                                 
011130        EXIT  PROGRAM                                             
011140     END-IF.                                                      
011150*                                                                 
011160 エラー判定処理－ＥＸＩＴ.                                        
011170     EXIT.                                                        
011180******************************************************************
011190*                  END OF PROGRAM                                *
011200******************************************************************
011210
