000010************************************************
000020* 基準適用日ファイル(CISPF001)
000030************************************************
000040    03   ()基準日                 PIC  X(0008).
000050    03   ()適用日                 PIC  X(0008).

