       IDENTIFICATION DIVISION.
       PROGRAM-ID. CH111.
       ENVIRONMENT. DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 PROD-COST  PIC 9(3)V99.
       77 QTY-SOLD   PIC 8(4).
       77 VALUE-SOLD PIC Z(7).99.
       PROCEDURE DIVISION.
       BEGIN.
           PERFORM AA 10 TIMES.
           DISPLAY "END".
           STOP RUN.
       AA.
           DISPLAY "FROO@ COST".
           ACCEPT PROD-COST.
           DISPLAY "QTY-SOLD".
           ACCEPT QTY-SOLD.
           CALL "CALPRO" USING PROD COST QTY-SOLD
                        VALUE-SOLD.
           DISPLAY "VALUE-SOLD= "VALUE-SOLD
           
           
           IDENTIFICATION DIVISION.
PROGRAM-ID. CAIJRO.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
LINKAGE SECTION.
77 PROD-SOLD PIC 9(3)V99.
77 QTY-SOLD   PIC 9(4).
77 VALUE-CALC PIC Z(7).99.
PROCEDURE DIVISION USING PROD-COST QTY-SOLD
                  VALUE-CALC.
BEGIN.
         COMPUTE VALUE-CALC=PROD-OOST * QTY -SOLD.
BB.  EXIT PROGRAM.

       


