//COP01    JOB (080912DL510),'SID0878',                          
//             MSGCLASS=O,MSGLEVEL=(1,1),                        
//             NOTIFY=&SYSUID                                    
//MYLIB JCLLIB ORDER=(COBOL.V3R4.SIGYPROC)                       
//BATCOB  EXEC IGYWCL,                                           
//             PGMLIB=SID0878.COB.LOAD,        ;LOAD MODULE      
//             GOPGM=PGM001                    ;MODULE NAME      
//COBOL.SYSIN  DD DISP=SHR,DSN=SID0878.TEST.COB(PGM001)          