000010*****************************************************************
000020*   Žæˆøæƒ}ƒXƒ^(D01TRS_TBL)
000030*****************************************************************
000040 01  Žæˆøæƒ}ƒXƒ^.
000050     03  ‚c‚O‚P|ŽæˆøæƒR[ƒh  PIC  X(009).
000060     03  ‚c‚O‚P|–¼Šñ‚¹ƒR[ƒh  PIC  X(040).
000070     03  ‚c‚O‚P|Žæˆøæ–¼Ì    PIC  X(080).
000080     03  ‚c‚O‚P|Žæˆøæ’Z–¼Ì  PIC  X(016).
000090     03  ‚c‚O‚P|ŽæˆøæƒJƒi–¼Ì
000100                               PIC  X(040).
000110     03  ‚c‚O‚P|—X•Ö”Ô†      PIC  X(007).
000120     03  ‚c‚O‚P|”[•tæƒR[ƒh  PIC  X(011).
000130     03  ‚c‚O‚P|ZŠ‚P        PIC  X(060).
000140     03  ‚c‚O‚P|ZŠ‚Q        PIC  X(060).
000150     03  ‚c‚O‚P|ZŠ‚R        PIC  X(060).
000160     03  ‚c‚O‚P|“d˜b”Ô†      PIC  X(015).
000170     03  ‚c‚O‚P|‹ŒŽÐ–¼        PIC  X(080).
000180     03  ‚c‚O‚P|Ž‘–{‹à        PIC S9(013) PACKED-DECIMAL.
000190     03  ‚c‚O‚P|Ý—§”N        PIC S9(004) PACKED-DECIMAL.
000200     03  ‚c‚O‚P|Ý—§ŒŽ        PIC S9(002) PACKED-DECIMAL.
000210     03  ‚c‚O‚P|ŒÚ‹q‹æ•ª      PIC  X(002).
000220     03  ‚c‚O‚P|Šé‹Æ‹æ•ª      PIC  X(001).
000230     03  ‚c‚O‚P|]‹Æˆõ”      PIC S9(006) PACKED-DECIMAL.
000240     03  ‚c‚O‚P|‹ÆŽíƒR[ƒh    PIC  X(005).
000250     03  ‚c‚O‚P|Ši•tƒ‰ƒ“ƒN    PIC  X(003).
000260     03  ‚c‚O‚P|Œ»’S“–ŽÒ      PIC  X(008).
000270     03  ‚c‚O‚P|¿‹æÅI”Ô†
000280                               PIC S9(005) PACKED-DECIMAL.
000290     03  ‚c‚O‚P|Žx•¥æÅI”Ô†
000300                               PIC S9(005) PACKED-DECIMAL.
000310     03  ‚c‚O‚P|Žå’S“–•”‰ÛƒR[ƒh
000320                               PIC  X(004).
000330     03  ‚c‚O‚P|Ši•tƒ‰ƒ“ƒN‚Q  PIC  X(003).
000340     03  ‚c‚O‚P|‘ã•\ŽÒ–¼Ì    PIC  X(020).
000350     03  ‚c‚O‚P|ƒAƒhƒŒƒX      PIC  X(040).
000360     03  ‚c‚O‚P|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
000370                               PIC  X(001).
000380     03  ‚c‚O‚P|—^MŠ‡‚èƒR[ƒh
000390                               PIC  X(007).
000400     03  ‚c‚O‚P|‰‰ñ¿‹˜’u‹æ•ª
000410                               PIC  X(001).
000420     03  ‚c‚O‚P|–ž—¹ˆÄ“à‘—•t‹æ•ª
000430                               PIC  X(001).
000440     03  ‚c‚O‚P|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
000450                               PIC  X(001).
000460     03  ‚c‚O‚P|“Á’èŽæˆøæ‹æ•ª
000470                               PIC  X(001).
000480     03  ‚c‚O‚P|Ž–‹ÆŠ–¼Ì    PIC  X(080).
000490     03  ‚c‚O‚P|Ž–‹ÆŠ—X•Ö”Ô†
000500                               PIC  X(007).
000510     03  ‚c‚O‚P|Ž–‹ÆŠZŠƒR[ƒh
000520                               PIC  X(011).
000530     03  ‚c‚O‚P|Ž–‹ÆŠZŠ‚Q  PIC  X(060).
000540     03  ‚c‚O‚P|Ž–‹ÆŠ“d˜b”Ô†
000550                               PIC  X(015).
000560     03  ‚c‚O‚P|¶”NŒŽ“ú      PIC  X(008).
000570     03  ‚c‚O‚P|ŠÇ—ÂŒ ƒŒƒxƒ‹
000580                               PIC  X(001).
000590     03  ‚c‚O‚P|‘Ý“|”NŒŽ“ú    PIC  X(008).
000600     03  ‚c‚O‚P|‘Ý“|‹àŠz      PIC S9(013) PACKED-DECIMAL.
000610     03  ‚c‚O‚P|‘Ý“|——RƒR[ƒh
000620                               PIC  X(002).
000630     03  ‚c‚O‚P|‘Ý“|ƒRƒƒ“ƒg  PIC  X(100).
000640     03  ‚c‚O‚P|‘Ý“|\¿”NŒŽ“ú
000650                               PIC  X(008).
000660     03  ‚c‚O‚P|Ž©“®¿‹ƒf[ƒ^ì¬—v”Û
000670                               PIC  X(001).
000680     03  ‚c‚O‚P|ŠJŽ¦’ •[Žæ“¾‰¿Ši‹æ•ª
000690                               PIC  X(001).
000700     03  ‚c‚O‚P|ŽæˆøŠJŽn”NŒŽ  PIC  X(006).
000710     03  ‚c‚O‚P|‘n‹Æ”NŒŽ      PIC  X(006).
000720     03  ‚c‚O‚P|Œn—ñ          PIC  X(030).
000730     03  ‚c‚O‚P|”Ì”„æ        PIC  X(030).
000740     03  ‚c‚O‚P|Žd“üæ        PIC  X(030).
000750     03  ‚c‚O‚P|Žå—vŠ”Žå      PIC  X(020).
000760     03  ‚c‚O‚P|Žå—vŠ”ŽåŽ—¦  PIC S9(003)V9(003) PACKED-DECIMAL.
000770     03  ‚c‚O‚P|•ÛØlŠÇ—ÂŒ ƒŒƒxƒ‹
000780                               PIC  X(001).
000790     03  ‚c‚O‚P|‰ß‹ŽÅ‚“Â‘£’iŠK
000800                               PIC  X(001).
000810     03  ‚c‚O‚P|‰ß‹ŽÅ‚“Â‘£’iŠKXV“ú
000820                               PIC  X(008).
000830     03  ‚c‚O‚P|Œ»ÝÅ‚“Â‘£’iŠK
000840                               PIC  X(001).
000850     03  ‚c‚O‚P|Œ»ÝÅ‚“Â‘£’iŠKXV“ú
000860                               PIC  X(008).
000870     03  ‚c‚O‚P|”„‹pŒ»ÝÅ‚“Â‘£’iŠK
000880                               PIC  X(001).
000890     03  ‚c‚O‚P|”„‹pŒ»ÝÅ‚“Â‘£’iŠKXV“ú
000900                               PIC  X(008).
000910     03  ‚c‚O‚P|ƒŠ[ƒX“Â‘£ŒðÂo—Íƒtƒ‰ƒO
000920                               PIC  X(001).
000930     03  ‚c‚O‚P|’†“r‰ð–ñ“Â‘£ŒðÂo—Íƒtƒ‰ƒO
000940                               PIC  X(001).
000950     03  ‚c‚O‚P|”„‹p“Â‘£ŒðÂo—Íƒtƒ‰ƒO
000960                               PIC  X(001).
000970     03  ‚c‚O‚P|‹âsƒR[ƒh    PIC  X(004).
000980     03  ‚c‚O‚P|Žx“XƒR[ƒh    PIC  X(003).
000990     03  ‚c‚O‚P|‘ã•\ŽÒ–ðE–¼  PIC  X(020).
001000     03  ‚c‚O‚P|]‹ÆŽí–¼      PIC  X(020).
001010     03  ‚c‚O‚P|ZŠ–¼ƒJƒi    PIC  X(040).
001020     03  ‚c‚O‚P|ƒRƒƒ“ƒg—“    PIC  X(120).
001030     03  ‚c‚O‚P|’é‘ƒR[ƒh    PIC  X(009).
001040     03  ‚c‚O‚P|Žå—vŠ”ŽåŽŠ””
001050                               PIC S9(010) PACKED-DECIMAL.
001060     03  ‚c‚O‚P|Š”Žå”        PIC S9(010) PACKED-DECIMAL.
001070     03  ‚c‚O‚P|‘S‘‹ÆŠE‡ˆÊ  PIC S9(007) PACKED-DECIMAL.
001080     03  ‚c‚O‚P|‘S‘‹ÆŠE‰ïŽÐ”
001090                               PIC S9(007) PACKED-DECIMAL.
001100     03  ‚c‚O‚P|Œ§“à‹ÆŠE‡ˆÊ  PIC S9(007) PACKED-DECIMAL.
001110     03  ‚c‚O‚P|Œ§“à‹ÆŠE‰ïŽÐ”
001120                               PIC S9(007) PACKED-DECIMAL.
001130     03  ‚c‚O‚P|Ž–‹ÆŠ”      PIC S9(005) PACKED-DECIMAL.
001140     03  ‚c‚O‚P|Žå—vŽ–‹ÆŠ–¼  PIC  X(120).
001150     03  ‚c‚O‚P|—˜—pƒŠ[ƒX‰ïŽÐ–¼
001160                               PIC  X(040).
001170     03  ‚c‚O‚P|ƒXƒRƒAƒŠƒ“ƒO•]“_
001180                               PIC S9(003) PACKED-DECIMAL.
001190     03  ‚c‚O‚P|’é‘•]“_      PIC S9(003) PACKED-DECIMAL.
001200     03  ‚c‚O‚P|Ši•t\¿’†ƒtƒ‰ƒO
001210                               PIC  X(001).
001220     03  ‚c‚O‚P|Ši•t’²®\¿——R
001230                               PIC  X(200).
001240     03  ‚c‚O‚P|Ši•t“ú        PIC  X(008).
001250     03  ‚c‚O‚P|—^MŒÀ“xŠz“K—p“ú
001260                               PIC  X(008).
001270     03  ‚c‚O‚P|“–ŽÐŽæˆøŠJŽnŒoˆÜ
001280                               PIC  X(160).
001290     03  ‚c‚O‚P|Šé‹Æ–Ú“I      PIC  X(100).
001300     03  ‚c‚O‚P|•\Ž¦’PˆÊ‹æ•ª  PIC  X(001).
001310     03  ‚c‚O‚P|‚a‚s‚lŽæˆø‹æ•ª
001320                               PIC  X(001).
001330     03  ‚c‚O‚P|‚a‚s‚l’S“–Žx“XƒR[ƒh
001340                               PIC  X(003).
001350     03  ‚c‚O‚P|î•ñŒðŠ·’Ê’m‹æ•ª
001360                               PIC  X(001).
001370     03  ‚c‚O‚P|î•ñŒðŠ·’Ê’mÝ’è“ú
001380                               PIC  X(008).
001390     03  ‚c‚O‚P|‚a‚s‚l˜AŒ‹‘ÎÛ‹æ•ª
001400                               PIC  X(001).
001410     03  ‚c‚O‚P|‚a‚n‚s‚k˜AŒ‹‘ÎÛ‹æ•ª
001420                               PIC  X(001).
001430     03  ‚c‚O‚P|e–§æ‹æ•ª    PIC  X(001).
001440     03  ‚c‚O‚P|‚m‚d‚s‚k‚d‚`‚r‚h‚m‚f—˜—p‘ÎÛ‹æ•ª
001450                               PIC  X(001).
001460     03  ‚c‚O‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
001470                               PIC  X(003).
001480     03  ‚c‚O‚P|Ž–‹ÆŠZŠ‚P  PIC  X(060).
001490     03  ‚c‚O‚P|Ž–‹ÆŠZŠ‚R  PIC  X(060).
001500     03  ‚c‚O‚P|Šé‹ÆŒˆŽZŒŽ    PIC  X(002).
001510     03  ‚c‚O‚P|ˆê”Ê‘åŒû‹æ•ª  PIC  X(001).
001520     03  ‚c‚O‚P|ŽØ“ü‹àŽ¯•Ê‹æ•ª
001530                               PIC  X(001).
001540     03  ‚c‚O‚P|ŽØ“üæŽí•Ê    PIC  X(002).
001550     03  ‚c‚O‚P|’S•Û·“ü—¦    PIC S9(003) PACKED-DECIMAL.
001560     03  ‚c‚O‚P|‹Œ–¼Šñ‚¹ƒR[ƒh
001570                               PIC  X(008).
001580     03  ‚c‚O‚P|XV”NŒŽ“ú    PIC  X(008).
001590     03  ‚c‚O‚P|XVŽžŠÔ      PIC  X(008).
001600     03  ‚c‚O‚P|XVŽÒ        PIC  X(008).
001610     03  ‚c‚O‚P|“o˜^”NŒŽ“ú    PIC  X(008).
001620     03  ‚c‚O‚P|“o˜^ŽžŠÔ      PIC  X(008).
001630     03  ‚c‚O‚P|“o˜^’S“–ŽÒ    PIC  X(008).
001640     03  ‚c‚O‚P|“ü—Í’S“–ŽÒƒR[ƒh
001650                               PIC  X(008).
