000010*****************************************************************
000020*   ¿‹æƒ}ƒXƒ^(D02SQS_TBL)
000030*****************************************************************
000040 01  ¿‹æƒ}ƒXƒ^.
000050     03  ‚c‚O‚Q|ŽæˆøæƒR[ƒh  PIC  X(009).
000060     03  ‚c‚O‚Q|¿‹æƒR[ƒh  PIC  X(005).
000070     03  ‚c‚O‚Q|¿‹æ–¼Ì    PIC  X(080).
000080     03  ‚c‚O‚Q|•”–å–¼Ì      PIC  X(060).
000090     03  ‚c‚O‚Q|’S“–ŽÒ–¼Ì    PIC  X(020).
000100     03  ‚c‚O‚Q|¿‹‘•\Ž¦    PIC  X(001).
000110     03  ‚c‚O‚Q|Užl–¼      PIC  X(040).
000120     03  ‚c‚O‚Q|—X•Ö”Ô†      PIC  X(007).
000130     03  ‚c‚O‚Q|”[•tæƒR[ƒh  PIC  X(011).
000140     03  ‚c‚O‚Q|ZŠ‚Q        PIC  X(060).
000150     03  ‚c‚O‚Q|ZŠ‚R        PIC  X(060).
000160     03  ‚c‚O‚Q|“d˜b”Ô†      PIC  X(015).
000170     03  ‚c‚O‚Q|ˆêŠ‡“ü‹àƒR[ƒh
000180                               PIC  X(005).
000190     03  ‚c‚O‚Q|‘—•tæ–¼Ì    PIC  X(060).
000200     03  ‚c‚O‚Q|‘—•tæ•”–å    PIC  X(060).
000210     03  ‚c‚O‚Q|‘—•tæ’S“–ŽÒ  PIC  X(020).
000220     03  ‚c‚O‚Q|‘—•tæƒJƒi–¼Ì
000230                               PIC  X(040).
000240     03  ‚c‚O‚Q|‘—•tæ—X•Ö”Ô†
000250                               PIC  X(007).
000260     03  ‚c‚O‚Q|‘—•tæŽs’¬‘ºƒR[ƒh
000270                               PIC  X(011).
000280     03  ‚c‚O‚Q|‘—•tæZŠ‚Q  PIC  X(060).
000290     03  ‚c‚O‚Q|‘—•tæZŠ‚R  PIC  X(060).
000300     03  ‚c‚O‚Q|‘—•tæ“d˜b”Ô†
000310                               PIC  X(015).
000320     03  ‚c‚O‚Q|Ž©“®ƒ}ƒbƒ`ƒ“ƒO‘ÎÛŠO‹æ•ª
000330                               PIC  X(001).
000340     03  ‚c‚O‚Q|‰ñŽûƒTƒCƒg    PIC S9(002) PACKED-DECIMAL.
000350     03  ‚c‚O‚Q|‰ñŽû“ú        PIC  X(002).
000360     03  ‚c‚O‚Q|‰ñŽû•û–@      PIC  X(001).
000370     03  ‚c‚O‚Q|‰ñŽûŠÔŠu      PIC S9(002) PACKED-DECIMAL.
000380     03  ‚c‚O‚Q|¿‹ƒTƒCƒg    PIC S9(002) PACKED-DECIMAL.
000390     03  ‚c‚O‚Q|¿‹’÷“ú      PIC  X(002).
000400     03  ‚c‚O‚Q|¿‹ŠÔŠu      PIC S9(002) PACKED-DECIMAL.
000410     03  ‚c‚O‚Q|¿‹Šî€ŒŽ    PIC S9(002) PACKED-DECIMAL.
000420     03  ‚c‚O‚Q|ì¬’Ê”      PIC S9(002) PACKED-DECIMAL.
000430     03  ‚c‚O‚Q|ì¬’PˆÊ      PIC  X(001).
000440     03  ‚c‚O‚Q|¿‹‘ì¬‹æ•ª
000450                               PIC  X(001).
000460     03  ‚c‚O‚Q|¿‹Žw’è—lŽ®‹æ•ª
000470                               PIC  X(001).
000480     03  ‚c‚O‚Q|‘—•t‹æ•ª      PIC  X(001).
000490     03  ‚c‚O‚Q|ŽóŽæ‘¤‹à—Z‹@ŠÖƒR[ƒh
000500                               PIC  X(004).
000510     03  ‚c‚O‚Q|ŽóŽæ‘¤Žx“XƒR[ƒh
000520                               PIC  X(003).
000530     03  ‚c‚O‚Q|ŽóŽæ‘¤ŒûÀŽí—Þ
000540                               PIC  X(001).
000550     03  ‚c‚O‚Q|ŽóŽæ‘¤ŒûÀ”Ô†
000560                               PIC  X(010).
000570     03  ‚c‚O‚Q|ŒûU‹âsƒR[ƒh
000580                               PIC  X(004).
000590     03  ‚c‚O‚Q|ŒûUŽx“XƒR[ƒh
000600                               PIC  X(003).
000610     03  ‚c‚O‚Q|ŒûUŒûÀŽí—Þ  PIC  X(001).
000620     03  ‚c‚O‚Q|ŒûUŒûÀ”Ô†  PIC  X(010).
000630     03  ‚c‚O‚Q|ŒûU–¼‹`l    PIC  X(030).
000640     03  ‚c‚O‚Q|¿‹ˆ¶–¼ˆóü  PIC  X(001).
000650     03  ‚c‚O‚Q|¿‹“ú•tˆóü  PIC  X(001).
000660     03  ‚c‚O‚Q|‰ñŽûŠúŒÀˆóü  PIC  X(001).
000670     03  ‚c‚O‚Q|Žg—pŒŽˆóü    PIC  X(001).
000680     03  ‚c‚O‚Q|“à–óˆóü      PIC  X(001).
000690     03  ‚c‚O‚Q|¿‹”Ô†ˆóü  PIC  X(001).
000700     03  ‚c‚O‚Q|“E—v—“ˆóü    PIC  X(001).
000710     03  ‚c‚O‚Q|“E—v—“        PIC  X(060).
000720     03  ‚c‚O‚Q|”õl—“ˆóü    PIC  X(001).
000730     03  ‚c‚O‚Q|ŒûU‚²ˆÄ“à‘ì¬‹æ•ª
000740                               PIC  X(001).
000750     03  ‚c‚O‚Q|W–ñ‹æ•ª      PIC  X(001).
000760     03  ‚c‚O‚Q|XV“úŽž      PIC  X(016).
000770     03  ‚c‚O‚Q|XVŽÒ        PIC  X(008).
000780     03  ‚c‚O‚Q|‘—•tæƒR[ƒh  PIC  X(003).
000790     03  ‚c‚O‚Q|‰¼‘zŒûÀ˜A”Ô  PIC S9(003) PACKED-DECIMAL.
000800     03  ‚c‚O‚Q|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
000810                               PIC  X(001).
000820     03  ‚c‚O‚Q|ƒRƒƒ“ƒg—“    PIC  X(060).
000830     03  ‚c‚O‚Q|“ü—Í’S“–ŽÒƒR[ƒh
000840                               PIC  X(008).
000850     03  ‚c‚O‚Q|•”–åƒJƒi–¼Ì  PIC  X(030).
000860     03  ‚c‚O‚Q|Œ_–ñæƒR[ƒh  PIC  X(005).
000870     03  ‚c‚O‚Q|‹¤—Lƒtƒ‰ƒO    PIC  X(001).
000880     03  ‚c‚O‚Q|ZŠ‚P        PIC  X(060).
000890     03  ‚c‚O‚Q|ZŠƒJƒi–¼Ì  PIC  X(060).
000900     03  ‚c‚O‚Q|‚e‚`‚w”Ô†    PIC  X(015).
000910     03  ‚c‚O‚Q|U‘Ö‹âsƒR[ƒh
000920                               PIC  X(004).
000930     03  ‚c‚O‚Q|Ž©Uˆø—Ž“ú    PIC  X(002).
000940     03  ‚c‚O‚Q|ŽóŽæ‘¤ŒûÀƒR[ƒh
000950                               PIC  X(002).
000960     03  ‚c‚O‚Q|UžŽè”—¿•‰’S‹æ•ª
000970                               PIC  X(001).
000980     03  ‚c‚O‚Q|Œ»’S“–ŽÒ      PIC  X(008).
000990     03  ‚c‚O‚Q|Žå’S“–•”‰ÛƒR[ƒh
001000                               PIC  X(004).
001010     03  ‚c‚O‚Q|“o˜^”NŒŽ“ú    PIC  X(008).
001020     03  ‚c‚O‚Q|“o˜^ŽžŠÔ      PIC  X(008).
001030     03  ‚c‚O‚Q|“o˜^’S“–ŽÒ    PIC  X(008).
001040     03  ‚c‚O‚Q|XV”NŒŽ“ú    PIC  X(008).
001050     03  ‚c‚O‚Q|XVŽžŠÔ      PIC  X(008).
001060     03  ‚c‚O‚Q|‹Œ¿‹æƒR[ƒh
001070                               PIC  X(008).
001080     03  ‚c‚O‚Q|ŒûÀˆø—ŽˆË—Š‘Žó—Ì“ú
001090                               PIC  X(008).
001100     03  ‚c‚O‚Q|ŒûÀˆø—ŽŠJŽn“ú
001110                               PIC  X(008).
