000010*****************************************************************
000020*   €–Ú–¼Ìƒ}ƒXƒ^(D19MSY_TBL)
000030*****************************************************************
000040 01  €–Ú–¼Ìƒ}ƒXƒ^.
000050     03  ‚c‚P‚X|ƒR[ƒh‚m‚n    PIC  X(012).
000060     03  ‚c‚P‚X|ƒR[ƒh        PIC  X(005).
000070     03  ‚c‚P‚X|ƒR[ƒh–¼      PIC  X(040).
000080     03  ‚c‚P‚X|–¼Ì          PIC  X(060).
000090     03  ‚c‚P‚X|XV“úŽž      PIC  X(016).
000100     03  ‚c‚P‚X|XVŽÒ        PIC  X(008).
000110     03  ‚c‚P‚X|ƒfƒtƒHƒ‹ƒg‹æ•ª
000120                               PIC  X(001).
000130     03  ‚c‚P‚X|ƒpƒXƒ[ƒh“ü—Í‹æ•ª
000140                               PIC  X(001).
000150     03  ‚c‚P‚X|ƒ\[ƒg‡      PIC S9(003) PACKED-DECIMAL.
000160     03  ‚c‚P‚X|“ü—Í’S“–ŽÒƒR[ƒh
000170                               PIC  X(008).
000180     03  ‚c‚P‚X|“o˜^”NŒŽ“ú    PIC  X(008).
000190     03  ‚c‚P‚X|“o˜^ŽžŠÔ      PIC  X(008).
000200     03  ‚c‚P‚X|“o˜^’S“–ŽÒ    PIC  X(008).
000210     03  ‚c‚P‚X|XV”NŒŽ“ú    PIC  X(008).
000220     03  ‚c‚P‚X|XVŽžŠÔ      PIC  X(008).
