000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. L9207.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 77 A PIC 9.
000070 77 B PIC 9.
000080 77 S PIC 9(2).
000090 77 S1 PIC 99.
000100 77 S2 PIC 9(4).
000110 77 S3 PIC 99.
000120 01 C-TABLE.
000130     02 C OCCURS 3.
000140         03 C1 PIC XX.
000150         03 C2 PIC 9(6).
000160 PROCEDURE DIVISION.
000170 MAIN.
000180     MOVE 4 TO A.
000190     PERFORM P1.
000200     MOVE S TO S1.
000210     MOVE 7 TO A.
000220     PERFORM P1.
000230     MOVE S TO S2. 
000240     MOVE 9 TO A.
000250     PERFORM P1.
000260     COMPUTE S3 = S / S2 - S1.
000270     DISPLAY "S1=",S1.
000280     DISPLAY "S2=",S2.
000290     DISPLAY "S3=",S3.
000300     DISPLAY "S=",S.
000310     MOVE SPACES TO C-TABLE.
000320     PERFORM P1 THRU P3
000330         VARYING A FROM 1 BY 1 UNTIL A > 3.
000340     DISPLAY C-TABLE.
000350     STOP 0.
000360 P1.
000370     MOVE 1 TO B S.
000380     PERFORM P2 A TIMES.
000390 P3.
000400     MOVE S TO C2(A).
000410 P2. 
000420     MULTIPLY B BY S.
000430     ADD 1 TO B.
000440