          05  CUSTOMER      PIC  X(4).
          05  CUSTOMER-NAME PIC  X(10).
          05  CUSTOMER-ADDRESS       PIC  X(20).
          05  CUSTOMER-CITY          PIC  X(20).   