000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CH94.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060     SELECT STOCK-FILE ASSIGN TO DISK
000070             ORGANIZATION IS INDEXED
000080             ACCESS MODE IS RANDOM
000090             RECORD KEY IS NUMBBRS.
000100 DATA DIVISION.
000120 FILE SECTION.
000130 FD STOCK-FILE LABEL RECORD IS STANDARD
000140                 VALUE OF FILE-ID IS "STOCK.DAT"
000150 01 STOCK-REC.
000160   03 NUMBERS   PIC 9(6).
000170   03 NAME      PIC X(20).
000180   03 AMOUNT    PIC 9(6).
000190   03 PRICE     PIC 9(4)V99.
000200   03 UNIT      PIC X(8).
000210 WORKING-STORAGE SECTION.
000220 77 EOF  PIC X(3) VALUE ALL SPACE.
000230 77 YN   PIC X.
000240  
000250 PROCEDURE DIVISION.
000260 G.
000270      OPEN I-O STOCK-FILE.
000280      DISPLAY "INPUT NUMBERS".
000290      ACCEPT NUMBERS.
000300      PERFORM R UNTIL NUMBERS = 999999.
000310      CLOSE STOCK-FILE.
000320      STOP RUN.
000330 R.
000340     READ STOCK-FILE INVALID KEY MOVE "ERR" TO EOF.
000350     IF EOF = "ERR" PERFORM RE
000360     ELSE PERFORM R1.
000370 RE.
000380     DISPLAY "NUMBERS ERROR".
000390     MOVE SPACE TO EOF.
000400     DISPLAY "INPUT NUMBERS".
000410     ACCEPT NUMBERS.
000420 R1.
000430     DISPLAY NUMBERS.
000440     DISPLAY NAME.
000450     DISPLAY AMOUNT.
000460     DISPLAY "CORRECT?"              
000470     ACCEPT YN.
000480     IF YN = "N" PERFORM R11
000490     ELSE DISPLAY "INPUT WUMBERS"
000500        ACCEPT NUMBERS.
000510 R11.
000520     DISPLAY "INPUT NUMOUNT".
000530     ACCEPT AMOUNT.
000540     REWRITE STOCK-REC.
000550