      *****************************************************************
      *   Œ_–ñŽèŒ`ÂŒ –¾×(D415UTM_TBL)
      *****************************************************************
       01  Œ_–ñŽèŒ`ÂŒ –¾×.
           03  ‚c‚S‚P‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚P‚T|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚P‚T|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚P‚T|Šz–Ê‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|ŽèŒ`Šú“ú    PIC  X(008).
           03  ‚c‚S‚P‚T|—˜‘§Šú“ú    PIC  X(008).
           03  ‚c‚S‚P‚T|“ú”        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|Š„ˆø—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|Š„ˆø—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|Žæ—§Žè”—¿“™
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|Žæ—§Žè”—¿“™Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|”ƒŽæ‘ã‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|ŽÐ“à‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚P‚T|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|ŽÀŽ¿”N—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|‘e—˜        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|ŽèŒ`”Ô†    PIC  X(010).
           03  ‚c‚S‚P‚T|ŽèŒ`Ží—Þ    PIC  X(001).
           03  ‚c‚S‚P‚T|Žx•¥‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚S‚P‚T|Žx•¥Žx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚P‚T|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚P‚T|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚P‚T|ŽÐ“à‹à—˜|ˆê”Ê
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|‘e—˜|ˆê”Ê  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚T|ŠúŒÀ‘OŒˆÙ“ú
                                     PIC  X(008).
           03  ‚c‚S‚P‚T|—¬“®‰»æ    PIC  X(010).
           03  ‚c‚S‚P‚T|ÂŒ —¬“®‰»æ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚P‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚P‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚P‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚P‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚P‚T|“o˜^’S“–ŽÒ  PIC  X(008).
