000010************************************************
000020* (ALM_NONEQU)
000030************************************************
000040 01  ALM_NONEQU-CTLNUM PIC  X(006).
000050 01  ALM_NONEQU-CLTNAM PIC  X(040).
000060 01  ALM_NONEQU-BALCAP PIC S9(013) COMP-3.
000070 01  ALM_NONEQU-COLAMT PIC S9(013) COMP-3.
000080 01  ALM_NONEQU-ISUDAY PIC  X(008).
000090 01  ALM_NONEQU-INTBGN PIC  X(008).
000100 01  ALM_NONEQU-DUEDAY PIC  X(008).
000110 01  ALM_NONEQU-UPDCYC PIC  X(002).
000120 01  ALM_NONEQU-AVEBAL PIC S9(013) COMP-3.
000130 01  ALM_NONEQU-COLRAT PIC S9(002)V9(5) COMP-3.
000140 01  ALM_NONEQU-CHARGE PIC S9(002)V9(5) COMP-3.
000150 01  ALM_NONEQU-REFNUM PIC  X(020).
000160 01  ALM_NONEQU-FIXFLT PIC  X(001).
000170 01  ALM_NONEQU-TRMTYP PIC  X(001).
000180 01  ALM_NONEQU-MON001 PIC S9(013) COMP-3.
000190 01  ALM_NONEQU-MON002 PIC S9(013) COMP-3.
000200 01  ALM_NONEQU-MON003 PIC S9(013) COMP-3.
000210 01  ALM_NONEQU-MON004 PIC S9(013) COMP-3.
000220 01  ALM_NONEQU-MON005 PIC S9(013) COMP-3.
000230 01  ALM_NONEQU-MON006 PIC S9(013) COMP-3.
000240 01  ALM_NONEQU-MON007 PIC S9(013) COMP-3.
000250 01  ALM_NONEQU-MON008 PIC S9(013) COMP-3.
000260 01  ALM_NONEQU-MON009 PIC S9(013) COMP-3.
000270 01  ALM_NONEQU-MON010 PIC S9(013) COMP-3.
000280 01  ALM_NONEQU-MON011 PIC S9(013) COMP-3.
000290 01  ALM_NONEQU-MON012 PIC S9(013) COMP-3.
000300 01  ALM_NONEQU-MON013 PIC S9(013) COMP-3.
000310 01  ALM_NONEQU-MON014 PIC S9(013) COMP-3.
000320 01  ALM_NONEQU-MON015 PIC S9(013) COMP-3.
000330 01  ALM_NONEQU-MON016 PIC S9(013) COMP-3.
000340 01  ALM_NONEQU-MON017 PIC S9(013) COMP-3.
000350 01  ALM_NONEQU-MON018 PIC S9(013) COMP-3.
000360 01  ALM_NONEQU-MON019 PIC S9(013) COMP-3.
000370 01  ALM_NONEQU-MON020 PIC S9(013) COMP-3.
000380 01  ALM_NONEQU-MON021 PIC S9(013) COMP-3.
000390 01  ALM_NONEQU-MON022 PIC S9(013) COMP-3.
000400 01  ALM_NONEQU-MON023 PIC S9(013) COMP-3.
000410 01  ALM_NONEQU-MON024 PIC S9(013) COMP-3.
000420 01  ALM_NONEQU-MON025 PIC S9(013) COMP-3.
000430 01  ALM_NONEQU-MON026 PIC S9(013) COMP-3.
000440 01  ALM_NONEQU-MON027 PIC S9(013) COMP-3.
000450 01  ALM_NONEQU-MON028 PIC S9(013) COMP-3.
000460 01  ALM_NONEQU-MON029 PIC S9(013) COMP-3.
000470 01  ALM_NONEQU-MON030 PIC S9(013) COMP-3.
000480 01  ALM_NONEQU-MON031 PIC S9(013) COMP-3.
000490 01  ALM_NONEQU-MON032 PIC S9(013) COMP-3.
000500 01  ALM_NONEQU-MON033 PIC S9(013) COMP-3.
000510 01  ALM_NONEQU-MON034 PIC S9(013) COMP-3.
000520 01  ALM_NONEQU-MON035 PIC S9(013) COMP-3.
000530 01  ALM_NONEQU-MON036 PIC S9(013) COMP-3.
000540 01  ALM_NONEQU-MON037 PIC S9(013) COMP-3.
000550 01  ALM_NONEQU-MON038 PIC S9(013) COMP-3.
000560 01  ALM_NONEQU-MON039 PIC S9(013) COMP-3.
000570 01  ALM_NONEQU-MON040 PIC S9(013) COMP-3.
000580 01  ALM_NONEQU-MON041 PIC S9(013) COMP-3.
000590 01  ALM_NONEQU-MON042 PIC S9(013) COMP-3.
000600 01  ALM_NONEQU-MON043 PIC S9(013) COMP-3.
000610 01  ALM_NONEQU-MON044 PIC S9(013) COMP-3.
000620 01  ALM_NONEQU-MON045 PIC S9(013) COMP-3.
000630 01  ALM_NONEQU-MON046 PIC S9(013) COMP-3.
000640 01  ALM_NONEQU-MON047 PIC S9(013) COMP-3.
000650 01  ALM_NONEQU-MON048 PIC S9(013) COMP-3.
000660 01  ALM_NONEQU-MON049 PIC S9(013) COMP-3.
000670 01  ALM_NONEQU-MON050 PIC S9(013) COMP-3.
000680 01  ALM_NONEQU-MON051 PIC S9(013) COMP-3.
000690 01  ALM_NONEQU-MON052 PIC S9(013) COMP-3.
000700 01  ALM_NONEQU-MON053 PIC S9(013) COMP-3.
000710 01  ALM_NONEQU-MON054 PIC S9(013) COMP-3.
000720 01  ALM_NONEQU-MON055 PIC S9(013) COMP-3.
000730 01  ALM_NONEQU-MON056 PIC S9(013) COMP-3.
000740 01  ALM_NONEQU-MON057 PIC S9(013) COMP-3.
000750 01  ALM_NONEQU-MON058 PIC S9(013) COMP-3.
000760 01  ALM_NONEQU-MON059 PIC S9(013) COMP-3.
000770 01  ALM_NONEQU-MON060 PIC S9(013) COMP-3.
000780 01  ALM_NONEQU-MON061 PIC S9(013) COMP-3.
000790 01  ALM_NONEQU-MON062 PIC S9(013) COMP-3.
000800 01  ALM_NONEQU-MON063 PIC S9(013) COMP-3.
000810 01  ALM_NONEQU-MON064 PIC S9(013) COMP-3.
000820 01  ALM_NONEQU-MON065 PIC S9(013) COMP-3.
000830 01  ALM_NONEQU-MON066 PIC S9(013) COMP-3.
000840 01  ALM_NONEQU-MON067 PIC S9(013) COMP-3.
000850 01  ALM_NONEQU-MON068 PIC S9(013) COMP-3.
000860 01  ALM_NONEQU-MON069 PIC S9(013) COMP-3.
000870 01  ALM_NONEQU-MON070 PIC S9(013) COMP-3.
000880 01  ALM_NONEQU-MON071 PIC S9(013) COMP-3.
000890 01  ALM_NONEQU-MON072 PIC S9(013) COMP-3.
000900 01  ALM_NONEQU-MON073 PIC S9(013) COMP-3.
000910 01  ALM_NONEQU-MON074 PIC S9(013) COMP-3.
000920 01  ALM_NONEQU-MON075 PIC S9(013) COMP-3.
000930 01  ALM_NONEQU-MON076 PIC S9(013) COMP-3.
000940 01  ALM_NONEQU-MON077 PIC S9(013) COMP-3.
000950 01  ALM_NONEQU-MON078 PIC S9(013) COMP-3.
000960 01  ALM_NONEQU-MON079 PIC S9(013) COMP-3.
000970 01  ALM_NONEQU-MON080 PIC S9(013) COMP-3.
000980 01  ALM_NONEQU-MON081 PIC S9(013) COMP-3.
000990 01  ALM_NONEQU-MON082 PIC S9(013) COMP-3.
001000 01  ALM_NONEQU-MON083 PIC S9(013) COMP-3.
001010 01  ALM_NONEQU-MON084 PIC S9(013) COMP-3.
001020 01  ALM_NONEQU-MON085 PIC S9(013) COMP-3.
001030 01  ALM_NONEQU-MON086 PIC S9(013) COMP-3.
001040 01  ALM_NONEQU-MON087 PIC S9(013) COMP-3.
001050 01  ALM_NONEQU-MON088 PIC S9(013) COMP-3.
001060 01  ALM_NONEQU-MON089 PIC S9(013) COMP-3.
001070 01  ALM_NONEQU-MON090 PIC S9(013) COMP-3.
001080 01  ALM_NONEQU-MON091 PIC S9(013) COMP-3.
001090 01  ALM_NONEQU-MON092 PIC S9(013) COMP-3.
001100 01  ALM_NONEQU-MON093 PIC S9(013) COMP-3.
001110 01  ALM_NONEQU-MON094 PIC S9(013) COMP-3.
001120 01  ALM_NONEQU-MON095 PIC S9(013) COMP-3.
001130 01  ALM_NONEQU-MON096 PIC S9(013) COMP-3.
001140 01  ALM_NONEQU-MON097 PIC S9(013) COMP-3.
001150 01  ALM_NONEQU-MON098 PIC S9(013) COMP-3.
001160 01  ALM_NONEQU-MON099 PIC S9(013) COMP-3.
001170 01  ALM_NONEQU-MON100 PIC S9(013) COMP-3.
001180 01  ALM_NONEQU-MON101 PIC S9(013) COMP-3.
001190 01  ALM_NONEQU-MON102 PIC S9(013) COMP-3.
001200 01  ALM_NONEQU-MON103 PIC S9(013) COMP-3.
001210 01  ALM_NONEQU-MON104 PIC S9(013) COMP-3.
001220 01  ALM_NONEQU-MON105 PIC S9(013) COMP-3.
001230 01  ALM_NONEQU-MON106 PIC S9(013) COMP-3.
001240 01  ALM_NONEQU-MON107 PIC S9(013) COMP-3.
001250 01  ALM_NONEQU-MON108 PIC S9(013) COMP-3.
001260 01  ALM_NONEQU-MON109 PIC S9(013) COMP-3.
001270 01  ALM_NONEQU-MON110 PIC S9(013) COMP-3.
001280 01  ALM_NONEQU-MON111 PIC S9(013) COMP-3.
001290 01  ALM_NONEQU-MON112 PIC S9(013) COMP-3.
001300 01  ALM_NONEQU-MON113 PIC S9(013) COMP-3.
001310 01  ALM_NONEQU-MON114 PIC S9(013) COMP-3.
001320 01  ALM_NONEQU-MON115 PIC S9(013) COMP-3.
001330 01  ALM_NONEQU-MON116 PIC S9(013) COMP-3.
001340 01  ALM_NONEQU-MON117 PIC S9(013) COMP-3.
001350 01  ALM_NONEQU-MON118 PIC S9(013) COMP-3.
001360 01  ALM_NONEQU-MON119 PIC S9(013) COMP-3.
001370 01  ALM_NONEQU-MON120 PIC S9(013) COMP-3.
