000010************************************************
000020* (ALM_TRSMST)
000030************************************************
000040 01  ALM_TRSMST-CTLNUM PIC  X(006).
000050 01  ALM_TRSMST-CLTNAM PIC  X(040).
000060 01  ALM_TRSMST-BALCAP PIC S9(013) COMP-3.
000070 01  ALM_TRSMST-COLAMT PIC S9(013) COMP-3.
000080 01  ALM_TRSMST-ISUDAY PIC  X(008).
000090 01  ALM_TRSMST-DUEDAY PIC  X(008).
000100 01  ALM_TRSMST-UPDCYC PIC  X(002).
000110 01  ALM_TRSMST-AVEBAL PIC S9(013) COMP-3.
000120 01  ALM_TRSMST-COLRAT PIC S9(002)V9(5) COMP-3.
000130 01  ALM_TRSMST-CHARGE PIC S9(002)V9(5) COMP-3.
000140 01  ALM_TRSMST-REFNUM PIC  X(020).
000150 01  ALM_TRSMST-FIXFLT PIC  X(001).
000160 01  ALM_TRSMST-TRMTYP PIC  X(001).
