000010************************************************
000020* (ANK_FUZUI)
000030************************************************
000040 01  ‚`‚m‚j|‚e‚t‚y‚t‚h|•tð€ƒR[ƒh PIC  X(002).
000050 01  ‚`‚m‚j|‚e‚t‚y‚t‚h|“à—e PIC  X(080).
000060 01  ‚`‚m‚j|‚e‚t‚y‚t‚h|“o˜^“ú PIC  X(008).
000070 01  ‚`‚m‚j|‚e‚t‚y‚t‚h|“o˜^Žž PIC  X(006).
000080 01  ‚`‚m‚j|‚e‚t‚y‚t‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚`‚m‚j|‚e‚t‚y‚t‚h|XV“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚e‚t‚y‚t‚h|XVŽž PIC  X(006).
000110 01  ‚`‚m‚j|‚e‚t‚y‚t‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
