000010************************************************
000020* (ANK_LPWK_SIHARAI)
000030************************************************
000040 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|ƒy[ƒW 
                                             PIC S9(001) COMP-3.
000070 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Žx•¥˜A”Ô 
                                             PIC S9(003) COMP-3.
000080 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|’[––”Ô† PIC  X(016).
000090 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Žx•¥˜A”Ô‚P 
                                             PIC S9(003) COMP-3.
000100 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Žx•¥“ú‚P PIC  X(008).
000110 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|ƒŠ[ƒX—¿‚P 
                                             PIC S9(013) COMP-3.
000120 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Žc‚‚P 
                                             PIC S9(013) COMP-3.
000130 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Žx•¥˜A”Ô‚Q 
                                             PIC S9(003) COMP-3.
000140 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Žx•¥“ú‚Q PIC  X(008).
000150 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|ƒŠ[ƒX—¿‚Q 
                                             PIC S9(013) COMP-3.
000160 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Žc‚‚Q 
                                             PIC S9(013) COMP-3.
000170 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000180 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|‘OŽóŒŽ” 
                                             PIC S9(002) COMP-3.
000190 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Œ_–ñ‘Šz 
                                             PIC S9(013) COMP-3.
000200 01  ‚`‚m‚j|‚k‚o‚v‚j|‚r‚h‚g‚`‚q‚`‚h|Žc‰¿Šz 
                                             PIC S9(013) COMP-3.
