000010************************************************
000020* (ANK_WORK003)
000030************************************************
000040 01  ANK_WORK003-KEY PIC S9(001) COMP-3.
000050 01  ANK_WORK003-物件NO PIC S9(003) COMP-3.
000060 01  ANK_WORK003-購入金額 PIC S9(013) COMP-3.
000070 01  ANK_WORK003-耐用年数 PIC S9(002) COMP-3.
000080 01  ANK_WORK003-固定資産税率 PIC S9(002)V9(2) COMP-3.
000090 01  ANK_WORK003-固定資産税額 PIC S9(013) COMP-3.
000100 01  ANK_WORK003-動総保険料率 PIC S9(002)V9(3) COMP-3.
000110 01  ANK_WORK003-動総保険料 PIC S9(013) COMP-3.
000120 01  ANK_WORK003-残価額 PIC S9(013) COMP-3.
000130 01  ANK_WORK003-基本ﾘｰｽ料 PIC S9(013) COMP-3.
000140 01  ANK_WORK003-個別ﾘｰｽ料 PIC S9(013) COMP-3.
000150 01  ANK_WORK003-ﾘｰｽ料率 PIC S9(002)V9(8) COMP-3.
000160 01  ANK_WORK003-最終物件NO PIC S9(003) COMP-3.
000170 01  ANK_WORK003-最終購入金額 PIC S9(013) COMP-3.
000180 01  ANK_WORK003-最終耐用年数 PIC S9(002) COMP-3.
000190 01  ANK_WORK003-最終固定資産税率 PIC S9(002)V9(2) COMP-3.
000200 01  ANK_WORK003-最終固定資産税額 PIC S9(013) COMP-3.
000210 01  ANK_WORK003-最終動総保険料率 PIC S9(002)V9(3) COMP-3.
000220 01  ANK_WORK003-最終動総保険料 PIC S9(013) COMP-3.
000230 01  ANK_WORK003-最終残価額 PIC S9(013) COMP-3.
000240 01  ANK_WORK003-最終基本ﾘｰｽ料 PIC S9(013) COMP-3.
000250 01  ANK_WORK003-最終個別ﾘｰｽ料 PIC S9(013) COMP-3.
000260 01  ANK_WORK003-最終ﾘｰｽ料率 PIC S9(002)V9(8) COMP-3.
000270 01  ANK_WORK003-物件数 PIC S9(003) COMP-3.
000280 01  ANK_WORK003-購入金額合計 PIC S9(013) COMP-3.
000290 01  ANK_WORK003-加重耐用年数 PIC S9(002)V9(3) COMP-3.
000300 01  ANK_WORK003-固定資産税額合計 PIC S9(013) COMP-3.
000310 01  ANK_WORK003-加重保険料率 PIC S9(002)V9(3) COMP-3.
000320 01  ANK_WORK003-動総保険料合計 PIC S9(013) COMP-3.
000330 01  ANK_WORK003-残価額合計 PIC S9(013) COMP-3.
000340 01  ANK_WORK003-基本ﾘｰｽ料合計 PIC S9(013) COMP-3.
000350 01  ANK_WORK003-個別ﾘｰｽ料合計 PIC S9(013) COMP-3.
000360 01  ANK_WORK003-登録日 PIC  X(008).
000370 01  ANK_WORK003-登録時刻 PIC  X(006).
000380 01  ANK_WORK003-登録担当者ｺｰﾄﾞ PIC  X(004).
000390 01  ANK_WORK003-更新日 PIC  X(008).
000400 01  ANK_WORK003-更新時刻 PIC  X(006).
000410 01  ANK_WORK003-更新担当者ｺｰﾄﾞ PIC  X(004).
