000010************************************************
000020* (ANK_WORK010)
000030************************************************
000040 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|•¨Œ–¼|Š¿Žš PIC  X(040).
000080 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|”—Ê PIC S9(004) COMP-3.
000090 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|’PˆÊ PIC  X(004).
000100 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|w“ü‹àŠz PIC S9(013) COMP-3.
000110 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|w“ü‹àŠz”ñ•\Ž¦‹æ•ª PIC S9(001) COMP-3.
000120 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|“o˜^“ú PIC  X(008).
000130 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|“o˜^Žž PIC  X(006).
000140 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|XV“ú PIC  X(008).
000160 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|XVŽž PIC  X(006).
000170 01  ‚`‚m‚j|‚v‚n‚q‚j‚O‚P‚O|XV’S“–ŽÒƒR[ƒh PIC  X(004).
