000010************************************************
000020* (ANK_KEY)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚d‚x|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚j‚d‚x|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚j‚d‚x|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚`‚m‚j|‚j‚d‚x|‰Û PIC  X(001).
000080 01  ‚`‚m‚j|‚j‚d‚x|’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚`‚m‚j|‚j‚d‚x|ˆ—ƒXƒe[ƒ^ƒX PIC  X(001).
000100 01  ‚`‚m‚j|‚j‚d‚x|ˆÄŒó‹µ‹æ•ª PIC  X(002).
000110 01  ‚`‚m‚j|‚j‚d‚x|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000120 01  ‚`‚m‚j|‚j‚d‚x|íœ‹æ•ª PIC  X(001).
000130 01  ‚`‚m‚j|‚j‚d‚x|“o˜^“ú PIC  X(008).
000140 01  ‚`‚m‚j|‚j‚d‚x|“o˜^Žž PIC  X(006).
000150 01  ‚`‚m‚j|‚j‚d‚x|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000160 01  ‚`‚m‚j|‚j‚d‚x|XV“ú PIC  X(008).
000170 01  ‚`‚m‚j|‚j‚d‚x|XVŽž PIC  X(006).
000180 01  ‚`‚m‚j|‚j‚d‚x|XV’S“–ŽÒƒR[ƒh PIC  X(004).
