000010************************************************
000020* (ANK_KIHON)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000080 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|Œ©Ï“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|Œ©Ï—LŒøŠúŒÀ PIC  X(008).
000110 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000120 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|Œ©Ï‘’ñoæ PIC  X(060).
000130 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ƒRƒƒ“ƒg PIC  X(060).
000140 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ŒŸŽû—\’è“ú PIC  X(008).
000150 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿Žx•¥‚¢•û–@‚P PIC  X(040).
000160 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿Žx•¥‚¢•û–@‚Q PIC  X(040).
000170 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|”[“üêŠ PIC  X(060).
000180 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|•ÛŽçŒ_–ñæ–¼ PIC  X(060).
000190 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ÄƒŠ[ƒX—¿ PIC  X(060).
000200 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|˜A‘Ñ•ÛØl PIC  X(060).
000210 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|Œ©Ï•ð€”Ô† PIC  X(080).
000220 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|Œ©Ï•ð€ PIC  X(500).
000230 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ˆÄŒƒŠƒtƒ@ƒŒƒ“ƒX‚P PIC  X(020).
000240 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|ˆÄŒƒŠƒtƒ@ƒŒƒ“ƒX‚Q PIC  X(020).
000250 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000260 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000270 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000280 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000290 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000300 01  ‚`‚m‚j|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
