000010************************************************
000020* (ANK_KANRIHYO_WK)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|’[––‚h‚c PIC  X(016).
000070 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|Œ_–ñ”Ô† PIC  X(009).
000080 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000090 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|’S“–ŽÒƒR[ƒh PIC  X(004).
000100 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|ˆÄŒó‹µ‹æ•ª PIC  X(002).
000110 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|ŒÚ‹qƒR[ƒh PIC  X(006).
000120 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|Žæˆøæ–¼ PIC  X(060).
000130 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|Œ©Ï“ú PIC  X(008).
000140 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|Œ_–ñ“ú PIC  X(008).
000150 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000160 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000170 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000180 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|‘e—˜‰v PIC S9(013) COMP-3.
000190 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000200 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000210 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|•¨Œ–¼|Š¿Žš PIC  X(040).
000220 01  ‚`‚m‚j|‚j‚`‚m‚q‚h‚g‚x‚n|‚v‚j|ŒŸŽû—\’è“ú PIC  X(008).
