000010************************************************
000020* (ANK_LPWK_MITUMORI)
000030************************************************
000040 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|’[––”Ô† PIC  X(016).
000070 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Žæˆøæ–¼ PIC  X(060).
000080 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Œ©Ï‘’ñoæ 
                                             PIC  X(060).
000090 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Œ©Ï“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ZŠ PIC  X(100).
000110 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|’S“–•”“X PIC  X(020).
000120 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|“d˜b”Ô† PIC  X(020).
000130 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|‚e‚`‚w”Ô† PIC  X(020).
000140 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|•¨Œ–¼‚P PIC  X(040).
000150 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|”—Ê‚P 
                                             PIC S9(004) COMP-3.
000160 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|’PˆÊ‚P PIC  X(004).
000170 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|w“ü‹àŠz‚P 
                                             PIC S9(013) COMP-3.
000180 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|•¨Œ–¼‚Q PIC  X(040).
000190 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|”—Ê‚Q 
                                             PIC S9(004) COMP-3.
000200 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|’PˆÊ‚Q PIC  X(004).
000210 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|w“ü‹àŠz‚Q 
                                             PIC S9(013) COMP-3.
000220 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|•¨Œ–¼‚R PIC  X(040).
000230 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|”—Ê‚R 
                                             PIC S9(004) COMP-3.
000240 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|’PˆÊ‚R PIC  X(004).
000250 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|w“ü‹àŠz‚R 
                                             PIC S9(013) COMP-3.
000260 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|•¨Œ–¼‚S PIC  X(040).
000270 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|”—Ê‚S 
                                             PIC S9(004) COMP-3.
000280 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|’PˆÊ‚S PIC  X(004).
000290 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|w“ü‹àŠz‚S 
                                             PIC S9(013) COMP-3.
000300 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|•¨Œ–¼‚T 
                                             PIC  X(040).
000310 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|”—Ê‚T 
                                             PIC S9(004) COMP-3.
000320 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|’PˆÊ‚T PIC  X(004).
000330 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|w“ü‹àŠz‚T 
                                             PIC S9(013) COMP-3.
000340 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000350 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ŒvŽZ•ûŽ®‚P PIC  X(001).
000360 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ŒvŽZ•ûŽ®‚Q PIC  X(001).
000370 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ŒvŽZ•ûŽ®‚R PIC  X(001).
000380 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒXŠúŠÔ‚P 
                                             PIC S9(003) COMP-3.
000390 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒXŠúŠÔ‚Q 
                                             PIC S9(003) COMP-3.
000400 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒXŠúŠÔ‚R 
                                             PIC S9(003) COMP-3.
000410 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|¿‹ƒTƒCƒNƒ‹‚P 
                                             PIC S9(002) COMP-3.
000420 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|¿‹ƒTƒCƒNƒ‹‚Q 
                                             PIC S9(002) COMP-3.
000430 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|¿‹ƒTƒCƒNƒ‹‚R 
                                             PIC S9(002) COMP-3.
000440 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒX—¿‚P 
                                             PIC S9(013) COMP-3.
000450 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒX—¿‚Q 
                                             PIC S9(013) COMP-3.
000460 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒX—¿‚R 
                                             PIC S9(013) COMP-3.
000470 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒX—¿—¦‚P 
                                             PIC S9(002)V9(3) COMP-3.
000480 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒX—¿—¦‚Q 
                                             PIC S9(002)V9(3) COMP-3.
000490 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒX—¿—¦‚R 
                                             PIC S9(002)V9(3) COMP-3.
000500 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Á”ïÅ“™Šz‚P 
                                             PIC S9(013) COMP-3.
000510 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Á”ïÅ“™Šz‚Q 
                                             PIC S9(013) COMP-3.
000520 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Á”ïÅ“™Šz‚R 
                                             PIC S9(013) COMP-3.
000530 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|‘OŽóƒŠ[ƒX—¿‚P 
                                             PIC S9(013) COMP-3.
000540 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|‘OŽóƒŠ[ƒX—¿‚Q 
                                             PIC S9(013) COMP-3.
000550 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|‘OŽóƒŠ[ƒX—¿‚R 
                                             PIC S9(013) COMP-3.
000560 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒX—¿Žx•¥•û–@‚P 
                                             PIC  X(040).
000570 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒŠ[ƒX—¿Žx•¥•û–@‚Q 
                                             PIC  X(040).
000580 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ÄƒŠ[ƒX—¿ PIC  X(060).
000590 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ŒŸŽû—\’è“ú PIC  X(008).
000600 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Ý’uêŠ–¼ PIC  X(060).
000610 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|•ÛŽçŒ_–ñ PIC  X(060).
000620 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|˜A‘Ñ•ÛØl PIC  X(060).
000630 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|•tð€ PIC  X(500).
000640 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|Œ©Ï—LŒøŠúŒÀ PIC  X(008).
000650 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ˆÄŒƒŠƒtƒ@ƒŒƒ“ƒX‚P 
                                             PIC  X(020).
000660 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ˆÄŒƒŠƒtƒ@ƒŒƒ“ƒX‚Q 
                                             PIC  X(020).
000670 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|w“ü‹àŠz”ñ•\Ž¦‹æ•ª 
                                             PIC S9(001) COMP-3.
000680 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|—¿—¦”ñ•\Ž¦‹æ•ª 
                                             PIC S9(001) COMP-3.
000690 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒeƒLƒXƒg‚P PIC  X(100).
000700 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒeƒLƒXƒg‚Q PIC  X(100).
000710 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒeƒLƒXƒg‚R PIC  X(100).
000720 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒeƒLƒXƒg‚S PIC  X(100).
000730 01  ‚`‚m‚j|‚k‚o‚v‚j|‚l‚h‚s‚t‚l‚n‚q‚h|ƒeƒLƒXƒg‚T PIC  X(100).
