000010************************************************
000020* (ANK_KURINOBE)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|ŒJ‰„‚m‚n PIC S9(002) COMP-3.
000070 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|ŒJ‰„‹àŠz PIC S9(013) COMP-3.
000080 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000090 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|“o˜^“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|“o˜^Žž PIC  X(006).
000110 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|XV“ú PIC  X(008).
000130 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|XVŽž PIC  X(006).
000140 01  ‚`‚m‚j|‚j‚t‚q‚h‚m‚n‚a‚d|XV’S“–ŽÒƒR[ƒh PIC  X(004).
