000010************************************************
000020* (ANK_LOSTKBN)
000030************************************************
000040 01  ‚`‚m‚j|‚k‚n‚r‚s‚j‚a‚m|ƒƒXƒg——R‹æ•ª PIC  X(002).
000050 01  ‚`‚m‚j|‚k‚n‚r‚s‚j‚a‚m|ƒƒXƒg——R PIC  X(020).
000060 01  ‚`‚m‚j|‚k‚n‚r‚s‚j‚a‚m|“o˜^“ú PIC  X(008).
000070 01  ‚`‚m‚j|‚k‚n‚r‚s‚j‚a‚m|“o˜^Žž PIC  X(006).
000080 01  ‚`‚m‚j|‚k‚n‚r‚s‚j‚a‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚`‚m‚j|‚k‚n‚r‚s‚j‚a‚m|XV“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚k‚n‚r‚s‚j‚a‚m|XVŽž PIC  X(006).
000110 01  ‚`‚m‚j|‚k‚n‚r‚s‚j‚a‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
