000010************************************************
000020* (ANK_LPWK_HUBARAI)
000030************************************************
000040 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|Žx•¥˜A”Ô 
                                             PIC S9(003) COMP-3.
000070 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|’[––”Ô† PIC  X(016).
000080 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|Œ³–{ PIC S9(013) COMP-3.
000090 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|•Š‹à PIC S9(013) COMP-3.
000100 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|””ï—p 
                                             PIC S9(013) COMP-3.
000110 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|—˜‘§ PIC S9(013) COMP-3.
000120 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|Œ³–{“à“ü 
                                             PIC S9(013) COMP-3.
000130 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|ˆêŠ‡•ÙÏ‹à 
                                             PIC S9(013) COMP-3.
000140 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|ŒÅ’èŽ‘ŽYÅŒŽŠz 
                                             PIC S9(013) COMP-3.
000150 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|“®‘•ÛŒ¯ŒŽŠz 
                                             PIC S9(013) COMP-3.
000160 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000170 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|˜’uŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000180 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|Œ_–ñ‘Šz 
                                             PIC S9(013) COMP-3.
000190 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|w“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000200 01  ‚`‚m‚j|‚k‚o‚v‚j|‚g‚t‚a‚`‚q‚`‚h|Žc‰¿Šz 
                                             PIC S9(013) COMP-3.
