000010************************************************
000020* (APR_SYOHIN_MST)
000030************************************************
000040 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|ƒAƒ|ƒ¤•iƒR[ƒh PIC  X(004).
000050 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|ƒAƒ|ƒ¤•i•ª—Þ–¼ PIC  X(020).
000060 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|•¨Œ–¼|Š¿Žš PIC  X(040).
000070 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|•¨Œ–¼ PIC  X(020).
000080 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|‹@Ží–¼ PIC  X(020).
000090 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|Ž‘ŽYƒR[ƒh PIC  X(007).
000100 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|‘Ï—p”N” PIC  X(002).
000110 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000120 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000130 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|M—p•ÛŒ¯ƒR[ƒh|ƒŠ[ƒX 
                                             PIC  X(006).
000140 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|M—p•ÛŒ¯ƒR[ƒh|Š„•Š 
                                             PIC  X(006).
000150 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|“o˜^“ú PIC  X(008).
000160 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|“o˜^Žž PIC  X(006).
000170 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000180 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|XV“ú PIC  X(008).
000190 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|XVŽž PIC  X(006).
000200 01  ‚`‚o‚q|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
