000010************************************************
000020* (APR_LPWK_ERROR)
000030************************************************
000040 01  ‚`‚o‚q|‚k‚o‚v‚j|‚d‚q‚q‚n‚q|’[––”Ô† PIC  X(016).
000050 01  ‚`‚o‚q|‚k‚o‚v‚j|‚d‚q‚q‚n‚q|ƒAƒ|ƒŒ_–ñ”Ô† PIC  X(006).
000060 01  ‚`‚o‚q|‚k‚o‚v‚j|‚d‚q‚q‚n‚q|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚`‚o‚q|‚k‚o‚v‚j|‚d‚q‚q‚n‚q|ƒƒbƒZ[ƒW PIC  X(060).
