000010************************************************
000020* ‹¤’Êî•ñ(CPDKYOTU)
000030************************************************
000040 01  ‚b‚o‚c‚j‚x‚n‚s‚t|“o˜^“ú|¢‹I PIC  X(001).
000050 01  ‚b‚o‚c‚j‚x‚n‚s‚t|“o˜^“ú|”N PIC  X(002).
000060 01  ‚b‚o‚c‚j‚x‚n‚s‚t|“o˜^“ú|ŒŽ PIC  X(002).
000070 01  ‚b‚o‚c‚j‚x‚n‚s‚t|“o˜^“ú|“ú PIC  X(002).
000080 01  ‚b‚o‚c‚j‚x‚n‚s‚t|XV“ú•t|”N PIC  X(002).
000090 01  ‚b‚o‚c‚j‚x‚n‚s‚t|XV“ú•t|ŒŽ PIC  X(002).
000100 01  ‚b‚o‚c‚j‚x‚n‚s‚t|XV“ú•t|“ú PIC  X(002).
000110 01  ‚b‚o‚c‚j‚x‚n‚s‚t|XVŽžŽž•ª PIC  X(004).
000120 01  ‚b‚o‚c‚j‚x‚n‚s‚t|XVŽž•b PIC  X(002).
000130 01  ‚b‚o‚c‚j‚x‚n‚s‚t|’S“–ŽÒƒR[ƒh PIC  X(004).
000140 01  ‚b‚o‚c‚j‚x‚n‚s‚t|‚v‚r–¼ PIC  X(008).
000150 01  ‚b‚o‚c‚j‚x‚n‚s‚t|XV‰ñ” PIC S9(002) COMP-3.
000160 01  ‚b‚o‚c‚j‚x‚n‚s‚t|íœ‹æ•ª PIC  X(001).
000170 01  ‚b‚o‚c‚j‚x‚n‚s‚t|‚»‚Ì‘¼‹æ•ª PIC  X(001).
