000010************************************************
000020* ˆ—’Ê”Ô(ŽØ“ü‹àŽæˆø‚c‚a)(CPDTUUH2)
000030************************************************
000040 01  ‚b‚o‚c‚s‚t‚t‚g‚Q|‚j‚d‚x‚P PIC  X(002).
000050 01  ‚b‚o‚c‚s‚t‚t‚g‚Q|‚j‚d‚x‚Q PIC  X(008).
000060 01  ‚b‚o‚c‚s‚t‚t‚g‚Q|ˆê˜A”Ô† PIC S9(003) COMP-3.
000070 01  ‚b‚o‚c‚s‚t‚t‚g‚Q|ƒ_ƒ~[‚O‚O‚P PIC  X(052).
000080 01  ‚b‚o‚c‚s‚t‚t‚g‚Q|‹¤’Êî•ñ PIC  X(035).
