000010************************************************
000020* ‰ð–ñ—ÝÏƒtƒ@ƒCƒ‹(“WŠJ)(CPFBUP03)
000030************************************************
000040 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|“ü—ÍŽ–‹ÆŠ‚b‚c PIC S9(004) COMP-3.
000050 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|ƒf[ƒ^Ž¯•Ê PIC S9(002) COMP-3.
000060 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|Ž–‹ÆŠ‚b‚c PIC S9(004) COMP-3.
000070 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|ƒŒƒR[ƒh‹æ•ª PIC  X(001).
000080 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|Œ_–ñ‚m‚n PIC  X(009).
000090 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|•¨Œ‚m‚n PIC S9(003) COMP-3.
000100 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|Š¨’èˆ—‚b‚c PIC S9(002) COMP-3.
000110 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|ƒ_ƒ~[ PIC  X(004).
000120 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‚j‚d‚x|ÄƒŠ[ƒX‚b‚c PIC S9(001) COMP-3.
000130 01  ‚b‚o‚e‚a‚t‚o‚O‚R|“WŠJ‹àŠz PIC S9(013) COMP-3.
000140 01  ‚b‚o‚e‚a‚t‚o‚O‚R|‰ñ” PIC S9(003) COMP-3.
