000010************************************************
000020* ‰ð–ñ—ÝÏƒtƒ@ƒCƒ‹(Šî–{)(CPFBUP01)
000030************************************************
000040 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|“ü—ÍŽ–‹ÆŠ‚b‚c PIC S9(004) COMP-3.
000050 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|ƒf[ƒ^Ž¯•Ê PIC S9(002) COMP-3.
000060 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|Ž–‹ÆŠ‚b‚c PIC S9(004) COMP-3.
000070 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|ƒŒƒR[ƒh‹æ•ª PIC  X(001).
000080 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|Œ_–ñ‚m‚n PIC  X(009).
000090 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|•¨Œ‚m‚n PIC S9(003) COMP-3.
000100 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|Š¨’èˆ—‚b‚c PIC S9(002) COMP-3.
000110 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|ƒ_ƒ~[ PIC  X(004).
000120 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚j‚d‚x|ÄƒŠ[ƒX‚b‚c PIC S9(001) COMP-3.
000130 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œ_–ñ‚m‚n PIC  X(009).
000140 01  ‚b‚o‚e‚a‚t‚o‚O‚P|’S“–ŽÒ‚b‚c PIC S9(004) COMP-3.
000150 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Ž–‹ÆŠ‚b‚c PIC S9(004) COMP-3.
000160 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒ†[ƒU‚b‚c PIC  X(008).
000170 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ÄƒŠ[ƒX‚b‚c PIC S9(001) COMP-3.
000180 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Š¨’èˆ—‚b‚c PIC S9(002) COMP-3.
000190 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Ž–ŒÌ‚b‚c PIC S9(001) COMP-3.
000200 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000210 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œ_–ñ“ú|”N PIC S9(002) COMP-3.
000220 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œ_–ñ“ú|ŒŽ PIC S9(002) COMP-3.
000230 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œ_–ñ“ú|“ú PIC S9(002) COMP-3.
000240 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000250 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ŒŸŽû“ú|”N PIC S9(002) COMP-3.
000260 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ŒŸŽû“ú|ŒŽ PIC S9(002) COMP-3.
000270 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ŒŸŽû“ú|“ú PIC S9(002) COMP-3.
000280 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000290 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000300 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXŠJŽn“ú|”N PIC S9(002) COMP-3.
000310 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXŠJŽn“ú|ŒŽ PIC S9(002) COMP-3.
000320 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXŠJŽn“ú|“ú PIC S9(002) COMP-3.
000330 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000340 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXI—¹“ú|”N PIC S9(002) COMP-3.
000350 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXI—¹“ú|ŒŽ PIC S9(002) COMP-3.
000360 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒŠ[ƒXI—¹“ú|“ú PIC S9(002) COMP-3.
000370 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000380 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|”N PIC S9(002) COMP-3.
000390 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|ŒŽ PIC S9(002) COMP-3.
000400 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|“ú PIC S9(002) COMP-3.
000410 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000420 01  ‚b‚o‚e‚a‚t‚o‚O‚P|âg‹c‹æ•ª PIC  X(001).
000430 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”Û”F‹æ•ª PIC  X(001).
000440 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Á”ïÅ’¥Žû‹æ•ª PIC S9(001) COMP-3.
000450 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Á”ïÅ—¦‚P PIC S9(002)V9(1) COMP-3.
000460 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Šî€‹à—˜ PIC S9(002)V9(8) COMP-3.
000470 01  ‚b‚o‚e‚a‚t‚o‚O‚P|—˜‰ñ‚è|Šî–{ PIC S9(002)V9(8) COMP-3.
000480 01  ‚b‚o‚e‚a‚t‚o‚O‚P|—˜‰ñ‚è|ŽÀŽ¿ PIC S9(002)V9(8) COMP-3.
000490 01  ‚b‚o‚e‚a‚t‚o‚O‚P|’P”N“xŒ_–ñ PIC S9(002) COMP-3.
000500 01  ‚b‚o‚e‚a‚t‚o‚O‚P|•t•Û“ú|¢‹I PIC S9(001) COMP-3.
000510 01  ‚b‚o‚e‚a‚t‚o‚O‚P|•t•Û“ú|”N PIC S9(002) COMP-3.
000520 01  ‚b‚o‚e‚a‚t‚o‚O‚P|•t•Û“ú|ŒŽ PIC S9(002) COMP-3.
000530 01  ‚b‚o‚e‚a‚t‚o‚O‚P|•t•Û“ú|“ú PIC S9(002) COMP-3.
000540 01  ‚b‚o‚e‚a‚t‚o‚O‚P|¿‹‚b‚c PIC S9(002) COMP-3.
000550 01  ‚b‚o‚e‚a‚t‚o‚O‚P|¿‹æ‚b‚c PIC  X(008).
000560 01  ‚b‚o‚e‚a‚t‚o‚O‚P|¿‹‹æ•ª‚P PIC S9(001) COMP-3.
000570 01  ‚b‚o‚e‚a‚t‚o‚O‚P|¿‹‹æ•ª‚Q PIC S9(001) COMP-3.
000580 01  ‚b‚o‚e‚a‚t‚o‚O‚P|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000590 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Žx•¥‰ñ” PIC S9(003) COMP-3.
000600 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”­sÏ‹æ•ª PIC S9(003) COMP-3.
000610 01  ‚b‚o‚e‚a‚t‚o‚O‚P|˜’uŠúŠÔ PIC S9(003) COMP-3.
000620 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000630 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ŒvŽZ•ûŽ® PIC S9(001) COMP-3.
000640 01  ‚b‚o‚e‚a‚t‚o‚O‚P|[“–ŒŽ” PIC S9(003) COMP-3.
000650 01  ‚b‚o‚e‚a‚t‚o‚O‚P|[“–ŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000660 01  ‚b‚o‚e‚a‚t‚o‚O‚P|[“–ŠJŽn“ú|”N PIC S9(002) COMP-3.
000670 01  ‚b‚o‚e‚a‚t‚o‚O‚P|[“–ŠJŽn“ú|ŒŽ PIC S9(002) COMP-3.
000680 01  ‚b‚o‚e‚a‚t‚o‚O‚P|[“–I—¹“ú|¢‹I PIC S9(001) COMP-3.
000690 01  ‚b‚o‚e‚a‚t‚o‚O‚P|[“–I—¹“ú|”N PIC S9(002) COMP-3.
000700 01  ‚b‚o‚e‚a‚t‚o‚O‚P|[“–I—¹“ú|ŒŽ PIC S9(002) COMP-3.
000710 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹âs‚b‚c PIC  X(007).
000720 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ŒûÀ”Ô† PIC  X(007).
000730 01  ‚b‚o‚e‚a‚t‚o‚O‚P|—a‹àŽí—Þ PIC  X(001).
000740 01  ‚b‚o‚e‚a‚t‚o‚O‚P|“ü‹à“ú PIC S9(002) COMP-3.
000750 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘æ‚P‰ñ“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000760 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘æ‚P‰ñ“ü‹à“ú|”N PIC S9(002) COMP-3.
000770 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘æ‚P‰ñ“ü‹à“ú|ŒŽ PIC S9(002) COMP-3.
000780 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘æ‚P‰ñ“ü‹à“ú|“ú PIC S9(002) COMP-3.
000790 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000800 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Žc‰¿‰ñŽû“ú|”N PIC S9(002) COMP-3.
000810 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Žc‰¿‰ñŽû“ú|ŒŽ PIC S9(002) COMP-3.
000820 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Žc‰¿‰ñŽû“ú|“ú PIC S9(002) COMP-3.
000830 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒtƒ@ƒCƒiƒ“ƒXŠúŠÔ PIC S9(003) COMP-3.
000840 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000850 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|”N PIC S9(002) COMP-3.
000860 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|ŒŽ PIC S9(002) COMP-3.
000870 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|“ú PIC S9(002) COMP-3.
000880 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘O“n‹à—˜‘§Šz|‰ð–ñ•ª PIC S9(013) COMP-3.
000890 01  ‚b‚o‚e‚a‚t‚o‚O‚P|””ï—p‰ð–ñ•ª|ŒŽŠz|ŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000900 01  ‚b‚o‚e‚a‚t‚o‚O‚P|””ï—p‰ð–ñ•ª|ŒŽŠz|•ÛŒ¯—¿ PIC S9(013) COMP-3.
000910 01  ‚b‚o‚e‚a‚t‚o‚O‚P|””ï—p‰ð–ñ•ª|ŒŽŠz|•ÛŽç—¿ PIC S9(013) COMP-3.
000920 01  ‚b‚o‚e‚a‚t‚o‚O‚P|””ï—p‰ð–ñ•ª|ŒŽŠz|‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000930 01  ‚b‚o‚e‚a‚t‚o‚O‚P|””ï—p‰ð–ñ•ª|ŒŽŠz|‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000940 01  ‚b‚o‚e‚a‚t‚o‚O‚P|•ÛØŽc‰¿‡Œv‰ð–ñ•ª PIC S9(013) COMP-3.
000950 01  ‚b‚o‚e‚a‚t‚o‚O‚P|w“ü‹àŠz‡Œv‰ð–ñ•ª PIC S9(013) COMP-3.
000960 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘OŽóƒŠ[ƒX—¿‰ð–ñ•ª PIC S9(013) COMP-3.
000970 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œ_–ñ‹àŠz‰ð–ñ•ª PIC S9(013) COMP-3.
000980 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Á”ïÅ—¦‚QŽcŒ_–ñ PIC S9(002)V9(1) COMP-3.
000990 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹ŠQ‹à“ü‹à‚e PIC S9(001) COMP-3.
001000 01  ‚b‚o‚e‚a‚t‚o‚O‚P|“]ƒŠ[ƒXæ‚b‚c PIC  X(002).
001010 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘OŽó•ª“à–ó PIC  X(001).
001020 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ÅV“ü—ÍÁ”ïÅ—¦XV‘O PIC S9(002)V9(1) COMP-3.
001030 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ÅV“ü—ÍÁ”ïÅ—¦XVŒã PIC S9(002)V9(1) COMP-3.
001040 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
001050 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ÂŒ Žc‚‰ð–ñŽž PIC S9(013) COMP-3.
001060 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ÂŒ Žc‚Žc‘¶•ª PIC S9(013) COMP-3.
001070 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‰ð–ñ‘Oî•ñ|ˆê•”[“–Šz PIC S9(013) COMP-3.
001080 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‰ð–ñ‘Oî•ñ|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
001090 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ŽÀƒŠ[ƒX—¿‰ð–ñ‘O PIC S9(013) COMP-3.
001100 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ŽÀƒŠ[ƒX—¿‰ð–ñ•ª PIC S9(013) COMP-3.
001110 01  ‚b‚o‚e‚a‚t‚o‚O‚P|w“ü‹àŠz‡Œv‰ð–ñ‘O PIC S9(013) COMP-3.
001120 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(044).
001130 01  ‚b‚o‚e‚a‚t‚o‚O‚P|—˜‘§Žc‚ PIC S9(013) COMP-3.
001140 01  ‚b‚o‚e‚a‚t‚o‚O‚P|¿‹“à–ó‚b‚c PIC  X(003).
001150 01  ‚b‚o‚e‚a‚t‚o‚O‚P|’†“r‰ð–ñŽd–ó‚b‚c PIC  X(003).
001160 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‚r‚e‚b”»’è‹æ•ª PIC  X(001).
001170 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Á”ïÅ‚b‚cXV‘O PIC S9(002) COMP-3.
001180 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Á”ïÅ‚b‚cXVŒã PIC S9(002) COMP-3.
001190 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Â–±‹¦’²‚b‚c PIC  X(002).
001200 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œo‰ß‰ñ” PIC S9(003) COMP-3.
001210 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Žc‘¶‰ñ” PIC S9(003) COMP-3.
001220 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘OŽóŽcŒŽ” PIC S9(003) COMP-3.
001230 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K‘¹‹à‘æ‚RŽÒŽx•¥æ–¼ƒJƒi PIC  X(030).
001240 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‘æ‚RŽÒ•¥‹K‘¹‹à‹àŠz PIC S9(013) COMP-3.
001250 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K‘¹‹à”„‹p‘ã‹à[“–Šz PIC S9(013) COMP-3.
001260 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹o‹à‡Œv PIC S9(013) COMP-3.
001270 01  ‚b‚o‚e‚a‚t‚o‚O‚P|””ï—p‡Œv PIC S9(013) COMP-3.
001280 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
001290 01  ‚b‚o‚e‚a‚t‚o‚O‚P|—˜‘§|‰ð–ñˆ—ŒŽ PIC S9(013) COMP-3.
001300 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œ³–{“à“ü|‰ð–ñˆ—ŒŽ PIC S9(013) COMP-3.
001310 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Œ³–{Žc‚|‰ð–ñˆ—ŒŽ PIC S9(013) COMP-3.
001320 01  ‚b‚o‚e‚a‚t‚o‚O‚P|Á”ïÅŠz|‰ð–ñˆ—ŒŽ PIC S9(011) COMP-3.
001330 01  ‚b‚o‚e‚a‚t‚o‚O‚P|””ï—p|‰ð–ñˆ—ŒŽ PIC S9(013) COMP-3.
001340 01  ‚b‚o‚e‚a‚t‚o‚O‚P|•¨Œ‘ŠŽE‹æ•ª PIC  X(001).
001350 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K‘¹‹à‰ñŽû•û–@ PIC  X(001).
001360 01  ‚b‚o‚e‚a‚t‚o‚O‚P|“ü‹à“Ë‡‹æ•ª PIC S9(001) COMP-3.
001370 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‰¼Žó‹àÁŠˆ‰ñŽûŒû PIC S9(013) COMP-3.
001380 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒ_ƒ~[‚O‚O‚R PIC  X(002).
001390 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚P PIC S9(013) COMP-3.
001400 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚Q PIC S9(013) COMP-3.
001410 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚R PIC S9(013) COMP-3.
001420 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚S PIC S9(013) COMP-3.
001430 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚T PIC S9(013) COMP-3.
001440 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚U PIC S9(013) COMP-3.
001450 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚V PIC S9(013) COMP-3.
001460 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚W PIC S9(013) COMP-3.
001470 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚X PIC S9(013) COMP-3.
001480 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚c‚P‚O PIC S9(013) COMP-3.
001490 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚P PIC S9(013) COMP-3.
001500 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚Q PIC S9(013) COMP-3.
001510 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚R PIC S9(013) COMP-3.
001520 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚S PIC S9(013) COMP-3.
001530 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚T PIC S9(013) COMP-3.
001540 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚U PIC S9(013) COMP-3.
001550 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚V PIC S9(013) COMP-3.
001560 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚W PIC S9(013) COMP-3.
001570 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚X PIC S9(013) COMP-3.
001580 01  ‚b‚o‚e‚a‚t‚o‚O‚P|‹K’è‘¹Ž¸‹à‚b‚P‚O PIC S9(013) COMP-3.
001590 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒ_ƒ~[‚O‚O‚S PIC  X(030).
001600 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚c‚P PIC S9(013) COMP-3.
001610 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚c‚Q PIC S9(013) COMP-3.
001620 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚c‚R PIC S9(013) COMP-3.
001630 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚c‚S PIC S9(013) COMP-3.
001640 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚c‚T PIC S9(013) COMP-3.
001650 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚b‚P PIC S9(013) COMP-3.
001660 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚b‚Q PIC S9(013) COMP-3.
001670 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚b‚R PIC S9(013) COMP-3.
001680 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚b‚S PIC S9(013) COMP-3.
001690 01  ‚b‚o‚e‚a‚t‚o‚O‚P|”„‹p‘ã‹à‚b‚T PIC S9(013) COMP-3.
001700 01  ‚b‚o‚e‚a‚t‚o‚O‚P|ƒ_ƒ~[‚O‚O‚T PIC  X(030).
