000010************************************************
000020* ‰ð–ñ—š—ðŽ‘ŽYƒtƒ@ƒCƒ‹iŠî–{j(CPFKARIC01)
000030************************************************
000040 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‚j‚d‚x|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‚j‚d‚x|‰ð–ñ“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000060 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‚j‚d‚x|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000070 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‚j‚d‚x|‰ð–ñˆ—ƒR[ƒh PIC  X(001).
000080 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‚j‚d‚x|•¨Œ‚m‚n PIC S9(003) COMP-3.
000090 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‚j‚d‚x|‰ð–ñ‹æ•ª PIC  X(001).
000100 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œ_–ñ‚m‚n PIC  X(009).
000110 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000120 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ƒ†[ƒUƒR[ƒh PIC  X(008).
000130 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000140 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œ´Œ_–ñ PIC  X(001).
000150 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œp‘± PIC  X(001).
000160 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ÄƒŠ[ƒX PIC  X(001).
000170 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Š„•Š PIC  X(001).
000180 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Žè”—¿ PIC  X(001).
000190 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ƒtƒ@ƒNƒ^ƒŠƒ“ƒO PIC  X(001).
000200 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‹àÁ PIC  X(001).
000210 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Žx•¥•ÛØ PIC  X(001).
000220 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(005).
000230 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000240 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000250 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000260 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000270 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000280 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000290 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000300 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Žc‰¿Šz‡ŒvŠz PIC S9(013) COMP-3.
000310 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|•¨ŒŽ}”Ô” PIC S9(003) COMP-3.
000320 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|”—Ê‡Œv PIC S9(005) COMP-3.
000330 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|’P”N“xŒ_–ñ PIC  X(002).
000340 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000350 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ÂŒ ‹¦’²ƒR[ƒh PIC  X(002).
000360 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Žd“üÁ”ïÅŠz‡Œv PIC S9(013) COMP-3.
000370 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000380 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|âg‹c‹æ•ª PIC  X(001).
000390 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ÅI•¨Œ‚m‚n PIC S9(003) COMP-3.
000400 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Š²Ž–”ñŠ²Ž–‹æ•ª PIC  X(001).
000410 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‚n‚o‚d‚m‚b‚k‚n‚r‚d‹æ•ª PIC  X(001).
000420 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‰ñŽûŽè‡ PIC  X(001).
000430 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|”Û”F‹æ•ª PIC  X(001).
000440 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(033).
000450 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œ³Œ_–ñ‚m‚n PIC  X(009).
000460 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œ³ÅI•¨Œ‚m‚n PIC S9(003) COMP-3.
000470 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œ³Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000480 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|Œ³ƒ†[ƒUƒR[ƒh PIC  X(008).
000490 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000500 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000510 01  ‚b‚o‚e‚j‚`‚q‚h‚b‚O‚P|‹¤’Êî•ñ PIC  X(035).
