000010************************************************
000020* ‰ð–ñ—š—ðÂŒ ƒtƒ@ƒCƒ‹iŠî–{j(CPFKAIRD01)
000030************************************************
000040 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|‰ð–ñ‹æ•ª PIC  X(001).
000070 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|‰ð–ñ“ú.
000080 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|‰ð–ñ“ú|¢‹I PIC  X(001).
000090 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000100 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|¿‹ƒR[ƒh PIC  X(002).
000110 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ÄƒŠ[ƒXƒR[ƒh PIC  X(001).
000120 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ƒŒƒR[ƒh‹æ•ª PIC  X(002).
000130 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|‚j‚d‚xŒ_–ñ‚m‚n PIC  X(009).
000140 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000150 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ƒ†[ƒUƒR[ƒh PIC  X(008).
000160 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|’S“–ŽÒƒR[ƒh PIC  X(004).
000170 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Œ´Œ_–ñ PIC  X(001).
000180 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Œp‘±ƒŠ[ƒX PIC  X(001).
000190 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ÄƒŠ[ƒX PIC  X(001).
000200 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Š„•Š PIC  X(001).
000210 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Žè”—¿ PIC  X(001).
000220 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ƒtƒ@ƒNƒ^ƒŠƒ“ƒO PIC  X(001).
000230 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|‹àÁ PIC  X(001).
000240 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Žx•¥•ÛØ PIC  X(001).
000250 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ŒŸŽûWŒv•\‘ÎÛŠO‹æ•ª PIC  X(001).
000260 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000270 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000280 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|”Û”F‹æ•ª PIC  X(001).
000290 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(027).
000300 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Œ³Ž–‹ÆŠƒR[ƒh PIC  X(004).
000310 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|Œ³ƒ†[ƒUƒR[ƒh PIC  X(008).
000320 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ˆ—”NŒŽ“x|¢‹I PIC  X(001).
000330 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000340 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚P|‹¤’Êî•ñ PIC  X(035).
