000010************************************************
000020* —¬“®‰»—pÂŒ Žc‚ƒtƒ@ƒCƒ‹(CPFRDSAI)
000030************************************************
000040 01  ‚b‚o‚e‚q‚c‚r‚`‚h|—¬“®‰»‚h‚c PIC  X(007).
000050 01  ‚b‚o‚e‚q‚c‚r‚`‚h|Œ_–ñ”Ô† PIC S9(009) COMP-3.
000060 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000070 01  ‚b‚o‚e‚q‚c‚r‚`‚h|‰ð–ñ‹æ•ª PIC  X(001).
000080 01  ‚b‚o‚e‚q‚c‚r‚`‚h|‰ð–ñ“ú|¢‹I‹æ•ª PIC  X(001).
000090 01  ‚b‚o‚e‚q‚c‚r‚`‚h|‰ð–ñ“ú|”N PIC  X(002).
000100 01  ‚b‚o‚e‚q‚c‚r‚`‚h|‰ð–ñ“ú|ŒŽ PIC  X(002).
000110 01  ‚b‚o‚e‚q‚c‚r‚`‚h|‰ð–ñ“ú|“ú PIC  X(002).
000120 01  ‚b‚o‚e‚q‚c‚r‚`‚h|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000130 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ƒtƒ@ƒCƒiƒ“ƒXŠJŽn|¢‹I‹æ•ª PIC X(001).
000140 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ƒtƒ@ƒCƒiƒ“ƒXŠJŽn|”N PIC  X(002).
000150 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ƒtƒ@ƒCƒiƒ“ƒXŠJŽn|ŒŽ PIC  X(002).
000160 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ƒtƒ@ƒCƒiƒ“ƒXI—¹|¢‹I‹æ•ª PIC X(001).
000170 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ƒtƒ@ƒCƒiƒ“ƒXI—¹|”N PIC  X(002).
000180 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ƒtƒ@ƒCƒiƒ“ƒXI—¹|ŒŽ PIC  X(002).
000190 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ƒtƒ@ƒCƒiƒ“ƒXŠúŠÔ PIC S9(003) COMP-3.
000200 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ÂŒ Žc‚ PIC S9(013) COMP-3.
000210 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ˆê•”‰ð–ñ‹àŠz PIC S9(013) COMP-3.
000220 01  ‚b‚o‚e‚q‚c‚r‚`‚h|ƒ_ƒ~[‚O‚O‚P PIC  X(046).
