000010************************************************
000020* (CPM_CPMMST)
000030************************************************
000040 01  CPM_CPMMST-CTLNUM PIC  X(006).
000050 01  CPM_CPMMST-CLTCOD PIC  X(007).
000060 01  CPM_CPMMST-CLTNAM PIC  X(040).
000070 01  CPM_CPMMST-REFNUM PIC  X(010).
000080 01  CPM_CPMMST-BILNUM PIC  X(007).
000090 01  CPM_CPMMST-CNTDAY PIC  X(008).
000100 01  CPM_CPMMST-BORDAY PIC  X(008).
000110 01  CPM_CPMMST-DUEDAY PIC  X(008).
000120 01  CPM_CPMMST-HLDTYP PIC  X(001).
000130 01  CPM_CPMMST-BORTYP PIC  X(001).
000140 01  CPM_CPMMST-TRMTYP PIC  X(001).
000150 01  CPM_CPMMST-FIXFLT PIC  X(001).
000160 01  CPM_CPMMST-BEFAFT PIC  X(001).
000170 01  CPM_CPMMST-YERDAY PIC  X(001).
000180 01  CPM_CPMMST-DAYBAS PIC  X(001).
000190 01  CPM_CPMMST-FRATYP PIC  X(001).
000200 01  CPM_CPMMST-SALTYP PIC  X(001).
000210 01  CPM_CPMMST-OBJTYP PIC  X(001).
000220 01  CPM_CPMMST-ICGTYP PIC  X(001).
000230 01  CPM_CPMMST-HOLSFT PIC  X(001).
000240 01  CPM_CPMMST-DUECAL PIC  X(001).
000250 01  CPM_CPMMST-MTGTYP PIC  X(001).
000260 01  CPM_CPMMST-CPYDAY PIC  X(002).
000270 01  CPM_CPMMST-ICGDAY PIC  X(008).
000280 01  CPM_CPMMST-IPYDAY PIC  X(008).
000290 01  CPM_CPMMST-FSTPAY PIC  X(008).
000300 01  CPM_CPMMST-IPYCYC PIC  X(002).
000310 01  CPM_CPMMST-CPYCYC PIC  X(002).
000320 01  CPM_CPMMST-GAPTYP PIC  X(001).
000330 01  CPM_CPMMST-REMARK PIC  X(040).
000340 01  CPM_CPMMST-CREDEP PIC  X(001).
000350 01  CPM_CPMMST-CRENUM PIC  X(007).
000360 01  CPM_CPMMST-DEBBNK PIC  X(004).
000370 01  CPM_CPMMST-DEBBRC PIC  X(003).
000380 01  CPM_CPMMST-DEBDEP PIC  X(001).
000390 01  CPM_CPMMST-DEBNUM PIC  X(007).
000400 01  CPM_CPMMST-DAYCNT PIC S9(004) COMP-3.
000410 01  CPM_CPMMST-BORCAP PIC S9(013) COMP-3.
000420 01  CPM_CPMMST-INTRAT PIC S9(002)V9(6) COMP-3.
000430 01  CPM_CPMMST-INTRST PIC S9(013) COMP-3.
000440 01  CPM_CPMMST-ADDDAY PIC  X(008).
000450 01  CPM_CPMMST-ADDTIM PIC  X(006).
000460 01  CPM_CPMMST-ADDPSN PIC  X(004).
000470 01  CPM_CPMMST-MODDAY PIC  X(008).
000480 01  CPM_CPMMST-MODTIM PIC  X(006).
000490 01  CPM_CPMMST-MODPSN PIC  X(004).
