000010************************************************
000020* (CPM_ALMDAT)
000030************************************************
000040 01  CPM_ALMDAT-GENREC PIC  X(120).
