000010************************************************
000020* (CPM_MODLST)
000030************************************************
000040 01  CPM_MODLST-JOBTYP PIC  X(001).
000050 01  CPM_MODLST-REGTIM PIC  X(006).
000060 01  CPM_MODLST-CTLNUM PIC  X(006).
000070 01  CPM_MODLST-CLTCOD PIC  X(007).
000080 01  CPM_MODLST-CLTNAM PIC  X(040).
000090 01  CPM_MODLST-REFNUM PIC  X(010).
000100 01  CPM_MODLST-BILNUM PIC  X(007).
000110 01  CPM_MODLST-CNTDAY PIC  X(008).
000120 01  CPM_MODLST-BORDAY PIC  X(008).
000130 01  CPM_MODLST-DUEDAY PIC  X(008).
000140 01  CPM_MODLST-HLDTYP PIC  X(001).
000150 01  CPM_MODLST-BORTYP PIC  X(001).
000160 01  CPM_MODLST-TRMTYP PIC  X(001).
000170 01  CPM_MODLST-FIXFLT PIC  X(001).
000180 01  CPM_MODLST-BEFAFT PIC  X(001).
000190 01  CPM_MODLST-YERDAY PIC  X(001).
000200 01  CPM_MODLST-DAYBAS PIC  X(001).
000210 01  CPM_MODLST-FRATYP PIC  X(001).
000220 01  CPM_MODLST-SALTYP PIC  X(001).
000230 01  CPM_MODLST-OBJTYP PIC  X(001).
000240 01  CPM_MODLST-ICGTYP PIC  X(001).
000250 01  CPM_MODLST-HOLSFT PIC  X(001).
000260 01  CPM_MODLST-DUECAL PIC  X(001).
000270 01  CPM_MODLST-MTGTYP PIC  X(001).
000280 01  CPM_MODLST-CPYDAY PIC  X(002).
000290 01  CPM_MODLST-ICGDAY PIC  X(008).
000300 01  CPM_MODLST-IPYDAY PIC  X(008).
000310 01  CPM_MODLST-FSTPAY PIC  X(008).
000320 01  CPM_MODLST-IPYCYC PIC  X(002).
000330 01  CPM_MODLST-CPYCYC PIC  X(002).
000340 01  CPM_MODLST-GAPTYP PIC  X(001).
000350 01  CPM_MODLST-REMARK PIC  X(040).
000360 01  CPM_MODLST-CREDEP PIC  X(001).
000370 01  CPM_MODLST-CRENUM PIC  X(007).
000380 01  CPM_MODLST-DEBBNK PIC  X(004).
000390 01  CPM_MODLST-DEBBRC PIC  X(003).
000400 01  CPM_MODLST-DEBDEP PIC  X(001).
000410 01  CPM_MODLST-DEBNUM PIC  X(007).
000420 01  CPM_MODLST-DAYCNT PIC S9(004) COMP-3.
000430 01  CPM_MODLST-BORCAP PIC S9(013) COMP-3.
000440 01  CPM_MODLST-INTRAT PIC S9(002)V9(6) COMP-3.
000450 01  CPM_MODLST-INTRST PIC S9(013) COMP-3.
000460 01  CPM_MODLST-CLTCOD_O PIC  X(007).
000470 01  CPM_MODLST-CLTNAM_O PIC  X(040).
000480 01  CPM_MODLST-REFNUM_O PIC  X(010).
000490 01  CPM_MODLST-BILNUM_O PIC  X(007).
000500 01  CPM_MODLST-CNTDAY_O PIC  X(008).
000510 01  CPM_MODLST-BORDAY_O PIC  X(008).
000520 01  CPM_MODLST-DUEDAY_O PIC  X(008).
000530 01  CPM_MODLST-HLDTYP_O PIC  X(001).
000540 01  CPM_MODLST-BORTYP_O PIC  X(001).
000550 01  CPM_MODLST-TRMTYP_O PIC  X(001).
000560 01  CPM_MODLST-FIXFLT_O PIC  X(001).
000570 01  CPM_MODLST-BEFAFT_O PIC  X(001).
000580 01  CPM_MODLST-YERDAY_O PIC  X(001).
000590 01  CPM_MODLST-DAYBAS_O PIC  X(001).
000600 01  CPM_MODLST-FRATYP_O PIC  X(001).
000610 01  CPM_MODLST-SALTYP_O PIC  X(001).
000620 01  CPM_MODLST-OBJTYP_O PIC  X(001).
000630 01  CPM_MODLST-ICGTYP_O PIC  X(001).
000640 01  CPM_MODLST-HOLSFT_O PIC  X(001).
000650 01  CPM_MODLST-DUECAL_O PIC  X(001).
000660 01  CPM_MODLST-MTGTYP_O PIC  X(001).
000670 01  CPM_MODLST-DAYCNT_O PIC S9(004) COMP-3.
000680 01  CPM_MODLST-BORCAP_O PIC S9(013) COMP-3.
000690 01  CPM_MODLST-INTRAT_O PIC S9(002)V9(6) COMP-3.
000700 01  CPM_MODLST-INTRST_O PIC S9(013) COMP-3.
000710 01  CPM_MODLST-CLTCOD_M PIC  X(001).
000720 01  CPM_MODLST-CLTNAM_M PIC  X(001).
000730 01  CPM_MODLST-REFNUM_M PIC  X(001).
000740 01  CPM_MODLST-BILNUM_M PIC  X(001).
000750 01  CPM_MODLST-CNTDAY_M PIC  X(001).
000760 01  CPM_MODLST-BORDAY_M PIC  X(001).
000770 01  CPM_MODLST-DUEDAY_M PIC  X(001).
000780 01  CPM_MODLST-HLDTYP_M PIC  X(001).
000790 01  CPM_MODLST-BORTYP_M PIC  X(001).
000800 01  CPM_MODLST-TRMTYP_M PIC  X(001).
000810 01  CPM_MODLST-FIXFLT_M PIC  X(001).
000820 01  CPM_MODLST-BEFAFT_M PIC  X(001).
000830 01  CPM_MODLST-YERDAY_M PIC  X(001).
000840 01  CPM_MODLST-DAYBAS_M PIC  X(001).
000850 01  CPM_MODLST-FRATYP_M PIC  X(001).
000860 01  CPM_MODLST-SALTYP_M PIC  X(001).
000870 01  CPM_MODLST-OBJTYP_M PIC  X(001).
000880 01  CPM_MODLST-ICGTYP_M PIC  X(001).
000890 01  CPM_MODLST-HOLSFT_M PIC  X(001).
000900 01  CPM_MODLST-DUECAL_M PIC  X(001).
000910 01  CPM_MODLST-MTGTYP_M PIC  X(001).
000920 01  CPM_MODLST-DAYCNT_M PIC  X(001).
000930 01  CPM_MODLST-BORCAP_M PIC  X(001).
000940 01  CPM_MODLST-INTRAT_M PIC  X(001).
000950 01  CPM_MODLST-INTRST_M PIC  X(001).
