      *****************************************************************
      *   ÅVŽæˆøæƒR[ƒh(D012STK_TBL)
      *****************************************************************
       01  ÅVŽæˆøæƒR[ƒh.
           03  ‚c‚O‚P‚Q|ƒT[ƒo”Ô†  PIC  X(002).
           03  ‚c‚O‚P‚Q|ÅVŽæˆøæƒR[ƒh
                                     PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚O‚P‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚P‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚P‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
