      *****************************************************************
      *   ŽæˆøæŽc‚î•ñŽí—Þ•Ê—š—ðƒ}ƒXƒ^(D018TZR_TBL)
      *****************************************************************
       01  ŽæˆøæŽc‚î•ñŽí—Þ•Ê—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚P‚W|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚W|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚P‚W|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚O‚P‚W|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚W|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚P‚W|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚P‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚P‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
