      *****************************************************************
      *   ƒOƒ‹[ƒvŽc‚î•ñ—š—ðƒ}ƒXƒ^(D028GZJ_TBL)
      *****************************************************************
       01  ƒOƒ‹[ƒvŽc‚î•ñ—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚W|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚W|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚Q‚W|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|•ÛØŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|–¢ÁžŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚W|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
