      *****************************************************************
      *   Œ¸‰¿ž‹p—¦ƒ}ƒXƒ^(D034KSR_TBL)
      *****************************************************************
       01  Œ¸‰¿ž‹p—¦ƒ}ƒXƒ^.
           03  ‚c‚O‚R‚S|‘Ï—p”N”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚R‚S|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚S|ŒÅ’èŽ‘ŽYž‹p—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚O‚R‚S|XV“úŽž    PIC  X(016).
           03  ‚c‚O‚R‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚R‚S|–@’è’èŠzž‹p—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚O‚R‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚R‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚R‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚R‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚S|XVŽžŠÔ    PIC  X(008).
