      *****************************************************************
      *   “ü‹àÁžŽd–ó’ZkƒR[ƒhƒ}ƒXƒ^(D051NKT_TBL)
      *****************************************************************
       01  “ü‹àÁžŽd–ó’ZkƒR[ƒhƒ}ƒXƒ^.
           03  ‚c‚O‚T‚P|ƒf[ƒ^‹æ•ª  PIC  X(001).
           03  ‚c‚O‚T‚P|’ZkƒR[ƒh  PIC  X(002).
           03  ‚c‚O‚T‚P|Žd–óƒR[ƒh  PIC  X(006).
           03  ‚c‚O‚T‚P|–¼Ì        PIC  X(040).
           03  ‚c‚O‚T‚P|—p“r        PIC  X(200).
           03  ‚c‚O‚T‚P|Žg—pŽí•Ê    PIC  X(001).
           03  ‚c‚O‚T‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚P|“o˜^ŽÒ      PIC  X(008).
           03  ‚c‚O‚T‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚T‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
