      *****************************************************************
      *   ŒÂl§ŒÀƒ}ƒXƒ^(D066KJS_TBL)
      *****************************************************************
       01  ŒÂl§ŒÀƒ}ƒXƒ^.
           03  ‚c‚O‚U‚U|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚U|Œ ŒÀƒŒƒxƒ‹  PIC  X(003).
           03  ‚c‚O‚U‚U|ƒƒjƒ…[ƒ{ƒ^ƒ“‚h‚c
                                     PIC  X(008).
           03  ‚c‚O‚U‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚U‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚U|XVŽÒ      PIC  X(008).
