      *****************************************************************
      *   ‘ãsŽÒƒ}ƒXƒ^(D067DKO_TBL)
      *****************************************************************
       01  ‘ãsŽÒƒ}ƒXƒ^.
           03  ‚c‚O‚U‚V|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚V|‘ãs’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚V|—š—ð”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚U‚V|‘ãsŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚U‚V|‘ãsI—¹”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚U‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚U‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚V|XVŽÒ      PIC  X(008).
