      *****************************************************************
      *   ‘ãs‹–‰Âƒ}ƒXƒ^(D068DKK_TBL)
      *****************************************************************
       01  ‘ãs‹–‰Âƒ}ƒXƒ^.
           03  ‚c‚O‚U‚W|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚W|‘ãs’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚W|—š—ð”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚U‚W|ƒƒjƒ…[ƒ{ƒ^ƒ“‚h‚c
                                     PIC  X(008).
           03  ‚c‚O‚U‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚U‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚W|XVŽÒ      PIC  X(008).
