      *****************************************************************
      *   Œ ŒÀW–ñƒe[ƒuƒ‹(D069KNS_TBL)
      *****************************************************************
       01  Œ ŒÀW–ñƒe[ƒuƒ‹.
           03  ‚c‚O‚U‚X|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚X|ƒƒjƒ…[ƒ{ƒ^ƒ“‚h‚c
                                     PIC  X(008).
           03  ‚c‚O‚U‚X|ŽÀsŒ ŒÀ—L–³ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚U‚X|ƒƒjƒ…[‰æ–Ê‚h‚c
                                     PIC  X(008).
           03  ‚c‚O‚U‚X|ƒ^ƒO‚h‚c    PIC  X(003).
           03  ‚c‚O‚U‚X|Æ‰ïXV‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚U‚X|’ñ‹ŸŽžŠÔ”»’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚U‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚U‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚X|XVŽÒ      PIC  X(008).
