      *****************************************************************
      *   •”“Xƒ}ƒXƒ^(D06BKA_TBL)
      *****************************************************************
       01  •”“Xƒ}ƒXƒ^.
           03  ‚c‚O‚U|•”‰ÛƒR[ƒh    PIC  X(004).
           03  ‚c‚O‚U|ƒT[ƒo”Ô†    PIC  X(002).
           03  ‚c‚O‚U|•”‰Û–¼Ì      PIC  X(040).
           03  ‚c‚O‚U|XV“úŽž      PIC  X(016).
           03  ‚c‚O‚U|XVŽÒ        PIC  X(008).
           03  ‚c‚O‚U|—X•Ö”Ô†      PIC  X(007).
           03  ‚c‚O‚U|Žs’¬‘ºƒR[ƒh  PIC  X(011).
           03  ‚c‚O‚U|ZŠ‚Q        PIC  X(060).
           03  ‚c‚O‚U|ZŠ‚R        PIC  X(060).
           03  ‚c‚O‚U|“d˜b”Ô†      PIC  X(015).
           03  ‚c‚O‚U|•”Š’·–¼      PIC  X(020).
           03  ‚c‚O‚U|–ðE‚P        PIC  X(030).
           03  ‚c‚O‚U|–ðE‚Q        PIC  X(030).
           03  ‚c‚O‚U|‰ïŒv•”–åƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚U|”„ãŒvã‹æ•ª  PIC  X(001).
           03  ‚c‚O‚U|ƒRƒ“ƒX[ƒ}–@l‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U|‹Æ–±‹æ•ª      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚U|•”‰ÛƒpƒXƒ[ƒh
                                     PIC  X(015).
           03  ‚c‚O‚U|ƒCƒ“ƒvƒbƒg‹æ•ª
                                     PIC  X(002).
           03  ‚c‚O‚U|‚e‚`‚w”Ô†    PIC  X(015).
           03  ‚c‚O‚U|•”‰Û–¼ÌƒJƒi  PIC  X(040).
           03  ‚c‚O‚U|•”‰Û—ªÌ      PIC  X(016).
           03  ‚c‚O‚U|•”‰Û—ªÌƒJƒi  PIC  X(012).
           03  ‚c‚O‚U|ZŠ‚P        PIC  X(040).
           03  ‚c‚O‚U|‘M”Ô†      PIC  X(002).
           03  ‚c‚O‚U|“K—p”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚U|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚U|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚U|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚O‚U|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚U|XVŽžŠÔ      PIC  X(008).
