      *****************************************************************
      *   ƒWƒ‡ƒ‚Žx“XƒR[ƒhƒ}ƒXƒ^(D075JMS_TBL)
      *****************************************************************
       01  ƒWƒ‡ƒ‚Žx“XƒR[ƒhƒ}ƒXƒ^.
           03  ‚c‚O‚V‚T|ƒWƒ‡ƒ‚Žx“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚V‚T|ƒWƒ‡ƒ‚Žx“X–¼
                                     PIC  X(060).
           03  ‚c‚O‚V‚T|ƒWƒ‡ƒ‚Žx“X–¼ƒJƒi
                                     PIC  X(030).
           03  ‚c‚O‚V‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚V‚T|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚V‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚V‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚V‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
