      *****************************************************************
      *   ”[•tæƒR[ƒh•ÏŠ·ƒ}ƒXƒ^(D082NFH_TBL)
      *****************************************************************
       01  ”[•tæƒR[ƒh•ÏŠ·ƒ}ƒXƒ^.
           03  ‚c‚O‚W‚Q|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚O‚W‚Q|æ•û”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚W‚Q|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚Q|”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚W‚Q|Ý’uêŠ–¼  PIC  X(020).
           03  ‚c‚O‚W‚Q|Ý’uêŠ–¼ƒJƒi
                                     PIC  X(020).
           03  ‚c‚O‚W‚Q|Ý’uêŠ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚O‚W‚Q|Ý’uêŠZŠ
                                     PIC  X(040).
           03  ‚c‚O‚W‚Q|Ý’uêŠZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚O‚W‚Q|Ý’uêŠZŠ‚R
                                     PIC  X(060).
           03  ‚c‚O‚W‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
