      *****************************************************************
      *   Žæˆøæ‹ÆÑà–±ƒ}ƒXƒ^(D090TRG_TBL)
      *****************************************************************
       01  Žæˆøæ‹ÆÑà–±ƒ}ƒXƒ^.
           03  ‚c‚O‚X‚O|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚X‚O|ŒˆŽZ”NŒŽ    PIC  X(006).
           03  ‚c‚O‚X‚O|”„ã‚      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|‰c‹Æ—˜‰v    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|Œoí—˜‰v    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|ÅˆøŒã—˜‰v  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|”z“–—¦      PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|Ž©ŒÈŽ‘–{”ä—¦
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|\Š“¾    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|Ž©ŒÈŽ‘–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|‘Ž‘ŽY      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|‘Â–±      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|Œ»—a‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|‘Â–±žŠÒ”N”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|Š—v‰^“]Ž‘‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|ƒtƒŠ[ƒLƒƒƒbƒVƒ…ƒtƒ[
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚O|î•ñŒ³‹æ•ª  PIC  X(001).
           03  ‚c‚O‚X‚O|î•ñŒ³ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚X‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚X‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
