      *****************************************************************
      *   Žæˆøæ—v€ƒ}ƒXƒ^(D091TRY_TBL)
      *****************************************************************
       01  Žæˆøæ—v€ƒ}ƒXƒ^.
           03  ‚c‚O‚X‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚X‚P|Š”Žå–¼‚Q    PIC  X(020).
           03  ‚c‚O‚X‚P|ŽŠ””‚Q    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|ŽŠ”—¦‚Q    PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Š”Žå–¼‚R    PIC  X(020).
           03  ‚c‚O‚X‚P|ŽŠ””‚R    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|ŽŠ”—¦‚R    PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Š”Žå–¼‚S    PIC  X(020).
           03  ‚c‚O‚X‚P|ŽŠ””‚S    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|ŽŠ”—¦‚S    PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Š”Žå–¼‚T    PIC  X(020).
           03  ‚c‚O‚X‚P|ŽŠ””‚T    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|ŽŠ”—¦‚T    PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|”Ì”„æ‚Q    PIC  X(030).
           03  ‚c‚O‚X‚P|”Ì”„æ‚R    PIC  X(030).
           03  ‚c‚O‚X‚P|”Ì”„æ‚S    PIC  X(030).
           03  ‚c‚O‚X‚P|”Ì”„æ‚T    PIC  X(030).
           03  ‚c‚O‚X‚P|Žd“üæ‚Q    PIC  X(030).
           03  ‚c‚O‚X‚P|Žd“üæ‚R    PIC  X(030).
           03  ‚c‚O‚X‚P|Žd“üæ‚S    PIC  X(030).
           03  ‚c‚O‚X‚P|Žd“üæ‚T    PIC  X(030).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ–¼‚P
                                     PIC  X(040).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ–¼‚Q
                                     PIC  X(040).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ–¼‚R
                                     PIC  X(040).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ–¼‚S
                                     PIC  X(040).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐî•ñ”NŒŽ‚P
                                     PIC  X(006).
           03  ‚c‚O‚X‚P|“–ŽÐŽc‚‚P  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|“–ŽÐƒVƒFƒA‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚P‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐƒVƒFƒA‚P‚P
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚P‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐƒVƒFƒA‚P‚Q
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚P‚R
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐƒVƒFƒA‚P‚R
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚P‚S
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐƒVƒFƒA‚P‚S
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‚»‚Ì‘¼Žc‚‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‚»‚Ì‘¼ƒVƒFƒA‚P
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐî•ñ”NŒŽ‚Q
                                     PIC  X(006).
           03  ‚c‚O‚X‚P|“–ŽÐŽc‚‚Q  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚Q‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚Q‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚Q‚R
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚Q‚S
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‚»‚Ì‘¼Žc‚‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐî•ñ”NŒŽ‚R
                                     PIC  X(006).
           03  ‚c‚O‚X‚P|“–ŽÐŽc‚‚R  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚R‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚R‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚R‚R
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚R‚S
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‚»‚Ì‘¼Žc‚‚R
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐî•ñ”NŒŽ‚S
                                     PIC  X(006).
           03  ‚c‚O‚X‚P|“–ŽÐŽc‚‚S  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚S‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚S‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚S‚R
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐŽc‚‚S‚S
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‚»‚Ì‘¼Žc‚‚S
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ“–ŽÐ”õl
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ”õl‚P
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ”õl‚Q
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ”õl‚R
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‰ïŽÐ”õl‚S
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‚»‚Ì‘¼”õl
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|—˜—pƒŠ[ƒX‡Œv”õl
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|ƒŠ[ƒX‰ïŽÐŽæˆøó‹µ
                                     PIC  X(120).
           03  ‚c‚O‚X‚P|Œo‰cw–ðE‚P
                                     PIC  X(010).
           03  ‚c‚O‚X‚P|Œo‰cwŽ–¼‚P
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Œo‰cwogæ“™‚P
                                     PIC  X(060).
           03  ‚c‚O‚X‚P|Œo‰cw–ðE‚Q
                                     PIC  X(010).
           03  ‚c‚O‚X‚P|Œo‰cwŽ–¼‚Q
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Œo‰cwogæ“™‚Q
                                     PIC  X(060).
           03  ‚c‚O‚X‚P|Œo‰cw–ðE‚R
                                     PIC  X(010).
           03  ‚c‚O‚X‚P|Œo‰cwŽ–¼‚R
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Œo‰cwogæ“™‚R
                                     PIC  X(060).
           03  ‚c‚O‚X‚P|Œo‰cw–ðE‚S
                                     PIC  X(010).
           03  ‚c‚O‚X‚P|Œo‰cwŽ–¼‚S
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Œo‰cwogæ“™‚S
                                     PIC  X(060).
           03  ‚c‚O‚X‚P|Œo‰cw–ðE‚T
                                     PIC  X(010).
           03  ‚c‚O‚X‚P|Œo‰cwŽ–¼‚T
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Œo‰cwogæ“™‚T
                                     PIC  X(060).
           03  ‚c‚O‚X‚P|ŠÖ˜A‰ïŽÐ‚¨‚æ‚ÑƒOƒ‹[ƒv
                                     PIC  X(100).
           03  ‚c‚O‚X‚P|”„ã\¬‚P  PIC  X(050).
           03  ‚c‚O‚X‚P|”„ã\¬ƒVƒFƒA‚P
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|”„ã\¬‚Q  PIC  X(050).
           03  ‚c‚O‚X‚P|”„ã\¬ƒVƒFƒA‚Q
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|”„ã\¬‚R  PIC  X(050).
           03  ‚c‚O‚X‚P|”„ã\¬ƒVƒFƒA‚R
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|”„ã\¬‚S  PIC  X(050).
           03  ‚c‚O‚X‚P|”„ã\¬ƒVƒFƒA‚S
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|”„ã\¬‚T  PIC  X(050).
           03  ‚c‚O‚X‚P|”„ã\¬ƒVƒFƒA‚T
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Ž–‹Æ‚Ì“ÁF  PIC  X(200).
           03  ‚c‚O‚X‚P|ŒoíŒoŒ±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚P|‹ÆŠEŒoŒ±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚P|Œo‰c”\—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚P|“¾ˆÓ•ª–ì‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚P|‘ã•\ŽÒog“™
                                     PIC  X(160).
           03  ‚c‚O‚X‚P|‘ã•\ŽÒŽ©‘î—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚O‚X‚P|‘ã•\ŽÒŽ©‘îZŠ‚P
                                     PIC  X(060).
           03  ‚c‚O‚X‚P|‘ã•\ŽÒŽ©‘îZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚O‚X‚P|‘ã•\ŽÒŽ©‘îZŠ‚R
                                     PIC  X(060).
           03  ‚c‚O‚X‚P|‘ã•\ŽÒŽ©‘î“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚O‚X‚P|Œo‰cŽÒ“à—e  PIC  X(160).
           03  ‚c‚O‚X‚P|‹âsŽc‚î•ñ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚O‚X‚P|Žæˆø‹âsŽc‚‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âsƒVƒFƒA‚P
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âs–¼‚Q
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Žæˆø‹âsŽc‚‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âsƒVƒFƒA‚Q
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âs–¼‚R
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Žæˆø‹âsŽc‚‚R
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âsƒVƒFƒA‚R
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âs–¼‚S
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Žæˆø‹âsŽc‚‚S
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âsƒVƒFƒA‚S
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âs–¼‚T
                                     PIC  X(020).
           03  ‚c‚O‚X‚P|Žæˆø‹âsŽc‚‚T
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|Žæˆø‹âsƒVƒFƒA‚T
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|‚»‚Ì‘¼‹âsŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|‚»‚Ì‘¼‹âsƒVƒFƒA
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚P|ƒƒCƒ“sŠ”Ž®Ž‡‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚P|ƒƒCƒ“s–ðˆõ”hŒ­‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚P|ƒƒCƒ“s‘o•ûŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚P|ƒƒCƒ“sŠÖŒW“à—e
                                     PIC  X(160).
           03  ‚c‚O‚X‚P|‚»‚Ì‘¼‹âsŽæˆøó‹µ
                                     PIC  X(160).
           03  ‚c‚O‚X‚P|“–ŠúŒˆŽZó‹µ“à—e
                                     PIC  X(200).
           03  ‚c‚O‚X‚P|—ˆŠúŒˆŽZŒ©’Ê‚µ“à—e
                                     PIC  X(200).
           03  ‚c‚O‚X‚P|‘‡ŠŒ©“à—e
                                     PIC  X(200).
           03  ‚c‚O‚X‚P|ÂŒ •Û‘Só‹µ“à—e
                                     PIC  X(200).
           03  ‚c‚O‚X‚P|“Á‹LŽ–€“à—e
                                     PIC  X(160).
           03  ‚c‚O‚X‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚X‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚X‚P|‘ã•\ŽÒŽ©‘îZŠƒR[ƒh
                                     PIC  X(011).
