      *****************************************************************
      *   •ïŠ‡ˆÙ—á\¿ƒ}ƒXƒ^(D099HKS_TBL)
      *****************************************************************
       01  •ïŠ‡ˆÙ—á\¿ƒ}ƒXƒ^.
           03  ‚c‚O‚X‚X|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚X‚X|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚X‚X|³”F•”    PIC  X(004).
           03  ‚c‚O‚X‚X|ðŒ˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚X‚X|•ïŠ‡ˆÙ—áðŒƒR[ƒh
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚X|ƒRƒƒ“ƒg    PIC  X(040).
           03  ‚c‚O‚X‚X|³”F“ú      PIC  X(008).
           03  ‚c‚O‚X‚X|“K—pŠúŒÀ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚O‚X‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚X‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
