      *****************************************************************
      *   •ÛØlŽæˆøæ(D102HOT_TBL)
      *****************************************************************
       01  •ÛØlŽæˆøæ.
           03  ‚c‚P‚O‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚O‚Q|•ÛØlŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚O‚Q|•ÛØlŠÖŒW‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚O‚Q|“ü—Í‡      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚O‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚O‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚O‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚O‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚O‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚O‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚O‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
