      *****************************************************************
      *   •ÛŒ¯‹à‘—‹àæƒ}ƒXƒ^(D114HSK_TBL)
      *****************************************************************
       01  •ÛŒ¯‹à‘—‹àæƒ}ƒXƒ^.
           03  ‚c‚P‚P‚S|‘—‹àæƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚P‚P‚S|‘—‹àæ–¼    PIC  X(080).
           03  ‚c‚P‚P‚S|‘—‹àæ–¼—ªÌ
                                     PIC  X(010).
           03  ‚c‚P‚P‚S|‘—‹àæ–¼ƒJƒi
                                     PIC  X(025).
           03  ‚c‚P‚P‚S|‘—‹àæ–¼—ªÌƒJƒi
                                     PIC  X(012).
           03  ‚c‚P‚P‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚P‚P‚S|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚P‚P‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚P‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚P‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚P‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚P‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
