      *****************************************************************
      *   Á”ïÅ—¦ƒ}ƒXƒ^(D11SHR_TBL)
      *****************************************************************
       01  Á”ïÅ—¦ƒ}ƒXƒ^.
           03  ‚c‚P‚P|Á”ïÅ—¦‹æ•ª  PIC  X(002).
           03  ‚c‚P‚P|“K—pŠJŽn“ú    PIC  X(008).
           03  ‚c‚P‚P|Á”ïÅ—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚P‚P|XV“úŽž      PIC  X(016).
           03  ‚c‚P‚P|XVŽÒ        PIC  X(008).
           03  ‚c‚P‚P|Å—¦‹æ•ª      PIC  X(002).
           03  ‚c‚P‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚P|Œo‰ß‘[’u“K—pŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚P‚P|Œo‰ß‘[’u“K—pI—¹“ú
                                     PIC  X(008).
           03  ‚c‚P‚P|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚P|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚P‚P|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚P‚P|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚P|XVŽžŠÔ      PIC  X(008).
