      *****************************************************************
      *   Ž‘ŽYŽí—Þ”»’èƒR[ƒhƒ}ƒXƒ^(D121SHK_TBL)
      *****************************************************************
       01  Ž‘ŽYŽí—Þ”»’èƒR[ƒhƒ}ƒXƒ^.
           03  ‚c‚P‚Q‚P|Ž‘ŽYŽí—Þ    PIC  X(007).
           03  ‚c‚P‚Q‚P|Ž‘ŽYŽí—Þ”»’è‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚Q‚P|Ž‘ŽYŽí—Þ”»’èƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚P‚Q‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚Q‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚Q‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚Q‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚Q‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚Q‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚Q‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
