      *****************************************************************
      *   ŽdŒüŒûÀƒ}ƒXƒ^(D132SKO_TBL)
      *****************************************************************
       01  ŽdŒüŒûÀƒ}ƒXƒ^.
           03  ‚c‚P‚R‚Q|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚P‚R‚Q|•”“XƒR[ƒh  PIC  X(004).
           03  ‚c‚P‚R‚Q|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚P‚R‚Q|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚P‚R‚Q|—a‹àŽí—Þ    PIC  X(001).
           03  ‚c‚P‚R‚Q|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚P‚R‚Q|‹âs–¼      PIC  X(040).
           03  ‚c‚P‚R‚Q|Žx“X–¼      PIC  X(040).
           03  ‚c‚P‚R‚Q|–¼‹`l      PIC  X(030).
           03  ‚c‚P‚R‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚R‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚R‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚R‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚R‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚R‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚R‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
