      *****************************************************************
      *   “ü‹àUžlÆ‰ïƒ}ƒXƒ^(D14NYS_TBL)
      *****************************************************************
       01  “ü‹àUžlÆ‰ïƒ}ƒXƒ^.
           03  ‚c‚P‚S|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚P‚S|¿‹æƒR[ƒh  PIC  X(005).
           03  ‚c‚P‚S|˜A”Ô          PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚S|ˆêŠ‡“ü‹àƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚P‚S|Už–¼‹`l–¼  PIC  X(048).
           03  ‚c‚P‚S|ŽdŒü‹âs–¼    PIC  X(015).
           03  ‚c‚P‚S|ŽdŒüŽx“X–¼    PIC  X(015).
           03  ‚c‚P‚S|ÅVŽg—p“ú    PIC  X(008).
           03  ‚c‚P‚S|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚S|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚P‚S|XVŽÒ        PIC  X(008).
           03  ‚c‚P‚S|“Ç‘Ö–¼        PIC  X(048).
           03  ‚c‚P‚S|UžŽè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚S|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚S|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚P‚S|“o˜^’S“–ŽÒ    PIC  X(008).
