      *****************************************************************
      *   ÇaÇsÇléxé–É}ÉXÉ^(D186BTM_TBL)
      *****************************************************************
       01  ÇaÇsÇléxé–É}ÉXÉ^.
           03  ÇcÇPÇWÇUÅ|éxé–ÉRÅ[Éh  PIC  X(006).
           03  ÇcÇPÇWÇUÅ|éxé–ñº      PIC  X(040).
           03  ÇcÇPÇWÇUÅ|éxé–ñºÉJÉi  PIC  X(040).
           03  ÇcÇPÇWÇUÅ|ìXéøÉRÅ[Éh  PIC  X(002).
           03  ÇcÇPÇWÇUÅ|ìXéø        PIC  X(020).
           03  ÇcÇPÇWÇUÅ|ÉGÉäÉAÉRÅ[Éh
                                     PIC  X(002).
           03  ÇcÇPÇWÇUÅ|ÉGÉäÉA      PIC  X(020).
