      *****************************************************************
      *   ŽÐ“à‹à—˜ƒ}ƒXƒ^(D18KIN_TBL)
      *****************************************************************
       01  ŽÐ“à‹à—˜ƒ}ƒXƒ^.
           03  ‚c‚P‚W|‹à—˜‹æ•ª      PIC  X(002).
           03  ‚c‚P‚W|“K—pŠJŽn“ú    PIC  X(008).
           03  ‚c‚P‚W|ŠúŠÔ          PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚P‚W|‹à—˜          PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚P‚W|XV“úŽž      PIC  X(016).
           03  ‚c‚P‚W|XVŽÒ        PIC  X(008).
           03  ‚c‚P‚W|“K—pI—¹“ú    PIC  X(008).
           03  ‚c‚P‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚W|ŽåŒ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚P‚W|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚W|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚P‚W|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚P‚W|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚W|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚P‚W|à–±•”‚h‚n    PIC S9(002)V9(008) PACKED-DECIMAL.
