      *****************************************************************
      *   Œ©ÏŽx•¥“WŠJ(D262MST_TBL)
      *****************************************************************
       01  Œ©ÏŽx•¥“WŠJ.
           03  ‚c‚Q‚U‚Q|Œ©Ï”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚Q|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚Q‚U‚Q|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚Q‚U‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚Q‚U‚Q|˜A”Ô        PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚Q|Žx•¥”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚Q|Žx•¥Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚Q|Žx•¥ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚Q|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚Q|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚Q‚U‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚U‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
