      *****************************************************************
      *   Œ©Ïãæ‰ð–ñ(D273MUK_TBL)
      *****************************************************************
       01  Œ©Ïãæ‰ð–ñ.
           03  ‚c‚Q‚V‚R|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚R|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚Q‚V‚R|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚R|‰ð–ñ‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚V‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚V‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚R|“o˜^’S“–ŽÒ  PIC  X(008).
