      *****************************************************************
      *   Œ©Ï‘Ý•t‹à‘‘Öî•ñ(D274MKK_TBL)
      *****************************************************************
       01  Œ©Ï‘Ý•t‹à‘‘Öî•ñ.
           03  ‚c‚Q‚V‚S|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚S|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚S|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚S|‘‘ÖŒ³Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚Q‚V‚S|‘‘ÖŒ³Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚S|‘‘ÖŒ³—˜‘§Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚V‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚V‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚S|“o˜^’S“–ŽÒ  PIC  X(008).
