      *****************************************************************
      *   Œ©Ï•¨Œ(D27MBK_TBL)
      *****************************************************************
       01  Œ©Ï•¨Œ.
           03  ‚c‚Q‚V|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚V|Œ©Ï”Ô†Ž}”Ô  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚Q‚V|•¨Œ”Ô†      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V|Žæ“¾‰¿Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|Ž‘ŽY•ª—ÞƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚Q‚V|‘Ï—p”N”      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V|’†ŒÃ‹æ•ª      PIC  X(001).
           03  ‚c‚Q‚V|Å–@‹æ•ª      PIC  X(001).
           03  ‚c‚Q‚V|“®‘•t•Û‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚V|ŒÅ’èŽ‘ŽYÅ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚V|Žc‰¿Ý’èŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|ŒŽŠz—¿‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|•ÛŒ¯‰ïŽÐ‹æ•ª  PIC  X(004).
           03  ‚c‚Q‚V|Žæ“¾ŠzÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|“®‘—¦        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V|“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|ŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|Œ_–ñ‘ŠzŒ‹‰Ê  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚V|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚V|XVŽÒ        PIC  X(008).
           03  ‚c‚Q‚V|‡ŽZæŒ_–ñŽí—Þ
                                     PIC  X(003).
           03  ‚c‚Q‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚V|Žx•¥“úƒpƒ^[ƒ“
                                     PIC  X(001).
           03  ‚c‚Q‚V|w“üæƒR[ƒh  PIC  X(009).
           03  ‚c‚Q‚V|‰ð–ñ•¨ŒŒ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚Q‚V|ˆêŽŸ“ñŽŸ”»•Ê‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚V|“®‘•ÛŒ¯—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|ŒÅ’èŽ‘ŽYÅ    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|Žc‰¿‹æ•ª      PIC  X(001).
           03  ‚c‚Q‚V|ŒÅ’èŽ‘ŽYÅ—¦  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V|•¨Œ–¼Ì      PIC  X(060).
           03  ‚c‚Q‚V|Œ^Ž®          PIC  X(025).
           03  ‚c‚Q‚V|”—Ê          PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚Q‚V|’PˆÊ          PIC  X(001).
           03  ‚c‚Q‚V|Ý’uêŠ–¼    PIC  X(080).
           03  ‚c‚Q‚V|—X•Ö”Ô†      PIC  X(007).
           03  ‚c‚Q‚V|”[•tæƒR[ƒh  PIC  X(006).
           03  ‚c‚Q‚V|ZŠ‚P        PIC  X(060).
           03  ‚c‚Q‚V|ZŠ‚Q        PIC  X(060).
           03  ‚c‚Q‚V|ZŠ‚R        PIC  X(060).
           03  ‚c‚Q‚V|Å•‰’S‹æ•ª    PIC  X(001).
           03  ‚c‚Q‚V|­ŠzŽ‘ŽY‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚V|»‘¢ŽÒ–¼      PIC  X(060).
           03  ‚c‚Q‚V|•¨Œ‹æ•ª      PIC  X(002).
           03  ‚c‚Q‚V|•¨ŒŽí—Þ‹æ•ª  PIC  X(002).
           03  ‚c‚Q‚V|ƒ[ƒJ[‹æ•ª  PIC  X(003).
           03  ‚c‚Q‚V|•¨Œ–¼ƒJƒi    PIC  X(060).
           03  ‚c‚Q‚V|ÅŽí—Þ‹æ•ª    PIC  X(001).
           03  ‚c‚Q‚V|Ý’uêŠ–¼ƒJƒi
                                     PIC  X(080).
           03  ‚c‚Q‚V|•ÛØ‰ïŽÐ      PIC  X(009).
           03  ‚c‚Q‚V|‘¼ŽÐŽc‰¿•ÛØæ
                                     PIC  X(009).
           03  ‚c‚Q‚V|Žw’è“dŽqŒvŽZ‹@
                                     PIC  X(040).
           03  ‚c‚Q‚V|“dŽqŒvŽZ‹@Š—LŽÒ
                                     PIC  X(040).
           03  ‚c‚Q‚V|‘¼ŽÐw“üŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|Ž©ŽÐŽc‰¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|‘¼ŽÐŽc‰¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|•ÛŽç‹æ•ª      PIC  X(001).
           03  ‚c‚Q‚V|‘ã—‰ñŽû•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚V|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚P
                                     PIC  X(016).
           03  ‚c‚Q‚V|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚Q
                                     PIC  X(016).
           03  ‚c‚Q‚V|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚R
                                     PIC  X(016).
           03  ‚c‚Q‚V|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚S
                                     PIC  X(016).
           03  ‚c‚Q‚V|’Zk\¿‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚V|Š—L‹æ•ª      PIC  X(001).
           03  ‚c‚Q‚V|Žx•¥•ÛŽç—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚V|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚V|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚Q‚V|‹@ŠB”Ô†      PIC  X(020).
           03  ‚c‚Q‚V|‘¹ŠQ•ÛŒ¯‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚V|”…ž•ÛŒ¯‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚V|ZŠƒR[ƒh    PIC  X(011).
           03  ‚c‚Q‚V|w“üŽx•¥æƒR[ƒh
                                     PIC  X(005).
