      *****************************************************************
      *   Œ_–ñ“à—eŒÂ•Êî•ñ(D310KKJ_TBL)
      *****************************************************************
       01  Œ_–ñ“à—eŒÂ•Êî•ñ.
           03  ‚c‚R‚P‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚P‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|‘ÎR—vŒ    PIC  X(002).
           03  ‚c‚R‚P‚O|Š„ˆø—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|Žæ—§Žè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|Žæ—§Žè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|—˜—¦Šî”‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚O|—˜‘§’[”‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚O|•Ð’[—¼’[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚O|‹x“ú‘Î‰ž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚O|—˜‘§ŒvŽZ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚O|‰‰ñ—˜‘§‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚O|ŽÀŽ¿”N—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|ƒXƒvƒŒƒbƒh  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|‰‰ñŒ³–{‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚P‚O|Œ³–{ƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|Œ³–{‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|‰‰ñ—˜‘§‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚P‚O|—˜‘§ƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|—˜‘§‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|Œ©’¼‚µƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚O|—˜—¦Šm’èŠúŒÀ
                                     PIC  X(008).
           03  ‚c‚R‚P‚O|‘æ‚P‰ñ•ÔÏ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P‚O|‘æ‚Q‰ñ•ÔÏ“ú
                                     PIC  X(008).
           03  ‚c‚R‚P‚O|— •tŽæˆø    PIC  X(060).
           03  ‚c‚R‚P‚O|ŽèŒ`— ‘•û–@
                                     PIC  X(001).
           03  ‚c‚R‚P‚O|’S•ÛƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚R‚P‚O|Šm”FƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚R‚P‚O|V‹K‘‘Ö‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚O|‘‘ÖæŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚P‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚P‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚P‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
