      *****************************************************************
      *   Œ_–ñ”Ô†—\–ñƒe[ƒuƒ‹(D317YYK_TBL)
      *****************************************************************
       01  Œ_–ñ”Ô†—\–ñƒe[ƒuƒ‹.
           03  ‚c‚R‚P‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚P‚V|Šú          PIC  X(002).
           03  ‚c‚R‚P‚V|Œ_–ñŒ`‘Ô    PIC  X(001).
           03  ‚c‚R‚P‚V|“Á’èŽæˆøæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚P‚V|ó‘Ô        PIC  X(001).
           03  ‚c‚R‚P‚V|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚P‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚P‚V|ƒRƒƒ“ƒg    PIC  X(040).
           03  ‚c‚R‚P‚V|Žg—p’†ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚P‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚P‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚V|“o˜^’S“–ŽÒ  PIC  X(008).
