      *****************************************************************
      *   ÂŒ ÌŽZ(D322SSA_TBL)
      *****************************************************************
       01  ÂŒ ÌŽZ.
           03  ‚c‚R‚Q‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚Q‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚Q‚Q|‰ñŽûƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‰ñŽû“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚R‚Q‚Q|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‘e—˜Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Šî–{—˜‰ñ‚è‘Šz
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|”„ãŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”Ê‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒÅ’èŽ‘ŽYÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|“®‘•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆÏ‘õ•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆÏ‘õ•ÛŽç—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”Ê“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊˆÏ‘õ•ÛŽç—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‘OŽóƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”Ê‘OŽóƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒJ‰„ƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŒJ‰„ƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Šî–{ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Šî–{ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒÅ’èŽ‘ŽYÅ”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒÅ’èŽ‘ŽYÅ”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|“®‘•ÛŒ¯—¿”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|“®‘•ÛŒ¯—¿”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‘OŽóƒƒŠƒbƒg‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‘OŽóƒƒŠƒbƒg‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒJ‰„ƒƒŠƒbƒg‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒJ‰„ƒƒŠƒbƒg‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŽÀŽ¿ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŽÀŽ¿ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‰Šú”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Šú’†”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Šî–{ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Šî–{ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒÅ’èŽ‘ŽYÅ”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒÅ’èŽ‘ŽYÅ”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|“®‘•ÛŒ¯—¿”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|“®‘•ÛŒ¯—¿”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‘OŽóƒƒŠƒbƒg‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‘OŽóƒƒŠƒbƒg‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒJ‰„ƒƒŠƒbƒg‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŒJ‰„ƒƒŠƒbƒg‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŽÀŽ¿ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŽÀŽ¿ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Žc‰¿‰ñŽûŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‰Šú”ï—p“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Šú’†”ï—pŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Žc‰¿‰ñŽûŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‘e—˜‰v‘S‘Ì  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŽc‰¿‰ñŽûŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŠú’†”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”Ê‘e—˜Šz‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŽc‰¿‰ñŽûŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”ÊŠú’†”ï—pŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|“–ŽÐŽ•ª”ä—¦
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|Šî–{Œ³–{‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‚»‚Ì‘¼””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‚»‚Ì‘¼””ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆê”Ê‚»‚Ì‘¼””ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆÏ‘õ•ÛŒ¯—¿”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆÏ‘õ•ÛŒ¯—¿”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‚»‚Ì‘¼””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‚»‚Ì‘¼””ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆÏ‘õ•ÛŒ¯—¿”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|ˆÏ‘õ•ÛŒ¯—¿”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‚»‚Ì‘¼””ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|‚»‚Ì‘¼””ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚Q‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚Q‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
