      *****************************************************************
      *   ŒˆÙðŒŽwŽ¦(D324KJS_TBL)
      *****************************************************************
       01  ŒˆÙðŒŽwŽ¦.
           03  ‚c‚R‚Q‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚Q‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚S|ŒˆÙŽí—Þ    PIC  X(001).
           03  ‚c‚R‚Q‚S|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚S|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚S|ðŒŽwŽ¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚Q‚S|ðŒŽwŽ¦”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚S|ðŒŽwŽ¦“à—e
                                     PIC  X(060).
           03  ‚c‚R‚Q‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚Q‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚Q‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚Q‚S|’S•Û’¥‹‹æ•ª
                                     PIC  X(001).
