      *****************************************************************
      *   ŒˆÙ(D328KES_TBL)
      *****************************************************************
       01  ŒˆÙ.
           03  ‚c‚R‚Q‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚Q‚W|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚W|ŒˆÙŽí—Þ    PIC  X(001).
           03  ‚c‚R‚Q‚W|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚W|ŒˆÙŽó•t”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚Q‚W|ŒˆÙƒ‰ƒ“ƒN  PIC  X(001).
           03  ‚c‚R‚Q‚W|ŒˆÙ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚W|ŒˆÙŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚Q‚W|³”F‹æ•ª    PIC  X(001).
           03  ‚c‚R‚Q‚W|ŒˆÙðŒ‚P  PIC  X(060).
           03  ‚c‚R‚Q‚W|ŒˆÙðŒ‚Q  PIC  X(060).
           03  ‚c‚R‚Q‚W|ŒˆÙðŒ‚R  PIC  X(060).
           03  ‚c‚R‚Q‚W|ŒˆÙðŒ‚S  PIC  X(060).
           03  ‚c‚R‚Q‚W|ŒˆÙðŒ‚T  PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚P
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚Q
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚R
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚S
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚T
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚U
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚V
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚W
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚X
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|R¸•”ˆÓŒ©—“‚P‚O
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|ŒˆÙŽæÁ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚Q‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚Q‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚Q‚W|•”“X’·³”F“ú
                                     PIC  X(008).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚P
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚Q
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚R
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚S
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚T
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚U
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚V
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚W
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚X
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|‰c‹Æ•”ˆÓŒ©—“‚P‚O
                                     PIC  X(060).
           03  ‚c‚R‚Q‚W|\¿‘ˆóüÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚Q‚W|ƒƒ“ƒRƒ~•t‹c‚m‚n
                                     PIC  X(006).
           03  ‚c‚R‚Q‚W|•ÊŽ†‹æ•ª    PIC  X(001).
           03  ‚c‚R‚Q‚W|•¨Œƒ`ƒFƒbƒN‹æ•ª
                                     PIC  X(001).
