      *****************************************************************
      *   ’ñŒg•¨Œ(D337TKB_TBL)
      *****************************************************************
       01  ’ñŒg•¨Œ.
           03  ‚c‚R‚R‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚R‚V|Œ_–ñŽí—Þ    PIC  X(001).
           03  ‚c‚R‚R‚V|•¨Œ”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|’ñŒgæ‹æ•ª  PIC  X(002).
           03  ‚c‚R‚R‚V|’ñŒgæŒ_–ñ”Ô†
                                     PIC  X(012).
           03  ‚c‚R‚R‚V|’ñŒgæ•¨Œ”Ô†
                                     PIC  X(003).
           03  ‚c‚R‚R‚V|Œ_–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚V|ŒŸŽû—\’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R‚V|ŒŸŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚V|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ƒŠ[ƒX—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ƒŠ[ƒX—¿’P‰¿‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ƒŠ[ƒX—¿Á”ïÅŠz’P‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ƒŠ[ƒX‹àŠz|‰‚ß
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|””ï—p‚»‚Ì‘¼‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ŒŽŠz•½‹Ï•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|‘OŽóŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|‘OŽóƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Žx•¥‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Ý’uŠúŠÔ    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ˆê‰ñƒŠ[ƒX—¿“ü‹à”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R‚V|•¨Œ–¼|Š¿Žš
                                     PIC  X(060).
           03  ‚c‚R‚R‚V|•¨Œ–¼|ƒJƒi
                                     PIC  X(060).
           03  ‚c‚R‚R‚V|Žd—l»‘¢”Ô†
                                     PIC  X(020).
           03  ‚c‚R‚R‚V|”—Ê        PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|w“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Žd“üÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Ž‘ŽYƒR[ƒh  PIC  X(007).
           03  ‚c‚R‚R‚V|‘Ï—p”N”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|’†ŒÃŽ‘ŽYƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚R‚V|“®‘•ÛŒ¯ƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚R‚V|“®‘•ÛŒ¯—¿—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚R‚R‚V|Å‹æ•ª      PIC  X(001).
           03  ‚c‚R‚R‚V|Å•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚R‚V|Ý’uêŠ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚R‚R‚V|Ý’uêŠZŠ
                                     PIC  X(100).
           03  ‚c‚R‚R‚V|Ý’uêŠ–¼|Š¿Žš
                                     PIC  X(080).
           03  ‚c‚R‚R‚V|Ý’uêŠ–¼|ƒJƒi
                                     PIC  X(080).
           03  ‚c‚R‚R‚V|Œ^Ž®”Ô†    PIC  X(015).
           03  ‚c‚R‚R‚V|ŒÂ•ÊƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Žc‰¿Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Žc‰¿•ÛØ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R‚V|‰ïŽÐƒR[ƒh  PIC  X(002).
           03  ‚c‚R‚R‚V|Žx“XƒR[ƒh  PIC  X(006).
           03  ‚c‚R‚R‚V|ƒGƒ“ƒhƒ†[ƒU[|Ž–¼
                                     PIC  X(060).
           03  ‚c‚R‚R‚V|ƒGƒ“ƒhƒ†[ƒU[|—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚R‚R‚V|ƒGƒ“ƒhƒ†[ƒU[|ZŠ
                                     PIC  X(100).
           03  ‚c‚R‚R‚V|ƒGƒ“ƒhƒ†[ƒU[|“d˜b”Ô†
                                     PIC  X(012).
           03  ‚c‚R‚R‚V|ƒGƒ“ƒhƒ†[ƒU[|¶”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R‚V|ƒŠ[ƒX—¿’PˆÊ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R‚V|ÄƒŠ[ƒX—¿ŒW”
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Žè”—¿”ä—¦  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P
                                     PIC  X(010).
           03  ‚c‚R‚R‚V|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚Q
                                     PIC  X(010).
           03  ‚c‚R‚R‚V|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚R
                                     PIC  X(010).
           03  ‚c‚R‚R‚V|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚R‚V|”„Žå–¼      PIC  X(060).
           03  ‚c‚R‚R‚V|”„ŽåZŠ    PIC  X(060).
           03  ‚c‚R‚R‚V|Žx•¥ðŒƒR[ƒh
                                     PIC  X(030).
           03  ‚c‚R‚R‚V|ŠJŽn”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚V|I—¹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚V|Ž}”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ÄƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|•ÛŽçŒ_–ñæ–¼
                                     PIC  X(030).
           03  ‚c‚R‚R‚V|ŽÀŽ¿ƒŠ[ƒX—¿‚o‚u
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Žc‰¿‚o‚u    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|ˆê•”‰ð–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R‚V|‰ð–ñ——RƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚R‚V|Ž‘ŽYˆ•ªƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚R‚V|Žx•¥Ï‘O•¥ƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Žx•¥Ï‘O•¥ƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|‰ßèƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|‰ßèƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|–¢•¥‚¢ƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|–¢•¥‚¢ƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|’ñŒg‹K‘¹‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|’ñŒg‹K‘¹‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|·ˆø‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|·ˆø‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|–¢•¥ŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Už’âŽ~”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚R‚V|Œ_–ñ‹æ•ª    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|‰ïˆõ”Ô†    PIC  X(016).
           03  ‚c‚R‚R‚V|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚V|‰ð–ñƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|Ž‘ŽY”Ô†    PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|‹ŒŽ‘ŽY”Ô†  PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|”„‹pŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|”„‹pŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|”„‹pŽ––±‘ãsŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|”„‹pŽ––±‘ãsŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚V|”„‹p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚V|‹@ŽíƒR[ƒh  PIC  X(015).
           03  ‚c‚R‚R‚V|‹@”Ô        PIC  X(012).
           03  ‚c‚R‚R‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚R‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚R‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚R‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚R‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
