      *****************************************************************
      *   Œ_–ñ“Á–ñð€(D345KTY_TBL)
      *****************************************************************
       01  Œ_–ñ“Á–ñð€.
           03  ‚c‚R‚S‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚S‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚T|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S‚T|•¶Œ¾”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S‚T|s”Ô†      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S‚T|“Á–ñð€    PIC  X(120).
           03  ‚c‚R‚S‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚S‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚S‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚T|“o˜^’S“–ŽÒ  PIC  X(008).
