      *****************************************************************
      *   ‰ð–ñ“Á–ñð€(D355KTJ_TBL)
      *****************************************************************
       01  ‰ð–ñ“Á–ñð€.
           03  ‚c‚R‚T‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚T‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T‚T|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T‚T|“Á–ñð€    PIC  X(120).
           03  ‚c‚R‚T‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚T‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚T‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚T‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚T‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚T‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚T‚T|“o˜^’S“–ŽÒ  PIC  X(008).
