      *****************************************************************
      *   •ÏX\¿|‘Ý•t‹à‹à—˜•ÏX(D368HKK_TBL)
      *****************************************************************
       01  •ÏX\¿|‘Ý•t‹à‹à—˜•ÏX.
           03  ‚c‚R‚U‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚W|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚W|Œ»s‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚W|•ÏX‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚W|•ÏX—\’è“ú  PIC  X(008).
           03  ‚c‚R‚U‚W|Šm’è“ú      PIC  X(008).
           03  ‚c‚R‚U‚W|XVÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚W|‘e—˜·Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚W|“o˜^’S“–ŽÒ  PIC  X(008).
