      *****************************************************************
      *   •ÏX—š—ð|ŽÔ—¼•¨Œ(D370HSR_TBL)
      *****************************************************************
       01  •ÏX—š—ð|ŽÔ—¼•¨Œ.
           03  ‚c‚R‚V‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚O|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚V‚O|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚V‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|“o˜^”Ô†    PIC  X(020).
           03  ‚c‚R‚V‚O|ŽÔŒŸ–ž—¹“ú  PIC  X(008).
           03  ‚c‚R‚V‚O|Ý’èŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|Ž©“®ŽÔÅ•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚V‚O|Ž©“®ŽÔÅŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|Ž©”…Ó•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚V‚O|Ž©”…Ó‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|d—ÊÅ•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚V‚O|d—ÊÅŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|”CˆÓ•ÛŒ¯•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚V‚O|”CˆÓ•ÛŒ¯‘ã—“XƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚V‚O|”CˆÓ•ÛŒ¯•t•ÛæƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|”CˆÓ•ÛŒ¯–ž—¹“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚O|ƒƒ“ƒeƒiƒ“ƒXŒ_–ñæ
                                     PIC  X(009).
           03  ‚c‚R‚V‚O|ŒŽŠzƒƒ“ƒeƒiƒ“ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|‘–s‹——£    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|ƒ^ƒCƒ„–{”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚O|ƒRƒƒ“ƒg    PIC  X(040).
           03  ‚c‚R‚V‚O|”õl‚P      PIC  X(040).
           03  ‚c‚R‚V‚O|”õl‚Q      PIC  X(040).
           03  ‚c‚R‚V‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚V‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚V‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
