      *****************************************************************
      *   ÄƒŠ[ƒX—š—ð(D378SLI_TBL)
      *****************************************************************
       01  ÄƒŠ[ƒX—š—ð.
           03  ‚c‚R‚V‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚V‚W|—š—ð˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒXŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒXŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|Œ_–ñŒ–¼    PIC  X(040).
           03  ‚c‚R‚V‚W|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚R‚V‚W|•Ï‘¥•¥      PIC  X(001).
           03  ‚c‚R‚V‚W|“–‰ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚V‚W|“–‰Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Á”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅVŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅVÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚V‚W|ÅVÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅVŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅVÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|•ÛŽç–³žŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚W|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚W|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚W|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚W|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚R‚V‚W|‰ð–ñ‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅV—š—ð‰ð–ñ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅV‰ñŽû“ú  PIC  X(008).
           03  ‚c‚R‚V‚W|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|Š„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Š„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘k‹y‰ð–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚W|‰ð–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|–ž—¹ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚W|–ž—¹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚W|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|‰ð–ñ\¿“ú  PIC  X(008).
           03  ‚c‚R‚V‚W|‰ñŽûðŒ•ÏXƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|‰ñŽûðŒ•ÏX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‰ñŽûðŒ•ÏX“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚W|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|•ÛŽç—L–³ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒXŽ©“®ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒXŽ©“®ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚V‚W|“–‰Žæ“¾Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Žæ“¾ŠzŒ»‰¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘O•¥ŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚V‚W|¿‹‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‡ŽZæŒ_–ñŽí—Þ
                                     PIC  X(003).
           03  ‚c‚R‚V‚W|¡‰ñÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒXŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©U¿‹ƒXƒgƒbƒv\¿”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|Ž©U¿‹ƒXƒgƒbƒv\¿•”‰Û
                                     PIC  X(004).
           03  ‚c‚R‚V‚W|Ž©U¿‹ƒXƒgƒbƒv\¿ŽÒ
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|Ž©U¿‹ƒXƒgƒbƒvŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚W|Ž©U¿‹ƒXƒgƒbƒvI—¹”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚W|Ž©U¿‹ƒXƒgƒbƒv——R
                                     PIC  X(002).
           03  ‚c‚R‚V‚W|Ž©UƒXƒgƒbƒvƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|Ž©U“Á•Ê¿‹\¿”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|Ž©U“Á•Ê¿‹\¿•”‰Û
                                     PIC  X(004).
           03  ‚c‚R‚V‚W|Ž©U“Á•Ê¿‹\¿ŽÒ
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|Ž©U“Á•Ê¿‹ŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚W|Ž©U“Á•Ê¿‹I—¹”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚W|Ž©U“Á•Ê¿‹\¿‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©U“Á•ÊƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|Žx•¥ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|ˆÏ‘õ•ÛŽç‘Š“–ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|‚»‚Ì‘¼Œ_–ñŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚W|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚W|‘e—˜‰vŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘e—˜‰vŠz|•\
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ŽèŒ`ŽóŽæ“ú  PIC  X(008).
           03  ‚c‚R‚V‚W|ŽèŒ`–‡”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ•ªŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ•ªŒŽŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ•ªÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘¼ŽÐŠ„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|‘¼ŽÐŠ„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒXŽè”—¿‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒXŽè”—¿‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚W|”„‹p‘ãŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒXŽ©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒX‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Š„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Š„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Š„•ŠŒ´‰¿‘ŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Š„•Š—˜‰v‘ŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Â–±Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚V‚W|Á”ïÅ’·Šú|ŽÀÑ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚V‚W|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|“–‰ŒŽŠz—¿‹à‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Á”ïÅŠz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅVŒŽŠz—¿‹à‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅVÁ”ïÅŠz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅVŒ_–ñ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÅVÁ”ïÅ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Žæ“¾‰¿Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Žæ“¾Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ŽŸ‰ñÄƒŠ[ƒX—¿‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ƒŠƒXƒP‘OŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚V‚W|Ž©U¿‹‹àŠz•ÏX——R
                                     PIC  X(002).
           03  ‚c‚R‚V‚W|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ý’uêŠ‹æ•ª
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Œ_–ñ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|“–‰Á”ïÅ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|ÄƒŠ[ƒX\¿ðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚V‚W|Ž©ŽÐŒ³–{‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ”„ã—˜‘§‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ—˜‘§‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐŒÅ’èŽ‘ŽYÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ“®‘•ÛŒ¯‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐˆÏ‘õ•ÛŽç—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ‚»‚Ì‘¼””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ•ªŽx•¥”ï—p“K—p‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Ž©ŽÐ•ªŽx•¥”ï—pˆê”Ê‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|Œ³–{‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|—˜‘§‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚W|””ï—p‘Šz  PIC S9(013) PACKED-DECIMAL.
