      *****************************************************************
      *   •ÏX—š—ðQŒ_–ñ“à—eŒÂ•Êî•ñ(D379HKJ_TBL)
      *****************************************************************
       01  •ÏX—š—ð|Œ_–ñ“à—eŒÂ•Êî•ñ.
           03  ‚c‚R‚V‚X|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚X|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚V‚X|‘ÎR—vŒ    PIC  X(002).
           03  ‚c‚R‚V‚X|Š„ˆø—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|Žæ—§Žè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|Žæ—§Žè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|—˜—¦Šî”‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚X|—˜‘§’[”‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚X|•Ð’[—¼’[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚X|‹x“ú‘Î‰ž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚X|—˜‘§ŒvŽZ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚X|‰‰ñ—˜‘§‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚X|ŽÀŽ¿”N—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|ƒXƒvƒŒƒbƒh  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|‰‰ñŒ³–{‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚X|Œ³–{ƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|Œ³–{‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|‰‰ñ—˜‘§‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚X|—˜‘§ƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|—˜‘§‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|Œ©’¼‚µƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚X|—˜—¦Šm’èŠúŒÀ
                                     PIC  X(008).
           03  ‚c‚R‚V‚X|‘æ‚P‰ñ•ÔÏ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚X|‘æ‚Q‰ñ•ÔÏ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚X|— •tŽæˆø    PIC  X(060).
           03  ‚c‚R‚V‚X|ŽèŒ`— ‘•û–@
                                     PIC  X(001).
           03  ‚c‚R‚V‚X|’S•ÛƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚R‚V‚X|Šm”FƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚R‚V‚X|V‹K‘‘Ö‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚X|‘‘ÖæŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚V‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚V‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚V‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
