      *****************************************************************
      *   ”Ä—p¿‹(D40HSQ_TBL)
      *****************************************************************
       01  ”Ä—p¿‹.
           03  ‚c‚S‚O|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚S‚O|¿‹æƒR[ƒh  PIC  X(005).
           03  ‚c‚S‚O|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚S‚O|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚O|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚S‚O|˜A”Ô          PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚S‚O|¿‹‰ñ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚O|¿‹ŠÔŠu      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚O|‰ñŽû•û–@      PIC  X(001).
           03  ‚c‚S‚O|¿‹”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚O|¿‹‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚O|¿‹Á”ïÅ    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚O|Áž”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚O|Áž’Ê”Ô      PIC  X(011).
           03  ‚c‚S‚O|‰ñŽû—\’è“ú    PIC  X(008).
           03  ‚c‚S‚O|‰ñŽû”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚O|‰ñŽû‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚O|‰ñŽûÁ”ïÅ    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚O|–¢‰ñŽû‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚O|‰‰ñ“ü‹à“ú    PIC  X(008).
           03  ‚c‚S‚O|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚O|•”‰ÛƒR[ƒh    PIC  X(004).
           03  ‚c‚S‚O|’·’Z‹æ•ª      PIC  X(001).
           03  ‚c‚S‚O|‹âs’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚S‚O|Á”ïÅƒR[ƒh  PIC  X(002).
           03  ‚c‚S‚O|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚O|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚S‚O|‘¿‹‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚O|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚O|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚S‚O|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚S‚O|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚O|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚S‚O|XVŽÒ        PIC  X(008).
           03  ‚c‚S‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
