      *****************************************************************
      *   ‰ð–ñ—š—ðQÂŒ ÌŽZ(D466KSS_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|ÂŒ ÌŽZ.
           03  ‚c‚S‚U‚U|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚U‚U|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚U‚U|‰ñŽûƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‰ñŽû“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚S‚U‚U|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‘e—˜Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Šî–{—˜‰ñ‚è‘Šz
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|”„ãŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”Ê‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒÅ’èŽ‘ŽYÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|“®‘•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆÏ‘õ•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆÏ‘õ•ÛŽç—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”Ê“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊˆÏ‘õ•ÛŽç—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‘OŽóƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”Ê‘OŽóƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒJ‰„ƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŒJ‰„ƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Šî–{ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Šî–{ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒÅ’èŽ‘ŽYÅ”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒÅ’èŽ‘ŽYÅ”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|“®‘•ÛŒ¯—¿”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|“®‘•ÛŒ¯—¿”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‘OŽóƒƒŠƒbƒg‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‘OŽóƒƒŠƒbƒg‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒJ‰„ƒƒŠƒbƒg‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒJ‰„ƒƒŠƒbƒg‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŽÀŽ¿ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŽÀŽ¿ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‰Šú”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Šú’†”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Šî–{ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Šî–{ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒÅ’èŽ‘ŽYÅ”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒÅ’èŽ‘ŽYÅ”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|“®‘•ÛŒ¯—¿”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|“®‘•ÛŒ¯—¿”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‘OŽóƒƒŠƒbƒg‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‘OŽóƒƒŠƒbƒg‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒJ‰„ƒƒŠƒbƒg‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŒJ‰„ƒƒŠƒbƒg‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŽÀŽ¿ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŽÀŽ¿ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Žc‰¿‰ñŽûŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‰Šú”ï—p“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Šú’†”ï—pŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Žc‰¿‰ñŽûŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‘e—˜‰v‘S‘Ì  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŽc‰¿‰ñŽûŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŠú’†”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”Ê‘e—˜Šz‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŽc‰¿‰ñŽûŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”ÊŠú’†”ï—pŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|“–ŽÐŽ•ª”ä—¦
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|Šî–{Œ³–{‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‚»‚Ì‘¼””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‚»‚Ì‘¼””ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆê”Ê‚»‚Ì‘¼””ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆÏ‘õ•ÛŒ¯—¿”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆÏ‘õ•ÛŒ¯—¿”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‚»‚Ì‘¼””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‚»‚Ì‘¼””ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆÏ‘õ•ÛŒ¯—¿”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|ˆÏ‘õ•ÛŒ¯—¿”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‚»‚Ì‘¼””ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|‚»‚Ì‘¼””ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚U‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚U‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
