      *****************************************************************
      *   ‰ð–ñ—š—ðQŒp‘±”ï—pŽx•¥(D474KKH_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|Œp‘±”ï—pŽx•¥.
           03  ‚c‚S‚V‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚V‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚S|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚S|”ï—pŽí—Þ    PIC  X(003).
           03  ‚c‚S‚V‚S|ŒJ‰„ŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚S|”ï—p‹æ•ª    PIC  X(001).
           03  ‚c‚S‚V‚S|”ï—p‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚S|‰‰ñŽx•¥—\’è”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚S|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚S|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚S|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚S‚V‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚V‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚V‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚S|“o˜^’S“–ŽÒ  PIC  X(008).
