      *****************************************************************
      *   ‰ð–ñ—š—ðQ‘‡ÌŽZ(D481SSM_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|‘‡ÌŽZ.
           03  ‚c‚S‚W‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚W‚P|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚S‚W‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚W‚P|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚W‚P|Œ´Œ_–ñ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚W‚P|ŒŸŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚W‚P|Œ´Œ_–ñŠúŠÔ  PIC  X(008).
           03  ‚c‚S‚W‚P|’ÊŠúŒ_–ñŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|’iŠK‹æ•ª    PIC  X(001).
           03  ‚c‚S‚W‚P|ÌŽZó‘Ô‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚W‚P|ÅVÌŽZXV“ú
                                     PIC  X(008).
           03  ‚c‚S‚W‚P|IŒ‹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚W‚P|³ŒpŒ´Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚W‚P|³Œp‘OŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚W‚P|‹¦’²“]‹æ•ª  PIC  X(001).
           03  ‚c‚S‚W‚P|‰ð–ñ‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|Å‘åÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|“K—p‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚W‚P|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”ÊŽÐ“à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‘O“n‹à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê‘O“n‹à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|Šî–{Œ³–{‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ŒJ‰„ƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”ÊŒJ‰„ƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‘OŽóŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‘OŽóƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê‘OŽóƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ŒÅ’èŽ‘ŽYÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|“®‘•ÛŒ¯—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|•ÛŽç—¿‘Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”ÊŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|•ÛŽç—¿Œ»‰¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê•ÛŽç—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‰Šú”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|Šú’†”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|Šú’†”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”ÊŠú’†”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‰ñŽû‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‰ñŽû‘ŠzŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê‰ñŽû‘ŠzŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‰ð–ñ¿‹‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‰ð–ñ¿‹ŠzŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê‰ð–ñ¿‹ŠzŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|”„‹p‘ã‹à‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|”„‹p‘ã‹àŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê”„‹p‘ã‹àŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆ•ª”ï—p‘‡
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆ•ª”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Êˆ•ª”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|“–‰Žc‰¿‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|–¢ŽÀŒ»Žc‰¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|–¢ŽÀŒ»Žc‰¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê–¢ŽÀŒ»Žc‰¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ŽÀŽ¿—˜‰ñ‚è  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|‘e—˜‰v      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|ˆê”Ê‘e—˜‰v  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚W‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚W‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚W‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚W‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚W‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚W‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
