      *****************************************************************
      *   ‰ð–ñ\¿Q‘¹ŠQ‹à¿‹(D511SGS_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿|‘¹ŠQ‹à¿‹.
           03  ‚c‚T‚P‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚T‚P‚P|‘¹ŠQ‹à¿‹•û–@
                                     PIC  X(001).
           03  ‚c‚T‚P‚P|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘¹ŠQ‹àŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚T‚P‚P|‘¹ŠQ‹à¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚T‚P‚P|‘¹ŠQ‹à‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚T‚P‚P|VŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚T‚P‚P|‘¹ŠQ‹à¿‹Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘¹ŠQ‹à¿‹ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘¹ŠQ‹à¿‹ŠzÁ”ïÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘¹ŠQ‹à¿‹ŠzÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚T‚P‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚P‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚T‚P‚P|‘ŠŽE‰ß“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘ŠŽE‰ß“ü‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘ŠŽE‘O•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘ŠŽE‘O•¥‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|•ÛŒ¯‰ïŽÐƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚T‚P‚P|‘¹ŠQ‹àŽx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚T‚P‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚P|“o˜^’S“–ŽÒ  PIC  X(008).
