      *****************************************************************
      *   •ÛŒ¯Ž–ŒÌ‘—‹à(D511HJS_TBL)
      *****************************************************************
       01  •ÛŒ¯Ž–ŒÌ‘—‹à.
           03  ‚c‚T‚P‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚T‚P‚P|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘—‹à˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|‘—‹àæƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚T‚P‚P|‘—‹àæ–¼    PIC  X(040).
           03  ‚c‚T‚P‚P|‘—‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚P‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚P‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
