      *****************************************************************
      *   ‰ð–ñ\¿Q‘Ý•t‹àŒJ‰z•ÙÏ(D518KKK_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿|‘Ý•t‹àŒJ‰z•ÙÏ.
           03  ‚c‚T‚P‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚W|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|•ÙÏ—\’è“ú  PIC  X(008).
           03  ‚c‚T‚P‚W|‘S•”ˆê•”‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚W|Œ³–{ŒJã‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|–ñ’èŒ³–{‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|ŒJãŒ³–{‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|–ñ’è—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|Œo‰ß—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|–ß‚µ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|ˆá–ñ‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|Á”ïÅ      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚W|Ážƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚T‚P‚W|Šm’èƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚T‚P‚W|ŒˆÙƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚T‚P‚W|ŒˆÙ“ú      PIC  X(008).
           03  ‚c‚T‚P‚W|Šm’è“ú      PIC  X(008).
           03  ‚c‚T‚P‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚P‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚P‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
