      *****************************************************************
      *   •ÛŒ¯Ž–ŒÌ¿‹(D51HJI_TBL)
      *****************************************************************
       01  •ÛŒ¯Ž–ŒÌ¿‹.
           03  ‚c‚T‚P|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚T‚P|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚T‚P|•¨Œ”Ô†      PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚T‚P|˜A”Ô          PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P|Ž–ŒÌ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚P|Ž–ŒÌŽžŠÔ      PIC  X(004).
           03  ‚c‚T‚P|ŠÇ—”Ô†      PIC  X(015).
           03  ‚c‚T‚P|•¨Œ–¼Ì      PIC  X(060).
           03  ‚c‚T‚P|Œ_–ñŠJŽn“ú    PIC  X(008).
           03  ‚c‚T‚P|Œ_–ñI—¹“ú    PIC  X(008).
           03  ‚c‚T‚P|ŠúŠÔ          PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P|Žæ“¾‰¿Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚T‚P|Œ_–ñæƒR[ƒh  PIC  X(005).
           03  ‚c‚T‚P|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX
                                     PIC  X(016).
           03  ‚c‚T‚P|Ý’uêŠ–¼    PIC  X(020).
           03  ‚c‚T‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚T‚P|Žc‰¿Ý’èŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚T‚P|•ÛŒ¯‰ïŽÐƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚T‚P|Ó”CŠúŠÔŽ©    PIC  X(008).
           03  ‚c‚T‚P|Ó”CŠúŠÔŽŠ    PIC  X(008).
           03  ‚c‚T‚P|•ÛŒ¯ØŒ””Ô†  PIC  X(011).
           03  ‚c‚T‚P|“®‘•ÛŒ¯‰¿Ši  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|ÄƒŠ[ƒX•t•Û—¦
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P|Ž–ŒÌ¿‹“o˜^“ú
                                     PIC  X(008).
           03  ‚c‚T‚P|Ž–ŒÌ‹æ•ª      PIC  X(001).
           03  ‚c‚T‚P|Ž–ŒÌŒ´ˆö      PIC  X(001).
           03  ‚c‚T‚P|”íÐ•¨Œ‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|”íÐ•¨ŒŽc‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|¿‹”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚P|¿‹‚q‚d‚e‚m‚n
                                     PIC  X(008).
           03  ‚c‚T‚P|¿‹•ÛŒ¯‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|—ÕŽž”ï—p•ÛŒ¯‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|•ÛŒ¯‹à¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|•ÛŒ¯‹à¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚T‚P|“ü‘—‹à“o˜^“ú  PIC  X(008).
           03  ‚c‚T‚P|•ÛŒ¯‹à“ü‹à“ú  PIC  X(008).
           03  ‚c‚T‚P|•ÛŒ¯‹à“ü‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P|•ÛŒ¯‹àˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚P|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚P|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚T‚P|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚P|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚P|XVŽÒ        PIC  X(008).
           03  ‚c‚T‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
