      *****************************************************************
      *   ”„‹p—š—ð(D55BKD_TBL)
      *****************************************************************
       01  ”„‹p—š—ð.
           03  ‚c‚T‚T|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚T‚T|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚T|\¿˜A”Ô      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚T|”„‹p˜A”Ô      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚T|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚T‚T|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚T‚T|ˆ•ªæƒR[ƒh  PIC  X(005).
           03  ‚c‚T‚T|”„‹p“ú        PIC  X(008).
           03  ‚c‚T‚T|”„‹p——R      PIC  X(002).
           03  ‚c‚T‚T|”„‹p‹æ•ª      PIC  X(001).
           03  ‚c‚T‚T|”„‹p‘ã        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|”„‹p‘ãÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|”„‹p‘ãÁ”ïÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚T|”„‹p‘ãÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚T‚T|”„‹p‘ã‰ñŽû“ú  PIC  X(008).
           03  ‚c‚T‚T|”„‹pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T|”„‹pˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚T‚T|‰ñŽûŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|‰ñŽûŠzÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|‰ñŽû”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚T|‰ñŽû•û–@      PIC  X(001).
           03  ‚c‚T‚T|–¢‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|”„‹pŒo”ï      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|ó‘Ôƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚T‚T|ˆ•ªƒ‹[ƒg    PIC  X(001).
           03  ‚c‚T‚T|–ž—¹”„‹pƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚T‚T|¿‹‘”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚T‚T|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚T‚T|ŽæÁ¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚T‚T|\¿ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T|\¿ˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚T‚T|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T|\¿ŽæÁ‹æ•ª  PIC  X(001).
           03  ‚c‚T‚T|\¿ŽæÁ“ú    PIC  X(008).
           03  ‚c‚T‚T|\¿ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T|\¿ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T|”„”ƒŒ_–ñ”Ô†  PIC  X(015).
           03  ‚c‚T‚T|”„”ƒŒ_–ñ“ú    PIC  X(008).
           03  ‚c‚T‚T|ŒˆÙƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T|ŒˆÙˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚T‚T|ŒˆÙƒ‰ƒ“ƒN    PIC  X(001).
           03  ‚c‚T‚T|ŒˆÙ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚T|ŒˆÙŽÒƒR[ƒh  PIC  X(008).
           03  ‚c‚T‚T|³”F‹æ•ª      PIC  X(001).
           03  ‚c‚T‚T|ŒˆÙŽæÁ‹æ•ª  PIC  X(001).
           03  ‚c‚T‚T|ŒˆÙŽæÁ“ú    PIC  X(008).
           03  ‚c‚T‚T|ŒˆÙŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T|ŒˆÙŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T|Šm’èƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T|Šm’èˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚T‚T|Šm’èŽæÁ‹æ•ª  PIC  X(001).
           03  ‚c‚T‚T|Šm’èŽæÁ“ú    PIC  X(008).
           03  ‚c‚T‚T|Šm’èŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T|Šm’èŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚T|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚T|XVŽÒ        PIC  X(008).
           03  ‚c‚T‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚T‚T|Ž©ŽÐ”„‹p‘ã    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|Ž©ŽÐ”„‹p‘ãÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|‘¼ŽÐ‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚T‚T|‘Ý“|‘¹Ž¸‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|‘Ý“|‘¹Ž¸‹à‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|‘Ý“|‘¹Ž¸‹à‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|‘Ý“|‘¹Ž¸‹à–¢‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|ˆø“næ‹æ•ª    PIC  X(001).
           03  ‚c‚T‚T|”„‹pˆÏ‘õŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|ˆøŽæ•‰’S‹æ•ª  PIC  X(001).
           03  ‚c‚T‚T|ˆøŽæ”ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|””ï—pÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚T‚T|Áž’Ê”Ô      PIC  X(011).
           03  ‚c‚T‚T|•¨Œˆ•ª\¿ðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚T‚T|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚T|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚T|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚T‚T|‰‰ñ“ü‹à“ú    PIC  X(008).
           03  ‚c‚T‚T|Áž”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚T|‰ð–ñ\¿˜A”Ô  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚T|‘ã•\•¨Œ”Ô†  PIC S9(004) PACKED-DECIMAL.
