      *****************************************************************
      *   “ü‹àÁžŠÇ—|“ü‹à–¾×(D57NKM_TBL)
      *****************************************************************
       01  “ü‹àÁžŠÇ—|“ü‹à–¾×.
           03  ‚c‚T‚V‚m‚j‚l|Áž’Ê”Ô      PIC  X(011).
           03  ‚c‚T‚V‚m‚j‚l|“ü‹à’Ê”Ô      PIC  X(011).
           03  ‚c‚T‚V‚m‚j‚l|Áž‘ÎÛŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V‚m‚j‚l|ÁžŽæÁ‹æ•ª  PIC  X(001).
           03  ‚c‚T‚V‚m‚j‚l|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚l|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚l|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚l|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚l|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚l|XVŽÒ        PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚l|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
