      *****************************************************************
      *   U‘ÖŽd–ó(D586FRS_TBL)
      *****************************************************************
       01  U‘ÖŽd–ó.
           03  ‚c‚T‚W‚U|“ü‹à“ú      PIC  X(008).
           03  ‚c‚T‚W‚U|‚r‚d‚p”Ô†  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚T‚W‚U|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚W‚U|ŽØ•û‰È–ÚƒR[ƒh
                                     PIC  X(010).
           03  ‚c‚T‚W‚U|ŽØ•û‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚W‚U|ŽØ•û‰ÛÅ‹æ•ª
                                     PIC  X(003).
           03  ‚c‚T‚W‚U|‘Ý•û‰È–ÚƒR[ƒh
                                     PIC  X(010).
           03  ‚c‚T‚W‚U|‘Ý•û‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚W‚U|‘Ý•û‰ÛÅ‹æ•ª
                                     PIC  X(003).
           03  ‚c‚T‚W‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚W‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚W‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚W‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚W‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚W‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚W‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
