      *****************************************************************
      *   ˆóŽ†Å’Ç‰Á”­s(D604INS_TBL)
      *****************************************************************
       01  ˆóŽ†Å’Ç‰Á”­s.
           03  ‚c‚U‚O‚S|•”“XƒR[ƒh  PIC  X(004).
           03  ‚c‚U‚O‚S|•¶‘•ª—Þ    PIC  X(001).
           03  ‚c‚U‚O‚S|ˆóŽ†ÅŠzŽí—Þ
                                     PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚U‚O‚S|ˆóŽ†Å–‡”  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚O‚S|ˆóŽ†ÅŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O‚S|ŽèŒ`–‡”    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚O‚S|ŽèŒ`‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚O‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚O‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚O‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚O‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚O‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚O‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
