      *****************************************************************
      *   ŽØ“ü‹àŽc‚(D646KZN_TBL)
      *****************************************************************
       01  ŽØ“ü‹àŽc‚.
           03  ‚c‚U‚S‚U|ŒŽŽŸ”NŒŽ    PIC  X(006).
           03  ‚c‚U‚S‚U|ŽØ“ü‹à”Ô†  PIC  X(010).
           03  ‚c‚U‚S‚U|ŽØ“üæŽí•Ê  PIC  X(002).
           03  ‚c‚U‚S‚U|ŽØ“üæƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚U‚S‚U|ŽØ“üæ–¼    PIC  X(040).
           03  ‚c‚U‚S‚U|‘“àÂŒ ’ZŠúŽØ“ü‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚S‚U|‘“àÂŒ ’·ŠúŽØ“ü‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚S‚U|‘“àÂŒ ŽØ“ü‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚S‚U|·“ü—¦      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚S‚U|ŠCŠOÂŒ ŽØ“ü‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚S‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚S‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚S‚U|“o˜^ŽÒ      PIC  X(008).
           03  ‚c‚U‚S‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚S‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚S‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚S‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
