      *****************************************************************
      *   ’•¶‘–ñŠ¼(D650TYK_TBL)
      *****************************************************************
       01  ’•¶‘–ñŠ¼.
           03  ‚c‚U‚T‚O|–ñŠ¼ƒpƒ^[ƒ“
                                     PIC  X(001).
           03  ‚c‚U‚T‚O|s”Ô†      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚T‚O|•¶ŽšŽí      PIC  X(001).
           03  ‚c‚U‚T‚O|ƒtƒHƒ“ƒgƒTƒCƒY
                                     PIC  X(002).
           03  ‚c‚U‚T‚O|•¶–Ê        PIC  X(110).
           03  ‚c‚U‚T‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚T‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚T‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚T‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚T‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚T‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚T‚O|“o˜^’S“–ŽÒ  PIC  X(008).
