      *****************************************************************
      *   ’ñŒgƒŠ[ƒX–ž—¹’ñŒgæŒ_–ñŠî–{(D664MTK_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX–ž—¹’ñŒgæŒ_–ñŠî–{.
           03  ‚c‚U‚U‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚U‚S|XV‹æ•ª    PIC  X(001).
           03  ‚c‚U‚U‚S|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚U‚U‚S|–ž—¹ˆ—“ú  PIC  X(008).
           03  ‚c‚U‚U‚S|ÄƒŠ[ƒXˆ—Œ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚U‚U‚S|”„‹pˆ—Œ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚U‚U‚S|”pŠüˆ—Œ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚U‚U‚S|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚U‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚S|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚S|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚S|ÄƒŠ[ƒXŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚U‚U‚S|ÄƒŠ[ƒXŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|ÄƒŠ[ƒX—¿‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|ÄƒŠ[ƒXÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|¿‹Žx•¥ƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|Žx•¥‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|‚a‚h‚f‚h‚m‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|‰ñŽû•ûŽ®‚P  PIC  X(001).
           03  ‚c‚U‚U‚S|‰ñŽû•ûŽ®‚Q  PIC  X(001).
           03  ‚c‚U‚U‚S|˜’uŠúŠÔ    PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|“ü‹àŠî€“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|ŒvŽZ•ûŽ®    PIC  X(001).
           03  ‚c‚U‚U‚S|‹âsƒR[ƒh  PIC  X(007).
           03  ‚c‚U‚U‚S|ŒûÀ”Ô†    PIC  X(007).
           03  ‚c‚U‚U‚S|—a‹àŽí•Ê    PIC  X(001).
           03  ‚c‚U‚U‚S|Žc‰¿Ý’èŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|Žc‰¿‰ñŽû“ú  PIC  X(008).
           03  ‚c‚U‚U‚S|”„‹p‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|”„‹pÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|”„‹pÁ”ïÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|”„‹pÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚U‚S|”„‹p“ü‹à—\’è“ú
                                     PIC  X(008).
           03  ‚c‚U‚U‚S|”„‹pˆÏ‘õŽè”—¿‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚S|ˆøŽæ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚S|ˆøŽæ”ï—p‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
