      *****************************************************************
      *   ’ñŒgƒpƒ‰ƒ[ƒ^ƒ}ƒXƒ^(D669TPA_TBL)
      *****************************************************************
       01  ’ñŒgƒpƒ‰ƒ[ƒ^ƒ}ƒXƒ^.
           03  ‚c‚U‚U‚X|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚X|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚X|•”ƒR[ƒh  PIC  X(004).
           03  ‚c‚U‚U‚X|’S“–ŽÒƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|Œ_–ñ“ú      PIC  X(008).
           03  ‚c‚U‚U‚X|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚X|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚X|¿‹”­sƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|¿‹‘”­s“ú
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|¿‹ŠÔŠu    PIC  X(002).
           03  ‚c‚U‚U‚X|¿‹Šî€ŒŽ  PIC  X(002).
           03  ‚c‚U‚U‚X|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚X|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚X|w“üŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚X|w“üæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚X|Â–±‹¦’²‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒvŽZ•ûŽ®    PIC  X(001).
           03  ‚c‚U‚U‚X|ˆÄŒ”­¶——R
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|Žc‰¿•ÛØæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚X|‰c‹Æ•”ˆÓŒ©  PIC  X(160).
           03  ‚c‚U‚U‚X|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚U‚U‚X|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚U‚U‚X|Ð‰îæ‹æ•ª  PIC  X(001).
           03  ‚c‚U‚U‚X|Ð‰îæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚X|Ð‰îæŒ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚X|Ð‰îæ‚a‚s‚l–{Žx“XƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚U‚U‚X|Ð‰îæ•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|Ð‰îæ‹âsƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚U‚U‚X|‹¦’²“]‹æ•ª  PIC  X(001).
           03  ‚c‚U‚U‚X|‹¦’²‰ñŽû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|‘¹ŠQ”…ž‹àŒvŽZ•û–@
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|‘¹ŠQ”…ž‹à•¶Œ¾
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|•¨ŒŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|ŒŸŽû“ú
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|ŒŸŽû“ú
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‘OŒŽ“–ŒŽ‹à—˜‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‘OŒŽ“–ŒŽ‹à—˜‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚P
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚Q
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚R
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚S
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ŒJ‰„‹æ•ª‚T
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚P
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚Q
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚R
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚S
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ŒJ‰„‹æ•ª‚T
                                     PIC  X(003).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚P
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚Q
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚R
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚S
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚T
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚P
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚Q
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚R
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚S
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg‚T
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚P
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚Q
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚R
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚S
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‚a‚n‚s‚kŽx•¥“ú‚T
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚P
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚Q
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚R
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚S
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‚a‚n‚s‚kŽx•¥“ú‚T
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ðŒ‚P
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ðŒ‚Q
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ðŒ‚R
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ðŒ‚S
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|Žx•¥ðŒ‚T
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ðŒ‚P
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ðŒ‚Q
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ðŒ‚R
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ðŒ‚S
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|Žx•¥ðŒ‚T
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|ˆ´ùŽè”—¿Žx•¥ƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|ˆ´ùŽè”—¿Žx•¥ƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|ˆ´ùŽè”—¿Žx•¥“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|ˆ´ùŽè”—¿Žx•¥“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‰‰ñ‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‰‰ñ‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‰‰ñ‰ñŽûƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‰‰ñ‰ñŽûƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‰‰ñ‰ñŽû“ú
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‰‰ñ‰ñŽû“ú
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‰‰ñ˜’uŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‰‰ñ˜’uŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚X|ŒŸŽû‚P|‰‰ñ‰ñŽû“ú•¶Œ¾
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ŒŸŽû‚Q|‰‰ñ‰ñŽû“ú•¶Œ¾
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|“Á–ñð€    PIC  X(320).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|’ñŒgæ‚P
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|’ñŒgæ‚Q
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|’ñŒgæ‚R
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|’ñŒgæ‚S
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|’ñŒgæ‚T
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚P
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚Q
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚R
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚S
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|‚a‚n‚s‚k‚T
                                     PIC  X(030).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚P
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚Q
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚R
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚S
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|•¨Œ–¼ƒJƒi|•ÏŠ·‹æ•ª‚T
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|’ •[o—Í”NŒŽ“ú|ƒvƒ‰ƒXŒŽ”
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|’ •[o—Í”NŒŽ“ú|“ú
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|ˆø“næ‹æ•ª|”„‹p
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|ˆø“næ‹æ•ª|”pŠü
                                     PIC  X(001).
           03  ‚c‚U‚U‚X|”„‹p‹àŠz“ü‹àŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚X|”„‹p‹àŠz“ü‹àæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚X|”„‹pˆÏ‘õŽè”—¿Š„‡
                                     PIC S9(000)V9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚X|”„‹p‹àŠz“ü‹à—\’è“ú|ƒvƒ‰ƒXŒŽ”
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|”„‹p‹àŠz“ü‹à—\’è“ú|“ú
                                     PIC  X(002).
           03  ‚c‚U‚U‚X|Žó“nŠúŒÀ    PIC  X(030).
           03  ‚c‚U‚U‚X|Žx•¥ðŒ    PIC  X(040).
           03  ‚c‚U‚U‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚U‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚U‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
