      *****************************************************************
      *   ’ñŒgƒŠ[ƒX•¨Œ–¾×(D682TBK_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX•¨Œ–¾×.
           03  ‚c‚U‚W‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚W‚Q|Œ_–ñŽí—Þ    PIC  X(001).
           03  ‚c‚U‚W‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚Q|’ñŒgæŒ_–ñ”Ô†
                                     PIC  X(012).
           03  ‚c‚U‚W‚Q|•¨Œ”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|’ñŒgæ‹æ•ª  PIC  X(002).
           03  ‚c‚U‚W‚Q|’ñŒgæ•¨Œ”Ô†
                                     PIC  X(003).
           03  ‚c‚U‚W‚Q|Œ_–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚Q|ŒŸŽû—\’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚Q|ŒŸŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚Q|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ƒŠ[ƒX—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ƒŠ[ƒX—¿’P‰¿‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ƒŠ[ƒX—¿Á”ïÅŠz’P‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ƒŠ[ƒX‹àŠz|‰‚ß
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|””ï—p‚»‚Ì‘¼‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ŒŽŠz•½‹Ï•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‘OŽóŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‘OŽóƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žx•¥‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Ý’uŠúŠÔ    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ˆê‰ñƒŠ[ƒX—¿“ü‹à”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚Q|•¨Œ–¼      PIC  X(060).
           03  ‚c‚U‚W‚Q|•¨Œ–¼|ƒJƒi
                                     PIC  X(060).
           03  ‚c‚U‚W‚Q|Žd—l»‘¢”Ô†
                                     PIC  X(020).
           03  ‚c‚U‚W‚Q|”—Ê        PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|’PˆÊ        PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|w“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žd“üÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Ž‘ŽYƒR[ƒh  PIC  X(007).
           03  ‚c‚U‚W‚Q|‘Ï—p”N”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|’†ŒÃŽ‘ŽYƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚U‚W‚Q|“®‘•ÛŒ¯ƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚Q|“®‘•ÛŒ¯—¿—¦
                                     PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚U‚W‚Q|Å‹æ•ª      PIC  X(001).
           03  ‚c‚U‚W‚Q|Å•‰’S‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚Q|Ý’uêŠ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚U‚W‚Q|ZŠƒR[ƒh  PIC  X(011).
           03  ‚c‚U‚W‚Q|Ý’uêŠZŠ‚P
                                     PIC  X(060).
           03  ‚c‚U‚W‚Q|Ý’uêŠZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚U‚W‚Q|Ý’uêŠZŠ‚R
                                     PIC  X(060).
           03  ‚c‚U‚W‚Q|Ý’uêŠ–¼  PIC  X(080).
           03  ‚c‚U‚W‚Q|Ý’uêŠ–¼|ƒJƒi
                                     PIC  X(080).
           03  ‚c‚U‚W‚Q|Œ^Ž®”Ô†    PIC  X(015).
           03  ‚c‚U‚W‚Q|ŒÂ•ÊƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žc‰¿Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žc‰¿•ÛØ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚Q|‰ïŽÐƒR[ƒh  PIC  X(002).
           03  ‚c‚U‚W‚Q|Žx“XƒR[ƒh  PIC  X(006).
           03  ‚c‚U‚W‚Q|ƒGƒ“ƒhƒ†[ƒU[|Ž–¼
                                     PIC  X(060).
           03  ‚c‚U‚W‚Q|ƒGƒ“ƒhƒ†[ƒU[|—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚U‚W‚Q|ƒGƒ“ƒhƒ†[ƒU[|ZŠ
                                     PIC  X(100).
           03  ‚c‚U‚W‚Q|ƒGƒ“ƒhƒ†[ƒU[|“d˜b”Ô†
                                     PIC  X(012).
           03  ‚c‚U‚W‚Q|ƒGƒ“ƒhƒ†[ƒU[|¶”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚Q|ƒŠ[ƒX—¿’PˆÊ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚Q|ÄƒŠ[ƒX—¿ŒW”
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žè”—¿”ä—¦  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚P
                                     PIC  X(010).
           03  ‚c‚U‚W‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚Q
                                     PIC  X(010).
           03  ‚c‚U‚W‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚R
                                     PIC  X(010).
           03  ‚c‚U‚W‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚S
                                     PIC  X(010).
           03  ‚c‚U‚W‚Q|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚U‚W‚Q|”„Žå–¼      PIC  X(060).
           03  ‚c‚U‚W‚Q|”„ŽåZŠ    PIC  X(060).
           03  ‚c‚U‚W‚Q|Žx•¥ðŒƒR[ƒh
                                     PIC  X(030).
           03  ‚c‚U‚W‚Q|ŠJŽn”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚Q|I—¹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚Q|Ž}”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ÄƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|•ÛŽçŒ_–ñæ–¼
                                     PIC  X(030).
           03  ‚c‚U‚W‚Q|ŽÀŽ¿ƒŠ[ƒX—¿‚o‚u
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žc‰¿‚o‚u    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ˆê•”‰ð–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚Q|‰ð–ñ——RƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚U‚W‚Q|Ž‘ŽYˆ•ªƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚U‚W‚Q|Žx•¥Ï‘O•¥ƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žx•¥Ï‘O•¥ƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‰ßèƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‰ßèƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|–¢•¥‚¢ƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|–¢•¥‚¢ƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|’ñŒg‹K‘¹‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|’ñŒg‹K‘¹‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|·ˆø‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|·ˆø‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|–¢•¥ŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Už’âŽ~”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚Q|Œ_–ñ‹æ•ª    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‰ïˆõ”Ô†    PIC  X(016).
           03  ‚c‚U‚W‚Q|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚Q|‰ð–ñƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Ž‘ŽY”Ô†    PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‹ŒŽ‘ŽY”Ô†  PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|”„‹pŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|”„‹pŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|”„‹pŽ––±‘ãsŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|”„‹pŽ––±‘ãsŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|”„‹p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚Q|‹@ŽíƒR[ƒh  PIC  X(015).
           03  ‚c‚U‚W‚Q|‹@”Ô        PIC  X(012).
           03  ‚c‚U‚W‚Q|‹@ŠB”Ô†    PIC  X(020).
           03  ‚c‚U‚W‚Q|w“ü‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Œ^Ž®        PIC  X(025).
           03  ‚c‚U‚W‚Q|Ž©ŽÐŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Ž©ŽÐ•ÛØæƒR[ƒh
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|•¨Œ‹æ•ª    PIC  X(002).
           03  ‚c‚U‚W‚Q|•¨ŒŽí•Ê‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚W‚Q|»‘¢‹ÆŽÒƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚W‚Q|»‘¢‹ÆŽÒ–¼  PIC  X(060).
           03  ‚c‚U‚W‚Q|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚Q|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚Q|w“üŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚Q|w“üæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚Q|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚U‚W‚Q|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚Q|ŽèŒ`UoƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚Q|Žx•¥ƒTƒCƒg  PIC  X(004).
           03  ‚c‚U‚W‚Q|Žx•¥“ú      PIC  X(008).
           03  ‚c‚U‚W‚Q|ŽèŒ`Uo“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ŽèŒ`Šú“úƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚Q|ŽèŒ`Šú“ú    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ŽèŒ`Žó“n•û–@
                                     PIC  X(004).
           03  ‚c‚U‚W‚Q|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(013).
           03  ‚c‚U‚W‚Q|Žx•¥‘ŠŽEŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žx•¥‘ŠŽEÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|­ŠzŽ‘ŽY    PIC  X(014).
           03  ‚c‚U‚W‚Q|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‘¼ŽÐw“üŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‘¼ŽÐŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žc‰¿‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚Q|Žw’è“dŽqŒvŽZ‹@
                                     PIC  X(040).
           03  ‚c‚U‚W‚Q|“dŽqŒvŽZ‹@Š—LŽÒ
                                     PIC  X(040).
           03  ‚c‚U‚W‚Q|Žc‰¿•ÛØæƒR[ƒh
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|Žx•¥ŒJ‰„‹æ•ª
                                     PIC  X(003).
           03  ‚c‚U‚W‚Q|‚a‚n‚s‚kŽx•¥ƒTƒCƒg
                                     PIC  X(004).
           03  ‚c‚U‚W‚Q|‚a‚n‚s‚kŽx•¥“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|ŒÅ’èŽ‘ŽYÅ—¦
                                     PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚Q|‘¹ŠQ•ÛŒ¯    PIC  X(012).
           03  ‚c‚U‚W‚Q|Žx•¥ðŒ    PIC  X(002).
           03  ‚c‚U‚W‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚W‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚W‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
