      *****************************************************************
      *   ƒpƒ‰ƒ[ƒ^’ù³Q‰æ–Ê§Œä(D683PTS_TBL)
      *****************************************************************
       01  ƒpƒ‰ƒ[ƒ^’ù³|‰æ–Ê§Œä.
           03  ‚c‚U‚W‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚R|‚r‚d‚p|‚m‚n
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚R|€–Ú–¼Ì    PIC  X(100).
           03  ‚c‚U‚W‚R|Žg—p‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚R|•\Ž¦‹æ•ª    PIC  X(001).
           03  ‚c‚U‚W‚R|”wŒiF‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚R|Žg—p‚c‚v    PIC  X(030).
           03  ‚c‚U‚W‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚W‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚W‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
