      *****************************************************************
      *   ”Ä—pŽx•¥ƒ}ƒXƒ^(D733HSH_TBL)
      *****************************************************************
       01  ”Ä—pŽx•¥ƒ}ƒXƒ^.
           03  ‚c‚V‚R‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚R‚R|ÄƒŠ[ƒXƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚R‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚R‚R|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚R‚R|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚R‚R|‰¼“`•[”Ô†  PIC  X(012).
           03  ‚c‚V‚R‚R|“`•[”Ô†    PIC  X(012).
           03  ‚c‚V‚R‚R|Žæˆø“ú      PIC  X(008).
           03  ‚c‚V‚R‚R|“–‰Žæˆø“ú  PIC  X(008).
           03  ‚c‚V‚R‚R|‚u‚`‚k‚t‚d“ú
                                     PIC  X(008).
           03  ‚c‚V‚R‚R|ŽæˆøæƒR[ƒh|‘ŠŽèæ
                                     PIC  X(009).
           03  ‚c‚V‚R‚R|Žx•¥æƒR[ƒh|‘ŠŽèæ
                                     PIC  X(005).
           03  ‚c‚V‚R‚R|‘ŠŽèæ–¼    PIC  X(056).
           03  ‚c‚V‚R‚R|Žg“r–¾×    PIC  X(056).
           03  ‚c‚V‚R‚R|Žx•¥•û–@    PIC  X(002).
           03  ‚c‚V‚R‚R|Žx•¥—\’è“ú  PIC  X(008).
           03  ‚c‚V‚R‚R|Žx•¥“ú      PIC  X(008).
           03  ‚c‚V‚R‚R|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚R|Žx•¥•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚R‚R|Žx•¥‹âsƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚V‚R‚R|Žx•¥—a‹àŽí–Ú
                                     PIC  X(001).
           03  ‚c‚V‚R‚R|Žx•¥—a‹àŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚V‚R‚R|ŽæˆøæƒR[ƒh|ŽóŽææ
                                     PIC  X(009).
           03  ‚c‚V‚R‚R|Žx•¥æƒR[ƒh|ŽóŽææ
                                     PIC  X(005).
           03  ‚c‚V‚R‚R|ŽóŽæ‹âsƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚V‚R‚R|ŽóŽæ—a‹àŽí–Ú
                                     PIC  X(001).
           03  ‚c‚V‚R‚R|ŽóŽæ—a‹àŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚V‚R‚R|ŽóŽææ–¼    PIC  X(056).
           03  ‚c‚V‚R‚R|‹Æ–±ƒR[ƒh  PIC  X(002).
           03  ‚c‚V‚R‚R|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚R|¿‹ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚R‚R|“ü—Í•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚R‚R|ó‘Ô‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚R|Žx•¥‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚R|³”FŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚R‚R|³”F“ú•t    PIC  X(008).
           03  ‚c‚V‚R‚R|³”FŽž    PIC  X(006).
           03  ‚c‚V‚R‚R|“o˜^íœ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚R‚R|ŽæÁ“`•[”Ô†
                                     PIC  X(012).
           03  ‚c‚V‚R‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚R‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚R‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚R‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚R‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚R‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚R‚R|XVŽÒ      PIC  X(008).
