      *****************************************************************
      *   Œo”ïƒ}ƒXƒ^(D744KFK_TBL)
      *****************************************************************
       01  Œo”ïƒ}ƒXƒ^.
           03  ‚c‚V‚S‚S|•”“XƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚S‚S|•”“X–¼      PIC  X(040).
           03  ‚c‚V‚S‚S|”NŒŽ        PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|’÷“ú‹æ•ª    PIC  X(001).
           03  ‚c‚V‚S‚S|•Š‰Ûˆ—‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚S‚S|’¼ÚŒo”ï    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|–{ŽÐ‹¤’Ê”ï  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|ŠÔÚŒo”ï|‚»‚Ì‘¼
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|ŠÔÚŒo”ï|ŠÔÚ•”–å
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|’²®‹àŠz|’¼ÚŒo”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|’²®‹àŠz|–{ŽÐ‹¤’Ê”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|’²®‹àŠz|ŠÔÚŒo”ï‚»‚Ì‘¼
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|’²®‹àŠz|ŠÔÚŒo”ïŠÔÚ•”–å
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚S‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚S‚S|XVŽÒ      PIC  X(008).
