      *****************************************************************
      *   ŒŸŽû—š—ð(D781KNR_TBL)
      *****************************************************************
       01  ŒŸŽû—š—ð.
           03  ‚c‚V‚W‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‹æ•ª        PIC  X(001).
           03  ‚c‚V‚W‚P|ƒGƒ“ƒgƒŠ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|ƒGƒ“ƒgƒŠŽžŠÔ
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|Œ©Ï”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚P|âg‹cŒˆÙ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|‘Ý•tŽÀs—\’è“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|¬–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|Œ_–ñŒ–¼    PIC  X(040).
           03  ‚c‚V‚W‚P|ƒGƒ“ƒhƒ†[ƒUƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚P|Œ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|Ð‰îƒ‹[ƒg  PIC  X(001).
           03  ‚c‚V‚W‚P|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚P|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|•Ï‘¥•¥      PIC  X(001).
           03  ‚c‚V‚W‚P|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|Œ_–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|’S•Û‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|‹¦’²‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚P|ŽåŠ²Ž–æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚P|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ƒ†[ƒU—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|’·ƒvƒ‰‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚P|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚V‚W‚P|‘æ‚P‰ñ‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‘æ‚P‰ñ‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‘æ‚P‰ñ‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‘æ‚P‰ñ‰ñŽû‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|U‘ÖŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|“ª‹à‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|‰c‹ÆƒRƒƒ“ƒg—“‚P
                                     PIC  X(080).
           03  ‚c‚V‚W‚P|‰c‹ÆƒRƒƒ“ƒg—“‚Q
                                     PIC  X(080).
           03  ‚c‚V‚W‚P|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚P|–ž—¹ˆÄ“à‘—•t‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|–ž—¹ˆÄ“à‰ñ“š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚P|‘k‹yˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‘k‹yˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|ŒŸŽûŽæÁ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|ŒŸŽûŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|“–‰‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ÅV‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ÅI•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒXƒf[ƒ^ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒXŽ©“®ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|ƒŠ[ƒXŠ„•Š‘O•¥ŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|“ª‹à¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‘O•¥¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|“ª‹à¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‘O•¥¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚P|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|•¨ŒŠm”F    PIC  X(001).
           03  ‚c‚V‚W‚P|‚Ü‚é‚ß’PˆÊ  PIC  X(001).
           03  ‚c‚V‚W‚P|“à–óˆóü•û–@
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Œ_–ñŠúŠÔ‰ñ”ˆóü—L–³
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|¬–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|¬–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|¬–ñŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX¿‹ŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚W‚P|“–‰—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|“–‰‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|“–‰ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|“–‰Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆÈ~‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆÈ~‰ñŽû“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆÈ~‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‹ŒŽæˆø”Ô†  PIC  X(010).
           03  ‚c‚V‚W‚P|‰ð–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|‰ð–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|–ž—¹—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|–ž—¹—\–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒXŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|³ŒpƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|³Œpˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|³ŒpŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|³ŒpŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|”„‹pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|”„‹pˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|ðŒ•ÏXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|ðŒ•ÏXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚P|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Œ_–ñ—¿—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‘e—˜Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|“–‰Œ_–ñ—¿—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆÈ~‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|¿‹ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|¿‹ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|¿‹Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|Œ_–ñŽæˆø‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Ó”C‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|‘ŠŽE‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|’•¶‘o—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|–ž—¹ˆÄ“à’ •[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX—¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Œ_–ñ‘Ž®    PIC  X(001).
           03  ‚c‚V‚W‚P|•¨Œ•ÛŠÇêŠ
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|¿‹æ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚P|•s“®ŽY’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|—L‰¿ØŒ”’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‚»‚Ì‘¼’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|•ÛØl—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|–¢ŽûŽc‚‘ÎÛŠOƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚V‚W‚P|“®‘•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|“®‘•t•ÛŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚P|–â‡‚¹”Ô†  PIC  X(010).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‹ŒŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚V‚W‚P|w“ü‘I‘ðŒ •tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX\¿‘—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|³Œp\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ƒŠƒXƒPƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‘e—˜‰vŠz|•\
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‚¨Žx•¥–¾×‘ì¬Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‚¨Žx•¥–¾×‘—v”Û
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|\¿”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|‘ÎÛŒ³–{Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚P|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|¿‹Šî€    PIC  X(001).
           03  ‚c‚V‚W‚P|ŽŸ‰ñÄƒŠ[ƒX‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽŸ‰ñÄƒŠ[ƒX‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽG”ï•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽG”ï”Ì‘£”ï  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽG”ïM—p•ÛŒ¯
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽG”ï‚»‚Ì‘¼  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|’¥‹Š®—¹ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|’¥‹Š®—¹ŽæÁƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ŽŸ‰ñÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Œ_–ñ‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|’•¶‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‚»‚Ì‘¼”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‰c‹ÆƒRƒƒ“ƒg—“‚R
                                     PIC  X(080).
           03  ‚c‚V‚W‚P|ŽÐ“à‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ŽG”ï’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‹¦’²‰ñŽû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|’P”N“xŒ_–ñ  PIC  X(001).
           03  ‚c‚V‚W‚P|ƒoƒbƒNŽæˆø  PIC  X(001).
           03  ‚c‚V‚W‚P|”Û”F‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚P|”ñ‰ÛÅ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚P|•ïŠ‡‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|ŠCŠOÝ’u‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|•¨ŒƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚V‚W‚P|‰ð–ñ‹àŒvŽZ•û–@
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|”À“ü—\’è“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|\¿Œ_–ñŠz‰ÁŽZƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Ð‰îæŽæˆøæ
                                     PIC  X(009).
           03  ‚c‚V‚W‚P|Ð‰îæŒ_–ñæ
                                     PIC  X(005).
           03  ‚c‚V‚W‚P|Ð‰îæ‚a‚s‚l
                                     PIC  X(004).
           03  ‚c‚V‚W‚P|Ð‰îæ—»“X  PIC  X(004).
           03  ‚c‚V‚W‚P|Ð‰îæ‹âs  PIC  X(004).
           03  ‚c‚V‚W‚P|Ð‰îæŽx“X  PIC  X(003).
           03  ‚c‚V‚W‚P|¿‹“ú      PIC  X(002).
           03  ‚c‚V‚W‚P|Œ_–ñŽæÁ——R‚P
                                     PIC  X(080).
           03  ‚c‚V‚W‚P|Œ_–ñŽæÁ——R‚Q
                                     PIC  X(080).
           03  ‚c‚V‚W‚P|Œ_–ñŽæÁ\¿‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ŒˆÙ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Œ_–ñ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ŒŸŽû“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Œ_–ñŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ŒŸŽûŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|•ÏX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|•ÏXƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚P|•ÏX”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|Â–±‹¦’²ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚W‚P|ˆê”Ê‘åŒû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|§“xƒŠ[ƒX  PIC  X(001).
           03  ‚c‚V‚W‚P|Šî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‘e—˜Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆê”ÊŽÐ“à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆê”ÊŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆê”Ê‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆê”ÊŠî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆê”ÊŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆê”Ê‘e—˜ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‹­§•Û‘¶ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚W‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚W‚P|ˆ´ùŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‹Æ–±‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|”ƒ–ß‹`–±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‘ã—‰ñŽû    PIC  X(001).
           03  ‚c‚V‚W‚P|”ƒŽæ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‹à—˜•Ï“®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|˜A“®‹à—˜‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚P|Š„ˆø—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‘Ý•t‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‘Ý•t‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|Ž‘‹àŽg“r‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚P|Ž‘‹àŽg“r•¶Œ¾
                                     PIC  X(080).
           03  ‚c‚V‚W‚P|Žx•¥ˆÏ‘õŽæˆøŒ`‘Ô
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|—ZŽ‘•û–@    PIC  X(001).
           03  ‚c‚V‚W‚P|•ÔÏðŒ    PIC  X(001).
           03  ‚c‚V‚W‚P|ƒŠ[ƒXŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Ž‘ŽY‰È–Ú‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|d—v«Šî€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‘O“n‹à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ƒgƒŠƒvƒ‹ƒIƒvƒVƒ‡ƒ“•ûŽ®
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ˆø‡’†Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|“à—e•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|³Œp•ªŠ„Ží—Þ
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|³Œp‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|–ž—¹ðŒ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|‘æ‚P‰ñ–Ú‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚V‚W‚P|‘æ‚Q‰ñ–ÚˆÈ~‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚V‚W‚P|÷“nðŒ•tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Žx•¥Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‘¹ŠQ”…ž‹à•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚V‚W‚P|—¬“®‰»”Ô†  PIC  X(006).
           03  ‚c‚V‚W‚P|—¬“®‰»æ    PIC  X(007).
           03  ‚c‚V‚W‚P|M‘õæÝ’è“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|M‘õI—¹“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|·“ü—\–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ÂŒ ”ƒŽæ“ú  PIC  X(008).
           03  ‚c‚V‚W‚P|‘ŠŽEð€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|÷“n‹ÖŽ~“Á–ñ
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|æ•ûŒ_–ñ”Ô†
                                     PIC  X(016).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX—¿•ªŽq
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX—¿•ª•ê
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|‰c‹ÆƒRƒƒ“ƒg—“‚S
                                     PIC  X(080).
           03  ‚c‚V‚W‚P|V‹Kæ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚P|e–§æ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚P|à–±•”‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ˆê”Ê‘O“n‹à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|ŒˆÙƒ‰ƒ“ƒN  PIC  X(001).
           03  ‚c‚V‚W‚P|‚¨—çó”­sƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|ˆÚsƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX\¿ðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚W‚P|–â‚¢‡‚í‚¹’S“–•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚P|–â‚¢‡‚í‚¹’S“–ŽÒ–¼
                                     PIC  X(020).
           03  ‚c‚V‚W‚P|ÄƒŠ[ƒX—¿Žx•¥—\’è“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|–ž—¹’Ê’m‘‰ñ“šŠúŒÀ
                                     PIC  X(008).
           03  ‚c‚V‚W‚P|\¿‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚P|“à—e\¿‘ˆóü‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚P|“à—e\¿‘ˆóüÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|Œ_–ñŒ–¼Ž©“®“o˜^‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚P|•ÔÏŒ´Ž‘    PIC  X(080).
