      *****************************************************************
      *   Žæˆøæ—š—ðƒ}ƒXƒ^(D782TRR_TBL)
      *****************************************************************
       01  Žæˆøæ—š—ðƒ}ƒXƒ^.
           03  ‚c‚V‚W‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚Q|–¼Šñ‚¹ƒR[ƒh
                                     PIC  X(040).
           03  ‚c‚V‚W‚Q|Žæˆøæ–¼Ì  PIC  X(080).
           03  ‚c‚V‚W‚Q|Žæˆøæ’Z–¼Ì
                                     PIC  X(016).
           03  ‚c‚V‚W‚Q|ŽæˆøæƒJƒi–¼Ì
                                     PIC  X(040).
           03  ‚c‚V‚W‚Q|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚V‚W‚Q|”[•tæƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚V‚W‚Q|ZŠ‚P      PIC  X(060).
           03  ‚c‚V‚W‚Q|ZŠ‚Q      PIC  X(060).
           03  ‚c‚V‚W‚Q|ZŠ‚R      PIC  X(060).
           03  ‚c‚V‚W‚Q|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚V‚W‚Q|‹ŒŽÐ–¼      PIC  X(080).
           03  ‚c‚V‚W‚Q|Ž‘–{‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Ý—§”N      PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Ý—§ŒŽ      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|ŒÚ‹q‹æ•ª    PIC  X(002).
           03  ‚c‚V‚W‚Q|Šé‹Æ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚W‚Q|]‹Æˆõ”    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|‹ÆŽíƒR[ƒh  PIC  X(005).
           03  ‚c‚V‚W‚Q|Ši•tƒ‰ƒ“ƒN  PIC  X(003).
           03  ‚c‚V‚W‚Q|Œ»’S“–ŽÒ    PIC  X(008).
           03  ‚c‚V‚W‚Q|¿‹æÅI”Ô†
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Žx•¥æÅI”Ô†
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Žå’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚Q|Ši•tƒ‰ƒ“ƒN‚Q
                                     PIC  X(003).
           03  ‚c‚V‚W‚Q|‘ã•\ŽÒ–¼Ì  PIC  X(020).
           03  ‚c‚V‚W‚Q|ƒAƒhƒŒƒX    PIC  X(040).
           03  ‚c‚V‚W‚Q|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|—^MŠ‡‚èƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚V‚W‚Q|‰‰ñ¿‹˜’u‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|–ž—¹ˆÄ“à‘—•t‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|“Á’èŽæˆøæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|Ž–‹ÆŠ–¼Ì  PIC  X(080).
           03  ‚c‚V‚W‚Q|Ž–‹ÆŠ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚V‚W‚Q|Ž–‹ÆŠZŠƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚V‚W‚Q|Ž–‹ÆŠZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚V‚W‚Q|Ž–‹ÆŠ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚V‚W‚Q|¶”NŒŽ“ú    PIC  X(008).
           03  ‚c‚V‚W‚Q|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|‘Ý“|”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚Q|‘Ý“|‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|‘Ý“|——RƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚W‚Q|‘Ý“|ƒRƒƒ“ƒg
                                     PIC  X(100).
           03  ‚c‚V‚W‚Q|‘Ý“|\¿”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚Q|Ž©“®¿‹ƒf[ƒ^ì¬—v”Û
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|ŠJŽ¦’ •[Žæ“¾‰¿Ši‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|ŽæˆøŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚W‚Q|‘n‹Æ”NŒŽ    PIC  X(006).
           03  ‚c‚V‚W‚Q|Œn—ñ        PIC  X(030).
           03  ‚c‚V‚W‚Q|”Ì”„æ      PIC  X(030).
           03  ‚c‚V‚W‚Q|Žd“üæ      PIC  X(030).
           03  ‚c‚V‚W‚Q|Žå—vŠ”Žå    PIC  X(020).
           03  ‚c‚V‚W‚Q|Žå—vŠ”ŽåŽ—¦
                                     PIC S9(003)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|•ÛØlŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|‰ß‹ŽÅ‚“Â‘£’iŠK
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|‰ß‹ŽÅ‚“Â‘£’iŠKXV“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚Q|Œ»ÝÅ‚“Â‘£’iŠK
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|Œ»ÝÅ‚“Â‘£’iŠKXV“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚Q|”„‹pŒ»ÝÅ‚“Â‘£’iŠK
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|”„‹pŒ»ÝÅ‚“Â‘£’iŠKXV“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚Q|ƒŠ[ƒX“Â‘£ŒðÂo—Íƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|’†“r‰ð–ñ“Â‘£ŒðÂo—Íƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|”„‹p“Â‘£ŒðÂo—Íƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚W‚Q|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚V‚W‚Q|‘ã•\ŽÒ–ðE–¼
                                     PIC  X(020).
           03  ‚c‚V‚W‚Q|]‹ÆŽí–¼    PIC  X(020).
           03  ‚c‚V‚W‚Q|ZŠ–¼ƒJƒi  PIC  X(040).
           03  ‚c‚V‚W‚Q|ƒRƒƒ“ƒg—“  PIC  X(120).
           03  ‚c‚V‚W‚Q|’é‘ƒR[ƒh  PIC  X(009).
           03  ‚c‚V‚W‚Q|Žå—vŠ”ŽåŽŠ””
                                     PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Š”Žå”      PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|‘S‘‹ÆŠE‡ˆÊ
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|‘S‘‹ÆŠE‰ïŽÐ”
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Œ§“à‹ÆŠE‡ˆÊ
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Œ§“à‹ÆŠE‰ïŽÐ”
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Ž–‹ÆŠ”    PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Žå—vŽ–‹ÆŠ–¼
                                     PIC  X(120).
           03  ‚c‚V‚W‚Q|—˜—pƒŠ[ƒX‰ïŽÐ–¼
                                     PIC  X(040).
           03  ‚c‚V‚W‚Q|ƒXƒRƒAƒŠƒ“ƒO•]“_
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|’é‘•]“_    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|Ši•t\¿’†ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|Ši•t’²®\¿——R
                                     PIC  X(200).
           03  ‚c‚V‚W‚Q|Ši•t“ú      PIC  X(008).
           03  ‚c‚V‚W‚Q|—^MŒÀ“xŠz“K—p“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚Q|“–ŽÐŽæˆøŠJŽnŒoˆÜ
                                     PIC  X(160).
           03  ‚c‚V‚W‚Q|Šé‹Æ–Ú“I    PIC  X(100).
           03  ‚c‚V‚W‚Q|•\Ž¦’PˆÊ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|‚a‚s‚lŽæˆø‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|‚a‚s‚l’S“–Žx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚W‚Q|î•ñŒðŠ·’Ê’m‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|î•ñŒðŠ·’Ê’mÝ’è“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚Q|‚a‚s‚l˜AŒ‹‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|‚a‚n‚s‚k˜AŒ‹‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|e–§æ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚W‚Q|‚m‚d‚s‚k‚d‚`‚r‚h‚m‚f—˜—p‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚W‚Q|Ž–‹ÆŠZŠ‚P
                                     PIC  X(060).
           03  ‚c‚V‚W‚Q|Ž–‹ÆŠZŠ‚R
                                     PIC  X(060).
           03  ‚c‚V‚W‚Q|Šé‹ÆŒˆŽZŒŽ  PIC  X(002).
           03  ‚c‚V‚W‚Q|ˆê”Ê‘åŒû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|ŽØ“ü‹àŽ¯•Ê‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚Q|ŽØ“üæŽí•Ê  PIC  X(002).
           03  ‚c‚V‚W‚Q|’S•Û·“ü—¦  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚Q|‹Œ–¼Šñ‚¹ƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚W‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚W‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
