      *****************************************************************
      *   ”[•tæˆêŠ‡•ÏX(D805NHN_TBL)
      *****************************************************************
       01  ”[•tæˆêŠ‡•ÏX.
           03  ‚c‚W‚O‚T|‚r‚d‚p      PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚O‚T|‹Œ”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚W‚O‚T|‹Œ”[•tæƒR[ƒh–¼
                                     PIC  X(040).
           03  ‚c‚W‚O‚T|V”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚W‚O‚T|V”[•tæƒR[ƒh–¼
                                     PIC  X(040).
           03  ‚c‚W‚O‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚O‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚O‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚O‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚O‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚O‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚O‚T|XVŽÒ      PIC  X(008).
