      *****************************************************************
      *   ŠÇ——^MŽx•¥(D854KSH_TBL)
      *****************************************************************
       01  ŠÇ——^MŽx•¥.
           03  ‚c‚W‚T‚S|—^MŠÇ—æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚T‚S|Žx•¥—\’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚W‚T‚S|Žx•¥˜A”Ô    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚T‚S|Žx•¥æ–¼    PIC  X(080).
           03  ‚c‚W‚T‚S|Žx•¥——R    PIC  X(020).
           03  ‚c‚W‚T‚S|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚S|Žx•¥Á”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚T‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚T‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
