      *****************************************************************
      *   ŒûU‡Œvƒf[ƒ^(D881KFG_TBL)
      *****************************************************************
       01  ŒûU‡Œvƒf[ƒ^.
           03  ‚c‚W‚W‚P|U‘Ö‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚W‚W‚P|–ñ’è“ú      PIC  X(008).
           03  ‚c‚W‚W‚P|–¾×˜A”Ô    PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚W‚W‚P|U‘Ö“ú      PIC  X(008).
           03  ‚c‚W‚W‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚W‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚W‚P|¿‹æ–¼Ì  PIC  X(040).
           03  ‚c‚W‚W‚P|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚W‚W‚P|‹âs–¼      PIC  X(015).
           03  ‚c‚W‚W‚P|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚W‚W‚P|Žx“X–¼      PIC  X(015).
           03  ‚c‚W‚W‚P|ŒûÀŽí—Þ    PIC  X(001).
           03  ‚c‚W‚W‚P|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚W‚W‚P|–¼‹`l      PIC  X(030).
           03  ‚c‚W‚W‚P|‹àŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚W‚P|Á”ïÅŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚W‚P|‡Œv‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚W‚P|“E—v        PIC  X(040).
           03  ‚c‚W‚W‚P|ƒf[ƒ^•ÏXƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚W‚W‚P|ŒûUˆø—ŽŒ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚W‚W‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚W‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚W‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚W‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚W‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚W‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚W‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
