      *****************************************************************
      *   “úŽŸÂŒ î•ñƒe[ƒuƒ‹(D911SJD_TBL)
      *****************************************************************
       01  “úŽŸÂŒ î•ñƒe[ƒuƒ‹.
           03  ‚c‚X‚P‚P|ƒŒƒR[ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚X‚P‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚X‚P‚P|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|ŒŽŽŸ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚P|ŠúŽñ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚P|Šú––”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚P|“–“ú”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚P|ÂŒ Žc‚‹æ•ª
                                     PIC  X(002).
           03  ‚c‚X‚P‚P|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚P|Œ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚P|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚X‚P‚P|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚P|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚X‚P‚P|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚X‚P‚P|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚P|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚P|¿‹æŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚P|Œ_–ñæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚P|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚P|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚P|Â–±‹¦’²‹æ•ª
                                     PIC  X(002).
           03  ‚c‚X‚P‚P|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚P|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚P|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚P|’S•Û‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚P|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚P|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚P|Á”ïÅ‹æ•ª  PIC  X(002).
           03  ‚c‚X‚P‚P|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚P|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–ŒŽ•ª¿‹‰ñ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|¬–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚P|¬–ñ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚P|¬–ñŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚P|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚P|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|ŒŸŽûŽæÁ“ú  PIC  X(008).
           03  ‚c‚X‚P‚P|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|ŒŸŽûŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚P|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚P|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚P|Œ_–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚P|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚X‚P‚P|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚X‚P‚P|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚P|‘OŽóƒŠ[ƒX—¿“ü‹à“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|“ü‹à“ú      PIC  X(008).
           03  ‚c‚X‚P‚P|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|—¬“®‰»æ    PIC  X(007).
           03  ‚c‚X‚P‚P|”Û”F‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚P|˜’uŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘OŽó[“–ŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚P|‘OŽó[“–ŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|‘OŽó[“–ŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘OŽó[“–”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|‘OŽó[“–ÏŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‰‰ñ‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|ÅI‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚P|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ_–ñ‹àŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ_–ñ‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ_–ñ‹àŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O•¥‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O•¥‹àŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O•¥‹àŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ³–{‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ³–{‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|—˜‘§‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|—˜‘§‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|””ï—p‘Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|””ï—p‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|ŒÅ’èŽ‘ŽYÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“®‘•ÛŒ¯—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Žx•¥—˜‘§“K—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Žx•¥—˜‘§ˆê”Ê‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|ˆÏ‘õ•ÛŽç—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ_–ñÏ–¢ŒŸŽû‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Œ_–ñÏ–¢ŒŸŽûÁ”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|ŒˆÙÏ–¢¬–ñ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|ŒˆÙÏ–¢¬–ñÁ”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Žc‰¿‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚P|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|ÅžŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|ÅžŽc‰¿Ý’èŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|M—p•ÛŒ¯—¿Žc‚‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|M—p•ÛŒ¯—¿Žc‚Á”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––ÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––Á”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–––ñ’èÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–––ñ’èÁ”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––‘OŽó‹àŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––‘OŽó‹àÁ”ïÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––‘OŽó‹àÁ”ïÅŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–––ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–––ñ’è—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––ŽÀŽ¿Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––”„ãŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––”„ãŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––””ï—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––””ï—pŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––Š„•ŠŒ´‰¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––Š„•ŠŒ´‰¿Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰vŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––ŒÅ’èŽ‘ŽYÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––“®‘•ÛŒ¯—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––Žx•¥—˜‘§“K—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––Žx•¥—˜‘§ˆê”ÊŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––ˆÏ‘õ•ÛŽç—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú––”„ã—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜Á”ïÅ‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜ŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜ŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜ŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜Žx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜Žx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜ˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜ŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|‘O“ú–˜ŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––ÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––Á”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–––ñ’èÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–––ñ’èÁ”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––‘OŽó‹àŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––‘OŽó‹àÁ”ïÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––‘OŽó‹àÁ”ïÅŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–––ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–––ñ’è—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––ŽÀŽ¿Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––”„ãŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––”„ãŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––””ï—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––””ï—pŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––Š„•ŠŒ´‰¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––Š„•ŠŒ´‰¿Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰vŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––ŒÅ’èŽ‘ŽYÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––“®‘•ÛŒ¯—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––Žx•¥—˜‘§“K—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––Žx•¥—˜‘§ˆê”ÊŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––ˆÏ‘õ•ÛŽç—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––”„ã—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú––‘OŽóŽû‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–––¢ŽûŽû‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜Á”ïÅ‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜ŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜ŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜ŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜Žx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜Žx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜ˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜ŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–˜ŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‰ñŽûŽÀÑŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‰ñŽûŽÀÑŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‰ñŽûŽÀÑŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‰ñŽûŽÀÑŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úÁ”ïÅ’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úÁ”ïÅ’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–ñ’è’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–ñ’è’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–ñ’è’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–ñ’è’²®ŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‘OŽó’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‘OŽó’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‘OŽó’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‘OŽó’²®ŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–ñ’èŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú–ñ’è—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽÀŽ¿Œ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽÀŽ¿—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú”„ã’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú”„ã’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú””ï—p’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú””ï—p’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‹à—ZŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‹à—ZŒ³–{’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‹à—Z—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú‹à—Z—˜‘§’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŒÅ’èŽ‘ŽYÅ’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú“®‘•ÛŒ¯—¿’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽx•¥—˜‘§’²®Šz“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úŽx•¥—˜‘§’²®Šzˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“úˆÏ‘õ•ÛŽç—¿’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú”„ãŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“–“ú”„ã—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚P‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚X‚P‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚P‚P|XVŽÒ      PIC  X(008).
