      *****************************************************************
      *   Ž‘ŽYî•ñƒe[ƒuƒ‹(D921SIJ_TBL)
      *****************************************************************
       01  Ž‘ŽYî•ñƒe[ƒuƒ‹.
           03  ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚X‚Q‚P|ƒL[î•ñ|Œ_–ñŽí—Þ
                                     PIC  X(003).
           03  ‚c‚X‚Q‚P|ƒL[î•ñ|•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŽåŒ_–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|‹¦’²‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñI—¹“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ˆø“n”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|¬–ñ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒŸŽûŽæÁ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒŸŽûŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚Q‚P|Œ_–ñ“à—e|ŒÚ‹q‹æ•ª
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|ÂŒ |Š¨’èˆ—ƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|Žæ“¾”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|•¨Œ|ˆÚ“®”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|•¨Œ|ó‘Ôƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|ˆÚ“®——R
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|•¨Œ|•¨Œˆ•ª˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|Žæ“¾‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|ŽæÁŽæ“¾‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽæ“¾‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|Žc‰¿‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|Œ_–ñŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|‘¼ŽÐw“üŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|’èŠz|ŒŽŠzž‹p”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|’èŠz|ŒŽŠzž‹p”ï’[”
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|•¨ŒƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|”—Ê  PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|Ž‘ŽYŽí—Þ
                                     PIC  X(007).
           03  ‚c‚X‚Q‚P|•¨Œ|‘Ï—p”N”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|•¨ŒŽí—Þ
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|•¨Œ|Ž©‘¼ŽÐ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|ƒ\ƒtƒg‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|­ŠzŽ‘ŽY‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|’†ŒÃŽ‘ŽY‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|‰ïŽÐž‹p‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|ŒÅ’èŽ‘ŽYÅ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|ŠCŠOÝ’uêŠ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œ|‹ŒŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚X‚Q‚P|•¨Œ|‹Œ•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|•ªŠ„”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|•¨Œ|•ªŠ„Œ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œ|•¨Œ–¼Ì
                                     PIC  X(060).
           03  ‚c‚X‚Q‚P|•¨Œ|‚eŒ^–¼
                                     PIC  X(025).
           03  ‚c‚X‚Q‚P|•¨Œ|ƒfƒB[ƒ‰Žæˆøæ
                                     PIC  X(009).
           03  ‚c‚X‚Q‚P|•¨Œ|ƒfƒB[ƒ‰ƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñ——R
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|‰ð–ñŽæÁƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|ŽæÁ‰ð–ñ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‰ð–ñ–ž—¹|–ž—¹ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|•¨Œˆ•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|\¿ó‘Ôƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|•¨Œˆ•ª\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|ˆ•ªæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|ˆ•ªæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”p”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”p——R
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|•¨Œˆ•ª|”„”pŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|³Œp|³Œpƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|³Œp|³Œp“ñŽŸÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|³Œp|³ŒpŒ³Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚X‚Q‚P|³Œp|³ŒpŒ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|³Œp|³Œpˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|³Œp|³Œp“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|³Œp|³ŒpŽž•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|³Œp|³ŒpŽžž‹p—ÝŒvŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|³Œp|³ŒpŽæÁ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•t•Û‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û“ú”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•t•ÛŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ—L–³
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ž–ŒÌ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯Œp‘±
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯—¿—¦
                                     PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•ÛŒ¯‰¿Ši
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•Ô–ß•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|“®‘•ÛŒ¯ØŒ””Ô†
                                     PIC  X(011).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|•t•Û—¦
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|Ý’uêŠ–¼ƒJƒi
                                     PIC  X(080).
           03  ‚c‚X‚Q‚P|“®‘•ÛŒ¯|”…ž•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|M—p•ÛŒ¯‰ïŽÐƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|‹@ŠB—Þ•ª—ÞƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|’Ê’m‘”­‘—“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|’Ê’m‘”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|•„†
                                     PIC  X(005).
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|Tœ‚·‚×‚«‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|M—p•ÛŒ¯|ˆÈ~‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|Žc‘¶—¦
                                     PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x”[•tæƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|ŒÅ’èŽ‘ŽYÅ—¦
                                     PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘ÎÛŽæ“¾‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|”NÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x•]‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|‘O”N“x—˜_•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|“–”N“x•]‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|“–”N“x—˜_•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|Žc‘¶“ž’Bƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|Žc‘¶“ž’B”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|ŒÅ’èŽ‘ŽYÅ|\ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽó‘Ôƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽŒ_–ñŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ‰ð–ñ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ‰ð–ñ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ”„”p“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ”„”p”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽ”„”p——R
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|‘OŒŽ|ŽæÁ‰ð–ñ——R
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŠú‰ð–ñ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘k‹yˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘k‹yˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‘OŒŽ|‘OŒŽŒo‰ßŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‹¤’Ê|Šú––”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‹¤’Ê|ŠúŽñ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‹¤’Ê|ŒŽŽŸ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|‹¤’Ê|’Ç‰ÁŒ¸­ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‹¤’Ê|Žæ“¾”N“x
                                     PIC  X(004).
           03  ‚c‚X‚Q‚P|‹¤’Ê|ž‹pŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‹¤’Ê|“–ŒŽ–˜ž‹pŒo‰ßŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‹¤’Ê|“–Šúž‹pŒŽ”
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‹¤’Ê|ˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‹¤’Ê|“–ŒŽž‹p‘ÎÛƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‹¤’Ê|’è—¦ž‹p’²®‰Â”\ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|ž‹p’âŽ~ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|ž‹p’âŽ~“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú––•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŠú–˜ž‹pŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|ž‹pŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŒŽž‹pŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|‘OŒŽ–˜ž‹pŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|Œ»Ý•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|œ‹p•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|“–ŒŽ–˜ž‹pŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|“–ŒŽž‹pŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|‰ïŽÐ—˜_|“–Šúž‹pŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú––•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŠú–˜ž‹pŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŒŽž‹pŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|‘OŒŽ–˜ž‹pŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|Œ»Ý•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽ–˜ž‹pŠz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–ŒŽž‹pŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—‰ïŒv|“–Šúž‹pŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|ž‹p—¦
                                     PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|Š„‘ž‹p
                                     PIC  X(002).
           03  ‚c‚X‚Q‚P|Å–±|Š„‘ž‹p—¦
                                     PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|Š„‘ž‹p”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p—¦•ªŽq
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p—¦•ª•ê
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“Á•Êž‹p”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|‘OŠú––ŽÀŽ{Šz•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|‘OŠúŽÀŽ{Šz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|‘OŠúŒJ‰z’´‰ßŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|‘OŠúž‹p•s‘«Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŒÀ“xŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŽÀŽ{Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹pŽÀŽ{Šz—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹p•s‘«Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹p’´‰ßŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“–Šúž‹p‚Ö‚ÌU‘ÖŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“–Šú––ŽÀŽ{Šz•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|\Žc‘¶“ž’Bƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚X‚Q‚P|Å–±|Å–±\Žc‘¶“ž’B”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚Q‚P|Å–±|‘OŠú–––@’è•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|Å–±|“–Šú–––@’è•ë‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|“o˜^”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|“o˜^ŽžŠÔ
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|“o˜^’S“–ŽÒ
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|XV”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|XVŽžŠÔ
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|XVŽÒ
                                     PIC  X(008).
           03  ‚c‚X‚Q‚P|ŠÇ—î•ñ|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
