000010************************************************
000020* (DFS_EDTREC)
000030************************************************
000040 01  DFS_EDTREC-DATTYP PIC  X(001).
000050 01  DFS_EDTREC-BNKCOD PIC  X(004).
000060 01  DFS_EDTREC-BNKNAM PIC  X(015).
000070 01  DFS_EDTREC-BRCCOD PIC  X(003).
000080 01  DFS_EDTREC-BRCNAM PIC  X(015).
000090 01  DFS_EDTREC-PAYDAY PIC  X(004).
000100 01  DFS_EDTREC-DEPKND PIC  X(001).
000110 01  DFS_EDTREC-DEPNUM PIC  X(007).
000120 01  DFS_EDTREC-CSTNAM PIC  X(030).
000130 01  DFS_EDTREC-TRNAMT PIC S9(010) COMP-3.
000140 01  DFS_EDTREC-TRNTYP PIC  X(001).
000150 01  DFS_EDTREC-PAYNUM PIC  X(008).
000160 01  DFS_EDTREC-CSTNUM PIC  X(012).
000170 01  DFS_EDTREC-RESULT PIC  X(001).
000180 01  DFS_EDTREC-CONTAX PIC S9(008) COMP-3.
000190 01  DFS_EDTREC-REGDAY PIC  X(008).
000200 01  DFS_EDTREC-REGTIM PIC  X(006).
000210 01  DFS_EDTREC-REGPSN PIC  X(004).
000220 01  DFS_EDTREC-MODDAY PIC  X(008).
000230 01  DFS_EDTREC-MODTIM PIC  X(006).
000240 01  DFS_EDTREC-MODPSN PIC  X(004).
000250 01  DFS_EDTREC-ERRFLG PIC  X(005).
000260 01  DFS_EDTREC-DBLFLG PIC  X(001).
