000010************************************************
000020* (ELP_PSNMST)
000030************************************************
000040 01  ELP_PSNMST-PSNCOD PIC  X(007).
000050 01  ELP_PSNMST-PSNNAM PIC  X(018).
000060 01  ELP_PSNMST-DIVCOD PIC  X(004).
000070 01  ELP_PSNMST-SEXTYP PIC  X(001).
000080 01  ELP_PSNMST-SHTCOD PIC  X(004).
000090 01  ELP_PSNMST-PRTSEQ PIC  X(003).
