000010************************************************
000020* (EMC_WK_GIMEN)
000030************************************************
000040 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|‹âs’ZkƒR[ƒh PIC  X(002).
000050 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|‹âsƒR[ƒh PIC  X(004).
000060 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|Žx“XƒR[ƒh PIC  X(003).
000070 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|‹âs–¼ PIC  X(030).
000080 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|Žx“X–¼ PIC  X(030).
000090 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|—a‹àŽí—Þ PIC  X(001).
000100 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ŒûÀ”Ô† PIC  X(007).
000110 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ŒûÀ–¼ PIC  X(040).
000120 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|‹æ•ª PIC  X(001).
000130 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚P PIC  X(001).
000140 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚Q PIC  X(001).
000150 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚R PIC  X(001).
000160 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚S PIC  X(001).
000170 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚T PIC  X(001).
000180 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚U PIC  X(001).
000190 01  ‚d‚l‚b|‚v‚j|‚f‚h‚l‚d‚m|ƒ`ƒFƒbƒN‚V PIC  X(001).
