000010************************************************
000020* (EMC_GINKO)
000030************************************************
000040 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|‹âs’ZkƒR[ƒh PIC  X(002).
000050 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|‹âsƒR[ƒh PIC  X(004).
000060 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|Žx“XƒR[ƒh PIC  X(003).
000070 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|‹âs–¼ PIC  X(030).
000080 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|Žx“X–¼ PIC  X(030).
000090 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|—a‹àŽí—Þ PIC  X(001).
000100 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|ŒûÀ”Ô† PIC  X(007).
000110 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|ŒûÀ–¼ PIC  X(040).
000120 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|“o˜^“ú PIC  X(008).
000130 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|“o˜^Žž PIC  X(006).
000140 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|XV“ú PIC  X(008).
000160 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|XVŽž PIC  X(006).
000170 01  ‚d‚l‚b|‚f‚h‚m‚j‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
