000010************************************************
000020* (EMC_WK_JUMEN)
000030************************************************
000040 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000050 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|—X•Ö”Ô† PIC  X(007).
000060 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|ZŠ‚P PIC  X(040).
000070 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|ZŠ‚Q PIC  X(020).
000080 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|Žæˆøæ–¼ PIC  X(040).
000090 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|•”–¼ PIC  X(040).
000100 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|‹æ•ª PIC  X(001).
000110 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|ƒ`ƒFƒbƒN‚P PIC  X(001).
000120 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|ƒ`ƒFƒbƒN‚Q PIC  X(001).
000130 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|ƒ`ƒFƒbƒN‚R PIC  X(001).
000140 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|ƒ`ƒFƒbƒN‚S PIC  X(001).
000150 01  ‚d‚l‚b|‚v‚j|‚i‚t‚l‚d‚m|ƒ`ƒFƒbƒN‚T PIC  X(001).
