000010************************************************
000020* (EMC_WK_SEIKYU)
000030************************************************
000040 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|Œ_–ñ”Ô† PIC  X(010).
000050 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|•¨Œ–¼ PIC  X(030).
000060 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|ŒŸŽû“ú PIC  X(008).
000070 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000080 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|[“–‰ñ PIC  X(003).
000090 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|‘Žx•¥‰ñ” PIC  X(003).
000100 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|“–ŒŽƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000110 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|Á”ïÅŠz PIC S9(011) COMP-3.
000120 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|“–ŽÐŒ_–ñ”Ô† PIC  X(010).
000130 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|“ú•t PIC  X(004).
000140 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|¿‹æƒR[ƒh PIC  X(008).
000150 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|¿‹ƒR[ƒh PIC  X(002).
000160 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|“ü‹à“ú PIC  X(002).
000170 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|Å—¦ PIC S9(002)V9(1) COMP-3.
000180 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000190 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|”—Ê PIC S9(004) COMP-3.
000200 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚Q 
                                             PIC  X(010).
000210 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚R 
                                             PIC  X(010).
000220 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚S 
                                             PIC  X(010).
000230 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|—X•Ö”Ô† PIC  X(007).
000240 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|ZŠ PIC  X(080).
000250 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|Žæˆøæ–¼ PIC  X(040).
000260 01  ‚d‚l‚b|‚v‚j|‚r‚d‚h‚j‚x‚t|•”–¼ PIC  X(040).
