000010************************************************
000020* (EXP_SIMPRT)
000030************************************************
000040 01  EXP_SIMPRT-TRNNUM PIC  X(004).
000050 01  EXP_SIMPRT-EXTNUM PIC  X(002).
000060 01  EXP_SIMPRT-DIVCOD PIC  X(004).
000070 01  EXP_SIMPRT-CNTNUM PIC  X(007).
000080 01  EXP_SIMPRT-PAYDAY PIC  X(008).
000090 01  EXP_SIMPRT-PAYBGN PIC  X(006).
000100 01  EXP_SIMPRT-PAYEND PIC  X(006).
000110 01  EXP_SIMPRT-FISYER PIC  X(004).
000120 01  EXP_SIMPRT-ACCCOD PIC  X(005).
000130 01  EXP_SIMPRT-ACCEXT PIC  X(002).
000140 01  EXP_SIMPRT-PAYTYP PIC  X(001).
000150 01  EXP_SIMPRT-PAYCYC PIC  X(002).
000160 01  EXP_SIMPRT-CLTCOD PIC  X(008).
000170 01  EXP_SIMPRT-FRMNAM PIC  X(050).
000180 01  EXP_SIMPRT-ITMNAM PIC  X(050).
000190 01  EXP_SIMPRT-PRTTYP PIC  X(001).
000200 01  EXP_SIMPRT-ITMCNT PIC S9(003) COMP-3.
000210 01  EXP_SIMPRT-PAYCNT PIC S9(003) COMP-3.
000220 01  EXP_SIMPRT-UNTPRC PIC S9(013) COMP-3.
000230 01  EXP_SIMPRT-PAYAMT PIC S9(013) COMP-3.
000240 01  EXP_SIMPRT-PAYFIS PIC S9(013) COMP-3.
000250 01  EXP_SIMPRT-ACTAMT PIC S9(013) COMP-3.
000260 01  EXP_SIMPRT-PLNAMT PIC S9(013) COMP-3.
000270 01  EXP_SIMPRT-TOTAMT PIC S9(013) COMP-3.
000280 01  EXP_SIMPRT-BUDAMT PIC S9(013) COMP-3.
000290 01  EXP_SIMPRT-PAY_04 PIC S9(013) COMP-3.
000300 01  EXP_SIMPRT-PAY_05 PIC S9(013) COMP-3.
000310 01  EXP_SIMPRT-PAY_06 PIC S9(013) COMP-3.
000320 01  EXP_SIMPRT-PAY_07 PIC S9(013) COMP-3.
000330 01  EXP_SIMPRT-PAY_08 PIC S9(013) COMP-3.
000340 01  EXP_SIMPRT-PAY_09 PIC S9(013) COMP-3.
000350 01  EXP_SIMPRT-PAY_10 PIC S9(013) COMP-3.
000360 01  EXP_SIMPRT-PAY_11 PIC S9(013) COMP-3.
000370 01  EXP_SIMPRT-PAY_12 PIC S9(013) COMP-3.
000380 01  EXP_SIMPRT-PAY_01 PIC S9(013) COMP-3.
000390 01  EXP_SIMPRT-PAY_02 PIC S9(013) COMP-3.
000400 01  EXP_SIMPRT-PAY_03 PIC S9(013) COMP-3.
