000010************************************************
000020* (EXP_ACCMST)
000030************************************************
000040 01  EXP_ACCMST-ACCCOD PIC  X(005).
000050 01  EXP_ACCMST-ACCNAM PIC  X(020).
