000010************************************************
000020* (EXP_SIMBUD)
000030************************************************
000040 01  EXP_SIMBUD-DIVCOD PIC  X(004).
000050 01  EXP_SIMBUD-FISYER PIC  X(004).
000060 01  EXP_SIMBUD-ACCCOD PIC  X(005).
000070 01  EXP_SIMBUD-BUDAMT PIC S9(013) COMP-3.
000080 01  EXP_SIMBUD-BUDBAL PIC S9(013) COMP-3.
