000010************************************************
000020* (EXP_SIMEXC)
000030************************************************
000040 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|”Ô† PIC  X(004).
000050 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Ž}”Ô PIC  X(002).
000060 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Ž–‹ÆŠ PIC  X(004).
000070 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Ž–‹ÆŠ–¼ PIC  X(020).
000080 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Œ_–ñ”Ô† PIC  X(007).
000090 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥“ú PIC  X(008).
000100 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥ŠJŽnŒŽ PIC  X(006).
000110 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥I—¹ŒŽ PIC  X(006).
000120 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|”N“x PIC  X(004).
000130 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|‰È–Ú PIC  X(005).
000140 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|‰È–Ú–¼ PIC  X(020).
000150 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|‰È–Ú‹æ•ª PIC  X(024).
000160 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥‹æ•ª PIC  X(001).
000170 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ƒTƒCƒNƒ‹ PIC  X(002).
000180 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥æ PIC  X(008).
000190 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥æ–¼ PIC  X(050).
000200 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žxo€–Ú PIC  X(050).
000210 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ˆóüŒ`Ž® PIC  X(001).
000220 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|•¨Œ” PIC S9(003) COMP-3.
000230 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥‰ñ” PIC S9(003) COMP-3.
000240 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|’P‰¿ PIC S9(013) COMP-3.
000250 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥‹àŠz PIC S9(013) COMP-3.
000260 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥”N“x•ª PIC S9(013) COMP-3.
000270 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥ŽÀÑ PIC S9(013) COMP-3.
000280 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|Žx•¥—\’è PIC S9(013) COMP-3.
000290 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|‡Œv‹àŠz PIC S9(013) COMP-3.
000300 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|—\ŽZ‹àŠz PIC S9(013) COMP-3.
000310 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚SŒŽ PIC S9(013) COMP-3.
000320 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚TŒŽ PIC S9(013) COMP-3.
000330 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚UŒŽ PIC S9(013) COMP-3.
000340 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚VŒŽ PIC S9(013) COMP-3.
000350 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚WŒŽ PIC S9(013) COMP-3.
000360 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚XŒŽ PIC S9(013) COMP-3.
000370 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚P‚OŒŽ PIC S9(013) COMP-3.
000380 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚P‚PŒŽ PIC S9(013) COMP-3.
000390 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚P‚QŒŽ PIC S9(013) COMP-3.
000400 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚PŒŽ PIC S9(013) COMP-3.
000410 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚QŒŽ PIC S9(013) COMP-3.
000420 01  ‚d‚w‚o|‚r‚h‚l‚d‚w‚b|ŒŽ•Ê|‚RŒŽ PIC S9(013) COMP-3.
