000010************************************************
000020* (EXP_SIMTRN)
000030************************************************
000040 01  EXP_SIMTRN-TRNNUM PIC  X(004).
000050 01  EXP_SIMTRN-EXTNUM PIC  X(002).
000060 01  EXP_SIMTRN-RECNUM PIC  X(004).
000070 01  EXP_SIMTRN-DIVCOD PIC  X(004).
000080 01  EXP_SIMTRN-ACCCOD PIC  X(005).
000090 01  EXP_SIMTRN-CLTCOD PIC  X(008).
000100 01  EXP_SIMTRN-PLNDAY PIC  X(008).
000110 01  EXP_SIMTRN-TRNDAY PIC  X(008).
000120 01  EXP_SIMTRN-RCVFLG PIC  X(001).
000130 01  EXP_SIMTRN-PAYFLG PIC  X(001).
000140 01  EXP_SIMTRN-UPDFLG PIC  X(001).
000150 01  EXP_SIMTRN-PAYAMT PIC S9(013) COMP-3.
000160 01  EXP_SIMTRN-CONTAX PIC S9(013) COMP-3.
000170 01  EXP_SIMTRN-TOTAMT PIC S9(013) COMP-3.
