000010************************************************
000020* (EXP_SIMCLT)
000030************************************************
000040 01  EXP_SIMCLT-CLTCOD PIC  X(008).
000050 01  EXP_SIMCLT-FRMNAM PIC  X(050).
