000010************************************************
000020* (EXT_BNKMST)
000030************************************************
000040 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|‹âsƒR[ƒh PIC  X(004).
000050 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|Žx“XƒR[ƒh PIC  X(003).
000060 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|•t‰ÁƒR[ƒh PIC  X(001).
000070 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|’ZkƒR[ƒh PIC  X(004).
000080 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|ˆÏ‘õŽÒƒR[ƒh PIC  X(010).
000090 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|‹âs–¼ PIC  X(030).
000100 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|‹âs–¼ƒJƒi PIC  X(015).
000110 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|Žx“X–¼ PIC  X(030).
000120 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|Žx“X–¼ƒJƒi PIC  X(015).
000130 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|–{“XŠÝŒ§ PIC  X(002).
000140 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|ŽèŒ`ŒðŠ·Š PIC  X(004).
000150 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|—X•Ö”Ô† PIC  X(007).
000160 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|ZŠ‚P PIC  X(040).
000170 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|ZŠ‚Q PIC  X(040).
000180 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|—a‹àŽí—Þ PIC  X(001).
000190 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|ŒûÀ”Ô† PIC  X(007).
000200 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|“ü‹à“ú PIC  X(002).
000210 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|‰ñŽû•ûŽ® PIC  X(001).
000220 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|“K—p“ú‚P PIC  X(008).
000230 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|“K—p“ú‚Q PIC  X(008).
000240 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|“K—p“ú‚R PIC  X(008).
000250 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|“K—p“ú‚S PIC  X(008).
000260 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|“K—p“ú‚T PIC  X(008).
000270 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|“K—p“ú‚U PIC  X(008).
000280 01  ‚d‚w‚s|‚a‚m‚j‚l‚r‚s|Ž©Uƒtƒ@ƒCƒ‹–¼ PIC  X(008).
