000010************************************************
000020* (EXT_TAXMST_PL)
000030************************************************
000040 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•tæƒR[ƒh   PIC  X(006).
000050 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•tæ–¼       PIC  X(020).
000060 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|‹âsƒR[ƒh     PIC  X(004).
000070 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|‹âs–¼         PIC  X(030).
000080 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|‹âs–¼ƒJƒi     PIC  X(015).
000090 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|•ñž‹à‹æ•ª     PIC  X(001).
000100 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t•û–@       PIC  X(001).
000110 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|Ž©“®ˆø—Ž       PIC  X(001).
000120 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•tŠúŒÀ‚P     PIC  X(008).
000130 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•tŠúŒÀ‚Q     PIC  X(008).
000140 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•tŠúŒÀ‚R     PIC  X(008).
000150 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•tŠúŒÀ‚S     PIC  X(008).
000160 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t“ú‚P       PIC  X(008).
000170 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t“ú‚Q       PIC  X(008).
000180 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t“ú‚R       PIC  X(008).
000190 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t“ú‚S       PIC  X(008).
000200 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|•ñž‹à“ü‹à“ú   PIC  X(008).
000210 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|Šî€”N         PIC  X(004).
000220 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|•s“®ŽYÅ‹æ•ª   PIC  X(001).
000230 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|ˆ—‹æ•ª       PIC  X(001).
000240 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|ì‹Æ‹æ•ª       PIC  X(002).
000250 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|XV•WŽ¯       PIC  X(001).
000260 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|Å—¦           
000270                                       PIC S9(001)V9(3) COMP-3.
000280 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|‰ÛÅ•W€Šz     
000290                                       PIC S9(013) COMP-3.
000300 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|ÅŠz           
000310                                       PIC S9(013) COMP-3.
000320 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|•ñž‹à         
000330                                       PIC S9(013) COMP-3.
000340 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t‹àŠz‚P     
000350                                       PIC S9(013) COMP-3.
000360 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t‹àŠz‚Q     
000370                                       PIC S9(013) COMP-3.
000380 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t‹àŠz‚R     
000390                                       PIC S9(013) COMP-3.
000400 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|”[•t‹àŠz‚S     
000410                                       PIC S9(013) COMP-3.
000420 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|•s“®ŽYÅŠz     
000430                                       PIC S9(013) COMP-3.
000440 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|•s“®ŽYÅ•ñž‹à 
000450                                       PIC S9(013) COMP-3.
000460 01  ‚d‚w‚s|‚s‚`‚w‚l‚r‚s|‚o‚k|•ªŠ„”[•tŒÀ“x   
000470                                       PIC S9(013) COMP-3.
