000010************************************************
000020* (FCT_V_URIKAKE_510_1_COPY)
000030************************************************
000040 01  ‚e‚b‚s|‚u|‚t‚q‚h‚j‚`‚j‚d|‚T‚P‚O|‚P|‚b‚n‚o‚x|Œ_–ñ”Ô† 
                                             PIC  X(007).
000050 01  ‚e‚b‚s|‚u|‚t‚q‚h‚j‚`‚j‚d|‚T‚P‚O|‚P|‚b‚n‚o‚x|‘ã—‰ñŽû‹æ•ª 
                                             PIC  X(001).
