000010************************************************
000020* (FCT_YOSIN)
000030************************************************
000040 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|Œ_–ñ”Ô† PIC  X(007).
000050 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|Œ_–ñ”Ô†Ž}”Ô PIC  X(002).
000060 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚P PIC  X(008).
000070 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|—^Mæ–¼‚P PIC  X(060).
000080 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚P PIC  X(002).
000090 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚P PIC  X(002).
000100 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•‰’SŠ„‡‚P PIC S9(003) COMP-3.
000110 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚Q PIC  X(008).
000120 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|—^Mæ–¼‚Q PIC  X(060).
000130 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚Q PIC  X(002).
000140 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚Q PIC  X(002).
000150 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•‰’SŠ„‡‚Q PIC S9(003) COMP-3.
000160 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚R PIC  X(008).
000170 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|—^Mæ–¼‚R PIC  X(060).
000180 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚R PIC  X(002).
000190 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚R PIC  X(002).
000200 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•‰’SŠ„‡‚R PIC S9(003) COMP-3.
000210 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚S PIC  X(008).
000220 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|—^Mæ–¼‚S PIC  X(060).
000230 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚S PIC  X(002).
000240 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚S PIC  X(002).
000250 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•‰’SŠ„‡‚S PIC S9(003) COMP-3.
000260 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚T PIC  X(008).
000270 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|—^Mæ–¼‚T PIC  X(060).
000280 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚T PIC  X(002).
000290 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚T PIC  X(002).
000300 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|•‰’SŠ„‡‚T PIC S9(003) COMP-3.
000310 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|“o˜^“ú PIC  X(008).
000320 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|“o˜^Žž PIC  X(006).
000330 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000340 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|XV“ú PIC  X(008).
000350 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|XVŽž PIC  X(006).
000360 01  ‚e‚b‚s|‚x‚n‚r‚h‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
