000010************************************************
000020* (FCT_KEY)
000030************************************************
000040 01  ‚e‚b‚s|‚j‚d‚x|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000050 01  ‚e‚b‚s|‚j‚d‚x|Œ_–ñ”Ô† PIC  X(007).
000060 01  ‚e‚b‚s|‚j‚d‚x|Œ_–ñŽ}”Ô PIC  X(002).
000070 01  ‚e‚b‚s|‚j‚d‚x|ˆ—ƒXƒe[ƒ^ƒX PIC  X(001).
000080 01  ‚e‚b‚s|‚j‚d‚x|“o˜^“ú PIC  X(008).
000090 01  ‚e‚b‚s|‚j‚d‚x|“o˜^Žž PIC  X(006).
000100 01  ‚e‚b‚s|‚j‚d‚x|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000110 01  ‚e‚b‚s|‚j‚d‚x|XV“ú PIC  X(008).
000120 01  ‚e‚b‚s|‚j‚d‚x|XVŽž PIC  X(006).
000130 01  ‚e‚b‚s|‚j‚d‚x|XV’S“–ŽÒƒR[ƒh PIC  X(004).
