000010************************************************
000020* (FCT_SOSIN2)
000030************************************************
000040 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|ƒf[ƒ^Ž¯•ÊƒR[ƒh PIC  X(002).
000050 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|‘—MŽ–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|ì¬“ú•t PIC  X(008).
000070 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|ì¬Žž PIC  X(006).
000080 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|Œ_–ñ”Ô† PIC  X(007).
000090 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|Œ_–ñŽ}”Ô PIC  X(002).
000100 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|ƒŒƒR[ƒh‹æ•ª PIC  X(001).
000110 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000120 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|–¼Šñ‚¹ƒR[ƒh‚P PIC  X(008).
000130 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|—^Mæ–¼‚P PIC  X(060).
000140 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•ÛØ’S•Û“à—e‚P PIC  X(002).
000150 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•Û‘S”ÍˆÍ‚P PIC  X(002).
000160 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•‰’SŠ„‡‚P PIC S9(003) COMP-3.
000170 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|–¼Šñ‚¹ƒR[ƒh‚Q PIC  X(008).
000180 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|—^Mæ–¼‚Q PIC  X(060).
000190 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•ÛØ’S•Û“à—e‚Q PIC  X(002).
000200 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•Û‘S”ÍˆÍ‚Q PIC  X(002).
000210 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•‰’SŠ„‡‚Q PIC S9(003) COMP-3.
000220 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|–¼Šñ‚¹ƒR[ƒh‚R PIC  X(008).
000230 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|—^Mæ–¼‚R PIC  X(060).
000240 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•ÛØ’S•Û“à—e‚R PIC  X(002).
000250 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•Û‘S”ÍˆÍ‚R PIC  X(002).
000260 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•‰’SŠ„‡‚R PIC S9(003) COMP-3.
000270 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|–¼Šñ‚¹ƒR[ƒh‚S PIC  X(008).
000280 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|—^Mæ–¼‚S PIC  X(060).
000290 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•ÛØ’S•Û“à—e‚S PIC  X(002).
000300 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•Û‘S”ÍˆÍ‚S PIC  X(002).
000310 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•‰’SŠ„‡‚S PIC S9(003) COMP-3.
000320 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|–¼Šñ‚¹ƒR[ƒh‚T PIC  X(008).
000330 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|—^Mæ–¼‚T PIC  X(060).
000340 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•ÛØ’S•Û“à—e‚T PIC  X(002).
000350 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•Û‘S”ÍˆÍ‚T PIC  X(002).
000360 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚Q|•‰’SŠ„‡‚T PIC S9(003) COMP-3.
