000010************************************************
000020* ‘‡Užƒf[ƒ^(ƒwƒbƒ_[ƒŒƒR[ƒh)(FFUISA30)
000030************************************************
000040 01  ‚e‚e‚t‚h‚r‚`‚R‚O|ƒf[ƒ^‹æ•ª PIC  X(001).
000050 01  ‚e‚e‚t‚h‚r‚`‚R‚O|Ž¯•Ê‚b‚c PIC  X(002).
000060 01  ‚e‚e‚t‚h‚r‚`‚R‚O|ŒvŽZ•ûŽ® PIC  X(001).
000070 01  ‚e‚e‚t‚h‚r‚`‚R‚O|UžˆË—Šl‚b‚c PIC  X(010).
000080 01  ‚e‚e‚t‚h‚r‚`‚R‚O|UžˆË—Šl–¼ PIC  X(040).
000090 01  ‚e‚e‚t‚h‚r‚`‚R‚O|Žæ‘g“ú|ŒŽ PIC  X(002).
000100 01  ‚e‚e‚t‚h‚r‚`‚R‚O|Žæ‘g“ú|“ú PIC  X(002).
000110 01  ‚e‚e‚t‚h‚r‚`‚R‚O|‹âs‚b‚c PIC  X(004).
000120 01  ‚e‚e‚t‚h‚r‚`‚R‚O|‹âs–¼ PIC  X(015).
000130 01  ‚e‚e‚t‚h‚r‚`‚R‚O|Žx“X‚b‚c PIC  X(003).
000140 01  ‚e‚e‚t‚h‚r‚`‚R‚O|Žx“X–¼ PIC  X(015).
000150 01  ‚e‚e‚t‚h‚r‚`‚R‚O|—a‹àŽí–Ú PIC  X(001).
000160 01  ‚e‚e‚t‚h‚r‚`‚R‚O|ŒûÀ”Ô† PIC  X(007).
000170 01  ‚e‚e‚t‚h‚r‚`‚R‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(017).
