000010************************************************
000020* ”Û”F(Šî–{)(HSNINK)
000030************************************************
000040 01  ‚g‚r‚m‚h‚m‚j|Œ_–ñ”Ô†  PIC  X(009).
000050 01  ‚g‚r‚m‚h‚m‚j|ÂŒ XV‹æ•ª  PIC  X(001).
000060 01  ‚g‚r‚m‚h‚m‚j|ƒ†[ƒU[ƒR[ƒh  PIC  X(008).
000070 01  ‚g‚r‚m‚h‚m‚j|ŒvŽZ•ûŽ®  PIC  X(001).
000080 01  ‚g‚r‚m‚h‚m‚j|ƒTƒCƒNƒ‹  PIC  X(002).
000090 01  ‚g‚r‚m‚h‚m‚j|‚a‚d‚f‚h‚m‰ñ”  PIC  X(001).
000100 01  ‚g‚r‚m‚h‚m‚j|˜’u  PIC  X(003).
000110 01  ‚g‚r‚m‚h‚m‚j|ŒŸŽû“ú  PIC  X(008).
000120 01  ‚g‚r‚m‚h‚m‚j|ƒŠ[ƒXŠúŠÔ  PIC  X(003).
000130 01  ‚g‚r‚m‚h‚m‚j|Žx•¥‰ñ”Œv  PIC  X(003).
000140 01  ‚g‚r‚m‚h‚m‚j|ƒŠ[ƒX‚d‚m‚c  PIC  X(008).
000150 01  ‚g‚r‚m‚h‚m‚j|ƒtƒ@ƒCƒiƒ“ƒX‚d‚m‚c  PIC  X(008).
000160 01  ‚g‚r‚m‚h‚m‚j|Œ_–ñ‹à‡Œv  PIC S9(013) COMP-3.
000170 01  ‚g‚r‚m‚h‚m‚j|w“ü‡Œv  PIC S9(013) COMP-3.
000180 01  ‚g‚r‚m‚h‚m‚j|Žc‰¿Šz  PIC S9(013) COMP-3.
000190 01  ‚g‚r‚m‚h‚m‚j|Žc‰¿•ÛØ  PIC  X(001).
000200 01  ‚g‚r‚m‚h‚m‚j|“ü‹à“ú  PIC  X(002).
000210 01  ‚g‚r‚m‚h‚m‚j|Á”ïÅ—¦  PIC S9(003)V9(1) COMP-3.
000220 01  ‚g‚r‚m‚h‚m‚j|—˜‘§‡Œv  PIC S9(013) COMP-3.
000230 01  ‚g‚r‚m‚h‚m‚j|”ï—p‡Œv  PIC S9(013) COMP-3.
000240 01  ‚g‚r‚m‚h‚m‚j|Œvã‚d‚m‚c  PIC  X(006).
000250 01  ‚g‚r‚m‚h‚m‚j|ƒŠ[ƒX‚r‚s‚`‚q‚s  PIC  X(008).
000260 01  ‚g‚r‚m‚h‚m‚j|ƒtƒ@ƒCƒiƒ“ƒX‚r‚s‚`‚q‚s  PIC  X(006).
000270 01  ‚g‚r‚m‚h‚m‚j|“ü‹à‚P‰ñ–Ú  PIC  X(008).
