000010************************************************
000020* (IBS_TRANS)
000030************************************************
000040 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|ˆÄŒ‚m‚n PIC  X(012).
000050 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|âg‹c‚m‚n PIC  X(010).
000060 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|Œ_–ñŒ`‘Ô PIC  X(001).
000070 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|¬–ñ“ú PIC  X(008).
000080 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|ˆÄŒ–¼ PIC  X(060).
000090 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‹¦’²Œ`‘Ô PIC  X(002).
000100 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|Š²Ž–‰ïŽÐƒR[ƒh PIC  X(008).
000110 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|ˆÄŒ‘S‘Ì•¼Ží PIC  X(003).
000120 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|ˆÄŒ‘S‘ÌŠz PIC S9(014)V9(2) COMP-3.
000130 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|“–ŽÐŽ•ªŠz•¼Ží PIC  X(003).
000140 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|“–ŽÐŽ•ªŠz PIC S9(014)V9(2) COMP-3.
000150 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|Žå“±“XƒR[ƒh PIC  X(004).
000160 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‹L’ “XƒR[ƒh PIC  X(004).
000170 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‰c‹Æ’S“–ŽÒ PIC  X(004).
000180 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|Ž––±’S“–ŽÒ PIC  X(001).
000190 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|—^MæƒR[ƒh PIC  X(008).
000200 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|”í•ÛØŒ`‘Ô PIC  X(001).
000210 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|•ÛŒ¯‘—Þ’¥‹ PIC  X(001).
000220 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|•ÛŒ¯XVŒŽ‚P PIC  X(004).
000230 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|•ÛŒ¯XVŒŽ‚Q PIC  X(004).
000240 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|•ÛŒ¯XVŒŽ‚R PIC  X(004).
000250 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|Ž‘‹àŽg“rƒR[ƒh PIC  X(004).
000260 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|’S•ÛŽí—Þ PIC  X(002).
000270 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|’S•Û•]‰¿Šz•¼Ží PIC  X(003).
000280 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|’S•Û•]‰¿Šz PIC S9(014)V9(2) COMP-3.
000290 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|’S•Û–¼Ì PIC  X(040).
000300 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|“o˜^“ú PIC  X(008).
000310 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|“o˜^Žž PIC  X(006).
000320 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000330 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|XV“ú PIC  X(008).
000340 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|XVŽž PIC  X(006).
000350 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|XV’S“–ŽÒƒR[ƒh PIC  X(004).
