000010************************************************
000020* (IBS_FINANCE)
000030************************************************
000040 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|˜A”Ô PIC S9(003) COMP-3.
000060 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|ŒvŽZ“ú PIC  X(008).
000070 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|“ú” PIC S9(004) COMP-3.
000080 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|‰ñŽû“ú PIC  X(008).
000090 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|‚s‚s‚l PIC S9(004)V9(2) COMP-3.
000100 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|’²’B‹à—˜ PIC S9(004)V9(8) COMP-3.
000110 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|‰^—p‹à—˜ PIC S9(004)V9(8) COMP-3.
000120 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|Œ³–{“à“ü PIC S9(014)V9(2) COMP-3.
000130 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|—˜‘§ PIC S9(014)V9(2) COMP-3.
000140 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|‚»‚Ì‘¼ PIC S9(014)V9(2) COMP-3.
000150 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|‰ñŽûŠz PIC S9(014)V9(2) COMP-3.
000160 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|Œ³–{Žc‚ PIC S9(014)V9(2) COMP-3.
000170 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|–¢ŽÀŒ»—˜‰v PIC S9(014)V9(2) COMP-3.
000180 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|–¢ŽÀŒ»—˜‰v·Šz—ÝŒv 
                                             PIC S9(014)V9(2) COMP-3.
000190 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|”õl PIC  X(020).
000200 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|“o˜^“ú PIC  X(008).
000210 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|“o˜^Žž PIC  X(006).
000220 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000230 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|XV“ú PIC  X(008).
000240 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|XVŽž PIC  X(006).
000250 01  ‚h‚a‚r|‚e‚h‚m‚`‚m‚b‚d|XV’S“–ŽÒƒR[ƒh PIC  X(004).
