000010************************************************
000020* (IBS_RATE_20030729)
000030************************************************
000040 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|”N PIC  X(004).
000050 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|ŒŽ PIC  X(002).
000060 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|•¼ŽíƒR[ƒh PIC  X(003).
000070 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|‚s‚s‚r 
                                             PIC S9(004)V9(2) COMP-3.
000080 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|‚s‚s‚a 
                                             PIC S9(004)V9(2) COMP-3.
000090 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|‚s‚s‚l 
                                             PIC S9(004)V9(2) COMP-3.
000100 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|“o˜^“ú PIC  X(008).
000110 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|“o˜^Žž PIC  X(006).
000120 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|“o˜^’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000130 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|XV“ú PIC  X(008).
000140 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|XVŽž PIC  X(006).
000150 01  ‚h‚a‚r|‚q‚`‚s‚d|‚Q‚O‚O‚R‚O‚V‚Q‚X|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
