000010************************************************
000020* Žx•¥Žæˆøæ•ÏŠ·ƒe[ƒuƒ‹(IKOTBL003)
000030************************************************
000040 01  ‚h‚j‚n‚O‚O‚R|‹ŒŽx•¥æƒR[ƒh PIC  X(004).
000050 01  ‚h‚j‚n‚O‚O‚R|‹ŒŽæˆøæƒR[ƒh PIC  X(008).
000060 01  ‚h‚j‚n‚O‚O‚R|€–Ú‹æ•ª PIC  X(001).
