000010************************************************
000020* 転リース提携先コード変換テーブル(IKOTBL004)
000030************************************************
000040 01  ＩＫＯ００４－取引先コード PIC  X(008).
000050 01  ＩＫＯ００４－転リース提携先コード PIC  X(003).
