000010************************************************
000020* (JOM_FORM_0002)
000030************************************************
000040 01  JOM_FORM_0002-SHTNUM PIC S9(002) COMP-3.
000050 01  JOM_FORM_0002-¼Þ®ÓŽx•¥ðŒº°ÄÞ PIC  X(002).
000060 01  JOM_FORM_0002-Žx•¥ðŒ•¶Œ¾ PIC  X(040).
000070 01  JOM_FORM_0002-Ž–‹ÆŠ–¼_1 PIC  X(020).
000080 01  JOM_FORM_0002-Œ_–ñ“ú PIC  X(008).
000090 01  JOM_FORM_0002-ŒŸŽû“ú PIC  X(008).
000100 01  JOM_FORM_0002-Ý’uêŠ–¼_Š¿Žš PIC  X(040).
000110 01  JOM_FORM_0002-¼Þ®ÓŒ_–ñ”Ô† PIC  X(009).
000120 01  JOM_FORM_0002-Œ_–ñ”Ô† PIC  X(007).
000130 01  JOM_FORM_0002-ŠJŽnŽ}”Ô PIC  X(002).
000140 01  JOM_FORM_0002-ÅIŽ}”Ô PIC  X(002).
000150 01  JOM_FORM_0002-ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
