000010************************************************
000020* (JOM_FORM_0005)
000030************************************************
000040 01  JOM_FORM_0005-SELCOD PIC  X(001).
000050 01  JOM_FORM_0005-ｼﾞｮﾓ支店ｺｰﾄﾞ PIC  X(002).
000060 01  JOM_FORM_0005-支店名漢字 PIC  X(060).
000070 01  JOM_FORM_0005-ｼﾞｮﾓ契約番号 PIC  X(009).
000080 01  JOM_FORM_0005-契約番号 PIC  X(009).
000090 01  JOM_FORM_0005-ﾘｰｽ期間 PIC S9(003) COMP-3.
000100 01  JOM_FORM_0005-前受月数 PIC S9(002) COMP-3.
000110 01  JOM_FORM_0005-社内金利 PIC S9(002)V9(2) COMP-3.
000120 01  JOM_FORM_0005-消費税率 PIC S9(002)V9(1) COMP-3.
000130 01  JOM_FORM_0005-ﾘｰｽ料 PIC S9(013) COMP-3.
000140 01  JOM_FORM_0005-前受ﾘｰｽ料 PIC S9(013) COMP-3.
000150 01  JOM_FORM_0005-購入金額合計 PIC S9(013) COMP-3.
000160 01  JOM_FORM_0005-仕入消費税等額合計 PIC S9(013) COMP-3.
000170 01  JOM_FORM_0005-繰延月数 PIC S9(002)V9(2) COMP-3.
000180 01  JOM_FORM_0005-繰延金額 PIC S9(013) COMP-3.
000190 01  JOM_FORM_0005-契約金額 PIC S9(013) COMP-3.
000200 01  JOM_FORM_0005-実質利回り PIC S9(002)V9(8) COMP-3.
000210 01  JOM_FORM_0005-基本利回り PIC S9(002)V9(8) COMP-3.
000220 01  JOM_FORM_0005-粗利益 PIC S9(013) COMP-3.
000230 01  JOM_FORM_0005-受取手数料 PIC S9(013) COMP-3.
000240 01  JOM_FORM_0005-基本ﾘｰｽ料 PIC S9(013) COMP-3.
000250 01  JOM_FORM_0005-月額固定資産税総額 PIC S9(013) COMP-3.
000260 01  JOM_FORM_0005-月額動総保険料総額 PIC S9(013) COMP-3.
000270 01  JOM_FORM_0005-売主名 PIC  X(060).
000280 01  JOM_FORM_0005-ｼﾞｮﾓ支払条件ｺｰﾄﾞ PIC  X(002).
000290 01  JOM_FORM_0005-支払条件文言 PIC  X(040).
000300 01  JOM_FORM_0005-購入先ｺｰﾄﾞ PIC  X(008).
000310 01  JOM_FORM_0005-物件NO PIC  X(003).
000320 01  JOM_FORM_0005-ｼﾞｮﾓ商品ｺｰﾄﾞ PIC  X(004).
000330 01  JOM_FORM_0005-ｼﾞｮﾓ商品分類名 PIC  X(030).
000340 01  JOM_FORM_0005-資産ｺｰﾄﾞ PIC  X(007).
000350 01  JOM_FORM_0005-耐用年数 PIC  X(002).
000360 01  JOM_FORM_0005-平均耐用年数 PIC S9(002)V9(3) COMP-3.
000370 01  JOM_FORM_0005-信用保険ｺｰﾄﾞ PIC  X(006).
000380 01  JOM_FORM_0005-動総保険ｺｰﾄﾞ PIC  X(004).
000390 01  JOM_FORM_0005-動総保険料率 PIC S9(002)V9(3) COMP-3.
000400 01  JOM_FORM_0005-物件名漢字 PIC  X(040).
000410 01  JOM_FORM_0005-物件名ｶﾅ PIC  X(020).
000420 01  JOM_FORM_0005-数量 PIC S9(004) COMP-3.
000430 01  JOM_FORM_0005-購入金額 PIC S9(013) COMP-3.
000440 01  JOM_FORM_0005-仕入消費税等額 PIC S9(013) COMP-3.
000450 01  JOM_FORM_0005-個別ﾘｰｽ料 PIC S9(013) COMP-3.
000460 01  JOM_FORM_0005-設置場所住所 PIC  X(100).
000470 01  JOM_FORM_0005-設置場所名漢字 PIC  X(040).
000480 01  JOM_FORM_0005-設置場所名ｶﾅ PIC  X(020).
000490 01  JOM_FORM_0005-納付先ｺｰﾄﾞ PIC  X(006).
000500 01  JOM_FORM_0005-斡旋手数料 PIC S9(013) COMP-3.
