000010************************************************
000020* (JYO_PRTINP)
000030************************************************
000040 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Šî€“ú PIC  X(008).
000050 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Ž‘ŽY”Ô† PIC  X(009).
000060 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Ž‘ŽYŽí—Þ PIC  X(001).
000070 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Ž‘ŽYƒR[ƒh PIC  X(006).
000080 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Ž‘ŽY–¼ PIC  X(040).
000090 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000100 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Ž–‹ÆŠ–¼ PIC  X(020).
000110 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|ž‹p•û–@ PIC  X(006).
000120 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|‘‰Á——R PIC  X(006).
000130 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Œ¸­——R PIC  X(006).
000140 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Ž–‹Æ‹Ÿ—p“ú PIC  X(008).
000150 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Žæ“¾”NŒŽ PIC  X(006).
000160 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|‘‰Á“ú PIC  X(008).
000170 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Œ¸­“ú PIC  X(008).
000180 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|”[•tæ PIC  X(006).
000190 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|‘Ï—p”N” PIC S9(003) COMP-3.
000200 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Œo‰ßŒŽ” PIC S9(002) COMP-3.
000210 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|ž‹p—¦ PIC S9(002)V9(3) COMP-3.
000220 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|Žæ“¾‰¿Šz PIC S9(013) COMP-3.
000230 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|ž‹pŒÀ“x PIC S9(013) COMP-3.
000240 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
000250 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|“–ŠúŽæ“¾Šz PIC S9(013) COMP-3.
000260 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|“–Šúœ‹pŠz PIC S9(013) COMP-3.
000270 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|“–Šúž‹pŠz PIC S9(013) COMP-3.
000280 01  ‚i‚x‚n|‚o‚q‚s‚h‚m‚o|“–Šú––•ë‰¿ PIC S9(013) COMP-3.
