000010************************************************
000020* (KAI_BUKKEN)
000030************************************************
000040 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|•¨Œ–¼Š¿Žš PIC  X(040).
000070 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|•¨Œ–¼ƒJƒi PIC  X(020).
000080 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Žd—l»‘¢”Ô† PIC  X(020).
000090 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|”—Ê PIC S9(004) COMP-3.
000100 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|w“ü‹àŠz PIC S9(013) COMP-3.
000110 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Ž‘ŽYƒR[ƒh PIC  X(007).
000120 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Å‹æ•ª PIC  X(001).
000130 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‘Ï—p”N” PIC S9(002) COMP-3.
000140 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|’†ŒÃ•iƒR[ƒh PIC  X(001).
000150 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000160 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Žc‰¿Šz PIC S9(013) COMP-3.
000170 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Žc‰¿•ÛØ‹æ•ª PIC  X(001).
000180 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|w“üæƒR[ƒh PIC  X(008).
000190 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|”[•tæƒR[ƒh PIC  X(006).
000200 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Ý’uêŠ–¼Š¿Žš PIC  X(040).
000210 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Ý’uêŠ–¼ƒJƒi PIC  X(020).
000220 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Ý’uêŠZŠ PIC  X(100).
000230 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000240 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|•ÏXŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000250 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|“Á—á—¦•ªŽq PIC S9(002) COMP-3.
000260 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|“Á—á—¦•ª•ê PIC S9(002) COMP-3.
000270 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P 
                                             PIC  X(012).
000280 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚Q 
                                             PIC  X(012).
000290 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚R 
                                             PIC  X(012).
000300 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚S 
                                             PIC  X(012).
000310 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|ŒÅ’èŽ‘ŽYÅ—¦ PIC S9(002)V9(2) COMP-3.
000320 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|“®‘•ÛŒ¯—¿—¦ PIC S9(002)V9(3) COMP-3.
000330 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(3) COMP-3.
000340 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ïŽÐ‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
000350 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|—˜_‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
000360 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Å•‰’SƒR[ƒh PIC  X(001).
000370 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|•¨Œ‘ã‹à‘ŠŽE‹æ•ª PIC  X(001).
000380 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ‘ÎÛ‹æ•ª PIC S9(001) COMP-3.
000390 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ“ú PIC  X(008).
000400 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ——R PIC  X(001).
000410 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ•¨Œ‹àŠz PIC S9(013) COMP-3.
000420 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ”—Ê PIC S9(004) COMP-3.
000430 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000440 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000450 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ•ÛŒ¯—¿ PIC S9(013) COMP-3.
000460 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ•ÛŽç—¿ PIC S9(013) COMP-3.
000470 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000480 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000490 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ‰Šú”ï—p PIC S9(013) COMP-3.
000500 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñŽc‰¿ PIC S9(013) COMP-3.
000510 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000520 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñÂŒ Žc PIC S9(013) COMP-3.
000530 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ•ª“–ŒŽ“ü‹àƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000540 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‘OŽó[“–Šz PIC S9(013) COMP-3.
000550 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|“ü‹à’âŽ~ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000560 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‹K’è‘¹ŠQ‹àŠz PIC S9(013) COMP-3.
000570 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|Å’á‘¹ŠQŠz PIC S9(013) COMP-3.
000580 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ‹K’è‘¹ŠQ‹à—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000590 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñ‰‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000600 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñI‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000610 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‹K’è‘¹ŠQ‹àŽx•¥“ú PIC S9(008) COMP-3.
000620 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|’¼“]‹æ•ª PIC  X(001).
000630 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‹K’è‘¹ŠQ‹àŽx•¥ŽÒ PIC  X(001).
000640 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‘OŽóƒŠ[ƒX—¿ˆ— PIC  X(001).
000650 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‹K’è‘¹ŠQ‹àÁ”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000660 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‘OŽó—a‚©‚èÁ”ïÅ“™ 
                                             PIC S9(013) COMP-3.
000670 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|•ÏXŒãÁ”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000680 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|•ÏXŒã‘OŽóÁ”ïÅ“™·Šz 
                                             PIC S9(013) COMP-3.
000690 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‹K’è‘¹ŠQ‹àÁ”ïÅ“™ 
                                             PIC S9(013) COMP-3.
000700 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|”„‹p‘ã‹à‹K‘¹‹à[“–‹àŠz 
                                             PIC S9(013) COMP-3.
000710 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‹K’è‘¹ŠQ‹à‘æ‚RŽÒŽx•¥æ–¼ PIC  X(030).
000720 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‘æ‚RŽÒ•¥‚¢‹K’è‘¹ŠQ‹à 
                                             PIC S9(013) COMP-3.
000730 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‹K’è‘¹ŠQ‹à‰ñŽû•ûŽ® PIC  X(001).
000740 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|‰ð–ñŽd–óƒR[ƒh PIC  X(003).
000750 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|•¨ŒŠm’è‚e‚k‚f PIC  X(001).
000760 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|“o˜^“ú PIC  X(008).
000770 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|“o˜^Žž PIC  X(006).
000780 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000790 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|XV“ú PIC  X(008).
000800 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|XVŽž PIC  X(006).
000810 01  ‚j‚`‚h|‚a‚t‚j‚j‚d‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
