000010************************************************
000020* (KAI_WK_KEIYAKU2)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|Œ_–ñæ–¼ PIC  X(060).
000060 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‰ð–ñ“ú”N PIC  X(004).
000070 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‰ð–ñ“úŒŽ PIC  X(002).
000080 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‰ð–ñ“ú“ú PIC  X(002).
000090 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000100 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000110 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|Á”ïÅ“™‚P 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‡Œv‚P PIC S9(013) COMP-3.
000130 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‘O•¥ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‘O•¥ƒŠ[ƒX—¿Žc‚ 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|Á”ïÅ“™‚Q 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‡Œv‚Q PIC S9(013) COMP-3.
000170 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‹ŒÁ”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000180 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|VÁ”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000190 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‰ð–ñ‘O•¥ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000200 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|“¯—a‚èÁ”ïÅ“™ 
                                             PIC S9(013) COMP-3.
000210 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|‰ð–ñŒã‘O•¥ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000220 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t‚Q|•Ô‹p‘O•¥ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
