000010************************************************
000020* (KAI_WK_KISONGMN)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|Œ_–ñæ–¼ PIC  X(060).
000060 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‰ð–ñ“ú PIC  X(008).
000070 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‰ð–ñ‹æ•ª PIC  X(020).
000080 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‰ð–ñ•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000090 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‰ð–ñŽc‰¿Šz 
                                             PIC S9(013) COMP-3.
000100 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|Œ_–ñŠúŠÔ PIC  X(003).
000110 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|˜’uŒŽ” PIC  X(003).
000120 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‰ð–ñŒŽŠzƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‘Ï—p”N” 
                                             PIC S9(002)V9(3) COMP-3.
000140 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000150 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‰ð–ñ‰Šú”ï—p 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000170 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(8) COMP-3.
000180 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|ŒŸŽû“ú PIC  X(008).
000190 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‘æ‚P‰ñ“ü‹à“ú PIC  X(008).
000200 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|‘æ‚Q‰ñ“ü‹à“ú PIC  X(008).
000210 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|Œo‰ßŒŽ” PIC  X(003).
000220 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|Œ¸Šz–@‚P‚P‚O 
                                             PIC S9(013) COMP-3.
000230 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|•ÛŒ¯‰¿Ši‚P‚P‚O 
                                             PIC S9(013) COMP-3.
000240 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|ŽÀŽ¿Œ³–{Žc‚P‚O‚T 
                                             PIC S9(013) COMP-3.
000250 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|Žc‘¶ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000260 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|ŽÀŽ¿–¢‰ñŽûŒ³–{ 
                                             PIC S9(013) COMP-3.
000270 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|–¢’¥ŽûŒÅ’èŽ‘ŽYÅ 
                                             PIC S9(013) COMP-3.
000280 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|–¢’¥Žû•ÛŒ¯—¿ 
                                             PIC S9(013) COMP-3.
000290 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|–¢‰ñŽû‡Œv 
                                             PIC S9(013) COMP-3.
000300 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|–@’è’èŠzž‹pŠzŽc‚ 
                                             PIC S9(013) COMP-3.
000310 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|Œ¸Šz–@‚P‚O‚T 
                                             PIC S9(013) COMP-3.
000320 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|•¨Œ”Ô† PIC  X(003).
000330 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|Š„•Š‚e‚k‚f PIC  X(001).
000340 01  ‚j‚`‚h|‚v‚j|‚j‚h‚r‚n‚m‚f‚l‚m|–@’è’è—¦ž‹pŠzŽc‚ 
                                             PIC S9(013) COMP-3.
