000010************************************************
000020* (KAI_WK_KEIYAKU)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|“WŠJ˜A”Ô PIC S9(003) COMP-3.
000060 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Œ_–ñæ–¼ PIC  X(060).
000070 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‰ð–ñ“ú”N PIC  X(004).
000080 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‰ð–ñ“úŒŽ PIC  X(002).
000090 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‰ð–ñ“ú“ú PIC  X(002).
000100 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000110 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000120 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Žx•¥‰ñ” PIC S9(003) COMP-3.
000130 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|Á”ïÅ“™ PIC S9(013) COMP-3.
000140 01  ‚j‚`‚h|‚v‚j|‚j‚d‚h‚x‚`‚j‚t|‡Œv PIC S9(013) COMP-3.
