000010************************************************
000020* (KAI_SAIMEI)
000030************************************************
000040 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|‚r‚e‚b‰ð–ñˆ— PIC  X(001).
000070 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|‹K‘¹‹àÁ”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000080 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|Žc‰¿Šz PIC S9(013) COMP-3.
000090 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000100 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|w“ü‹àŠz PIC S9(013) COMP-3.
000110 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|”—Ê PIC S9(004) COMP-3.
000120 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|Ž‘ŽYˆ•ªƒR[ƒh PIC  X(001).
000130 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|‹K’è‘¹Ž¸‹àŠz PIC S9(013) COMP-3.
000140 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|”„‹p‹àŠz PIC S9(013) COMP-3.
000150 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|”„‹pæ–¼ƒJƒi PIC  X(030).
000160 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|ˆøŽæ”ï—p PIC S9(013) COMP-3.
000170 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|”„‹p‹àŠz“ü‹à—\’è“ú PIC  X(008).
000180 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|”„‹p‹àŠz“ü‹àæƒR[ƒh PIC  X(008).
000190 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|“o˜^“ú PIC  X(008).
000200 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|“o˜^Žž PIC  X(006).
000210 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000220 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|XV“ú PIC  X(008).
000230 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|XVŽž PIC  X(006).
000240 01  ‚j‚`‚h|‚r‚`‚h‚l‚d‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
