000010************************************************
000020* (KAI_WK_HOUTABLE)
000030************************************************
000040 01  KAI_WK_HOUTABLE-NO PIC S9(003) COMP-3.
000050 01  KAI_WK_HOUTABLE-’S“–•”“X PIC  X(020).
000060 01  KAI_WK_HOUTABLE-‰ð–ñ“ú PIC  X(008).
000070 01  KAI_WK_HOUTABLE-Œ_–ñ”Ô† PIC  X(009).
000080 01  KAI_WK_HOUTABLE-–¼Šñ‚¹º°ÄÞ PIC  X(008).
000090 01  KAI_WK_HOUTABLE-Œ_–ñæ–¼ PIC  X(060).
000100 01  KAI_WK_HOUTABLE-’¼“]‹æ•ª PIC  X(001).
000110 01  KAI_WK_HOUTABLE-‰ð–ñ——R PIC  X(001).
000120 01  KAI_WK_HOUTABLE-‰ð–ñ‘ÎÛ‹æ•ª PIC S9(001) COMP-3.
000130 01  KAI_WK_HOUTABLE-‰ð–ñ•¨Œ–¼Š¿Žš PIC  X(040).
000140 01  KAI_WK_HOUTABLE-Œ´•¨Œ‹àŠz PIC S9(013) COMP-3.
000150 01  KAI_WK_HOUTABLE-Œ´Žc‰¿‹àŠz PIC S9(013) COMP-3.
000160 01  KAI_WK_HOUTABLE-Œ´Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000170 01  KAI_WK_HOUTABLE-‰ð–ñ•¨Œ‹àŠz PIC S9(013) COMP-3.
000180 01  KAI_WK_HOUTABLE-Ø°½ŠúŠÔ PIC S9(013) COMP-3.
000190 01  KAI_WK_HOUTABLE-‰ð–ñŒŽŠzØ°½—¿ PIC S9(013) COMP-3.
000200 01  KAI_WK_HOUTABLE-‘Ï—p”N” PIC S9(002)V9(3) COMP-3.
000210 01  KAI_WK_HOUTABLE-•ÛŒ¯—¿—¦ PIC S9(002)V9(3) COMP-3.
000220 01  KAI_WK_HOUTABLE-‰ð–ñŽc‰¿ PIC S9(013) COMP-3.
000230 01  KAI_WK_HOUTABLE-‰ð–ñ‰Šú”ï—p PIC S9(013) COMP-3.
000240 01  KAI_WK_HOUTABLE-ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000250 01  KAI_WK_HOUTABLE-ŽÐ“à‹à—˜ PIC S9(002)V9(3) COMP-3.
000260 01  KAI_WK_HOUTABLE-ŒŸŽû“ú PIC  X(008).
000270 01  KAI_WK_HOUTABLE-‰‰ñØ°½—¿“ü‹à“ú PIC  X(008).
000280 01  KAI_WK_HOUTABLE-˜’uŒŽ” PIC S9(003) COMP-3.
000290 01  KAI_WK_HOUTABLE-‘æ2‰ñØ°½—¿“ü‹à“ú PIC  X(008).
000300 01  KAI_WK_HOUTABLE-Œo‰ßŒŽ” PIC S9(003) COMP-3.
000310 01  KAI_WK_HOUTABLE-‡ˆÓ‰ð–ñ‹à PIC S9(013) COMP-3.
000320 01  KAI_WK_HOUTABLE-ˆ•ª•û–@ PIC  X(001).
000330 01  KAI_WK_HOUTABLE-”„‹p‘ã‹à PIC S9(013) COMP-3.
000340 01  KAI_WK_HOUTABLE-“ü‹à—\’è“ú PIC  X(008).
000350 01  KAI_WK_HOUTABLE-Žx•¥ŽÒ PIC  X(001).
000360 01  KAI_WK_HOUTABLE-Žx•¥•û–@ PIC  X(001).
000370 01  KAI_WK_HOUTABLE-‰ñŽû—\’è“ú PIC  X(008).
000380 01  KAI_WK_HOUTABLE-‘æ3ŽÒ–¼ PIC  X(030).
000390 01  KAI_WK_HOUTABLE-Žx•¥‹àŠz PIC S9(013) COMP-3.
000400 01  KAI_WK_HOUTABLE-”„‹p[“– PIC S9(013) COMP-3.
000410 01  KAI_WK_HOUTABLE-•¨Œ‘ŠŽE PIC  X(001).
000420 01  KAI_WK_HOUTABLE-‘OŽó‚¯Ø°½—¿ˆ— PIC  X(001).
000430 01  KAI_WK_HOUTABLE-‰c‹Æí—ª•” PIC  X(001).
000440 01  KAI_WK_HOUTABLE-‘‡Šé‰æ•” PIC  X(001).
000450 01  KAI_WK_HOUTABLE-Ž––±ŠÇ—•” PIC  X(001).
000460 01  KAI_WK_HOUTABLE-•ïŠ‡ˆÙ—á PIC  X(001).
000470 01  KAI_WK_HOUTABLE-•¨ŒNO PIC  X(003).
