000010************************************************
000020* (KEI_SEIKYU_WK)
000030************************************************
000040 01  ‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‚v‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‚v‚j|ŽèŒ`–‡” PIC S9(003) COMP-3.
000060 01  ‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‚v‚j|“ü‹àŠî€“ú PIC  X(002).
000070 01  ‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‚v‚j|—a‹àŽí—Þ PIC  X(001).
000080 01  ‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‚v‚j|‹âsƒR[ƒh PIC  X(007).
000090 01  ‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‚v‚j|ŒûÀ”Ô† PIC  X(007).
000100 01  ‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‚v‚j|‹âs’ZkƒR[ƒh PIC  X(002).
