000010************************************************
000020* (KEI_IKEN)
000030************************************************
000040 01  ‚j‚d‚h|‚h‚j‚d‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚h‚j‚d‚m|‰c‹Æ•”ˆÓŒ© PIC  X(340).
000060 01  ‚j‚d‚h|‚h‚j‚d‚m|Ž––±˜A—Ž–€ PIC  X(200).
000070 01  ‚j‚d‚h|‚h‚j‚d‚m|“o˜^“ú PIC  X(008).
000080 01  ‚j‚d‚h|‚h‚j‚d‚m|“o˜^Žž PIC  X(006).
000090 01  ‚j‚d‚h|‚h‚j‚d‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000100 01  ‚j‚d‚h|‚h‚j‚d‚m|XV“ú PIC  X(008).
000110 01  ‚j‚d‚h|‚h‚j‚d‚m|XVŽž PIC  X(006).
000120 01  ‚j‚d‚h|‚h‚j‚d‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
