000010************************************************
000020* (KEI_SONSITU)
000030************************************************
000040 01  ‚j‚d‚h|‚r‚n‚m‚r‚h‚s‚t|‹K’è‘¹Ž¸‹àƒR[ƒh PIC  X(002).
000050 01  ‚j‚d‚h|‚r‚n‚m‚r‚h‚s‚t|“à—e PIC  X(030).
000060 01  ‚j‚d‚h|‚r‚n‚m‚r‚h‚s‚t|“o˜^“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚r‚n‚m‚r‚h‚s‚t|“o˜^Žž PIC  X(006).
000080 01  ‚j‚d‚h|‚r‚n‚m‚r‚h‚s‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚r‚n‚m‚r‚h‚s‚t|XV“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚r‚n‚m‚r‚h‚s‚t|XVŽž PIC  X(006).
000110 01  ‚j‚d‚h|‚r‚n‚m‚r‚h‚s‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
