000010************************************************
000020* (KEI_KONYUM)
000030************************************************
000040 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000050 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|w“üæƒR[ƒh|ƒZƒ“ƒ^[ PIC  X(008).
000070 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|w“üæ–¼ PIC  X(060).
000080 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|Žx•¥æƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|w“üæ—X•Ö”Ô† PIC  X(007).
000100 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|w“üæZŠ PIC  X(100).
000110 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|w“üæ’S“–ŽÒ PIC  X(020).
000120 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|“d˜b”Ô† PIC  X(015).
000130 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|‚e‚`‚w”Ô† PIC  X(015).
000140 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|Žx•¥ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000150 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|Žx•¥ðŒ•¶Œ¾ PIC  X(040).
000160 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|ƒRƒƒ“ƒg PIC  X(100).
000170 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|w“üæ–¼ƒJƒi PIC  X(030).
000180 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|“o˜^“ú PIC  X(008).
000190 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|“o˜^Žž PIC  X(006).
000200 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000210 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|XV“ú PIC  X(008).
000220 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|XVŽž PIC  X(006).
000230 01  ‚j‚d‚h|‚j‚n‚m‚x‚t‚l|XV’S“–ŽÒƒR[ƒh PIC  X(004).
