000010************************************************
000020* (KEI_KANJO_CD)
000030************************************************
000040 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000050 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|“à—e PIC  X(030).
000060 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|Œ_–ñ”Ô†‚Ìã‚PŒ… PIC  X(001).
000070 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|“o˜^“ú PIC  X(008).
000080 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|“o˜^Žž PIC  X(006).
000090 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000100 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|XV“ú PIC  X(008).
000110 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|XVŽž PIC  X(006).
000120 01  ‚j‚d‚h|‚j‚`‚m‚i‚n|‚b‚c|XV’S“–ŽÒƒR[ƒh PIC  X(004).
