000010************************************************
000020* (KEI_EDA_WK_THUMON3)
000030************************************************
000040 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚R|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚R|ƒfƒB[ƒ‰[ƒR[ƒh
                                             PIC  X(005).
000060 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚R|’[––”Ô† PIC  X(016).
000070 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚R|”Ô† PIC  X(018).
000080 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚R|Žx•¥ŒJ‰„‹àŠz 
                                             PIC S9(013) COMP-3.
000090 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚R|Žx•¥ðŒ•¶Œ¾ 
                                             PIC  X(040).
