000010************************************************
000020* (KEI_LPWK_RINGI_KONYU)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|w“üæŽ¯•Ê‚m‚n 
                                             PIC  X(002).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|‚v‚j˜A”Ô 
                                             PIC S9(003) COMP-3.
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|’[––”Ô† 
                                             PIC  X(016).
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|w“üæƒR[ƒh 
                                             PIC  X(008).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|w“üæ–¼ 
                                             PIC  X(060).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|w“üæZŠ 
                                             PIC  X(100).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|w“üæ’S“–ŽÒ 
                                             PIC  X(020).
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|“d˜b”Ô† 
                                             PIC  X(015).
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚P 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚P 
                                             PIC S9(002)V9(2) COMP-3.
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚P 
                                             PIC  X(040).
000180 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚Q 
                                             PIC S9(013) COMP-3.
000190 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚Q 
                                             PIC S9(002)V9(2) COMP-3.
000200 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚Q 
                                             PIC  X(040).
000210 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚R 
                                             PIC S9(013) COMP-3.
000220 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚R 
                                             PIC S9(002)V9(2) COMP-3.
000230 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚R 
                                             PIC  X(040).
000240 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚S 
                                             PIC S9(013) COMP-3.
000250 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚S 
                                             PIC S9(002)V9(2) COMP-3.
000260 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚S 
                                             PIC  X(040).
000270 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚T 
                                             PIC S9(013) COMP-3.
000280 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚T 
                                             PIC S9(002)V9(2) COMP-3.
000290 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚T 
                                             PIC  X(040).
000300 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚P 
                                             PIC  X(001).
000310 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚Q 
                                             PIC  X(001).
000320 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚R 
                                             PIC  X(001).
000330 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚S 
                                             PIC  X(001).
000340 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚T 
                                             PIC  X(001).
000350 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Žæˆøæ–¼ 
                                             PIC  X(060).
000360 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚n‚m‚x‚t|Œ_–ñ“ú 
                                             PIC  X(008).
