000010************************************************
000020* (KEI_TSRYO_KHN)
000030************************************************
000040 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|¿‹æƒR[ƒh PIC  X(008).
000080 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000100 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ˆ—“ú PIC  X(008).
000110 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ƒŠ[ƒXŠJŽn“ú PIC  X(008).
000120 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|‹âs’ZkƒR[ƒh PIC  X(002).
000130 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|‹âsƒR[ƒh PIC  X(007).
000140 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ŒûÀ”Ô† PIC  X(007).
000150 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|—a‹àŽí—Þ PIC  X(001).
000160 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ŠÖ˜AŒ_–ñ”Ô† PIC  X(009).
000170 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Á”ïÅ’¥Žû‹æ•ª PIC  X(001).
000180 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|‚r‚e‚b”»’è‹æ•ª PIC  X(001).
000190 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ƒf[ƒ^‹æ•ª PIC  X(001).
000200 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|“ü‹à“ú PIC S9(002) COMP-3.
000210 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000220 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|¿‹‹æ•ª‚P PIC  X(001).
000230 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|¿‹‹æ•ª‚Q PIC  X(001).
000240 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000250 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|¿‹ƒR[ƒh PIC  X(002).
000260 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000270 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
000280 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|‚a‚d‚f‚h‚m‰ñ” PIC  X(001).
000290 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ŒvŽZ•ûŽ® PIC  X(001).
000300 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ÄƒŠ[ƒXƒR[ƒh PIC  X(001).
000310 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|¿‹‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000320 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000330 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000340 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Žè”—¿Œû‘OŽó‹àŠz 
                                             PIC S9(013) COMP-3.
000350 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Žè”—¿Œû‘OŽó“ü‹à“ú PIC  X(008).
000360 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|Žè”—¿¿‹–¼Ì PIC  X(030).
000370 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|ÄƒŠ[ƒX•t•Û—¦ 
                                             PIC S9(002) COMP-3.
000380 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|‘—M‹æ•ª PIC  X(001).
000390 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|“o˜^“ú PIC  X(008).
000400 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|“o˜^Žž PIC  X(006).
000410 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000420 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|XV“ú PIC  X(008).
000430 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|XVŽž PIC  X(006).
000440 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚j‚g‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
