000010************************************************
000020* (KEI_EDA_WK_THUMON1)
000030************************************************
000040 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000060 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|’[––”Ô† PIC  X(016).
000070 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000080 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|Œ_–ñ“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|ŒŸŽû—\’è“ú 
                                             PIC  X(008).
000110 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|[“–|‘ŠŽE‹æ•ª 
                                             PIC  X(001).
000120 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|‘O“n‹à‹æ•ª 
                                             PIC  X(001).
000130 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|w“üæ–¼ PIC  X(060).
000140 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|w“üæZŠ 
                                             PIC  X(100).
000150 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000170 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|“s“¹•{Œ§ PIC  X(010).
000180 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|ZŠ‚P PIC  X(040).
000190 01  ‚j‚d‚h|‚d‚c‚`|‚v‚j|‚s‚g‚t‚l‚n‚m‚P|ZŠ‚Q PIC  X(040).
