000010************************************************
000020* (KEI_BUNKATU_KEY)
000030************************************************
000040 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|ˆ—ƒXƒe[ƒ^ƒX PIC  X(001).
000060 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|‘—M‹æ•ª PIC  X(001).
000070 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000080 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|“o˜^“ú PIC  X(008).
000090 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|“o˜^Žž PIC  X(006).
000100 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|“o˜^’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000110 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|XV“ú PIC  X(008).
000120 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|XVŽž PIC  X(006).
000130 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚d‚x|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
