000010************************************************
000020* (KEI_HOSHO_ITEM)
000030************************************************
000040 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚h‚s‚d‚l|•Û‘S”ÍˆÍƒR[ƒh PIC  X(002).
000050 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚h‚s‚d‚l|“à—e PIC  X(020).
000060 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚h‚s‚d‚l|“o˜^“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚h‚s‚d‚l|“o˜^Žž PIC  X(006).
000080 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚h‚s‚d‚l|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚h‚s‚d‚l|XV“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚h‚s‚d‚l|XVŽž PIC  X(006).
000110 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚h‚s‚d‚l|XV’S“–ŽÒƒR[ƒh PIC  X(004).
