000010************************************************
000020* (KEI_NASCA_SYOHIN)
000030************************************************
000040 01  ‚j‚d‚h|‚m‚`‚r‚b‚`|‚r‚x‚n‚g‚h‚m|‹@ŠB”Ô† PIC  X(010).
000050 01  ‚j‚d‚h|‚m‚`‚r‚b‚`|‚r‚x‚n‚g‚h‚m|•¨Œ–¼|ƒJƒi PIC  X(020).
000060 01  ‚j‚d‚h|‚m‚`‚r‚b‚`|‚r‚x‚n‚g‚h‚m|Ž‘ŽYƒR[ƒh PIC  X(007).
