000010************************************************
000020* (KEI_LPWK_EDA_THUMON2)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|ƒfƒB[ƒ‰[ƒR[ƒh
                                             PIC  X(005).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|’[––”Ô† 
                                             PIC  X(016).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|”Ô† 
                                             PIC S9(003) COMP-3.
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|Žæˆøæ–¼ 
                                             PIC  X(060).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|Œ_–ñ“ú 
                                             PIC  X(008).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|ŒŸŽû—\’è“ú 
                                             PIC  X(008).
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|[“–|‘ŠŽE‹æ•ª 
                                             PIC  X(001).
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|‘O“n‹à‹æ•ª 
                                             PIC  X(001).
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|w“üæ–¼ 
                                             PIC  X(060).
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|w“üæZŠ 
                                             PIC  X(100).
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000180 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|“s“¹•{Œ§ 
                                             PIC  X(010).
000190 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|ZŠ‚P 
                                             PIC  X(040).
000200 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚Q|ZŠ‚Q 
                                             PIC  X(040).
