000010************************************************
000020* (KEI_PATTERN_MST)
000030************************************************
000040 01  ‚j‚d‚h|‚o‚`‚s‚s‚d‚q‚m|‚l‚r‚s|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚d‚h|‚o‚`‚s‚s‚d‚q‚m|‚l‚r‚s|Žæˆøæ–¼ PIC  X(060).
