000010************************************************
000020* (KEI_WK_EDA_KIHON)
000030************************************************
000040 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|’[––”Ô† PIC  X(016).
000060 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Œ_–ñ”Ô†‚VŒ… PIC  X(007).
000080 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000090 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000100 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Žæˆøæ–¼ PIC  X(060).
000110 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Š¨’èˆ—ƒR[ƒh 
                                             PIC  X(002).
000130 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Â–±‹¦’²ƒR[ƒh 
                                             PIC  X(002).
000140 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŽæˆøŒ`‘ÔƒR[ƒh 
                                             PIC  X(002).
000150 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000160 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|•¨ŒŠm”FŠî€ PIC  X(001).
000170 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000180 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒŸŽû—\’è“ú PIC  X(008).
000190 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000200 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒvŽZ•ûŽ® PIC  X(001).
000210 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000220 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000230 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000240 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|˜’uŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000250 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‘OŽóŒŽ” 
                                             PIC S9(002) COMP-3.
000260 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(2) COMP-3.
000270 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒŽŠz•½‹Ï•ÛŽç—¿ 
                                             PIC S9(013) COMP-3.
000280 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‚»‚Ì‘¼””ï—p‘Šz 
                                             PIC S9(013) COMP-3.
000290 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‘O“n‹à—˜‘§ 
                                             PIC S9(013) COMP-3.
000300 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000310 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Á”ïÅ’¥Žû‹æ•ª 
                                             PIC  X(001).
000320 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000330 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000340 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|“]ƒŠ[ƒX’ñŒgæƒR[ƒh 
                                             PIC  X(002).
000350 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|’P”N“xŒ_–ñ PIC  X(002).
000360 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|[“–|‘ŠŽE‹æ•ª PIC  X(001).
000370 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‘O“n‹à‹æ•ª PIC  X(001).
000380 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ÄƒŠ[ƒX—¿•\Ž¦‹æ•ª 
                                             PIC  X(001).
000390 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ÄƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000400 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|•ÛŽçŒ_–ñæ–¼ PIC  X(060).
000410 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|“Á–ñ PIC  X(800).
000420 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000430 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Žc‰¿Šz‡Œv 
                                             PIC S9(013) COMP-3.
000440 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000450 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000460 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‘e—˜‰v 
                                             PIC S9(013) COMP-3.
000470 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000480 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000490 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000500 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅ‘Šz 
                                             PIC S9(013) COMP-3.
000510 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯—¿‘Šz 
                                             PIC S9(013) COMP-3.
000520 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000530 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒvŽZ•û–@|‹K’è‘¹Ž¸‹à 
                                             PIC  X(002).
000540 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ƒƒ“ƒRƒ~•t‹c‚m‚n 
                                             PIC  X(007).
000550 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒˆÏ‹æ•ª PIC  X(001).
000560 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000570 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|I‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000580 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‘ã•\•¨Œ–¼ PIC  X(040).
000590 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|¿‹‹æ•ª‚P PIC  X(001).
000600 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|¿‹‹æ•ª‚Q PIC  X(001).
000610 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‘æ‚P‰ñƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000620 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‚Q‰ñ–ÚˆÈ~ƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000630 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŽèŒ`–‡” 
                                             PIC S9(003) COMP-3.
000640 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|“ü‹àŠî€“ú PIC  X(002).
000650 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|—a‹àŽí—Þ PIC  X(001).
000660 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‹âsƒR[ƒh PIC  X(007).
000670 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ŒûÀ”Ô† PIC  X(007).
000680 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|‹âsŽx“X–¼ PIC  X(060).
000690 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|“®‘•t•Û‹æ•ª PIC  X(001).
000700 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚h‚g‚n‚m|ˆø“nŠúŒÀ PIC  X(008).
