000010************************************************
000020* (KEI_LPWK_EDA_THUMON3)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚R|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚R|’[––”Ô† 
                                             PIC  X(016).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚R|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚R|Žx•¥ðŒ•¶Œ¾ 
                                             PIC  X(040).
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚R|”Ô† 
                                             PIC S9(003) COMP-3.
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚R|Žx•¥ŒJ‰„‹àŠz 
                                             PIC S9(013) COMP-3.
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚R|Žx•¥ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
