000010************************************************
000020* (KEI_TSRYO_TKI)
000030************************************************
000040 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|˜A”Ô PIC S9(003) COMP-3.
000060 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|“WŠJ¿‹‹àŠz 
                                             PIC S9(013) COMP-3.
000080 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|Žx•¥‰ñ” PIC S9(003) COMP-3.
000090 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|“o˜^“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|“o˜^Žž PIC  X(006).
000110 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|XV“ú PIC  X(008).
000130 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|XVŽž PIC  X(006).
000140 01  ‚j‚d‚h|‚s‚r‚q‚x‚n|‚s‚j‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
