000010************************************************
000020* (KEI_LPWK_RINGI_MEISAI)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|•¨Œ‚m‚n 
                                             PIC  X(003).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|‚v‚j˜A”Ô 
                                             PIC S9(005) COMP-3.
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|’[––”Ô† 
                                             PIC  X(016).
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|w“üæŽ¯•Ê‚m‚n 
                                             PIC  X(001).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|•¨Œ–¼|Š¿Žš 
                                             PIC  X(040).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|»‘¢‹ÆŽÒ 
                                             PIC  X(060).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|”—Ê 
                                             PIC S9(004) COMP-3.
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|w“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Ž‘ŽYƒR[ƒh 
                                             PIC  X(007).
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|‘Ï—p”N” 
                                             PIC S9(002) COMP-3.
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|M—p•ÛŒ¯ƒR[ƒh 
                                             PIC  X(006).
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Žc‰¿Šz 
                                             PIC S9(013) COMP-3.
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Žc‰¿•ÛØæ–¼ 
                                             PIC  X(060).
000180 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼|Š¿Žš 
                                             PIC  X(040).
000190 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Ý’uêŠZŠ 
                                             PIC  X(100).
000200 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Ž‘ŽYƒ}ƒXƒ^Ž‘ŽY–¼ 
                                             PIC  X(030).
000210 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|w“üæ–¼ 
                                             PIC  X(060).
000220 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Žæˆøæ–¼ 
                                             PIC  X(060).
000230 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚l‚d‚h‚r‚`‚h|Œ_–ñ“ú 
                                             PIC  X(008).
