000010************************************************
000020* (KEI_MEISAI_WK)
000030************************************************
000040 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|w“üæŽ¯•Ê‚m‚n PIC  X(001).
000070 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|•¨Œ–¼|Š¿Žš PIC  X(040).
000080 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|•¨Œ–¼|ƒJƒi PIC  X(020).
000090 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Žd—l»‘¢”Ô† PIC  X(020).
000100 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|»‘¢‹ÆŽÒ PIC  X(060).
000110 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|’P‰¿ PIC S9(013) COMP-3.
000120 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|”—Ê PIC S9(004) COMP-3.
000130 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|w“ü‹àŠz PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|’†ŒÃ•iƒR[ƒh PIC  X(001).
000170 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|“®‘•t•Û‹æ•ª PIC  X(001).
000180 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000190 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|“®‘•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000200 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Ž‘ŽYƒR[ƒh PIC  X(007).
000210 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|‘Ï—p”N” PIC S9(002) COMP-3.
000220 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|M—p•ÛŒ¯ƒR[ƒh PIC  X(006).
000230 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Œ^Ž®”Ô† PIC  X(015).
000240 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Žc‰¿•ÛØ‹æ•ª PIC  X(001).
000250 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Žc‰¿Šz PIC S9(013) COMP-3.
000260 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Žc‰¿•ÛØæƒR[ƒh PIC  X(008).
000270 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Žc‰¿•ÛØæ–¼ PIC  X(060).
000280 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Å‹æ•ª PIC  X(001).
000290 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Å•‰’SƒR[ƒh PIC  X(001).
000300 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|ŒÅ’èŽ‘ŽYÅŠz 
                                             PIC S9(002)V9(2) COMP-3.
000310 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|“Á—á—¦|•ªŽq 
                                             PIC S9(002) COMP-3.
000320 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|“Á—á—¦|•ª•ê 
                                             PIC S9(002) COMP-3.
000330 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|“Á—áŠúŠÔ PIC S9(002) COMP-3.
000340 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000350 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Ý’uêŠ–¼|ƒJƒi PIC  X(020).
000360 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000370 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|”[•tæƒR[ƒh PIC  X(006).
000380 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Ý’uêŠZŠ PIC  X(100).
000390 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚P 
                                             PIC  X(012).
000400 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚Q 
                                             PIC  X(012).
000410 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚R 
                                             PIC  X(012).
000420 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚S 
                                             PIC  X(012).
000430 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Žw’è“dŽqŒvŽZ‹@ PIC  X(040).
000440 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|Žg—pŒ Ý’èŽÒ PIC  X(060).
000450 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|‚v‚jŒÅ—L|w“üæƒR[ƒh 
                                             PIC  X(008).
000460 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|‚v‚jŒÅ—L|w“üæ–¼ PIC  X(060).
000470 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|‚v‚jŒÅ—L|C³ƒtƒ‰ƒO 
                                             PIC  X(001).
000480 01  ‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‚v‚j|‚v‚jŒÅ—L|Vw“üæ”»’fƒtƒ‰ƒO 
                                             PIC  X(001).
