000010************************************************
000020* (KOK_SIHARAI)
000030************************************************
000040 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‹âsƒR[ƒh PIC  X(004).
000060 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‹âs–¼ PIC  X(030).
000070 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|Žx“XƒR[ƒh PIC  X(003).
000080 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|Žx“X–¼ PIC  X(030).
000090 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|—a‹àŽí—Þ PIC  X(001).
000100 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|ŒûÀ”Ô† PIC  X(007).
000110 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|ŒûÀ–¼‹`l PIC  X(060).
000120 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|Žx•¥æƒR[ƒh PIC  X(004).
000130 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|“o˜^“ú PIC  X(008).
000140 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|“o˜^Žž PIC  X(006).
000150 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000160 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|XV“ú PIC  X(008).
000170 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|XVŽž PIC  X(006).
000180 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
