000010************************************************
000020* (KOK_SOUKI_WKLIST)
000030************************************************
000040 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|ŒÚ‹qƒR[ƒh PIC  X(008).
000050 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|Žæˆøæ–¼ƒJƒi PIC  X(070).
000060 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|Žæˆøæ–¼Š¿Žš PIC  X(100).
000070 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|ZŠ PIC  X(100).
000080 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|¶”NŒŽ“ú PIC  X(007).
000090 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|‘ã•\ŽÒŽ–¼ PIC  X(030).
000100 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚P PIC  X(002).
000110 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚Q PIC  X(002).
000120 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚R PIC  X(002).
000130 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚S PIC  X(002).
000140 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚T PIC  X(002).
000150 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚k‚h‚r‚s|ƒƒbƒZ[ƒW PIC  X(080).
