000010************************************************
000020* (KOK_WKSETTEI)
000030************************************************
000040 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|’S“–ŽÒƒR[ƒh PIC  X(004).
000070 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|Žæˆøæ–¼Š¿Žš PIC  X(060).
000080 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|Žæˆøæ–¼ƒJƒi PIC  X(060).
000090 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|¿‹æ•”–¼ƒJƒi PIC  X(060).
000100 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|¿‹æ•”–¼ PIC  X(060).
000110 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|—X•Ö”Ô†‚RŒ… PIC  X(003).
000120 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|—X•Ö”Ô†‚SŒ… PIC  X(004).
000130 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ZŠƒJƒi PIC  X(060).
000140 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|“s“¹•{Œ§ PIC  X(010).
000150 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ZŠ‚P PIC  X(040).
000160 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ZŠ‚Q PIC  X(040).
000170 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‘åŠé‹ÆƒR[ƒh PIC  X(001).
000180 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‚a‚s‚lŽæˆø‹æ•ª PIC  X(001).
000190 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‚a‚s‚l’S“–•”“X PIC  X(030).
000200 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|Žx“XƒR[ƒh PIC  X(003).
000210 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‹ÆŽíƒR[ƒh PIC  X(002).
000220 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‹ÆŽí PIC  X(030).
000230 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000240 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000250 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|’é‘ƒR[ƒh PIC  X(010).
000260 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‹âs–¼ PIC  X(030).
000270 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‹âsŽx“X–¼ PIC  X(030).
000280 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‹âsƒR[ƒh PIC  X(007).
000290 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‹âsŒûÀ”Ô† PIC  X(007).
000300 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|—a‹àŽí—Þ PIC  X(001).
000310 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|‹âsM‹à PIC  X(001).
000320 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ÄƒŠ[ƒX—¿ PIC  X(001).
000330 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|“o˜^æ–¼ PIC  X(060).
000340 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|“o˜^æ–¼‚Q PIC  X(060).
000350 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|Ž–‹ÆŠ–¼ PIC  X(020).
000360 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛƒ†[ƒU[ PIC  X(001).
000370 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛ¿‹æ PIC  X(001).
000380 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛw“üæ PIC  X(001).
000390 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛŽc‰¿•ÛØæ PIC  X(001).
000400 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛ‚»‚Ì‘¼ PIC  X(001).
000410 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛ–¼Šñ‚¹ƒR[ƒh PIC  X(001).
000420 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛƒ†[ƒU[ƒR[ƒh PIC  X(001).
000430 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ÄƒŠ[ƒXŽ©“® PIC  X(001).
000440 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|“]ƒŠ[ƒX’ñŒgæ PIC  X(002).
000450 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ƒOƒ‹[ƒvƒR[ƒh PIC  X(008).
000460 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛƒOƒ‹[ƒv PIC  X(001).
000470 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|ŠÛƒOƒ‹[ƒvƒR[ƒh PIC  X(001).
000480 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|“o˜^æ–¼‚R PIC  X(060).
000490 01  ‚j‚n‚j|‚v‚j‚r‚d‚s‚s‚d‚h|’é‘‹æ•ª PIC  X(001).
