000010************************************************
000020* (KOK_HSMKN)
000030************************************************
000040 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000060 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|ƒOƒ‹[ƒvƒR[ƒh PIC  X(008).
000070 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000080 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|ƒOƒ‹[ƒv|–¢ŒŸŽûŒ” PIC  X(006).
000100 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|ƒOƒ‹[ƒv|–¢ŒŸŽûŽc‚ 
                                             PIC S9(013) COMP-3.
000110 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|–¼Šñ‚¹|–¢ŒŸŽûŒ” PIC  X(006).
000120 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|–¼Šñ‚¹|––ŒŸŽûŽc‚ PIC S9(013) COMP-3.
000130 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|ƒ†[ƒU[|–¢ŒŸŽûŒ” PIC  X(006).
000140 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|ƒ†[ƒU[|–¢ŒŸŽûŽc‚ 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|ŽåŠÇŽ–‹ÆŠƒR[ƒh PIC  X(004).
000160 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|“o˜^“ú PIC  X(008).
000170 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|“o˜^Žž PIC  X(006).
000180 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000190 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|XV“ú PIC  X(008).
000200 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|XVŽž PIC  X(006).
000210 01  ‚j‚n‚j|‚g‚r‚l‚j‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
