000010************************************************
000020* (KSL_KEI_TENKAI)
000030************************************************
000040 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|˜A”Ô PIC S9(003) COMP-3.
000060 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000070 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‰ñ” PIC S9(003) COMP-3.
000080 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|“o˜^“ú PIC  X(008).
000090 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|“o˜^Žž PIC  X(006).
000100 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000110 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|XV“ú PIC  X(008).
000120 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|XVŽž PIC  X(006).
000130 01  ‚j‚r‚k|‚j‚d‚h|‚s‚d‚m‚j‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
