000010************************************************
000020* (KSL_KEI_LPWK_TORIHIKI1)
000030************************************************
000040 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|’[––”Ô† 
                                             PIC  X(016).
000060 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000070 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|âg‹c‚m‚n 
                                             PIC  X(010).
000080 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|âg‹c‹æ•ª 
                                             PIC  X(001).
000090 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Žæˆøæ‹æ•ª 
                                             PIC  X(001).
000100 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000110 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒÚ‹qƒR[ƒh 
                                             PIC  X(006).
000120 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Žæˆøæ–¼ 
                                             PIC  X(060).
000130 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000140 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Š¨’èˆ—ƒR[ƒh 
                                             PIC  X(002).
000150 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Â–±‹¦’²ƒR[ƒh 
                                             PIC  X(002).
000160 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŽæˆøŒ`‘ÔƒR[ƒh 
                                             PIC  X(002).
000170 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ˆÄŒ”­¶‹æ•ª 
                                             PIC  X(001).
000180 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|•¨ŒŠm”FŠî€ 
                                             PIC  X(001).
000190 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|•¨Œ” 
                                             PIC S9(003) COMP-3.
000200 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|w“üæ” 
                                             PIC S9(001) COMP-3.
000210 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Œ_–ñ“ú 
                                             PIC  X(008).
000220 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒŸŽû—\’è“ú 
                                             PIC  X(008).
000230 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒŸŽû“ú 
                                             PIC  X(008).
000240 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒvŽZ•ûŽ® 
                                             PIC  X(001).
000250 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000260 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000270 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000280 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|˜’uŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000290 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘OŽóŒŽ” 
                                             PIC S9(002) COMP-3.
000300 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(2) COMP-3.
000310 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒŽŠz•½‹Ï•ÛŽç—¿ 
                                             PIC S9(013) COMP-3.
000320 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‚»‚Ì‘¼””ï—p‘Šz 
                                             PIC S9(013) COMP-3.
000330 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘O“n‹à—˜‘§ 
                                             PIC S9(013) COMP-3.
000340 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000350 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Á”ïÅ’¥Žû‹æ•ª 
                                             PIC  X(001).
000360 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000370 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000380 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh 
                                             PIC  X(002).
000390 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|’P”N“xŒ_–ñ 
                                             PIC  X(002).
000400 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|[“–|‘ŠŽE‹æ•ª 
                                             PIC  X(001).
000410 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘O“n‹à‹æ•ª 
                                             PIC  X(001).
000420 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ÄƒŠ[ƒX—¿•\Ž¦‹æ•ª 
                                             PIC  X(001).
000430 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ÄƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000440 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|•ÛŽçŒ_–ñæ–¼ 
                                             PIC  X(060).
000450 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|“Á–ñ 
                                             PIC  X(800).
000460 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000470 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Žc‰¿Šz‡Œv 
                                             PIC S9(013) COMP-3.
000480 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000490 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Šî–{—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000500 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘e—˜‰v 
                                             PIC S9(013) COMP-3.
000510 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000520 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000530 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Šî–{ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000540 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒÅ’èŽ‘ŽYÅ‘Šz 
                                             PIC S9(013) COMP-3.
000550 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|“®‘•ÛŒ¯—¿‘Šz 
                                             PIC S9(013) COMP-3.
000560 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚P 
                                             PIC S9(013) COMP-3.
000570 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚Q 
                                             PIC S9(013) COMP-3.
000580 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚R 
                                             PIC S9(013) COMP-3.
000590 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚S 
                                             PIC S9(013) COMP-3.
000600 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚T 
                                             PIC S9(013) COMP-3.
000610 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚U 
                                             PIC S9(013) COMP-3.
000620 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚V 
                                             PIC S9(013) COMP-3.
000630 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚W 
                                             PIC S9(013) COMP-3.
000640 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚X 
                                             PIC S9(013) COMP-3.
000650 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚P‚O 
                                             PIC S9(013) COMP-3.
000660 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚P‚P 
                                             PIC S9(013) COMP-3.
000670 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à‚P‚Q 
                                             PIC S9(013) COMP-3.
000680 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹K’è‘¹Ž¸‹à•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000690 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒvŽZ•û–@|‹K’è‘¹Ž¸‹à 
                                             PIC  X(002).
000700 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ƒƒ“ƒRƒ~•t‹c‚m‚n 
                                             PIC  X(007).
000710 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒˆÏ‹æ•ª 
                                             PIC  X(001).
000720 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‰c‹Æ•”ˆÓŒ© 
                                             PIC  X(340).
000730 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Ž––±˜A—Ž–€ 
                                             PIC  X(200).
000740 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹æƒR[ƒh 
                                             PIC  X(008).
000750 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹æ–¼ 
                                             PIC  X(060).
000760 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹æ—X•Ö”Ô† 
                                             PIC  X(007).
000770 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹æZŠ 
                                             PIC  X(100).
000780 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹æ“d˜b”Ô† 
                                             PIC  X(015).
000790 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹æ•”–å–¼Ì 
                                             PIC  X(040).
000800 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹‹æ•ª‚P 
                                             PIC  X(001).
000810 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|¿‹‹æ•ª‚Q 
                                             PIC  X(001).
000820 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘æ‚P‰ñƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000830 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘æ‚Q‰ñ–ÚˆÈ~ƒŠ[ƒX—¿ŽóŽæðŒ 
                                             PIC  X(020).
000840 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŽèŒ`–‡” 
                                             PIC S9(003) COMP-3.
000850 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|“ü‹àŠî€“ú 
                                             PIC  X(002).
000860 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|—a‹àŽí—Þ 
                                             PIC  X(001).
000870 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹âsƒR[ƒh 
                                             PIC  X(007).
000880 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒûÀ”Ô† 
                                             PIC  X(007).
000890 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000900 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000910 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‘OŽóƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000920 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Žc‰¿‰ñŽû“ú 
                                             PIC  X(008).
000930 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒÚ‹qŠî–{“s“¹•{Œ§ 
                                             PIC  X(010).
000940 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒÚ‹qŠî–{ZŠ‚P 
                                             PIC  X(040).
000950 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒÚ‹qŠî–{ZŠ‚Q 
                                             PIC  X(040).
000960 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|ŒÚ‹qŠî–{“d˜b”Ô† 
                                             PIC  X(015).
000970 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹àŒÉŽx“XƒR[ƒh 
                                             PIC  X(005).
000980 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|Œ§ƒR[ƒh 
                                             PIC  X(001).
000990 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹¤“¯Ž©‰c‹æ•ª 
                                             PIC  X(001).
001000 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|“ì–k‹æ•ª 
                                             PIC  X(001).
001010 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|•¨ŒƒR[ƒh 
                                             PIC  X(001).
001020 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|˜A‘Ñ•ÛØl” 
                                             PIC  X(001).
001030 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|‹ÆŽíƒR[ƒh 
                                             PIC  X(002).
001040 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|•¾ŽÐƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
001050 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚P|•¾ŽÐ‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
