000010************************************************
000020* (LCF_LCFMST)
000030************************************************
000040 01  LCF-LCFMST-CTLNUM PIC  X(006).
000050 01  LCF-LCFMST-CLTCOD PIC  X(007).
000060 01  LCF-LCFMST-CLTNAM PIC  X(040).
000070 01  LCF-LCFMST-REFNUM PIC  X(010).
000080 01  LCF-LCFMST-BRDNAM PIC  X(040).
000090 01  LCF-LCFMST-RATTYP PIC  X(020).
000100 01  LCF-LCFMST-CNTDAY PIC  X(008).
000110 01  LCF-LCFMST-BORDAY PIC  X(008).
000120 01  LCF-LCFMST-DUEDAY PIC  X(008).
000130 01  LCF-LCFMST-PAYCYC PIC  X(002).
000140 01  LCF-LCFMST-BORTYP PIC  X(001).
000150 01  LCF-LCFMST-TRMTYP PIC  X(001).
000160 01  LCF-LCFMST-FIXFLT PIC  X(001).
000170 01  LCF-LCFMST-BEFAFT PIC  X(001).
000180 01  LCF-LCFMST-YERDAY PIC  X(001).
000190 01  LCF-LCFMST-DAYBAS PIC  X(001).
000200 01  LCF-LCFMST-FRATYP PIC  X(001).
000210 01  LCF-LCFMST-SALTYP PIC  X(001).
000220 01  LCF-LCFMST-OBJTYP PIC  X(001).
000230 01  LCF-LCFMST-HOLSFT PIC  X(001).
000240 01  LCF-LCFMST-GAPTYP PIC  X(001).
000250 01  LCF-LCFMST-CREDEP PIC  X(001).
000260 01  LCF-LCFMST-CRENUM PIC  X(007).
000270 01  LCF-LCFMST-DEBBNK PIC  X(004).
000280 01  LCF-LCFMST-DEBBRC PIC  X(003).
000290 01  LCF-LCFMST-DEBDEP PIC  X(001).
000300 01  LCF-LCFMST-DEBNUM PIC  X(007).
000310 01  LCF-LCFMST-DAYCNT PIC S9(004) COMP-3.
000320 01  LCF-LCFMST-FSTCAP PIC S9(013) COMP-3.
000330 01  LCF-LCFMST-SECCAP PIC S9(013) COMP-3.
000340 01  LCF-LCFMST-CAPTOT PIC S9(013) COMP-3.
000350 01  LCF-LCFMST-CREAMT PIC S9(013) COMP-3.
000360 01  LCF-LCFMST-FSTRAT PIC S9(002)V9(6) COMP-3.
000370 01  LCF-LCFMST-SECRAT PIC S9(002)V9(6) COMP-3.
000380 01  LCF-LCFMST-SUPRAT PIC S9(002)V9(6) COMP-3.
000390 01  LCF-LCFMST-FSTINT PIC S9(013) COMP-3.
000400 01  LCF-LCFMST-SECINT PIC S9(013) COMP-3.
000410 01  LCF-LCFMST-REWRAT PIC S9(002)V9(6) COMP-3.
000420 01  LCF-LCFMST-REWAMT PIC S9(013) COMP-3.
000430 01  LCF-LCFMST-REWTAX PIC S9(013) COMP-3.
000440 01  LCF-LCFMST-CHGRAT PIC S9(002)V9(6) COMP-3.
000450 01  LCF-LCFMST-CHGAMT PIC S9(013) COMP-3.
000460 01  LCF-LCFMST-CHGTAX PIC S9(013) COMP-3.
000470 01  LCF-LCFMST-BKIRAT PIC S9(002)V9(6) COMP-3.
000480 01  LCF-LCFMST-BKIAMT PIC S9(013) COMP-3.
000490 01  LCF-LCFMST-BKITAX PIC S9(013) COMP-3.
000500 01  LCF-LCFMST-REGDAY PIC  X(008).
000510 01  LCF-LCFMST-REGTIM PIC  X(006).
000520 01  LCF-LCFMST-REGPSN PIC  X(004).
000530 01  LCF-LCFMST-MODDAY PIC  X(008).
000540 01  LCF-LCFMST-MODTIM PIC  X(006).
000550 01  LCF-LCFMST-MODPSN PIC  X(004).
