000010************************************************
000020* (LCF_ALMDAT)
000030************************************************
000040 01  LCF_ALMDAT-GENREC PIC  X(120).
