000010************************************************
000020* (LEA_KYOTU)
000030************************************************
000040 01  LEA_KYOTU-KEY PIC  X(001).
000050 01  LEA_KYOTU-事業所ｺｰﾄﾞ PIC  X(004).
000060 01  LEA_KYOTU-担当者 PIC  X(004).
000070 01  LEA_KYOTU-登録日 PIC  X(008).
000080 01  LEA_KYOTU-登録時刻 PIC  X(006).
000090 01  LEA_KYOTU-登録担当者ｺｰﾄﾞ PIC  X(004).
000100 01  LEA_KYOTU-更新日 PIC  X(008).
000110 01  LEA_KYOTU-更新時刻 PIC  X(006).
000120 01  LEA_KYOTU-更新担当者ｺｰﾄﾞ PIC  X(004).
