000010************************************************
000020* (LEA_WORK03)
000030************************************************
000040 01  LEA_WORK03-KEY PIC  X(001).
000050 01  LEA_WORK03-ŒJ‰„NO PIC S9(002) COMP-3.
000060 01  LEA_WORK03-ŒJ‰„‹àŠz PIC S9(013) COMP-3.
000070 01  LEA_WORK03-ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000080 01  LEA_WORK03-‰ÁdŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000090 01  LEA_WORK03-ŒJ‰„” PIC S9(003) COMP-3.
000100 01  LEA_WORK03-“o˜^“ú PIC  X(008).
000110 01  LEA_WORK03-“o˜^Žž PIC  X(006).
000120 01  LEA_WORK03-“o˜^’S“–ŽÒº°ÄÞ PIC  X(004).
000130 01  LEA_WORK03-XV“ú PIC  X(008).
000140 01  LEA_WORK03-XVŽž PIC  X(006).
000150 01  LEA_WORK03-XV’S“–ŽÒº°ÄÞ PIC  X(004).
