000010************************************************
000020* ‹âsƒ}ƒXƒ^[i‹âsƒŒƒR[ƒhj(LTRBAN)
000030************************************************
000040 01  ‚k‚s‚q‚a‚`‚m|‹âsƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚a‚`‚m|‹âs–¼ÌŠ¿Žš PIC  X(030).
000060 01  ‚k‚s‚q‚a‚`‚m|‹âs–¼ÌƒJƒi PIC  X(030).
000070 01  ‚k‚s‚q‚a‚`‚m|ƒ_ƒ~[‚O‚O‚P PIC  X(101).
000080 01  ‚k‚s‚q‚a‚`‚m|‹¤’Êî•ñ PIC  X(035).
