000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(“®‘•ÛŒ¯ØŒ””Ô†)(LTRCDM0230)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(010).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“®‘•ÛŒ¯ØŒ””Ô†‚P PIC  X(011).
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|ƒ_ƒ~[‚P PIC  X(012).
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“®‘•ÛŒ¯ØŒ””Ô†‚Q PIC  X(011).
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|ƒ_ƒ~[‚Q PIC  X(012).
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“®‘•ÛŒ¯ØŒ””Ô†‚R PIC  X(011).
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|ƒ_ƒ~[‚R PIC  X(012).
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“®‘•ÛŒ¯ØŒ””Ô†‚S PIC  X(011).
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|ƒ_ƒ~[‚S PIC  X(012).
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|“®‘•ÛŒ¯ØŒ””Ô†‚T PIC  X(011).
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|ƒ_ƒ~[‚T PIC  X(012).
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚R‚O|‹¤’Êî•ñ PIC  X(035).
