000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(“®ŽY‘‡•ÛŒ¯E—¿—¦)(LTRCDM0110)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|•ÛŒ¯—¿—¦‚P PIC S9(003)V9(7) COMP-3.
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|ƒ_ƒ~[‚P PIC  X(018).
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|•ÛŒ¯—¿—¦‚Q PIC S9(003)V9(7) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|ƒ_ƒ~[‚Q PIC  X(018).
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|•ÛŒ¯—¿—¦‚R PIC S9(003)V9(7) COMP-3.
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|ƒ_ƒ~[‚R PIC  X(018).
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|•ÛŒ¯—¿—¦‚S PIC S9(003)V9(7) COMP-3.
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|ƒ_ƒ~[‚S PIC  X(018).
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|•ÛŒ¯—¿—¦‚T PIC S9(003)V9(7) COMP-3.
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|ƒ_ƒ~[‚T PIC  X(018).
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚P‚P‚O|‹¤’Êî•ñ PIC  X(035).
