000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(Š·ŽZ‘Šê)(LTRCDM0410)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|•¼Ží PIC  X(003).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Š·ŽZ‘Šê‚P PIC S9(003)V9(2) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|¢‹I‚P PIC S9(001) COMP-3.
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|”NŒŽ“ú‚P PIC  X(006).
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Š·ŽZ‘Šê‚P PIC S9(003)V9(2) COMP-3.
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|¢‹I‚P PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|”NŒŽ“ú‚P PIC  X(006).
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ƒ_ƒ~[‚P PIC  X(007).
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q PIC  X(006).
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Š·ŽZ‘Šê‚Q PIC S9(003)V9(2) COMP-3.
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|¢‹I‚Q PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|”NŒŽ“ú‚Q PIC  X(006).
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Š·ŽZ‘Šê‚Q PIC S9(003)V9(2) COMP-3.
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|¢‹I‚Q PIC S9(001) COMP-3.
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|”NŒŽ“ú‚Q PIC  X(006).
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ƒ_ƒ~[‚Q PIC  X(007).
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R PIC  X(006).
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Š·ŽZ‘Šê‚R PIC S9(003)V9(2) COMP-3.
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|¢‹I‚R PIC S9(001) COMP-3.
000290 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|”NŒŽ“ú‚R PIC  X(006).
000300 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Š·ŽZ‘Šê‚R PIC S9(003)V9(2) COMP-3.
000310 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|¢‹I‚R PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|”NŒŽ“ú‚R PIC  X(006).
000330 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ƒ_ƒ~[‚R PIC  X(007).
000340 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S PIC S9(001) COMP-3.
000350 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S PIC  X(006).
000360 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Š·ŽZ‘Šê‚S PIC S9(003)V9(2) COMP-3.
000370 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|¢‹I‚S PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|”NŒŽ“ú‚S PIC  X(006).
000390 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Š·ŽZ‘Šê‚S PIC S9(003)V9(2) COMP-3.
000400 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|¢‹I‚S PIC S9(001) COMP-3.
000410 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|”NŒŽ“ú‚S PIC  X(006).
000420 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ƒ_ƒ~[‚S PIC  X(007).
000430 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T PIC  X(006).
000450 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Š·ŽZ‘Šê‚T PIC S9(003)V9(2) COMP-3.
000460 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|¢‹I‚T PIC S9(001) COMP-3.
000470 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ŒŽ––Šî€“ú|”NŒŽ“ú‚T PIC  X(006).
000480 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Š·ŽZ‘Šê‚T PIC S9(003)V9(2) COMP-3.
000490 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|¢‹I‚T PIC S9(001) COMP-3.
000500 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‘OŠú––Šî€“ú|”NŒŽ“ú‚T PIC  X(006).
000510 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|ƒ_ƒ~[‚T PIC  X(007).
000520 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚P‚O|‹¤’Êî•ñ PIC  X(035).
