000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(M—p•ÛŒ¯—¿—¦EŠ„•Š)(LTRCDM0221)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯ŠúŠÔŒŽ” PIC S9(003) COMP-3.
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚`‚P PIC S9(002)V9(4) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚a‚P PIC S9(002)V9(4) COMP-3.
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚b‚P PIC S9(002)V9(4) COMP-3.
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚c‚P PIC S9(002)V9(4) COMP-3.
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦—\‚P PIC S9(002)V9(4) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|ƒ_ƒ~[‚P PIC  X(008).
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚`‚Q PIC S9(002)V9(4) COMP-3.
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚a‚Q PIC S9(002)V9(4) COMP-3.
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚b‚Q PIC S9(002)V9(4) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚c‚Q PIC S9(002)V9(4) COMP-3.
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦—\‚Q PIC S9(002)V9(4) COMP-3.
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|ƒ_ƒ~[‚Q PIC  X(008).
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚`‚R PIC S9(002)V9(4) COMP-3.
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚a‚R PIC S9(002)V9(4) COMP-3.
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚b‚R PIC S9(002)V9(4) COMP-3.
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚c‚R PIC S9(002)V9(4) COMP-3.
000290 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦—\‚R PIC S9(002)V9(4) COMP-3.
000300 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|ƒ_ƒ~[‚R PIC  X(008).
000310 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000330 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚`‚S PIC S9(002)V9(4) COMP-3.
000340 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚a‚S PIC S9(002)V9(4) COMP-3.
000350 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚b‚S PIC S9(002)V9(4) COMP-3.
000360 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚c‚S PIC S9(002)V9(4) COMP-3.
000370 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦—\‚S PIC S9(002)V9(4) COMP-3.
000380 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|ƒ_ƒ~[‚S PIC  X(008).
000390 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000400 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000410 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚`‚T PIC S9(002)V9(4) COMP-3.
000420 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚a‚T PIC S9(002)V9(4) COMP-3.
000430 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚b‚T PIC S9(002)V9(4) COMP-3.
000440 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦‚c‚T PIC S9(002)V9(4) COMP-3.
000450 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|•ÛŒ¯—¿—¦—\‚T PIC S9(002)V9(4) COMP-3.
000460 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|ƒ_ƒ~[‚T PIC  X(008).
000470 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚P|‹¤’Êî•ñ PIC  X(035).
