000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(ƒVƒƒ[ƒv¤•iƒR[ƒh•ÏŠ·ƒe[ƒuƒ‹)(LTRCDM0020)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒVƒƒ[ƒv¤•iƒR[ƒh PIC  X(004).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|Ž‘ŽYƒR[ƒh‚P PIC  X(007).
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯‰ïŽÐƒR[ƒh‚P PIC  X(001).
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯—¿Ž¯•Ê‚P PIC  X(003).
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚P PIC  X(001).
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@ŠB‹æ•ª‚P PIC  X(002).
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@Ží–¼”Ô†‚P PIC  X(002).
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒ_ƒ~[‚P PIC  X(007).
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|Ž‘ŽYƒR[ƒh‚Q PIC  X(007).
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯‰ïŽÐƒR[ƒh‚Q PIC  X(001).
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯—¿Ž¯•Ê‚Q PIC  X(003).
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚Q PIC  X(001).
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@ŠB‹æ•ª‚Q PIC  X(002).
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@Ží–¼”Ô†‚Q PIC  X(002).
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒ_ƒ~[‚Q PIC  X(007).
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|Ž‘ŽYƒR[ƒh‚R PIC  X(007).
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯‰ïŽÐƒR[ƒh‚R PIC  X(001).
000290 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯—¿Ž¯•Ê‚R PIC  X(003).
000300 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚R PIC  X(001).
000310 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@ŠB‹æ•ª‚R PIC  X(002).
000320 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@Ží–¼”Ô†‚R PIC  X(002).
000330 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒ_ƒ~[‚R PIC  X(007).
000340 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000350 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000360 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|Ž‘ŽYƒR[ƒh‚S PIC  X(007).
000370 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯‰ïŽÐƒR[ƒh‚S PIC  X(001).
000380 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯—¿Ž¯•Ê‚S PIC  X(003).
000390 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚S PIC  X(001).
000400 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@ŠB‹æ•ª‚S PIC  X(002).
000410 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@Ží–¼”Ô†‚S PIC  X(002).
000420 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒ_ƒ~[‚S PIC  X(007).
000430 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000450 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|Ž‘ŽYƒR[ƒh‚T PIC  X(007).
000460 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯‰ïŽÐƒR[ƒh‚T PIC  X(001).
000470 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|•ÛŒ¯—¿Ž¯•Ê‚T PIC  X(003).
000480 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚T PIC  X(001).
000490 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@ŠB‹æ•ª‚T PIC  X(002).
000500 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹@Ží–¼”Ô†‚T PIC  X(002).
000510 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|ƒ_ƒ~[‚T PIC  X(007).
000520 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚O|‹¤’Êî•ñ PIC  X(035).
