000010************************************************
000020* •ÛŒ¯Ž–ŒÌŽæˆø‚ei•ÛŒ¯Ž–ŒÌŽæˆø)(LTRHTR)
000030************************************************
000040 01  ‚k‚s‚q‚g‚s‚q|§Œäƒf[ƒ^€–Ú PIC  X(001).
000050 01  ‚k‚s‚q‚g‚s‚q|ŽæˆøƒR[ƒh PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚g‚s‚q|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚k‚s‚q‚g‚s‚q|ƒ[ƒNƒXƒe[ƒVƒ‡ƒ“–¼ PIC  X(008).
000080 01  ‚k‚s‚q‚g‚s‚q|ƒVƒXƒeƒ€“ú•t|¢‹I PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚g‚s‚q|ƒVƒXƒeƒ€“ú•t|”NŒŽ“ú PIC  X(006).
000100 01  ‚k‚s‚q‚g‚s‚q|ƒVƒXƒeƒ€Žž PIC S9(008) COMP-3.
000110 01  ‚k‚s‚q‚g‚s‚q|’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚k‚s‚q‚g‚s‚q|ƒpƒXƒ[ƒh PIC  X(005).
000130 01  ‚k‚s‚q‚g‚s‚q|ˆ—‹æ•ª PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚g‚s‚q|‹Æ–±“ú•t PIC  X(007).
000150 01  ‚k‚s‚q‚g‚s‚q|ƒ_ƒ~[‚O‚O‚P PIC  X(010).
000160 01  ‚k‚s‚q‚g‚s‚q|Œ_–ñ‚m‚n PIC  X(009).
000170 01  ‚k‚s‚q‚g‚s‚q|•¨ŒŽ}”Ô PIC S9(003) COMP-3.
000180 01  ‚k‚s‚q‚g‚s‚q|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚g‚s‚q|•¨Œ–¼ PIC  X(030).
000200 01  ‚k‚s‚q‚g‚s‚q|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚g‚s‚q|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000220 01  ‚k‚s‚q‚g‚s‚q|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000230 01  ‚k‚s‚q‚g‚s‚q|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000240 01  ‚k‚s‚q‚g‚s‚q|ŠúŠÔ PIC S9(003) COMP-3.
000250 01  ‚k‚s‚q‚g‚s‚q|w“ü‹àŠz PIC S9(013) COMP-3.
000260 01  ‚k‚s‚q‚g‚s‚q|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000270 01  ‚k‚s‚q‚g‚s‚q|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX PIC  X(012).
000280 01  ‚k‚s‚q‚g‚s‚q|Ý’uêŠ PIC  X(020).
000290 01  ‚k‚s‚q‚g‚s‚q|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000300 01  ‚k‚s‚q‚g‚s‚q|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz PIC S9(013) COMP-3.
000310 01  ‚k‚s‚q‚g‚s‚q|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000320 01  ‚k‚s‚q‚g‚s‚q|ŠÇ—‚m‚n PIC  X(015).
000330 01  ‚k‚s‚q‚g‚s‚q|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000340 01  ‚k‚s‚q‚g‚s‚q|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000350 01  ‚k‚s‚q‚g‚s‚q|Ó”CŠúŠÔŽ©|¢‹I PIC S9(001) COMP-3.
000360 01  ‚k‚s‚q‚g‚s‚q|Ó”CŠúŠÔŽ©|”NŒŽ“ú PIC  X(006).
000370 01  ‚k‚s‚q‚g‚s‚q|Ó”CŠúŠÔŽŠ|¢‹I PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚g‚s‚q|Ó”CŠúŠÔŽŠ|”NŒŽ“ú PIC  X(006).
000390 01  ‚k‚s‚q‚g‚s‚q|•ÛŒ¯ØŒ””Ô† PIC  X(011).
000400 01  ‚k‚s‚q‚g‚s‚q|“®‘•ÛŒ¯‰¿Šz PIC S9(013) COMP-3.
000410 01  ‚k‚s‚q‚g‚s‚q|ÄƒŠ[ƒX•t•Û—¦ PIC S9(002) COMP-3.
000420 01  ‚k‚s‚q‚g‚s‚q|ƒ_ƒ~[‚O‚O‚Q PIC  X(010).
000430 01  ‚k‚s‚q‚g‚s‚q|Ž–ŒÌ¿‹“o˜^“ú|¢‹I PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚g‚s‚q|Ž–ŒÌ¿‹“o˜^“ú|”NŒŽ“ú PIC  X(006).
000450 01  ‚k‚s‚q‚g‚s‚q|Ž–ŒÌ“ú•t|¢‹I PIC S9(001) COMP-3.
000460 01  ‚k‚s‚q‚g‚s‚q|Ž–ŒÌ“ú•t|”NŒŽ“ú PIC  X(006).
000470 01  ‚k‚s‚q‚g‚s‚q|Ž–ŒÌ“ú•t|Žž PIC  X(004).
000480 01  ‚k‚s‚q‚g‚s‚q|Ž–ŒÌ‹æ•ª PIC  X(001).
000490 01  ‚k‚s‚q‚g‚s‚q|Ž–ŒÌŒ´ˆö PIC  X(001).
000500 01  ‚k‚s‚q‚g‚s‚q|”íÐ•¨Œ‹àŠz PIC S9(013) COMP-3.
000510 01  ‚k‚s‚q‚g‚s‚q|”íÐ•¨ŒŽc‰¿Šz PIC S9(013) COMP-3.
000520 01  ‚k‚s‚q‚g‚s‚q|ƒ_ƒ~[‚O‚O‚R PIC  X(010).
000530 01  ‚k‚s‚q‚g‚s‚q|¿‹”NŒŽ“ú|¢‹I PIC S9(001) COMP-3.
000540 01  ‚k‚s‚q‚g‚s‚q|¿‹”NŒŽ“ú|”NŒŽ“ú PIC  X(006).
000550 01  ‚k‚s‚q‚g‚s‚q|¿‹‚q‚d‚e‚m‚n PIC  X(008).
000560 01  ‚k‚s‚q‚g‚s‚q|¿‹•ÛŒ¯‹à PIC S9(013) COMP-3.
000570 01  ‚k‚s‚q‚g‚s‚q|—ÕŽž”ï—p•ÛŒ¯‹à PIC S9(013) COMP-3.
000580 01  ‚k‚s‚q‚g‚s‚q|•ÛŒ¯‹à¿‹Šz PIC S9(013) COMP-3.
000590 01  ‚k‚s‚q‚g‚s‚q|ƒ_ƒ~[‚O‚O‚S PIC  X(013).
000600 01  ‚k‚s‚q‚g‚s‚q|“ü‘—‹à“o˜^“ú|¢‹I PIC S9(001) COMP-3.
000610 01  ‚k‚s‚q‚g‚s‚q|“ü‘—‹à“o˜^“ú|”NŒŽ“ú PIC  X(006).
000620 01  ‚k‚s‚q‚g‚s‚q|“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000630 01  ‚k‚s‚q‚g‚s‚q|“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000640 01  ‚k‚s‚q‚g‚s‚q|“ü‹àŠz PIC S9(013) COMP-3.
000650 01  ‚k‚s‚q‚g‚s‚q|•ÛŒ¯‹àˆ—‹æ•ª PIC  X(001).
000660 01  ‚k‚s‚q‚g‚s‚q|‘—‹àæƒR[ƒh‚P PIC S9(002) COMP-3.
000670 01  ‚k‚s‚q‚g‚s‚q|‘—‹àæ–¼‚P PIC  X(040).
000680 01  ‚k‚s‚q‚g‚s‚q|‘—‹àŠz‚P PIC S9(013) COMP-3.
000690 01  ‚k‚s‚q‚g‚s‚q|‘—‹àæƒR[ƒh‚Q PIC S9(002) COMP-3.
000700 01  ‚k‚s‚q‚g‚s‚q|‘—‹àæ–¼‚Q PIC  X(040).
000710 01  ‚k‚s‚q‚g‚s‚q|‘—‹àŠz‚Q PIC S9(013) COMP-3.
000720 01  ‚k‚s‚q‚g‚s‚q|‘—‹àæƒR[ƒh‚R PIC S9(002) COMP-3.
000730 01  ‚k‚s‚q‚g‚s‚q|‘—‹àæ–¼‚R PIC  X(040).
000740 01  ‚k‚s‚q‚g‚s‚q|‘—‹àŠz‚R PIC S9(013) COMP-3.
000750 01  ‚k‚s‚q‚g‚s‚q|ƒ_ƒ~[‚O‚O‚T PIC  X(011).
