000010************************************************
000020* •ÛŒ¯Ž–ŒÌƒ}ƒXƒ^i•ÛŒ¯‹à¿‹“ü‹à)(LTRHJK)
000030************************************************
000040 01  ‚k‚s‚q‚g‚i‚j|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚g‚i‚j|•¨ŒŽ}”Ô PIC S9(003) COMP-3.
000060 01  ‚k‚s‚q‚g‚i‚j|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚g‚i‚j|Ž–ŒÌ“ú•t|¢‹I PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚g‚i‚j|Ž–ŒÌ“ú•t|“ú•t PIC  X(006).
000090 01  ‚k‚s‚q‚g‚i‚j|Ž–ŒÌ“ú•t|Žž‚g‚g‚l‚l PIC  X(004).
000100 01  ‚k‚s‚q‚g‚i‚j|•¨Œ–¼ PIC  X(030).
000110 01  ‚k‚s‚q‚g‚i‚j|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚g‚i‚j|ƒŠ[ƒXŠJŽn“ú|“ú•t PIC  X(006).
000130 01  ‚k‚s‚q‚g‚i‚j|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚g‚i‚j|ƒŠ[ƒXI—¹“ú|“ú•t PIC  X(006).
000150 01  ‚k‚s‚q‚g‚i‚j|ŠúŠÔ PIC S9(003) COMP-3.
000160 01  ‚k‚s‚q‚g‚i‚j|w“ü‹àŠz PIC S9(013) COMP-3.
000170 01  ‚k‚s‚q‚g‚i‚j|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000180 01  ‚k‚s‚q‚g‚i‚j|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX PIC  X(012).
000190 01  ‚k‚s‚q‚g‚i‚j|Ý’uêŠ PIC  X(020).
000200 01  ‚k‚s‚q‚g‚i‚j|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000210 01  ‚k‚s‚q‚g‚i‚j|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚g‚i‚j|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000230 01  ‚k‚s‚q‚g‚i‚j|ŠÇ—‚m‚n PIC  X(015).
000240 01  ‚k‚s‚q‚g‚i‚j|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000250 01  ‚k‚s‚q‚g‚i‚j|Ó”CŠúŠÔŽ©|¢‹I PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚g‚i‚j|Ó”CŠúŠÔŽ©|“ú•t PIC  X(006).
000270 01  ‚k‚s‚q‚g‚i‚j|Ó”CŠúŠÔŽŠ|¢‹I PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚g‚i‚j|Ó”CŠúŠÔŽŠ|“ú•t PIC  X(006).
000290 01  ‚k‚s‚q‚g‚i‚j|•ÛŒ¯ØŒ””Ô† PIC  X(011).
000300 01  ‚k‚s‚q‚g‚i‚j|“®‘•ÛŒ¯‰¿Ši PIC S9(013) COMP-3.
000310 01  ‚k‚s‚q‚g‚i‚j|ÄƒŠ[ƒX•t•Û—¦ PIC S9(002) COMP-3.
000320 01  ‚k‚s‚q‚g‚i‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(012).
000330 01  ‚k‚s‚q‚g‚i‚j|Ž–ŒÌ¿‹“o˜^“ú|¢‹I PIC S9(001) COMP-3.
000340 01  ‚k‚s‚q‚g‚i‚j|Ž–ŒÌ¿‹“o˜^“ú|“ú•t PIC  X(006).
000350 01  ‚k‚s‚q‚g‚i‚j|Ž–ŒÌ‹æ•ª PIC  X(001).
000360 01  ‚k‚s‚q‚g‚i‚j|Ž–ŒÌŒ´ˆö PIC  X(001).
000370 01  ‚k‚s‚q‚g‚i‚j|”íÐ•¨Œ‹àŠz PIC S9(013) COMP-3.
000380 01  ‚k‚s‚q‚g‚i‚j|”íÐ•¨ŒŽc‰¿Šz PIC S9(013) COMP-3.
000390 01  ‚k‚s‚q‚g‚i‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(017).
000400 01  ‚k‚s‚q‚g‚i‚j|¿‹”NŒŽ“ú|¢‹I PIC S9(001) COMP-3.
000410 01  ‚k‚s‚q‚g‚i‚j|¿‹”NŒŽ“ú|“ú•t PIC  X(006).
000420 01  ‚k‚s‚q‚g‚i‚j|¿‹‚q‚d‚e‚m‚n PIC  X(008).
000430 01  ‚k‚s‚q‚g‚i‚j|¿‹•ÛŒ¯‹à PIC S9(013) COMP-3.
000440 01  ‚k‚s‚q‚g‚i‚j|—ÕŽž”ï—p•ÛŒ¯‹à PIC S9(013) COMP-3.
000450 01  ‚k‚s‚q‚g‚i‚j|•ÛŒ¯‹à¿‹Šz PIC S9(013) COMP-3.
000460 01  ‚k‚s‚q‚g‚i‚j|ƒ_ƒ~[‚O‚O‚R PIC  X(014).
000470 01  ‚k‚s‚q‚g‚i‚j|“ü‘—‹à“o˜^“ú|¢‹I PIC S9(001) COMP-3.
000480 01  ‚k‚s‚q‚g‚i‚j|“ü‘—‹à“o˜^“ú|“ú•t PIC  X(006).
000490 01  ‚k‚s‚q‚g‚i‚j|“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000500 01  ‚k‚s‚q‚g‚i‚j|“ü‹à“ú|“ú•t PIC  X(006).
000510 01  ‚k‚s‚q‚g‚i‚j|“ü‹àŠz PIC S9(013) COMP-3.
000520 01  ‚k‚s‚q‚g‚i‚j|•ÛŒ¯‹àˆ—‹æ•ª PIC  X(001).
000530 01  ‚k‚s‚q‚g‚i‚j|‘—‹àæƒR[ƒh‚P PIC S9(002) COMP-3.
000540 01  ‚k‚s‚q‚g‚i‚j|‘—‹àæ–¼‚P PIC  X(040).
000550 01  ‚k‚s‚q‚g‚i‚j|‘—‹àŠz‚P PIC S9(013) COMP-3.
000560 01  ‚k‚s‚q‚g‚i‚j|‘—‹àæƒR[ƒh‚Q PIC S9(002) COMP-3.
000570 01  ‚k‚s‚q‚g‚i‚j|‘—‹àæ–¼‚Q PIC  X(040).
000580 01  ‚k‚s‚q‚g‚i‚j|‘—‹àŠz‚Q PIC S9(013) COMP-3.
000590 01  ‚k‚s‚q‚g‚i‚j|‘—‹àæƒR[ƒh‚R PIC S9(002) COMP-3.
000600 01  ‚k‚s‚q‚g‚i‚j|‘—‹àæ–¼‚R PIC  X(040).
000610 01  ‚k‚s‚q‚g‚i‚j|‘—‹àŠz‚R PIC S9(013) COMP-3.
000620 01  ‚k‚s‚q‚g‚i‚j|ƒ_ƒ~[‚O‚O‚S PIC  X(011).
000630 01  ‚k‚s‚q‚g‚i‚j|ƒ_ƒ~[‚O‚O‚T PIC  X(021).
000640 01  ‚k‚s‚q‚g‚i‚j|‹¤’Êî•ñ PIC  X(035).
