000010************************************************
000020* Žx•¥æiŽx•¥æƒ}ƒXƒ^j(LTRKAP)
000030************************************************
000040 01  ‚k‚s‚q‚j‚`‚o|Žx•¥ŽæˆøæƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚j‚`‚o|ƒtƒ‰ƒO|“o˜^íœ PIC  X(001).
000060 01  ‚k‚s‚q‚j‚`‚o|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000070 01  ‚k‚s‚q‚j‚`‚o|‘ŠŽèæ–¼Ì PIC  X(056).
000080 01  ‚k‚s‚q‚j‚`‚o|ŒûÀ–¼‹`l PIC  X(030).
000090 01  ‚k‚s‚q‚j‚`‚o|‹âsƒR[ƒh PIC S9(004) COMP-3.
000100 01  ‚k‚s‚q‚j‚`‚o|Žx“XƒR[ƒh PIC S9(003) COMP-3.
000110 01  ‚k‚s‚q‚j‚`‚o|—a‹àŽí–Ú PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚j‚`‚o|ŒûÀ”Ô† PIC S9(007) COMP-3.
000130 01  ‚k‚s‚q‚j‚`‚o|“o˜^”Ô† PIC S9(004) COMP-3.
000140 01  ‚k‚s‚q‚j‚`‚o|–¼ˆ¶l PIC  X(056).
000150 01  ‚k‚s‚q‚j‚`‚o|—X•Ö”Ô†|e PIC  X(003).
000160 01  ‚k‚s‚q‚j‚`‚o|—X•Ö”Ô†|Žq PIC  X(004).
000170 01  ‚k‚s‚q‚j‚`‚o|—X‘—æZŠ‚P PIC  X(034).
000180 01  ‚k‚s‚q‚j‚`‚o|—X‘—æZŠ‚Q PIC  X(032).
000190 01  ‚k‚s‚q‚j‚`‚o|—X‘—æZŠ‚R PIC  X(032).
000200 01  ‚k‚s‚q‚j‚`‚o|—X‘—æ–¼‚P PIC  X(028).
000210 01  ‚k‚s‚q‚j‚`‚o|—X‘—æ–¼‚Q PIC  X(028).
000220 01  ‚k‚s‚q‚j‚`‚o|‹x“ú‘Î‰ž‹æ•ª PIC  X(001).
000230 01  ‚k‚s‚q‚j‚`‚o|Žè”—¿—L–³ PIC  X(001).
000240 01  ‚k‚s‚q‚j‚`‚o|ƒ_ƒ~[‚O‚O‚Q PIC  X(056).
000250 01  ‚k‚s‚q‚j‚`‚o|‹¤’Êî•ñ PIC  X(035).
