000010************************************************
000020* Œ_–ñiŒ_–ñŠî–{j(LTRKEK)
000030************************************************
000040 01  ‚k‚s‚q‚j‚d‚j|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚j‚d‚j|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚j‚d‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000070 01  ‚k‚s‚q‚j‚d‚j|ƒ†[ƒUƒR[ƒh PIC  X(008).
000080 01  ‚k‚s‚q‚j‚d‚j|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000090 01  ‚k‚s‚q‚j‚d‚j|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000100 01  ‚k‚s‚q‚j‚d‚j|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000110 01  ‚k‚s‚q‚j‚d‚j|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚j‚d‚j|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000130 01  ‚k‚s‚q‚j‚d‚j|ŒŸŽû—\’è“ú|¢‹I PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚j‚d‚j|ŒŸŽû—\’è“ú|”NŒŽ“ú PIC  X(006).
000150 01  ‚k‚s‚q‚j‚d‚j|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚j‚d‚j|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000170 01  ‚k‚s‚q‚j‚d‚j|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚j‚d‚j|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000190 01  ‚k‚s‚q‚j‚d‚j|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000200 01  ‚k‚s‚q‚j‚d‚j|•¨ŒŽ}”Ô” PIC S9(003) COMP-3.
000210 01  ‚k‚s‚q‚j‚d‚j|“WŠJ” PIC S9(003) COMP-3.
000220 01  ‚k‚s‚q‚j‚d‚j|”—Ê‡Œv PIC S9(005) COMP-3.
000230 01  ‚k‚s‚q‚j‚d‚j|ÅI•¨Œ”‚m‚n PIC S9(003) COMP-3.
000240 01  ‚k‚s‚q‚j‚d‚j|Š²Ž–”ñŠ²Ž– PIC  X(001).
000250 01  ‚k‚s‚q‚j‚d‚j|‚n‚o‚d‚m‚b‚k‚n‚r‚d‹æ•ª PIC  X(001).
000260 01  ‚k‚s‚q‚j‚d‚j|‰ñŽûŽè‡ PIC  X(001).
000270 01  ‚k‚s‚q‚j‚d‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000280 01  ‚k‚s‚q‚j‚d‚j|”Û”F‹æ•ª PIC  X(001).
000290 01  ‚k‚s‚q‚j‚d‚j|Žc‰¿•ÛØ‹æ•ª PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚j‚d‚j|Â–±‹¦’²‹æ•ª PIC  X(002).
000310 01  ‚k‚s‚q‚j‚d‚j|’P”N“xŒ_–ñ PIC  X(002).
000320 01  ‚k‚s‚q‚j‚d‚j|Žx•¥ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000330 01  ‚k‚s‚q‚j‚d‚j|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000340 01  ‚k‚s‚q‚j‚d‚j|Žx•¥‰ñ” PIC S9(003) COMP-3.
000350 01  ‚k‚s‚q‚j‚d‚j|˜’uŠúŠÔ PIC S9(003) COMP-3.
000360 01  ‚k‚s‚q‚j‚d‚j|Œ_–ñŽí—Þ PIC  X(001).
000370 01  ‚k‚s‚q‚j‚d‚j|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚j‚d‚j|ŒvŽZ•ûŽ® PIC S9(001) COMP-3.
000390 01  ‚k‚s‚q‚j‚d‚j|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000400 01  ‚k‚s‚q‚j‚d‚j|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000410 01  ‚k‚s‚q‚j‚d‚j|‹à—˜Šî€ PIC S9(002)V9(8) COMP-3.
000420 01  ‚k‚s‚q‚j‚d‚j|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000430 01  ‚k‚s‚q‚j‚d‚j|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000440 01  ‚k‚s‚q‚j‚d‚j|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000450 01  ‚k‚s‚q‚j‚d‚j|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000460 01  ‚k‚s‚q‚j‚d‚j|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000470 01  ‚k‚s‚q‚j‚d‚j|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000480 01  ‚k‚s‚q‚j‚d‚j|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000490 01  ‚k‚s‚q‚j‚d‚j|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000500 01  ‚k‚s‚q‚j‚d‚j|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000510 01  ‚k‚s‚q‚j‚d‚j|ƒŠ[ƒX—¿‰‰ñ PIC S9(013) COMP-3.
000520 01  ‚k‚s‚q‚j‚d‚j|ƒŠ[ƒX—¿Å‰ñ PIC S9(013) COMP-3.
000530 01  ‚k‚s‚q‚j‚d‚j|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000540 01  ‚k‚s‚q‚j‚d‚j|Žc‰¿Šz‡Œv PIC S9(013) COMP-3.
000550 01  ‚k‚s‚q‚j‚d‚j|‘O“n‹à—˜‘§Šz PIC S9(013) COMP-3.
000560 01  ‚k‚s‚q‚j‚d‚j|‰Šú”ï—p PIC S9(013) COMP-3.
000570 01  ‚k‚s‚q‚j‚d‚j|ŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000580 01  ‚k‚s‚q‚j‚d‚j|•ÛŒ¯—¿ PIC S9(013) COMP-3.
000590 01  ‚k‚s‚q‚j‚d‚j|•ÛŽç—¿ PIC S9(013) COMP-3.
000600 01  ‚k‚s‚q‚j‚d‚j|‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000610 01  ‚k‚s‚q‚j‚d‚j|‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000620 01  ‚k‚s‚q‚j‚d‚j|”Œo”ï‡Œv PIC S9(013) COMP-3.
000630 01  ‚k‚s‚q‚j‚d‚j|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000640 01  ‚k‚s‚q‚j‚d‚j|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000650 01  ‚k‚s‚q‚j‚d‚j|[“–‘ŠŽE‹æ•ª PIC  X(001).
000660 01  ‚k‚s‚q‚j‚d‚j|‘O“n‹à‹æ•ª PIC  X(001).
000670 01  ‚k‚s‚q‚j‚d‚j|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000680 01  ‚k‚s‚q‚j‚d‚j|âg‹c‹æ•ª PIC  X(001).
000690 01  ‚k‚s‚q‚j‚d‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(004).
000700 01  ‚k‚s‚q‚j‚d‚j|¿‹æƒR[ƒh PIC  X(008).
000710 01  ‚k‚s‚q‚j‚d‚j|‰ñŽû•ûŽ®‰‰ñ PIC S9(001) COMP-3.
000720 01  ‚k‚s‚q‚j‚d‚j|‰ñŽû•ûŽ®ˆÈ~ PIC S9(001) COMP-3.
000730 01  ‚k‚s‚q‚j‚d‚j|‹âsƒR[ƒh PIC  X(007).
000740 01  ‚k‚s‚q‚j‚d‚j|ŒûÀ”Ô† PIC  X(007).
000750 01  ‚k‚s‚q‚j‚d‚j|—a‹àŽí—Þ PIC  X(001).
000760 01  ‚k‚s‚q‚j‚d‚j|“ü‹à“ú PIC S9(002) COMP-3.
000770 01  ‚k‚s‚q‚j‚d‚j|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000780 01  ‚k‚s‚q‚j‚d‚j|ƒ_ƒ~[‚O‚O‚R PIC  X(010).
000790 01  ‚k‚s‚q‚j‚d‚j|Žd“üÁ”ïÅŠz‡Œv PIC S9(013) COMP-3.
000800 01  ‚k‚s‚q‚j‚d‚j|Á”ïÅ’¥Žû‹æ•ª PIC S9(001) COMP-3.
000810 01  ‚k‚s‚q‚j‚d‚j|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000820 01  ‚k‚s‚q‚j‚d‚j|Á”ïÅ‡Œv PIC S9(011) COMP-3.
000830 01  ‚k‚s‚q‚j‚d‚j|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
000840 01  ‚k‚s‚q‚j‚d‚j|Á”ïÅƒR[ƒh PIC  X(002).
000850 01  ‚k‚s‚q‚j‚d‚j|ƒ_ƒ~[‚O‚O‚S PIC  X(001).
000860 01  ‚k‚s‚q‚j‚d‚j|ŠÖ˜AŒ_–ñ‚m‚n PIC  X(009).
000870 01  ‚k‚s‚q‚j‚d‚j|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000880 01  ‚k‚s‚q‚j‚d‚j|’ù³‹æ•ª‚P PIC  X(001).
000890 01  ‚k‚s‚q‚j‚d‚j|’ù³‹æ•ª‚Q PIC  X(001).
000900 01  ‚k‚s‚q‚j‚d‚j|’ù³‹æ•ª‚R PIC  X(001).
000910 01  ‚k‚s‚q‚j‚d‚j|’ù³‹æ•ª‚S PIC  X(001).
000920 01  ‚k‚s‚q‚j‚d‚j|’ù³‹æ•ª‚T PIC  X(001).
000930 01  ‚k‚s‚q‚j‚d‚j|‘e—˜ PIC S9(013) COMP-3.
000940 01  ‚k‚s‚q‚j‚d‚j|‰c‹Æ‘Ý•t‹à‹æ•ª PIC S9(001) COMP-3.
000950 01  ‚k‚s‚q‚j‚d‚j|ƒf[ƒ^Ž¯•Ê PIC S9(002) COMP-3.
000960 01  ‚k‚s‚q‚j‚d‚j|“–“ú“ú•t‚P PIC  X(004).
000970 01  ‚k‚s‚q‚j‚d‚j|“ü‹à’Ê”Ô|˜A”Ô†‚P PIC S9(005) COMP-3.
000980 01  ‚k‚s‚q‚j‚d‚j|“–“ú“ú•t‚Q PIC  X(004).
000990 01  ‚k‚s‚q‚j‚d‚j|“ü‹à’Ê”Ô|˜A”Ô†‚Q PIC S9(005) COMP-3.
001000 01  ‚k‚s‚q‚j‚d‚j|“–“ú“ú•t‚R PIC  X(004).
001010 01  ‚k‚s‚q‚j‚d‚j|“ü‹à’Ê”Ô|˜A”Ô†‚R PIC S9(005) COMP-3.
001020 01  ‚k‚s‚q‚j‚d‚j|“–“ú“ú•t‚S PIC  X(004).
001030 01  ‚k‚s‚q‚j‚d‚j|“ü‹à’Ê”Ô|˜A”Ô†‚S PIC S9(005) COMP-3.
001040 01  ‚k‚s‚q‚j‚d‚j|“–“ú“ú•t‚T PIC  X(004).
001050 01  ‚k‚s‚q‚j‚d‚j|“ü‹à’Ê”Ô|˜A”Ô†‚T PIC S9(005) COMP-3.
001060 01  ‚k‚s‚q‚j‚d‚j|ƒ_ƒ~[‚O‚O‚T PIC  X(008).
001070 01  ‚k‚s‚q‚j‚d‚j|–¼Šñ‚¹ƒR[ƒh‚P PIC  X(008).
001080 01  ‚k‚s‚q‚j‚d‚j|—^Mæ–¼Š¿Žš‚P PIC  X(060).
001090 01  ‚k‚s‚q‚j‚d‚j|•ÛØ‘¹•Û“à—e‚P PIC  X(002).
001100 01  ‚k‚s‚q‚j‚d‚j|•Û‘S”ÍˆÍ‚P PIC  X(002).
001110 01  ‚k‚s‚q‚j‚d‚j|•‰’SŠ„‡‚P PIC S9(003) COMP-3.
001120 01  ‚k‚s‚q‚j‚d‚j|–¼Šñ‚¹ƒR[ƒh‚Q PIC  X(008).
001130 01  ‚k‚s‚q‚j‚d‚j|—^Mæ–¼Š¿Žš‚Q PIC  X(060).
001140 01  ‚k‚s‚q‚j‚d‚j|•ÛØ‘¹•Û“à—e‚Q PIC  X(002).
001150 01  ‚k‚s‚q‚j‚d‚j|•Û‘S”ÍˆÍ‚Q PIC  X(002).
001160 01  ‚k‚s‚q‚j‚d‚j|•‰’SŠ„‡‚Q PIC S9(003) COMP-3.
001170 01  ‚k‚s‚q‚j‚d‚j|–¼Šñ‚¹ƒR[ƒh‚R PIC  X(008).
001180 01  ‚k‚s‚q‚j‚d‚j|—^Mæ–¼Š¿Žš‚R PIC  X(060).
001190 01  ‚k‚s‚q‚j‚d‚j|•ÛØ‘¹•Û“à—e‚R PIC  X(002).
001200 01  ‚k‚s‚q‚j‚d‚j|•Û‘S”ÍˆÍ‚R PIC  X(002).
001210 01  ‚k‚s‚q‚j‚d‚j|•‰’SŠ„‡‚R PIC S9(003) COMP-3.
001220 01  ‚k‚s‚q‚j‚d‚j|–¼Šñ‚¹ƒR[ƒh‚S PIC  X(008).
001230 01  ‚k‚s‚q‚j‚d‚j|—^Mæ–¼Š¿Žš‚S PIC  X(060).
001240 01  ‚k‚s‚q‚j‚d‚j|•ÛØ‘¹•Û“à—e‚S PIC  X(002).
001250 01  ‚k‚s‚q‚j‚d‚j|•Û‘S”ÍˆÍ‚S PIC  X(002).
001260 01  ‚k‚s‚q‚j‚d‚j|•‰’SŠ„‡‚S PIC S9(003) COMP-3.
001270 01  ‚k‚s‚q‚j‚d‚j|–¼Šñ‚¹ƒR[ƒh‚T PIC  X(008).
001280 01  ‚k‚s‚q‚j‚d‚j|—^Mæ–¼Š¿Žš‚T PIC  X(060).
001290 01  ‚k‚s‚q‚j‚d‚j|•ÛØ‘¹•Û“à—e‚T PIC  X(002).
001300 01  ‚k‚s‚q‚j‚d‚j|•Û‘S”ÍˆÍ‚T PIC  X(002).
001310 01  ‚k‚s‚q‚j‚d‚j|•‰’SŠ„‡‚T PIC S9(003) COMP-3.
001320 01  ‚k‚s‚q‚j‚d‚j|ƒ_ƒ~[‚O‚O‚U PIC  X(023).
001330 01  ‚k‚s‚q‚j‚d‚j|ŒŸŽûÏ‹æ•ª PIC S9(001) COMP-3.
001340 01  ‚k‚s‚q‚j‚d‚j|ˆ—Š®—¹Ï‹æ•ª PIC S9(001) COMP-3.
001350 01  ‚k‚s‚q‚j‚d‚j|ˆ—”NŒŽ“x|¢‹I PIC  X(001).
001360 01  ‚k‚s‚q‚j‚d‚j|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
001370 01  ‚k‚s‚q‚j‚d‚j|‹¤’Êî•ñ PIC  X(035).
