000010************************************************
000020* ŽØ“ü‹àŽæˆø‚eiŽØ“ü‹àŽæˆøDBj(LTRKIT)
000030************************************************
000040 01  ‚k‚s‚q‚j‚h‚s|‚j‚d‚xˆ—’Ê”Ôˆê˜A”Ô† PIC S9(003) COMP-3.
000050 01  ‚k‚s‚q‚j‚h‚s|‚j‚d‚xˆ—’Ê”ÔŽ}”Ô PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚j‚h‚s|ƒ_ƒ~[‚O‚O‚P PIC  X(005).
000070 01  ‚k‚s‚q‚j‚h‚s|ŠÇ—‚m‚n PIC  X(007).
000080 01  ‚k‚s‚q‚j‚h‚s|Ž}”Ô PIC S9(002) COMP-3.
000090 01  ‚k‚s‚q‚j‚h‚s|ŽØ“üæƒR[ƒh PIC  X(007).
000100 01  ‚k‚s‚q‚j‚h‚s|•¼Ží PIC  X(003).
000110 01  ‚k‚s‚q‚j‚h‚s|ŽØ“üŠ¨’èƒR[ƒh PIC  X(001).
000120 01  ‚k‚s‚q‚j‚h‚s|‰È–ÚƒR[ƒh PIC S9(003) COMP-3.
000130 01  ‚k‚s‚q‚j‚h‚s|ŽæˆøƒR[ƒh PIC S9(002) COMP-3.
000140 01  ‚k‚s‚q‚j‚h‚s|ƒƒOƒ^ƒCƒv PIC  X(001).
000150 01  ‚k‚s‚q‚j‚h‚s|Žæˆø“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚j‚h‚s|Žæˆø“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000170 01  ‚k‚s‚q‚j‚h‚s|‚u‚`‚k‚t‚d“ú|¢‹I PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚j‚h‚s|‚u‚`‚k‚t‚d“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000190 01  ‚k‚s‚q‚j‚h‚s|Œ³–{Šz PIC S9(014)V9(2) COMP-3.
000200 01  ‚k‚s‚q‚j‚h‚s|‚d‚w‹æ•ª PIC  X(004).
000210 01  ‚k‚s‚q‚j‚h‚s|Š·ŽZ‘Šê PIC S9(004)V9(6) COMP-3.
000220 01  ‚k‚s‚q‚j‚h‚s|‰~‰Ý‹àŠz PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚j‚h‚s|‘Î‰¿‚e‚h‚w PIC  X(001).
000240 01  ‚k‚s‚q‚j‚h‚s|ƒ_ƒ~[‚O‚O‚Q PIC  X(005).
000250 01  ‚k‚s‚q‚j‚h‚s|ˆ—’Ê”Ô‹Æ–±Ž¯•ÊƒR[ƒh PIC  X(004).
000260 01  ‚k‚s‚q‚j‚h‚s|ˆ—’Ê”Ôˆê˜A”Ô† PIC S9(005) COMP-3.
000270 01  ‚k‚s‚q‚j‚h‚s|ˆ—’Ê”ÔŽ}”Ô PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚j‚h‚s|ƒ_ƒ~[‚O‚O‚R PIC  X(026).
000290 01  ‚k‚s‚q‚j‚h‚s|‹¤’Êî•ñ PIC  X(035).
