000010************************************************
000020* ŽØ“ü‹àŠÇ—iŽØ“ü‹àŠÇ—‡‚j(LTRKRN)
000030************************************************
000040 01  ‚k‚s‚q‚j‚q‚m|ŠÇ—‚m‚n PIC  X(007).
000050 01  ‚k‚s‚q‚j‚q‚m|“o˜^íœ PIC  X(001).
000060 01  ‚k‚s‚q‚j‚q‚m|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000070 01  ‚k‚s‚q‚j‚q‚m|ÅVŽ}”Ô PIC S9(002) COMP-3.
000080 01  ‚k‚s‚q‚j‚q‚m|ƒ_ƒ~[‚O‚O‚Q PIC  X(051).
000090 01  ‚k‚s‚q‚j‚q‚m|‹¤’Êî•ñ PIC  X(035).
