000010************************************************
000020* ”ƒŠ|‹àiw“üæj(LTRKKN)
000030************************************************
000040 01  ‚k‚s‚q‚j‚j‚m|Œ_–ñ”Ô†|‚P PIC  X(007).
000050 01  ‚k‚s‚q‚j‚j‚m|Œ_–ñ”Ô†|‚Q PIC  X(002).
000060 01  ‚k‚s‚q‚j‚j‚m|w“üæŽ¯•Ê”Ô† PIC S9(002) COMP-3.
000070 01  ‚k‚s‚q‚j‚j‚m|Žx•¥æƒR[ƒh PIC  X(004).
000080 01  ‚k‚s‚q‚j‚j‚m|Žx•¥æ–¼ PIC  X(056).
000090 01  ‚k‚s‚q‚j‚j‚m|w“üæ–¼ PIC  X(060).
000100 01  ‚k‚s‚q‚j‚j‚m|w“ü‹àŠz PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚j‚j‚m|Žd“üÁ”ïÅ PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚j‚j‚m|[“–‘ŠŽE‹àŠz PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚j‚j‚m|‘O“n‹à PIC S9(013) COMP-3.
000140 01  ‚k‚s‚q‚j‚j‚m|Žx•¥‹àŠz PIC S9(013) COMP-3.
000150 01  ‚k‚s‚q‚j‚j‚m|ƒ_ƒ~[‚O‚O‚P PIC  X(035).
000160 01  ‚k‚s‚q‚j‚j‚m|Žx•¥’Ç‰Á“ú•t|¢‹I PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚j‚j‚m|Žx•¥’Ç‰Á“ú•t|”NŒŽ“ú PIC  X(006).
000180 01  ‚k‚s‚q‚j‚j‚m|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000190 01  ‚k‚s‚q‚j‚j‚m|ƒ_ƒ~[‚O‚O‚Q PIC  X(028).
000200 01  ‚k‚s‚q‚j‚j‚m|“–ŒŽ³”F•ª“ú•t|¢‹I PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚j‚j‚m|“–ŒŽ³”F•ª“ú•t|”NŒŽ“ú PIC  X(006).
000220 01  ‚k‚s‚q‚j‚j‚m|³”F‰ñ” PIC S9(001) COMP-3.
000230 01  ‚k‚s‚q‚j‚j‚m|UžŒ” PIC S9(002) COMP-3.
000240 01  ‚k‚s‚q‚j‚j‚m|UžŽx•¥‹àŠz PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚j‚j‚m|ŽèŒ`Œ” PIC S9(002) COMP-3.
000260 01  ‚k‚s‚q‚j‚j‚m|ŽèŒ`Žx•¥‹àŠz PIC S9(013) COMP-3.
000270 01  ‚k‚s‚q‚j‚j‚m|“–ŒŽŽæÁ“ú•t|¢‹I PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚j‚j‚m|“–ŒŽŽæÁ“ú•t|”NŒŽ“ú PIC  X(006).
000290 01  ‚k‚s‚q‚j‚j‚m|ŽæÁ‰ñ” PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚j‚j‚m|ŽæÁUžŒ” PIC S9(002) COMP-3.
000310 01  ‚k‚s‚q‚j‚j‚m|ŽæÁUžŽx•¥‹àŠz PIC S9(013) COMP-3.
000320 01  ‚k‚s‚q‚j‚j‚m|ŽæÁŽèŒ`Œ” PIC S9(002) COMP-3.
000330 01  ‚k‚s‚q‚j‚j‚m|ŽæÁŽèŒ`Žx•¥‹àŠz PIC S9(013) COMP-3.
000340 01  ‚k‚s‚q‚j‚j‚m|Žx•¥ƒŒƒR[ƒhŒ” PIC S9(002) COMP-3.
000350 01  ‚k‚s‚q‚j‚j‚m|‹¤’Êî•ñ PIC  X(035).
