000010************************************************
000020* Œ_–ñi“WŠJî•ñj(LTRKET)
000030************************************************
000040 01  ‚k‚s‚q‚j‚d‚s|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚j‚d‚s|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚j‚d‚s|‚r‚d‚p”Ô† PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚j‚d‚s|“WŠJƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000080 01  ‚k‚s‚q‚j‚d‚s|‰ñ” PIC S9(003) COMP-3.
000090 01  ‚k‚s‚q‚j‚d‚s|ƒ_ƒ~[‚O‚O‚P PIC  X(012).
