000010************************************************
000020* ”ƒŠ|‹àiŽx•¥j(LTRKKS)
000030************************************************
000040 01  ‚k‚s‚q‚j‚j‚r|Œ_–ñ”Ô†|‚P PIC  X(007).
000050 01  ‚k‚s‚q‚j‚j‚r|Œ_–ñ”Ô†|‚Q PIC  X(002).
000060 01  ‚k‚s‚q‚j‚j‚r|w“üæŽ¯•Ê”Ô† PIC  X(002).
000070 01  ‚k‚s‚q‚j‚j‚r|Žx•¥æðŒŽ¯•Ê”Ô† PIC S9(002) COMP-3.
000080 01  ‚k‚s‚q‚j‚j‚r|•¨Œ‹àŠz PIC S9(013) COMP-3.
000090 01  ‚k‚s‚q‚j‚j‚r|Žd“üÁ”ïÅ PIC S9(013) COMP-3.
000100 01  ‚k‚s‚q‚j‚j‚r|[“–‘ŠŽE‹àŠz PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚j‚j‚r|‘O“n‹à PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚j‚j‚r|Žx•¥‹àŠz PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚j‚j‚r|Žx•¥ðŒƒR[ƒh PIC S9(002) COMP-3.
000140 01  ‚k‚s‚q‚j‚j‚r|Žx•¥ðŒ–¼ PIC  X(040).
000150 01  ‚k‚s‚q‚j‚j‚r|Žx•¥•û–@ PIC S9(002) COMP-3.
000160 01  ‚k‚s‚q‚j‚j‚r|Žx•¥—\’è“ú|“ú•t|¢‹I PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚j‚j‚r|Žx•¥—\’è“ú|“ú•t|”NŒŽ“ú PIC  X(006).
000180 01  ‚k‚s‚q‚j‚j‚r|ŽèŒ`Šú“ú|“ú•t|¢‹I PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚j‚j‚r|ŽèŒ`Šú“ú|“ú•t|”NŒŽ“ú PIC  X(006).
000200 01  ‚k‚s‚q‚j‚j‚r|Žx•¥ŽèŒ`•ªŠ„‹æ•ª PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚j‚j‚r|Žx•¥ŽèŒ`“‡‹æ•ª PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚j‚j‚r|[“–‘ŠŽEŠÖ˜AŒ_–ñ”Ô† PIC  X(009).
000230 01  ‚k‚s‚q‚j‚j‚r|Žx•¥“úUo“ú|“ú•t|¢‹I PIC S9(001) COMP-3.
000240 01  ‚k‚s‚q‚j‚j‚r|Žx•¥“úUo“ú|“ú•t|”NŒŽ“ú PIC  X(006).
000250 01  ‚k‚s‚q‚j‚j‚r|Užî•ñ|ŒûÀ–¼ PIC  X(056).
000260 01  ‚k‚s‚q‚j‚j‚r|Užî•ñ|‹âsƒR[ƒh PIC S9(007) COMP-3.
000270 01  ‚k‚s‚q‚j‚j‚r|Užî•ñ|—a‹àŽí•Ê PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚j‚j‚r|Užî•ñ|ŒûÀ”Ô† PIC S9(007) COMP-3.
000290 01  ‚k‚s‚q‚j‚j‚r|ŽèŒ`¬ØŽèî•ñ|Žó“nƒR[ƒh PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚j‚j‚r|ŽèŒ`¬ØŽèî•ñ|—X‘—æ–¼ PIC  X(056).
000310 01  ‚k‚s‚q‚j‚j‚r|ŽèŒ`¬ØŽèî•ñ|—X•Ö”Ô†|e PIC  X(003).
000320 01  ‚k‚s‚q‚j‚j‚r|ŽèŒ`¬ØŽèî•ñ|—X•Ö”Ô†|Žq PIC  X(004).
000330 01  ‚k‚s‚q‚j‚j‚r|ŽèŒ`¬ØŽèî•ñ|—X‘—æZŠ PIC  X(098).
000340 01  ‚k‚s‚q‚j‚j‚r|Žx•¥Šm”F|“ú•t|¢‹I PIC S9(001) COMP-3.
000350 01  ‚k‚s‚q‚j‚j‚r|Žx•¥Šm”F|“ú•t|”NŒŽ“ú PIC  X(006).
000360 01  ‚k‚s‚q‚j‚j‚r|Žx•¥Šm”F|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000370 01  ‚k‚s‚q‚j‚j‚r|Žx•¥³”F|“ú•t|¢‹I PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚j‚j‚r|Žx•¥³”F|“ú•t|”NŒŽ“ú PIC  X(006).
000390 01  ‚k‚s‚q‚j‚j‚r|Žx•¥³”F|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000400 01  ‚k‚s‚q‚j‚j‚r|Žx•¥³”F|³”F‚m‚n PIC  X(006).
000410 01  ‚k‚s‚q‚j‚j‚r|Žx•¥³”F|ŽæÁ“ú|¢‹I PIC S9(001) COMP-3.
000420 01  ‚k‚s‚q‚j‚j‚r|Žx•¥³”F|ŽæÁ“ú|”NŒŽ“ú PIC  X(006).
000430 01  ‚k‚s‚q‚j‚j‚r|‹x“ú”»’è‹æ•ª PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚j‚j‚r|ƒ_ƒ~[‚O‚O‚P PIC  X(033).
000450 01  ‚k‚s‚q‚j‚j‚r|‹¤’Êî•ñ PIC  X(035).
