000010************************************************
000020* –¼Ìƒ}ƒXƒ^iƒ|ƒbƒJEƒ[ƒJ[–¼j(LTRMEI530)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|ƒ[ƒJ[ƒR[ƒh PIC  X(002).
000070 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000080 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|w“üæƒR[ƒh PIC  X(008).
000090 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|w“üæ–¼ PIC  X(040).
000100 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|Žx•¥ŒJ‰„ŒŽ” PIC S9(003)V9(2) COMP-3.
000110 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|Žx•¥æƒR[ƒh PIC  X(004).
000120 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(094).
000130 01  ‚k‚s‚q‚l‚d‚h‚T‚R‚O|‹¤’Êî•ñ PIC  X(035).
