000010************************************************
000020* –¼Ìƒ}ƒXƒ^iŽx•¥ðŒ–¼j(LTRMEI410)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚S‚P‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚S‚P‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚S‚P‚O|Žx•¥ðŒƒR[ƒh PIC  X(002).
000070 01  ‚k‚s‚q‚l‚d‚h‚S‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000080 01  ‚k‚s‚q‚l‚d‚h‚S‚P‚O|Žx•¥ðŒ–¼Š¿Žš PIC  X(040).
000090 01  ‚k‚s‚q‚l‚d‚h‚S‚P‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(110).
000100 01  ‚k‚s‚q‚l‚d‚h‚S‚P‚O|‹¤’Êî•ñ PIC  X(035).
