000010************************************************
000020* ‚r‚e‚b–ž—¹—\’è(‚r‚e‚b–ž—¹—\’è(–¾×))(LTRMYM)
000030************************************************
000040 01  ‚k‚s‚q‚l‚x‚l|‚a‚n‚s‚kŒ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚l‚x‚l|‚r‚e‚bŒ_–ñ‚m‚n PIC  X(012).
000060 01  ‚k‚s‚q‚l‚x‚l|¤•i˜A”Ô PIC  X(003).
000070 01  ‚k‚s‚q‚l‚x‚l|Œ_–ñ‚m‚n PIC  X(009).
000080 01  ‚k‚s‚q‚l‚x‚l|•¨Œ‚m‚n PIC S9(003) COMP-3.
000090 01  ‚k‚s‚q‚l‚x‚l|–¾×ˆ—Œ‹‰Ê PIC  X(001).
000100 01  ‚k‚s‚q‚l‚x‚l|V¤•i˜A”Ô PIC  X(003).
000110 01  ‚k‚s‚q‚l‚x‚l|ÄƒŠ[ƒXŽü‰ñƒR[ƒh PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚l‚x‚l|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚l‚x‚l|”—Ê PIC S9(004) COMP-3.
000140 01  ‚k‚s‚q‚l‚x‚l|ƒŠ[ƒXŠJŽn“ú PIC S9(007) COMP-3.
000150 01  ‚k‚s‚q‚l‚x‚l|ƒŠ[ƒXI—¹“ú PIC S9(007) COMP-3.
000160 01  ‚k‚s‚q‚l‚x‚l|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000170 01  ‚k‚s‚q‚l‚x‚l|ÄƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000180 01  ‚k‚s‚q‚l‚x‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(001).
000190 01  ‚k‚s‚q‚l‚x‚l|w“ü‹àŠz PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚l‚x‚l|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚l‚x‚l|ŒÂ•ÊŒ_–ñ‹àŠz PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚l‚x‚l|w“ü‹àŠz“à–óÄƒŠ[ƒX PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚l‚x‚l|w“ü‹àŠz“à–ó“]”„ PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚l‚x‚l|w“ü‹àŠz“à–ó”pŠü PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚l‚x‚l|”—Ê“à–óÄƒŠ[ƒX PIC S9(004) COMP-3.
000260 01  ‚k‚s‚q‚l‚x‚l|”—Ê“à–ó“]”„ PIC S9(004) COMP-3.
000270 01  ‚k‚s‚q‚l‚x‚l|”—Ê“à–ó”pŠü PIC S9(004) COMP-3.
000280 01  ‚k‚s‚q‚l‚x‚l|‚a‚n‚s‚k•¨Œ–¼ PIC  X(020).
000290 01  ‚k‚s‚q‚l‚x‚l|‚a‚n‚s‚kÄƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000300 01  ‚k‚s‚q‚l‚x‚l|ƒ_ƒ~[‚O‚O‚Q PIC  X(023).
000310 01  ‚k‚s‚q‚l‚x‚l|‚r‚e‚b•¨Œ–¼ PIC  X(020).
000320 01  ‚k‚s‚q‚l‚x‚l|‚r‚e‚bÄƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000330 01  ‚k‚s‚q‚l‚x‚l|ƒ_ƒ~[‚O‚O‚R PIC  X(023).
000340 01  ‚k‚s‚q‚l‚x‚l|ƒ_ƒ~[‚O‚O‚S PIC  X(065).
000350 01  ‚k‚s‚q‚l‚x‚l|‹¤’Êî•ñ PIC  X(035).
