000010************************************************
000020* ‚r‚e‚b–ž—¹—\’è(‚a‚n‚s‚kŠî–{)(LTRMBK)
000030************************************************
000040 01  ‚k‚s‚q‚l‚a‚j|‚a‚n‚s‚kŒ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚l‚a‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000060 01  ‚k‚s‚q‚l‚a‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000070 01  ‚k‚s‚q‚l‚a‚j|Ž–‹ÆŠ–¼ PIC  X(020).
000080 01  ‚k‚s‚q‚l‚a‚j|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚k‚s‚q‚l‚a‚j|ƒ†[ƒU[–¼ PIC  X(020).
000100 01  ‚k‚s‚q‚l‚a‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(028).
000110 01  ‚k‚s‚q‚l‚a‚j|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000120 01  ‚k‚s‚q‚l‚a‚j|ƒ_ƒ~[‚O‚O‚R PIC  X(002).
000130 01  ‚k‚s‚q‚l‚a‚j|‚r‚e‚bƒŒƒR[ƒhŒ” PIC S9(003) COMP-3.
000140 01  ‚k‚s‚q‚l‚a‚j|‹¤’Êî•ñ PIC  X(035).
