000010************************************************
000020* –¼Ìƒ}ƒXƒ^i‹@Ží–¼/ƒR[ƒhEƒŠ[ƒXj(LTRMEI220)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|‹@ŠB‹æ•ª PIC  X(002).
000070 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|‹@Ží–¼”Ô† PIC  X(002).
000080 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000090 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|‹@Ží–¼ƒŠ[ƒX PIC  X(040).
000100 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|‹@ŽíƒR[ƒhƒJƒi–¼ PIC  X(010).
000110 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(099).
000120 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|•t•Û‘ÎÛ‹æ•ª PIC  X(001).
000130 01  ‚k‚s‚q‚l‚d‚h‚Q‚Q‚O|‹¤’Êî•ñ PIC  X(035).
