000010************************************************
000020* –¼Ìƒ}ƒXƒ^i‹@ŠB—Þ–¼FŠ„•Šj(LTRMEI211)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚P|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚P|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚P|‹@ŠB‹æ•ª PIC  X(002).
000070 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000080 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚P|‹@ŠB—Þ‚Ì‹æ•ª–¼ÌŠ„•Š PIC  X(070).
000090 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(080).
000100 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚P|‹¤’Êî•ñ PIC  X(035).
