000010************************************************
000020* –¼Ìƒ}ƒXƒ^i‘—‹àæ–¼j(LTRMEI111)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚P|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚P|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚P|‘—‹àæƒR[ƒh PIC S9(002) COMP-3.
000070 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000080 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚P|‘—‹àæ–¼ PIC  X(040).
000090 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(110).
000100 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚P|‹¤’Êî•ñ PIC  X(035).
