000010************************************************
000020* –¼Ìƒ}ƒXƒ^i•ÛŒ¯‰ïŽÐ–¼(“®‘•ÛŒ¯))(LTRMEI110)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000070 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(010).
000080 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|•ÛŒ¯‰ïŽÐ–¼ PIC  X(020).
000090 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|•ÛŒ¯‰ïŽÐ–¼—ªÌ PIC  X(010).
000100 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|•ÛŒ¯‰ïŽÐ–¼ƒJƒi PIC  X(025).
000110 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|•ÛŒ¯‰ïŽÐ–¼ƒJƒi—ªÌ PIC  X(012).
000120 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(083).
000130 01  ‚k‚s‚q‚l‚d‚h‚P‚P‚O|‹¤’Êî•ñ PIC  X(035).
