000010************************************************
000020* –¼Ìƒ}ƒXƒ^i¿‹“à–ó–¼j(LTRMEI420)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚S‚Q‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚S‚Q‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚S‚Q‚O|¿‹“à–óƒR[ƒh PIC  X(003).
000070 01  ‚k‚s‚q‚l‚d‚h‚S‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000080 01  ‚k‚s‚q‚l‚d‚h‚S‚Q‚O|–¼Ì PIC  X(040).
000090 01  ‚k‚s‚q‚l‚d‚h‚S‚Q‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(110).
000100 01  ‚k‚s‚q‚l‚d‚h‚S‚Q‚O|‹¤’Êî•ñ PIC  X(035).
