000010************************************************
000020* “ü‹àÁžŠÇ—‚c‚aiÁžŠî–{î•ñ)(LTRNKK)
000030************************************************
000040 01  ‚k‚s‚q‚m‚j‚j|Áž’Ê”Ô PIC S9(009) COMP-3.
000050 01  ‚k‚s‚q‚m‚j‚j|Áž“ú PIC  X(007).
000060 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚P PIC S9(009) COMP-3.
000070 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚P PIC  X(048).
000080 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚P PIC S9(013) COMP-3.
000090 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚Q PIC S9(009) COMP-3.
000100 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚Q PIC  X(048).
000110 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚Q PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚R PIC S9(009) COMP-3.
000130 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚R PIC  X(048).
000140 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚R PIC S9(013) COMP-3.
000150 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚S PIC S9(009) COMP-3.
000160 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚S PIC  X(048).
000170 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚S PIC S9(013) COMP-3.
000180 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚T PIC S9(009) COMP-3.
000190 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚T PIC  X(048).
000200 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚T PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚U PIC S9(009) COMP-3.
000220 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚U PIC  X(048).
000230 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚U PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚V PIC S9(009) COMP-3.
000250 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚V PIC  X(048).
000260 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚V PIC S9(013) COMP-3.
000270 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚W PIC S9(009) COMP-3.
000280 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚W PIC  X(048).
000290 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚W PIC S9(013) COMP-3.
000300 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚X PIC S9(009) COMP-3.
000310 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚X PIC  X(048).
000320 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚X PIC S9(013) COMP-3.
000330 01  ‚k‚s‚q‚m‚j‚j|“ü‹à’Ê”Ô‚P‚O PIC S9(009) COMP-3.
000340 01  ‚k‚s‚q‚m‚j‚j|“ü‹àæ–¼Ì‚P‚O PIC  X(048).
000350 01  ‚k‚s‚q‚m‚j‚j|‹àŠz‚P‚O PIC S9(013) COMP-3.
000360 01  ‚k‚s‚q‚m‚j‚j|Žd–óƒR[ƒh PIC S9(004) COMP-3.
000370 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‹àŠz‚P PIC S9(013) COMP-3.
000380 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‰ÛÅ‚b‚c‚P PIC S9(003) COMP-3.
000390 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‚q‚d‚e‚m‚n‚P PIC  X(016).
000400 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‹àŠz‚Q PIC S9(013) COMP-3.
000410 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‰ÛÅ‚b‚c‚Q PIC S9(003) COMP-3.
000420 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‚q‚d‚e‚m‚n‚Q PIC  X(016).
000430 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‹àŠz‚R PIC S9(013) COMP-3.
000440 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‰ÛÅ‚b‚c‚R PIC S9(003) COMP-3.
000450 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‚q‚d‚e‚m‚n‚R PIC  X(016).
000460 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‹àŠz‚S PIC S9(013) COMP-3.
000470 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‰ÛÅ‚b‚c‚S PIC S9(003) COMP-3.
000480 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‚q‚d‚e‚m‚n‚S PIC  X(016).
000490 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‹àŠz‚T PIC S9(013) COMP-3.
000500 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‰ÛÅ‚b‚c‚T PIC S9(003) COMP-3.
000510 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‚q‚d‚e‚m‚n‚T PIC  X(016).
000520 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‹àŠz‚U PIC S9(013) COMP-3.
000530 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‰ÛÅ‚b‚c‚U PIC S9(003) COMP-3.
000540 01  ‚k‚s‚q‚m‚j‚j|‘Ý•û|‚q‚d‚e‚m‚n‚U PIC  X(016).
000550 01  ‚k‚s‚q‚m‚j‚j|“E—v PIC  X(034).
000560 01  ‚k‚s‚q‚m‚j‚j|Žd–ó’ZkƒR[ƒh PIC S9(002) COMP-3.
000570 01  ‚k‚s‚q‚m‚j‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(057).
000580 01  ‚k‚s‚q‚m‚j‚j|‹¤’Êî•ñ PIC  X(035).
