000010************************************************
000020* 入金消込プルーフＦ（消込基本)(LTRNPF)
000030************************************************
000040 01  ＬＴＲＮＰＦ－入金消込データ PIC  X(250).
