000010************************************************
000020* ”[•tæƒ}ƒXƒ^i”[•tæŠî–{)(LTRNOF)
000030************************************************
000040 01  ‚k‚s‚q‚m‚n‚e|”[•tæƒR[ƒh PIC  X(006).
000050 01  ‚k‚s‚q‚m‚n‚e|“s“¹•{Œ§–¼Š¿Žš PIC  X(008).
000060 01  ‚k‚s‚q‚m‚n‚e|Žs‹æ–¼ŒS’¬‘º–¼Š¿Žš PIC  X(030).
000070 01  ‚k‚s‚q‚m‚n‚e|Žs‹æ–¼ŒS’¬‘º–¼ƒJƒi PIC  X(030).
000080 01  ‚k‚s‚q‚m‚n‚e|ƒ_ƒ~[‚O‚O‚P PIC  X(001).
000090 01  ‚k‚s‚q‚m‚n‚e|e PIC  X(003).
000100 01  ‚k‚s‚q‚m‚n‚e|Žq PIC  X(004).
000110 01  ‚k‚s‚q‚m‚n‚e|ZŠ–¼ŽsŒS–¼”Ô’n†Š¿Žš PIC  X(060).
000120 01  ‚k‚s‚q‚m‚n‚e|ZŠ–¼“s“¹•{Œ§–¼”Ô’n†ƒJƒi PIC  X(060).
000130 01  ‚k‚s‚q‚m‚n‚e|”[•tæ–¼Š¿Žš PIC  X(020).
000140 01  ‚k‚s‚q‚m‚n‚e|”[•tæ–¼ƒJƒi PIC  X(020).
000150 01  ‚k‚s‚q‚m‚n‚e|•ñ§‹àŽx•¥‹æ•ª PIC  X(001).
000160 01  ‚k‚s‚q‚m‚n‚e|”[•t•û–@ PIC  X(001).
000170 01  ‚k‚s‚q‚m‚n‚e|ž‹pŽ‘ŽYÅ—¦ PIC S9(002)V9(3) COMP-3.
000180 01  ‚k‚s‚q‚m‚n‚e|”[•t‹âsƒR[ƒh PIC  X(004).
000190 01  ‚k‚s‚q‚m‚n‚e|ƒ_ƒ~[‚O‚O‚Q PIC  X(013).
000200 01  ‚k‚s‚q‚m‚n‚e|‹¤’Êî•ñ PIC  X(035).
