000010************************************************
000020* —š—ðƒ}ƒbƒ`Ž‘ŽY•ÛŒ¯î•ñ(LTRSIH_M)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚g|‚l|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚h‚g|‚l|Œ_–ñ‚m‚n PIC  X(009).
000060 01  ‚k‚s‚q‚r‚h‚g|‚l|•¨Œ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚r‚h‚g|‚l|‰ð–ñ‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚r‚h‚g|‚l|Ä¶‹æ•ª PIC  X(001).
000090 01  ‚k‚s‚q‚r‚h‚g|‚l|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000100 01  ‚k‚s‚q‚r‚h‚g|‚l|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000110 01  ‚k‚s‚q‚r‚h‚g|‚l|•ÛŒ¯V‹KŒp‘±‹æ•ª PIC  X(001).
000120 01  ‚k‚s‚q‚r‚h‚g|‚l|Ž–ŒÌ—L–³‹æ•ª PIC  X(001).
000130 01  ‚k‚s‚q‚r‚h‚g|‚l|•t•Û“ú|¢‹I PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚r‚h‚g|‚l|•t•Û“ú|”NŒŽ“ú PIC  X(006).
000150 01  ‚k‚s‚q‚r‚h‚g|‚l|Ž–ŒÌ“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚r‚h‚g|‚l|Ž–ŒÌ“ú|”NŒŽ“ú PIC  X(006).
000170 01  ‚k‚s‚q‚r‚h‚g|‚l|–³Ž–ŒÌ–ß‚µ“ú|¢‹I PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚r‚h‚g|‚l|–³Ž–ŒÌ–ß‚µ“ú|”NŒŽ“ú PIC  X(006).
000190 01  ‚k‚s‚q‚r‚h‚g|‚l|‹K’è‘¹ŠQ‹à‚t‚o—¦ PIC S9(003)V9(7) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚g|‚l|“®‘•ÛŒ¯‰¿Ši PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚h‚g|‚l|“®‘•ÛŒ¯—¿ PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚g|‚l|“®‘•¥–ß‚µ•ÛŒ¯—¿ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚h‚g|‚l|“®‘–³Ž–ŒÌ–ß‚µ—¿ PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚h‚g|‚l|“–”N“xƒy[ƒW PIC S9(005) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚g|‚l|“–”N“xŒ…” PIC S9(002) COMP-3.
000260 01  ‚k‚s‚q‚r‚h‚g|‚l|‘O”N“xƒy[ƒW PIC S9(005) COMP-3.
000270 01  ‚k‚s‚q‚r‚h‚g|‚l|‘O”N“xŒ…” PIC S9(002) COMP-3.
000280 01  ‚k‚s‚q‚r‚h‚g|‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000290 01  ‚k‚s‚q‚r‚h‚g|‚l|ÄƒŠ[ƒX•t•Û—¦ PIC S9(002) COMP-3.
000300 01  ‚k‚s‚q‚r‚h‚g|‚l|“®‘•ÛŒ¯—¿—¦ PIC S9(004)V9(6) COMP-3.
000310 01  ‚k‚s‚q‚r‚h‚g|‚l|ƒ_ƒ~[‚O‚O‚Q PIC  X(010).
000320 01  ‚k‚s‚q‚r‚h‚g|‚l|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000330 01  ‚k‚s‚q‚r‚h‚g|‚l|‹@ŠB‹æ•ª PIC  X(002).
000340 01  ‚k‚s‚q‚r‚h‚g|‚l|‹@Ží–¼”Ô† PIC  X(002).
000350 01  ‚k‚s‚q‚r‚h‚g|‚l|Œ^Ž®”Ô† PIC  X(015).
000360 01  ‚k‚s‚q‚r‚h‚g|‚l|’Ê’m‘‘—•t“ú|¢‹I PIC S9(001) COMP-3.
000370 01  ‚k‚s‚q‚r‚h‚g|‚l|’Ê’m‘‘—•t“ú|”NŒŽ“ú PIC  X(006).
000380 01  ‚k‚s‚q‚r‚h‚g|‚l|•„†ˆê˜A”Ô† PIC  X(005).
000390 01  ‚k‚s‚q‚r‚h‚g|‚l|M—p•ÛŒ¯—¿ PIC S9(013) COMP-3.
000400 01  ‚k‚s‚q‚r‚h‚g|‚l|“®‘•ÛŒ¯ØŒ””Ô† PIC  X(011).
000410 01  ‚k‚s‚q‚r‚h‚g|‚l|ƒ_ƒ~[‚O‚O‚R PIC  X(015).
000420 01  ‚k‚s‚q‚r‚h‚g|‚l|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000430 01  ‚k‚s‚q‚r‚h‚g|‚l|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000440 01  ‚k‚s‚q‚r‚h‚g|‚l|‹¤’Êî•ñ PIC  X(035).
