000010************************************************
000020* —š—ðƒAƒ“ƒ}ƒbƒ`Ž‘ŽY•ÛŒ¯î•ñ(LTRSIH_U)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚g|‚t|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚h‚g|‚t|Œ_–ñ‚m‚n PIC  X(009).
000060 01  ‚k‚s‚q‚r‚h‚g|‚t|•¨Œ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚r‚h‚g|‚t|‰ð–ñ‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚r‚h‚g|‚t|Ä¶‹æ•ª PIC  X(001).
000090 01  ‚k‚s‚q‚r‚h‚g|‚t|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000100 01  ‚k‚s‚q‚r‚h‚g|‚t|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000110 01  ‚k‚s‚q‚r‚h‚g|‚t|•ÛŒ¯V‹KŒp‘±‹æ•ª PIC  X(001).
000120 01  ‚k‚s‚q‚r‚h‚g|‚t|Ž–ŒÌ—L–³‹æ•ª PIC  X(001).
000130 01  ‚k‚s‚q‚r‚h‚g|‚t|•t•Û“ú|¢‹I PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚r‚h‚g|‚t|•t•Û“ú|”NŒŽ“ú PIC  X(006).
000150 01  ‚k‚s‚q‚r‚h‚g|‚t|Ž–ŒÌ“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚r‚h‚g|‚t|Ž–ŒÌ“ú|”NŒŽ“ú PIC  X(006).
000170 01  ‚k‚s‚q‚r‚h‚g|‚t|–³Ž–ŒÌ–ß‚µ“ú|¢‹I PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚r‚h‚g|‚t|–³Ž–ŒÌ–ß‚µ“ú|”NŒŽ“ú PIC  X(006).
000190 01  ‚k‚s‚q‚r‚h‚g|‚t|‹K’è‘¹ŠQ‹à‚t‚o—¦ PIC S9(003)V9(7) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚g|‚t|“®‘•ÛŒ¯‰¿Ši PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚h‚g|‚t|“®‘•ÛŒ¯—¿ PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚g|‚t|“®‘•¥–ß‚µ•ÛŒ¯—¿ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚h‚g|‚t|“®‘–³Ž–ŒÌ–ß‚µ—¿ PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚h‚g|‚t|“–”N“xƒy[ƒW PIC S9(005) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚g|‚t|“–”N“xŒ…” PIC S9(002) COMP-3.
000260 01  ‚k‚s‚q‚r‚h‚g|‚t|‘O”N“xƒy[ƒW PIC S9(005) COMP-3.
000270 01  ‚k‚s‚q‚r‚h‚g|‚t|‘O”N“xŒ…” PIC S9(002) COMP-3.
000280 01  ‚k‚s‚q‚r‚h‚g|‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000290 01  ‚k‚s‚q‚r‚h‚g|‚t|ÄƒŠ[ƒX•t•Û—¦ PIC S9(002) COMP-3.
000300 01  ‚k‚s‚q‚r‚h‚g|‚t|“®‘•ÛŒ¯—¿—¦ PIC S9(004)V9(6) COMP-3.
000310 01  ‚k‚s‚q‚r‚h‚g|‚t|ƒ_ƒ~[‚O‚O‚Q PIC  X(010).
000320 01  ‚k‚s‚q‚r‚h‚g|‚t|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000330 01  ‚k‚s‚q‚r‚h‚g|‚t|‹@ŠB‹æ•ª PIC  X(002).
000340 01  ‚k‚s‚q‚r‚h‚g|‚t|‹@Ží–¼”Ô† PIC  X(002).
000350 01  ‚k‚s‚q‚r‚h‚g|‚t|Œ^Ž®”Ô† PIC  X(015).
000360 01  ‚k‚s‚q‚r‚h‚g|‚t|’Ê’m‘‘—•t“ú|¢‹I PIC S9(001) COMP-3.
000370 01  ‚k‚s‚q‚r‚h‚g|‚t|’Ê’m‘‘—•t“ú|”NŒŽ“ú PIC  X(006).
000380 01  ‚k‚s‚q‚r‚h‚g|‚t|•„†ˆê˜A”Ô† PIC  X(005).
000390 01  ‚k‚s‚q‚r‚h‚g|‚t|M—p•ÛŒ¯—¿ PIC S9(013) COMP-3.
000400 01  ‚k‚s‚q‚r‚h‚g|‚t|“®‘•ÛŒ¯ØŒ””Ô† PIC  X(011).
000410 01  ‚k‚s‚q‚r‚h‚g|‚t|ƒ_ƒ~[‚O‚O‚R PIC  X(015).
000420 01  ‚k‚s‚q‚r‚h‚g|‚t|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000430 01  ‚k‚s‚q‚r‚h‚g|‚t|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000440 01  ‚k‚s‚q‚r‚h‚g|‚t|‹¤’Êî•ñ PIC  X(035).
