000010************************************************
000020* Æ¸ƒtƒ@ƒCƒ‹(ŒÂ•Ê–¾×ƒŒƒR[ƒh)(LTRSYM)
000030************************************************
000040 01  ‚k‚s‚q‚r‚x‚l|‰È–ÚƒR[ƒh PIC  X(003).
000050 01  ‚k‚s‚q‚r‚x‚l|ŽæˆøƒR[ƒh PIC  X(002).
000060 01  ‚k‚s‚q‚r‚x‚l|•¼Ží‚P PIC  X(003).
000070 01  ‚k‚s‚q‚r‚x‚l|ŒûÀ”Ô† PIC  X(008).
000080 01  ‚k‚s‚q‚r‚x‚l|‚q‚d‚e‚m‚n PIC  X(016).
000090 01  ‚k‚s‚q‚r‚x‚l|“o˜^íœ PIC  X(001).
000100 01  ‚k‚s‚q‚r‚x‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000110 01  ‚k‚s‚q‚r‚x‚l|Žæˆø“ú|¢‹I PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚r‚x‚l|Žæˆø“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000130 01  ‚k‚s‚q‚r‚x‚l|Ž–‹ÆŠ PIC S9(004) COMP-3.
000140 01  ‚k‚s‚q‚r‚x‚l|•¼Ží‚Q PIC  X(003).
000150 01  ‚k‚s‚q‚r‚x‚l|ŠO‰Ý‹àŠz PIC S9(012)V9(2) COMP-3.
000160 01  ‚k‚s‚q‚r‚x‚l|‚d‚w‹æ•ª PIC  X(004).
000170 01  ‚k‚s‚q‚r‚x‚l|Š·ŽZƒŒ[ƒg PIC S9(004)V9(2) COMP-3.
000180 01  ‚k‚s‚q‚r‚x‚l|‰~‰Ý‹àŠz PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚r‚x‚l|‘Î‰¿‚e‚h‚w PIC  X(001).
000200 01  ‚k‚s‚q‚r‚x‚l|ŽnŠú|¢‹I PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚r‚x‚l|ŽnŠú|”NŒŽ“ú PIC S9(006) COMP-3.
000220 01  ‚k‚s‚q‚r‚x‚l|IŠú|¢‹I PIC S9(001) COMP-3.
000230 01  ‚k‚s‚q‚r‚x‚l|IŠú|”NŒŽ“ú PIC S9(006) COMP-3.
000240 01  ‚k‚s‚q‚r‚x‚l|—˜—¦ PIC S9(003)V9(7) COMP-3.
000250 01  ‚k‚s‚q‚r‚x‚l|•Ð’[—¼’[‹æ•ª PIC  X(001).
000260 01  ‚k‚s‚q‚r‚x‚l|‘OŽæŒãŽæ‹æ•ª PIC  X(001).
000270 01  ‚k‚s‚q‚r‚x‚l|—˜—¦Šî” PIC  X(001).
000280 01  ‚k‚s‚q‚r‚x‚l|“K—p PIC  X(034).
000290 01  ‚k‚s‚q‚r‚x‚l|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚r‚x‚l|‰ð–ñ“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000310 01  ‚k‚s‚q‚r‚x‚l|‘OŒŽ––ŠO‰ÝŽc‚ PIC S9(012)V9(2) COMP-3.
000320 01  ‚k‚s‚q‚r‚x‚l|‘OŒŽ––‰~‰ÝŽc‚ PIC S9(013) COMP-3.
000330 01  ‚k‚s‚q‚r‚x‚l|‘OŠú––ŠO‰ÝŽc‚ PIC S9(012)V9(2) COMP-3.
000340 01  ‚k‚s‚q‚r‚x‚l|‘OŠú––‰~‰ÝŽc‚ PIC S9(013) COMP-3.
000350 01  ‚k‚s‚q‚r‚x‚l|‘OŒŽŽæˆø“ú|¢‹I PIC S9(001) COMP-3.
000360 01  ‚k‚s‚q‚r‚x‚l|‘OŒŽŽæˆø“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000370 01  ‚k‚s‚q‚r‚x‚l|Šú––Žæˆø“ú|¢‹I PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚r‚x‚l|Šú––Žæˆø“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000390 01  ‚k‚s‚q‚r‚x‚l|ƒ_ƒ~[‚O‚O‚Q PIC  X(003).
000400 01  ‚k‚s‚q‚r‚x‚l|‹¤’Êî•ñ PIC  X(035).
