000010************************************************
000020* ’ñŒgƒR[ƒhƒ}ƒXƒ^(ŽO—m¤•iƒR[ƒh)(LTRSCD0520)
000030************************************************
000040 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ŽO—m¤•iƒR[ƒh PIC  X(003).
000060 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000070 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|¢‹I‚P PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|”NŒŽ“ú‚P PIC  X(006).
000090 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‘Ï—p”N”‚P PIC S9(002) COMP-3.
000100 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|Ž‘ŽYƒR[ƒh‚P PIC S9(007) COMP-3.
000110 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|•t•Û‹æ•ª‚P PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚P PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@ŠB‹æ•ª‚P PIC S9(002) COMP-3.
000140 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@Ží”Ô†‚P PIC S9(002) COMP-3.
000150 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒ_ƒ~[‚P PIC  X(008).
000160 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|¢‹I‚Q PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|”NŒŽ“ú‚Q PIC  X(006).
000180 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‘Ï—p”N”‚Q PIC S9(002) COMP-3.
000190 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|Ž‘ŽYƒR[ƒh‚Q PIC S9(007) COMP-3.
000200 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|•t•Û‹æ•ª‚Q PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚Q PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@ŠB‹æ•ª‚Q PIC S9(002) COMP-3.
000230 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@Ží”Ô†‚Q PIC S9(002) COMP-3.
000240 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒ_ƒ~[‚Q PIC  X(008).
000250 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|¢‹I‚R PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|”NŒŽ“ú‚R PIC  X(006).
000270 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‘Ï—p”N”‚R PIC S9(002) COMP-3.
000280 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|Ž‘ŽYƒR[ƒh‚R PIC S9(007) COMP-3.
000290 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|•t•Û‹æ•ª‚R PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚R PIC S9(001) COMP-3.
000310 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@ŠB‹æ•ª‚R PIC S9(002) COMP-3.
000320 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@Ží”Ô†‚R PIC S9(002) COMP-3.
000330 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒ_ƒ~[‚R PIC  X(008).
000340 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|¢‹I‚S PIC S9(001) COMP-3.
000350 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|”NŒŽ“ú‚S PIC  X(006).
000360 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‘Ï—p”N”‚S PIC S9(002) COMP-3.
000370 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|Ž‘ŽYƒR[ƒh‚S PIC S9(007) COMP-3.
000380 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|•t•Û‹æ•ª‚S PIC S9(001) COMP-3.
000390 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚S PIC S9(001) COMP-3.
000400 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@ŠB‹æ•ª‚S PIC S9(002) COMP-3.
000410 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@Ží”Ô†‚S PIC S9(002) COMP-3.
000420 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒ_ƒ~[‚S PIC  X(008).
000430 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|¢‹I‚T PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|“K—p”NŒŽ“ú|”NŒŽ“ú‚T PIC  X(006).
000450 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‘Ï—p”N”‚T PIC S9(002) COMP-3.
000460 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|Ž‘ŽYƒR[ƒh‚T PIC S9(007) COMP-3.
000470 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|•t•Û‹æ•ª‚T PIC S9(001) COMP-3.
000480 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒŠ[ƒXŠ„•Š‹æ•ª‚T PIC S9(001) COMP-3.
000490 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@ŠB‹æ•ª‚T PIC S9(002) COMP-3.
000500 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹@Ží”Ô†‚T PIC S9(002) COMP-3.
000510 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|ƒ_ƒ~[‚T PIC  X(008).
000520 01  ‚k‚s‚q‚r‚b‚c‚O‚T‚Q‚O|‹¤’Êî•ñ PIC  X(035).
