000010************************************************
000020* ¿‹i¿‹–¾×î•ñj(LTRSKM)
000030************************************************
000040 01  ‚k‚s‚q‚r‚j‚l|‚j‚d‚x€–Ú¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚k‚s‚q‚r‚j‚l|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚k‚s‚q‚r‚j‚l|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚r‚j‚l|“ü‹à—\’è“ú PIC  X(007).
000080 01  ‚k‚s‚q‚r‚j‚l|¿‹“à–óƒR[ƒh PIC  X(003).
000090 01  ‚k‚s‚q‚r‚j‚l|‘Žx•¥‰ñ” PIC S9(003) COMP-3.
000100 01  ‚k‚s‚q‚r‚j‚l|[“–‰ñ” PIC S9(003) COMP-3.
000110 01  ‚k‚s‚q‚r‚j‚l|‰ñŽû•ûŽ® PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚r‚j‚l|’·’Z‹æ•ª PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚r‚j‚l|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000140 01  ‚k‚s‚q‚r‚j‚l|¿‹”­s“ú|¢‹I PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚r‚j‚l|¿‹”­s“ú|”NŒŽ“ú PIC  X(006).
000160 01  ‚k‚s‚q‚r‚j‚l|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000170 01  ‚k‚s‚q‚r‚j‚l|Áž’Ê”Ô PIC S9(009) COMP-3.
000180 01  ‚k‚s‚q‚r‚j‚l|Áž“ú|¢‹I PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚r‚j‚l|Áž“ú|”NŒŽ“ú PIC  X(006).
000200 01  ‚k‚s‚q‚r‚j‚l|Á”ïÅ|’¥Žû‹æ•ª PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚r‚j‚l|Á”ïÅ|‹àŠz PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚j‚l|Á”ïÅ|Á”ïÅƒR[ƒh PIC S9(002) COMP-3.
000230 01  ‚k‚s‚q‚r‚j‚l|ƒŠ[ƒX—¿“™ PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚j‚l|¿‹‹àŠz PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚r‚j‚l|Áž‹àŠz PIC S9(013) COMP-3.
000260 01  ‚k‚s‚q‚r‚j‚l|“à•”“ü‹à‹æ•ª PIC S9(001) COMP-3.
000270 01  ‚k‚s‚q‚r‚j‚l|‹âs‚b‚c PIC S9(007) COMP-3.
000280 01  ‚k‚s‚q‚r‚j‚l|‹Œ¿‹“à–óƒR[ƒh PIC  X(003).
000290 01  ‚k‚s‚q‚r‚j‚l|ƒ†[ƒUƒR[ƒh PIC  X(008).
000300 01  ‚k‚s‚q‚r‚j‚l|Â‹¦ƒR[ƒh PIC  X(002).
000310 01  ‚k‚s‚q‚r‚j‚l|“Ë‡Ïƒtƒ‰ƒO PIC  X(001).
000320 01  ‚k‚s‚q‚r‚j‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(005).
000330 01  ‚k‚s‚q‚r‚j‚l|‹¤’Êî•ñ PIC  X(035).
