000010************************************************
000020* Ž‘ŽYiž‹pj(LTRSIS)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚r|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚r‚h‚r|•¨Œ‚m‚n PIC S9(003) COMP-3.
000060 01  ‚k‚s‚q‚r‚h‚r|‰ð–ñ‹æ•ª PIC  X(001).
000070 01  ‚k‚s‚q‚r‚h‚r|Ä¶‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚r‚h‚r|‘OŠú––•ë‰¿‰ïŽÐ PIC S9(013) COMP-3.
000090 01  ‚k‚s‚q‚r‚h‚r|“–ŒŽž‹p‚ PIC S9(013) COMP-3.
000100 01  ‚k‚s‚q‚r‚h‚r|“–Šúž‹p‚ PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚r‚h‚r|Œ»Ý•ë‰¿ PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚r‚h‚r|ƒ_ƒ~[‚O‚O‚P PIC  X(010).
000130 01  ‚k‚s‚q‚r‚h‚r|ž‹p‹æ•ª PIC S9(002) COMP-3.
000140 01  ‚k‚s‚q‚r‚h‚r|Š„‘‹æ•ª PIC S9(002) COMP-3.
000150 01  ‚k‚s‚q‚r‚h‚r|“Á•Êž‹p—¦|•ªŽq PIC S9(002) COMP-3.
000160 01  ‚k‚s‚q‚r‚h‚r|“Á•Êž‹p—¦|•ª•ê PIC S9(003) COMP-3.
000170 01  ‚k‚s‚q‚r‚h‚r|‘OŠú––•ë‰¿–@’è PIC S9(013) COMP-3.
000180 01  ‚k‚s‚q‚r‚h‚r|•’Êž‹p”ï PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚r‚h‚r|Š„‘ž‹p”ï PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚r|“Á•Êž‹p”ï PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚h‚r|“–Šú––•ë‰¿ PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚r|ŒJ‰z’´‰ßŠz PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚h‚r|ž‹pŒÀ“xŠz PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚h‚r|ƒ_ƒ~[‚O‚O‚Q PIC  X(015).
000250 01  ‚k‚s‚q‚r‚h‚r|‰ïŽÐ—˜_‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
000260 01  ‚k‚s‚q‚r‚h‚r|‰ïŽÐ—˜_“–Šú––•ë‰¿ PIC S9(013) COMP-3.
000270 01  ‚k‚s‚q‚r‚h‚r|“–Šúž‹p‰ß•s‘«Šz PIC S9(013) COMP-3.
000280 01  ‚k‚s‚q‚r‚h‚r|ƒ_ƒ~[‚O‚O‚R PIC  X(028).
000290 01  ‚k‚s‚q‚r‚h‚r|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚r‚h‚r|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000310 01  ‚k‚s‚q‚r‚h‚r|‹¤’Êî•ñ PIC  X(035).
