000010************************************************
000020* ÂŒ iÄƒŠ[ƒX“WŠJj(LTRSAS)
000030************************************************
000040 01  ‚k‚s‚q‚r‚`‚r|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚k‚s‚q‚r‚`‚r|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚r‚`‚r|•¨Œ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚r‚`‚r|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000080 01  ‚k‚s‚q‚r‚`‚r|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000090 01  ‚k‚s‚q‚r‚`‚r|‰ð–ñ‹æ•ª PIC  X(001).
000100 01  ‚k‚s‚q‚r‚`‚r|”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000110 01  ‚k‚s‚q‚r‚`‚r|”NŒŽ“x|”NŒŽ PIC  X(004).
000120 01  ‚k‚s‚q‚r‚`‚r|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000130 01  ‚k‚s‚q‚r‚`‚r|¿‹‹àŠz PIC S9(013) COMP-3.
000140 01  ‚k‚s‚q‚r‚`‚r|ÂŒ Žc‚ PIC S9(013) COMP-3.
000150 01  ‚k‚s‚q‚r‚`‚r|Á”ïÅ|Šz PIC S9(011) COMP-3.
000160 01  ‚k‚s‚q‚r‚`‚r|Á”ïÅ|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚r‚`‚r|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚r‚`‚r|‰ñŽûÏ•\Ž¦ PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚r‚`‚r|‘OŽó[“–•\Ž¦ PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚r‚`‚r|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000210 01  ‚k‚s‚q‚r‚`‚r|ƒ_ƒ~[‚O‚O‚P PIC  X(024).
