000010************************************************
000020* Æ¸ƒtƒ@ƒCƒ‹(‰È–ÚŒûÀŽc‚ƒŒƒR[ƒh)(LTRSYK)
000030************************************************
000040 01  ‚k‚s‚q‚r‚x‚j|‰È–ÚƒR[ƒh PIC  X(003).
000050 01  ‚k‚s‚q‚r‚x‚j|ŽæˆøƒR[ƒh PIC  X(002).
000060 01  ‚k‚s‚q‚r‚x‚j|•¼Ží PIC  X(003).
000070 01  ‚k‚s‚q‚r‚x‚j|ŒûÀ”Ô† PIC  X(008).
000080 01  ‚k‚s‚q‚r‚x‚j|“o˜^íœ PIC  X(001).
000090 01  ‚k‚s‚q‚r‚x‚j|ŒûÀƒ^ƒCƒv PIC  X(001).
000100 01  ‚k‚s‚q‚r‚x‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(003).
000110 01  ‚k‚s‚q‚r‚x‚j|ŒûÀ–¼Ì PIC  X(032).
000120 01  ‚k‚s‚q‚r‚x‚j|ŒûÀŽåŠÇŽ–‹ÆŠ PIC  X(004).
000130 01  ‚k‚s‚q‚r‚x‚j|ŒÂ•Ê–¾×” PIC S9(005) COMP-3.
000140 01  ‚k‚s‚q‚r‚x‚j|ŽØ•û‡Œv|ŠO‰Ý‹àŠz PIC S9(014)V9(2) COMP-3.
000150 01  ‚k‚s‚q‚r‚x‚j|ŽØ•û‡Œv|‰~‰Ý‹àŠz PIC S9(015) COMP-3.
000160 01  ‚k‚s‚q‚r‚x‚j|‘Ý•û‡Œv|ŠO‰Ý‹àŠz PIC S9(014)V9(2) COMP-3.
000170 01  ‚k‚s‚q‚r‚x‚j|‘Ý•û‡Œv|‰~‰Ý‹àŠz PIC S9(015) COMP-3.
000180 01  ‚k‚s‚q‚r‚x‚j|Žc‚|ŠO‰Ý‹àŠz PIC S9(014)V9(2) COMP-3.
000190 01  ‚k‚s‚q‚r‚x‚j|Žc‚|‰~‰Ý‹àŠz PIC S9(015) COMP-3.
000200 01  ‚k‚s‚q‚r‚x‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(020).
000210 01  ‚k‚s‚q‚r‚x‚j|“K—p“ú|¢‹I PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚r‚x‚j|“K—p“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000230 01  ‚k‚s‚q‚r‚x‚j|‹¤’Êî•ñ PIC  X(035).
