000010************************************************
000020* ’ñŒgƒR[ƒhƒ}ƒXƒ^(ƒ|ƒbƒJ‹@ŠB•ª—Þ‹æ•ª)(LTRSCD0820)
000030************************************************
000040 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|‹@ŠB•ª—Þ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(010).
000070 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|¢‹I‚P PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|”NŒŽ“ú‚P PIC  X(006).
000090 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|Ž‘ŽYƒR[ƒh‚P PIC  X(007).
000100 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“®‘•ÛŒ¯ƒR[ƒh‚P PIC  X(004).
000110 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|M—p•ÛŒ¯ƒR[ƒh‚P PIC  X(006).
000120 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|ƒ_ƒ~[‚P PIC  X(006).
000130 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|¢‹I‚Q PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|”NŒŽ“ú‚Q PIC  X(006).
000150 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|Ž‘ŽYƒR[ƒh‚Q PIC  X(007).
000160 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“®‘•ÛŒ¯ƒR[ƒh‚Q PIC  X(004).
000170 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|M—p•ÛŒ¯ƒR[ƒh‚Q PIC  X(006).
000180 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|ƒ_ƒ~[‚Q PIC  X(006).
000190 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|¢‹I‚R PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|”NŒŽ“ú‚R PIC  X(006).
000210 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|Ž‘ŽYƒR[ƒh‚R PIC  X(007).
000220 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“®‘•ÛŒ¯ƒR[ƒh‚R PIC  X(004).
000230 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|M—p•ÛŒ¯ƒR[ƒh‚R PIC  X(006).
000240 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|ƒ_ƒ~[‚R PIC  X(006).
000250 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|¢‹I‚S PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|”NŒŽ“ú‚S PIC  X(006).
000270 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|Ž‘ŽYƒR[ƒh‚S PIC  X(007).
000280 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“®‘•ÛŒ¯ƒR[ƒh‚S PIC  X(004).
000290 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|M—p•ÛŒ¯ƒR[ƒh‚S PIC  X(006).
000300 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|ƒ_ƒ~[‚S PIC  X(006).
000310 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|¢‹I‚T PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“K—p“ú•t|”NŒŽ“ú‚T PIC  X(006).
000330 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|Ž‘ŽYƒR[ƒh‚T PIC  X(007).
000340 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|“®‘•ÛŒ¯ƒR[ƒh‚T PIC  X(004).
000350 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|M—p•ÛŒ¯ƒR[ƒh‚T PIC  X(006).
000360 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|ƒ_ƒ~[‚T PIC  X(006).
000370 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚Q‚O|‹¤’Êî•ñ PIC  X(035).
