000010************************************************
000020* ’ñŒgƒR[ƒhƒ}ƒXƒ^(ƒWƒƒƒbƒNƒX¤•iƒR[ƒh)(LTRSCD0810)
000030************************************************
000040 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|‚i‚`‚b‚b‚r¤•iƒR[ƒh 
                                             PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000070 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|“K—p“ú•t‚P PIC  X(007).
000080 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Ž‘ŽYƒR[ƒh‚P PIC S9(007) COMP-3.
000090 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|•ÛŒ¯—¿ƒR[ƒh‚P PIC S9(004) COMP-3.
000100 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Žg—p•ÛŒ¯ƒR[ƒh‚P PIC S9(006) COMP-3.
000110 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|ƒ_ƒ~[‚P PIC  X(006).
000120 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|“K—p“ú•t‚Q PIC  X(007).
000130 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Ž‘ŽYƒR[ƒh‚Q PIC S9(007) COMP-3.
000140 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|•ÛŒ¯—¿ƒR[ƒh‚Q PIC S9(004) COMP-3.
000150 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Žg—p•ÛŒ¯ƒR[ƒh‚Q PIC S9(006) COMP-3.
000160 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|ƒ_ƒ~[‚Q PIC  X(006).
000170 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|“K—p“ú•t‚R PIC  X(007).
000180 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Ž‘ŽYƒR[ƒh‚R PIC S9(007) COMP-3.
000190 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|•ÛŒ¯—¿ƒR[ƒh‚R PIC S9(004) COMP-3.
000200 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Žg—p•ÛŒ¯ƒR[ƒh‚R PIC S9(006) COMP-3.
000210 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|ƒ_ƒ~[‚R PIC  X(006).
000220 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|“K—p“ú•t‚S PIC  X(007).
000230 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Ž‘ŽYƒR[ƒh‚S PIC S9(007) COMP-3.
000240 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|•ÛŒ¯—¿ƒR[ƒh‚S PIC S9(004) COMP-3.
000250 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Žg—p•ÛŒ¯ƒR[ƒh‚S PIC S9(006) COMP-3.
000260 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|ƒ_ƒ~[‚S PIC  X(006).
000270 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|“K—p“ú•t‚T PIC  X(007).
000280 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Ž‘ŽYƒR[ƒh‚T PIC S9(007) COMP-3.
000290 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|•ÛŒ¯—¿ƒR[ƒh‚T PIC S9(004) COMP-3.
000300 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|Žg—p•ÛŒ¯ƒR[ƒh‚T PIC S9(006) COMP-3.
000310 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|ƒ_ƒ~[‚T PIC  X(006).
000320 01  ‚k‚s‚q‚r‚b‚c‚O‚W‚P‚O|‹¤’Êî•ñ PIC  X(035).
