000010************************************************
000020* —š—ðƒ}ƒbƒ`Ž‘ŽY–¾×(LTRSIM_M)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚l|‚l|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚h‚l|‚l|Œ_–ñ‚m‚n PIC  X(009).
000060 01  ‚k‚s‚q‚r‚h‚l|‚l|•¨Œ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ð–ñ‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚r‚h‚l|‚l|Ä¶‹æ•ª PIC  X(001).
000090 01  ‚k‚s‚q‚r‚h‚l|‚l|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000100 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000110 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000120 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000140 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000160 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000170 01  ‚k‚s‚q‚r‚h‚l|‚l|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000180 01  ‚k‚s‚q‚r‚h‚l|‚l|Ž‘ŽYƒR[ƒh PIC S9(007) COMP-3.
000190 01  ‚k‚s‚q‚r‚h‚l|‚l|’†ŒÃŽ‘ŽYƒR[ƒh PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚l|‚l|Ž‘ŽYˆ•ªƒR[ƒh PIC  X(001).
000210 01  ‚k‚s‚q‚r‚h‚l|‚l|‘Ï—p”N” PIC S9(002) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚l|‚l|•t•Û‹æ•ª|“®ŽY‘‡ PIC  X(001).
000230 01  ‚k‚s‚q‚r‚h‚l|‚l|•t•Û‹æ•ª|M—p•ÛŒ¯ PIC  X(001).
000240 01  ‚k‚s‚q‚r‚h‚l|‚l|”—Ê PIC S9(004) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚l|‚l|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000260 01  ‚k‚s‚q‚r‚h‚l|‚l|ŒÂ•ÊŒ_–ñ‹àŠz PIC S9(013) COMP-3.
000270 01  ‚k‚s‚q‚r‚h‚l|‚l|Žc‰¿î•ñ|Žc‰¿•ÛØ‹æ•ª PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚r‚h‚l|‚l|Žc‰¿î•ñ|Žc‰¿•ÛØæƒR[ƒh PIC  X(008).
000290 01  ‚k‚s‚q‚r‚h‚l|‚l|Žc‰¿î•ñ|Žc‰¿•ÛØæ–¼ PIC  X(060).
000300 01  ‚k‚s‚q‚r‚h‚l|‚l|Žc‰¿î•ñ|Žc‰¿Šz‚P•ÛØ PIC S9(013) COMP-3.
000310 01  ‚k‚s‚q‚r‚h‚l|‚l|Žc‰¿î•ñ|Žc‰¿Šz‚QŒ©Ï PIC S9(013) COMP-3.
000320 01  ‚k‚s‚q‚r‚h‚l|‚l|Žc‰¿î•ñ|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz PIC S9(013) COMP-3.
000330 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000340 01  ‚k‚s‚q‚r‚h‚l|‚l|•¨Œ–¼Š¿Žš PIC  X(060).
000350 01  ‚k‚s‚q‚r‚h‚l|‚l|•¨Œ–¼ƒJƒi PIC  X(030).
000360 01  ‚k‚s‚q‚r‚h‚l|‚l|Žd—l»‘¢”Ô† PIC  X(020).
000370 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ð–ñ‘ÎÛƒR[ƒh PIC  X(001).
000380 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ð–ñˆ—ƒR[ƒh PIC  X(001).
000390 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000400 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000410 01  ‚k‚s‚q‚r‚h‚l|‚l|ˆ—“úÄƒŠ[ƒXŒp‘±ƒŠ[ƒX¢‹I PIC S9(001) COMP-3.
000420 01  ‚k‚s‚q‚r‚h‚l|‚l|ˆ—“úÄƒŠ[ƒXŒp‘±ƒŠ[ƒX”NŒŽ“ú PIC  X(006).
000430 01  ‚k‚s‚q‚r‚h‚l|‚l|ÄƒŠ[ƒXŽü‰ñƒR[ƒh PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚Q PIC  X(003).
000450 01  ‚k‚s‚q‚r‚h‚l|‚l|w“üæƒR[ƒh PIC  X(008).
000460 01  ‚k‚s‚q‚r‚h‚l|‚l|w“üæ‹àŠz PIC S9(013) COMP-3.
000470 01  ‚k‚s‚q‚r‚h‚l|‚l|Žd“üÁ”ïÅ PIC S9(013) COMP-3.
000480 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000490 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚R PIC  X(013).
000500 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P PIC  X(012).
000510 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚Q PIC  X(012).
000520 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚R PIC  X(012).
000530 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚S PIC  X(012).
000540 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚S PIC  X(057).
000550 01  ‚k‚s‚q‚r‚h‚l|‚l|³Œp‹æ•ª PIC  X(001).
000560 01  ‚k‚s‚q‚r‚h‚l|‚l|Œ³•¨Œ‚m‚n PIC  X(003).
000570 01  ‚k‚s‚q‚r‚h‚l|‚l|³Œp“ú¢‹I PIC  X(001).
000580 01  ‚k‚s‚q‚r‚h‚l|‚l|³Œp“ú”NŒŽ“ú PIC  X(006).
000590 01  ‚k‚s‚q‚r‚h‚l|‚l|“Çž‚r‚d‚p PIC S9(007) COMP-3.
000600 01  ‚k‚s‚q‚r‚h‚l|‚l|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000610 01  ‚k‚s‚q‚r‚h‚l|‚l|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000620 01  ‚k‚s‚q‚r‚h‚l|‚l|‹¤’Êî•ñ PIC  X(035).
000630 01  ‚k‚s‚q‚r‚h‚l|‚l|•ÛŒ¯î•ñ|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000640 01  ‚k‚s‚q‚r‚h‚l|‚l|•ÛŒ¯î•ñ|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000650 01  ‚k‚s‚q‚r‚h‚l|‚l|•ÛŒ¯V‹KŒp‘±‹æ•ª PIC  X(001).
000660 01  ‚k‚s‚q‚r‚h‚l|‚l|Ž–ŒÌ—L–³‹æ•ª PIC  X(001).
000670 01  ‚k‚s‚q‚r‚h‚l|‚l|•t•Û“ú|¢‹I PIC S9(001) COMP-3.
000680 01  ‚k‚s‚q‚r‚h‚l|‚l|•t•Û“ú|”NŒŽ“ú PIC  X(006).
000690 01  ‚k‚s‚q‚r‚h‚l|‚l|Ž–ŒÌ“ú|¢‹I PIC S9(001) COMP-3.
000700 01  ‚k‚s‚q‚r‚h‚l|‚l|Ž–ŒÌ“ú|”NŒŽ“ú PIC  X(006).
000710 01  ‚k‚s‚q‚r‚h‚l|‚l|–³Ž–ŒÌ–ß‚µ“ú|¢‹I PIC S9(001) COMP-3.
000720 01  ‚k‚s‚q‚r‚h‚l|‚l|–³Ž–ŒÌ–ß‚µ“ú|”NŒŽ“ú PIC  X(006).
000730 01  ‚k‚s‚q‚r‚h‚l|‚l|‹K’è‘¹ŠQ‹à‚t‚o—¦ PIC S9(002)V9(7) COMP-3.
000740 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘•ÛŒ¯‰¿Ši PIC S9(013) COMP-3.
000750 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘•ÛŒ¯—¿ PIC S9(013) COMP-3.
000760 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘•¥–ß‚µ•ÛŒ¯—¿ PIC S9(013) COMP-3.
000770 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘–³Ž–ŒÌ–ß‚µ—¿ PIC S9(013) COMP-3.
000780 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘\ž–¾×î•ñ|“–”N“xƒy[ƒW PIC S9(005) COMP-3.
000790 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘\ž–¾×î•ñ|“–”N“xŒ…” PIC S9(002) COMP-3.
000800 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘\ž–¾×î•ñ|‘O”N“xƒy[ƒW PIC S9(005) COMP-3.
000810 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘\ž–¾×î•ñ|‘O”N“xŒ…” PIC S9(002) COMP-3.
000820 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚T PIC  X(008).
000830 01  ‚k‚s‚q‚r‚h‚l|‚l|ÄƒŠ[ƒX•t•Û—¦ PIC S9(002) COMP-3.
000840 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘•ÛŒ¯—¿—¦ PIC S9(003)V9(6) COMP-3.
000850 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚U PIC  X(010).
000860 01  ‚k‚s‚q‚r‚h‚l|‚l|M—p•ÛŒ¯ƒR[ƒh|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000870 01  ‚k‚s‚q‚r‚h‚l|‚l|M—p•ÛŒ¯ƒR[ƒh|‹@ŠB‹æ•ª PIC  X(002).
000880 01  ‚k‚s‚q‚r‚h‚l|‚l|M—p•ÛŒ¯ƒR[ƒh|‹@Ží–¼”Ô† PIC  X(002).
000890 01  ‚k‚s‚q‚r‚h‚l|‚l|Œ^Ž®”Ô† PIC  X(015).
000900 01  ‚k‚s‚q‚r‚h‚l|‚l|’Ê’m‘‘—•t“ú|¢‹I PIC S9(001) COMP-3.
000910 01  ‚k‚s‚q‚r‚h‚l|‚l|’Ê’m‘‘—•t“ú|”NŒŽ“ú PIC  X(006).
000920 01  ‚k‚s‚q‚r‚h‚l|‚l|•„†ˆê˜A”Ô† PIC  X(005).
000930 01  ‚k‚s‚q‚r‚h‚l|‚l|M—p•ÛŒ¯—¿ PIC S9(013) COMP-3.
000940 01  ‚k‚s‚q‚r‚h‚l|‚l|“®‘•ÛŒ¯ØŒ””Ô† PIC  X(011).
000950 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚V PIC  X(015).
000960 01  ‚k‚s‚q‚r‚h‚l|‚l|•ÛŒ¯î•ñ|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000970 01  ‚k‚s‚q‚r‚h‚l|‚l|•ÛŒ¯î•ñ|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000980 01  ‚k‚s‚q‚r‚h‚l|‚l|”[•tæƒR[ƒh PIC  X(006).
000990 01  ‚k‚s‚q‚r‚h‚l|‚l|Å‹æ•ª PIC S9(001) COMP-3.
001000 01  ‚k‚s‚q‚r‚h‚l|‚l|Å•‰’S‹æ•ª PIC  X(001).
001010 01  ‚k‚s‚q‚r‚h‚l|‚l|‘Ï—p”N”’Zk‹æ•ª PIC  X(001).
001020 01  ‚k‚s‚q‚r‚h‚l|‚l|ˆÚ“®î•ñ|ˆÚ“®‹æ•ª PIC  X(001).
001030 01  ‚k‚s‚q‚r‚h‚l|‚l|ˆÚ“®î•ñ|¢‹I PIC S9(001) COMP-3.
001040 01  ‚k‚s‚q‚r‚h‚l|‚l|ˆÚ“®î•ñ|”NŒŽ“ú PIC  X(006).
001050 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚W PIC  X(010).
001060 01  ‚k‚s‚q‚r‚h‚l|‚l|“Á—á|ŠúŠÔ PIC S9(002) COMP-3.
001070 01  ‚k‚s‚q‚r‚h‚l|‚l|“Á—á|•ªŽq PIC S9(002) COMP-3.
001080 01  ‚k‚s‚q‚r‚h‚l|‚l|“Á—á|•ª•ê PIC S9(003) COMP-3.
001090 01  ‚k‚s‚q‚r‚h‚l|‚l|”NÅŠz PIC S9(013) COMP-3.
001100 01  ‚k‚s‚q‚r‚h‚l|‚l|‘O”N“x•]‰¿Šz PIC S9(013) COMP-3.
001110 01  ‚k‚s‚q‚r‚h‚l|‚l|‘O”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
001120 01  ‚k‚s‚q‚r‚h‚l|‚l|“–”N“x•]‰¿Šz PIC S9(013) COMP-3.
001130 01  ‚k‚s‚q‚r‚h‚l|‚l|“–”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
001140 01  ‚k‚s‚q‚r‚h‚l|‚l|“Á•Ê‰ÛÅ•W€Šz PIC S9(013) COMP-3.
001150 01  ‚k‚s‚q‚r‚h‚l|‚l|‘O‰ñ\æ PIC  X(006).
001160 01  ‚k‚s‚q‚r‚h‚l|‚l|Ý’uêŠ–¼Š¿Žš PIC  X(040).
001170 01  ‚k‚s‚q‚r‚h‚l|‚l|Ý’uêŠ–¼ƒJƒi PIC  X(020).
001180 01  ‚k‚s‚q‚r‚h‚l|‚l|Ý’uêŠ—X•Ö”Ô†|e PIC  X(003).
001190 01  ‚k‚s‚q‚r‚h‚l|‚l|Ý’uêŠ—X•Ö”Ô†|Žq PIC  X(004).
001200 01  ‚k‚s‚q‚r‚h‚l|‚l|Ý’uêŠZŠŠ¿Žš PIC  X(100).
001210 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚X PIC  X(011).
001220 01  ‚k‚s‚q‚r‚h‚l|‚l|ŒÅ’èŽ‘ŽY\î•ñˆ—”NŒŽ“x¢‹I PIC S9(001) COMP-3.
001230 01  ‚k‚s‚q‚r‚h‚l|‚l|ŒÅ’èŽ‘ŽY\î•ñˆ—”NŒŽ“x”NŒŽ PIC  X(004).
001240 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ïŽÐ‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
001250 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ïŽÐ“–ŒŽž‹p‚ PIC S9(013) COMP-3.
001260 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ïŽÐ“–Šúž‹p‚ PIC S9(013) COMP-3.
001270 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ïŽÐŒ»Ý•ë‰¿ PIC S9(013) COMP-3.
001280 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚P‚O PIC  X(010).
001290 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@ž‹p‹æ•ª PIC S9(002) COMP-3.
001300 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@Š„‘‹æ•ª PIC S9(002) COMP-3.
001310 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@“Á•Êž‹p—¦|•ªŽq PIC S9(002) COMP-3.
001320 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@“Á•Êž‹p—¦|•ª•ê PIC S9(003) COMP-3.
001330 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@‘OŠú––•ë‰¿–@’è PIC S9(013) COMP-3.
001340 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@•’Êž‹p”ï PIC S9(013) COMP-3.
001350 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@Š„‘ž‹p”ï PIC S9(013) COMP-3.
001360 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@“Á•Êž‹p”ï PIC S9(013) COMP-3.
001370 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@“–Šú––•ë‰¿ PIC S9(013) COMP-3.
001380 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@ŒJ‰z’´‰ßŠz PIC S9(013) COMP-3.
001390 01  ‚k‚s‚q‚r‚h‚l|‚l|Å–@ž‹pŒÀ“xŠz PIC S9(013) COMP-3.
001400 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚P‚P PIC  X(015).
001410 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ïŽÐ—˜_‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
001420 01  ‚k‚s‚q‚r‚h‚l|‚l|‰ïŽÐ—˜_“–Šú––•ë‰¿ PIC S9(013) COMP-3.
001430 01  ‚k‚s‚q‚r‚h‚l|‚l|“–Šúž‹p‰ß•s‘«Šz PIC S9(013) COMP-3.
001440 01  ‚k‚s‚q‚r‚h‚l|‚l|ƒ_ƒ~[‚O‚O‚P‚Q PIC  X(028).
001450 01  ‚k‚s‚q‚r‚h‚l|‚l|ž‹pŒvŽZî•ñˆ—”NŒŽ“x¢‹I PIC S9(001) COMP-3.
001460 01  ‚k‚s‚q‚r‚h‚l|‚l|ž‹pŒvŽZî•ñˆ—”NŒŽ“x”NŒŽ PIC  X(004).
