000010************************************************
000020* Žd–óƒ}ƒXƒ^(LTRSWA)
000030************************************************
000040 01  ‚k‚s‚q‚r‚v‚`|‹Æ–±ƒR[ƒh PIC  X(001).
000050 01  ‚k‚s‚q‚r‚v‚`|ƒpƒ^[ƒ“‚m‚n PIC  X(003).
000060 01  ‚k‚s‚q‚r‚v‚`|“o˜^íœ PIC  X(001).
000070 01  ‚k‚s‚q‚r‚v‚`|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000080 01  ‚k‚s‚q‚r‚v‚`|ŽØ•ûŒÂ” PIC S9(003) COMP-3.
000090 01  ‚k‚s‚q‚r‚v‚`|‘Ý•ûŒÂ” PIC S9(003) COMP-3.
000100 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P PIC  X(001).
000110 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P PIC S9(002) COMP-3.
000120 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P PIC  X(005).
000130 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P PIC  X(008).
000140 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P PIC S9(003) COMP-3.
000150 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P PIC S9(004) COMP-3.
000160 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q PIC  X(001).
000170 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q PIC S9(002) COMP-3.
000180 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q PIC  X(005).
000190 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q PIC  X(008).
000200 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q PIC S9(003) COMP-3.
000210 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q PIC S9(004) COMP-3.
000220 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R PIC  X(001).
000230 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R PIC S9(002) COMP-3.
000240 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R PIC  X(005).
000250 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R PIC  X(008).
000260 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R PIC S9(003) COMP-3.
000270 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R PIC S9(004) COMP-3.
000280 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S PIC  X(001).
000290 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S PIC S9(002) COMP-3.
000300 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S PIC  X(005).
000310 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S PIC  X(008).
000320 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S PIC S9(003) COMP-3.
000330 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S PIC S9(004) COMP-3.
000340 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T PIC  X(001).
000350 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T PIC S9(002) COMP-3.
000360 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T PIC  X(005).
000370 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T PIC  X(008).
000380 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T PIC S9(003) COMP-3.
000390 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T PIC S9(004) COMP-3.
000400 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U PIC  X(001).
000410 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U PIC S9(002) COMP-3.
000420 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U PIC  X(005).
000430 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U PIC  X(008).
000440 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U PIC S9(003) COMP-3.
000450 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U PIC S9(004) COMP-3.
000460 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V PIC  X(001).
000470 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V PIC S9(002) COMP-3.
000480 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V PIC  X(005).
000490 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V PIC  X(008).
000500 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V PIC S9(003) COMP-3.
000510 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V PIC S9(004) COMP-3.
000520 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚W PIC  X(001).
000530 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚W PIC S9(002) COMP-3.
000540 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚W PIC  X(005).
000550 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚W PIC  X(008).
000560 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚W PIC S9(003) COMP-3.
000570 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚W PIC S9(004) COMP-3.
000580 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚X PIC  X(001).
000590 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚X PIC S9(002) COMP-3.
000600 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚X PIC  X(005).
000610 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚X PIC  X(008).
000620 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚X PIC S9(003) COMP-3.
000630 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚X PIC S9(004) COMP-3.
000640 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚O PIC  X(001).
000650 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚O PIC S9(002) COMP-3.
000660 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚O PIC  X(005).
000670 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚O PIC  X(008).
000680 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚O PIC S9(003) COMP-3.
000690 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚O PIC S9(004) COMP-3.
000700 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚P PIC  X(001).
000710 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚P PIC S9(002) COMP-3.
000720 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚P PIC  X(005).
000730 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚P PIC  X(008).
000740 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚P PIC S9(003) COMP-3.
000750 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚P PIC S9(004) COMP-3.
000760 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚Q PIC  X(001).
000770 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚Q PIC S9(002) COMP-3.
000780 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚Q PIC  X(005).
000790 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚Q PIC  X(008).
000800 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚Q PIC S9(003) COMP-3.
000810 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚Q PIC S9(004) COMP-3.
000820 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚R PIC  X(001).
000830 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚R PIC S9(002) COMP-3.
000840 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚R PIC  X(005).
000850 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚R PIC  X(008).
000860 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚R PIC S9(003) COMP-3.
000870 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚R PIC S9(004) COMP-3.
000880 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚S PIC  X(001).
000890 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚S PIC S9(002) COMP-3.
000900 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚S PIC  X(005).
000910 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚S PIC  X(008).
000920 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚S PIC S9(003) COMP-3.
000930 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚S PIC S9(004) COMP-3.
000940 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚T PIC  X(001).
000950 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚T PIC S9(002) COMP-3.
000960 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚T PIC  X(005).
000970 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚T PIC  X(008).
000980 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚T PIC S9(003) COMP-3.
000990 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚T PIC S9(004) COMP-3.
001000 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚U PIC  X(001).
001010 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚U PIC S9(002) COMP-3.
001020 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚U PIC  X(005).
001030 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚U PIC  X(008).
001040 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚U PIC S9(003) COMP-3.
001050 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚U PIC S9(004) COMP-3.
001060 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚V PIC  X(001).
001070 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚V PIC S9(002) COMP-3.
001080 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚V PIC  X(005).
001090 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚V PIC  X(008).
001100 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚V PIC S9(003) COMP-3.
001110 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚V PIC S9(004) COMP-3.
001120 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚W PIC  X(001).
001130 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚W PIC S9(002) COMP-3.
001140 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚W PIC  X(005).
001150 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚W PIC  X(008).
001160 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚W PIC S9(003) COMP-3.
001170 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚W PIC S9(004) COMP-3.
001180 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚P‚X PIC  X(001).
001190 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚P‚X PIC S9(002) COMP-3.
001200 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚P‚X PIC  X(005).
001210 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚P‚X PIC  X(008).
001220 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚P‚X PIC S9(003) COMP-3.
001230 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚P‚X PIC S9(004) COMP-3.
001240 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚O PIC  X(001).
001250 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚O PIC S9(002) COMP-3.
001260 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚O PIC  X(005).
001270 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚O PIC  X(008).
001280 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚O PIC S9(003) COMP-3.
001290 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚O PIC S9(004) COMP-3.
001300 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚P PIC  X(001).
001310 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚P PIC S9(002) COMP-3.
001320 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚P PIC  X(005).
001330 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚P PIC  X(008).
001340 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚P PIC S9(003) COMP-3.
001350 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚P PIC S9(004) COMP-3.
001360 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚Q PIC  X(001).
001370 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚Q PIC S9(002) COMP-3.
001380 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚Q PIC  X(005).
001390 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚Q PIC  X(008).
001400 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚Q PIC S9(003) COMP-3.
001410 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚Q PIC S9(004) COMP-3.
001420 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚R PIC  X(001).
001430 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚R PIC S9(002) COMP-3.
001440 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚R PIC  X(005).
001450 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚R PIC  X(008).
001460 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚R PIC S9(003) COMP-3.
001470 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚R PIC S9(004) COMP-3.
001480 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚S PIC  X(001).
001490 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚S PIC S9(002) COMP-3.
001500 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚S PIC  X(005).
001510 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚S PIC  X(008).
001520 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚S PIC S9(003) COMP-3.
001530 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚S PIC S9(004) COMP-3.
001540 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚T PIC  X(001).
001550 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚T PIC S9(002) COMP-3.
001560 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚T PIC  X(005).
001570 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚T PIC  X(008).
001580 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚T PIC S9(003) COMP-3.
001590 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚T PIC S9(004) COMP-3.
001600 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚U PIC  X(001).
001610 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚U PIC S9(002) COMP-3.
001620 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚U PIC  X(005).
001630 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚U PIC  X(008).
001640 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚U PIC S9(003) COMP-3.
001650 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚U PIC S9(004) COMP-3.
001660 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚V PIC  X(001).
001670 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚V PIC S9(002) COMP-3.
001680 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚V PIC  X(005).
001690 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚V PIC  X(008).
001700 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚V PIC S9(003) COMP-3.
001710 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚V PIC S9(004) COMP-3.
001720 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚W PIC  X(001).
001730 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚W PIC S9(002) COMP-3.
001740 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚W PIC  X(005).
001750 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚W PIC  X(008).
001760 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚W PIC S9(003) COMP-3.
001770 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚W PIC S9(004) COMP-3.
001780 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚Q‚X PIC  X(001).
001790 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚Q‚X PIC S9(002) COMP-3.
001800 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚Q‚X PIC  X(005).
001810 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚Q‚X PIC  X(008).
001820 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚Q‚X PIC S9(003) COMP-3.
001830 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚Q‚X PIC S9(004) COMP-3.
001840 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚O PIC  X(001).
001850 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚O PIC S9(002) COMP-3.
001860 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚O PIC  X(005).
001870 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚O PIC  X(008).
001880 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚O PIC S9(003) COMP-3.
001890 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚O PIC S9(004) COMP-3.
001900 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚P PIC  X(001).
001910 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚P PIC S9(002) COMP-3.
001920 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚P PIC  X(005).
001930 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚P PIC  X(008).
001940 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚P PIC S9(003) COMP-3.
001950 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚P PIC S9(004) COMP-3.
001960 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚Q PIC  X(001).
001970 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚Q PIC S9(002) COMP-3.
001980 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚Q PIC  X(005).
001990 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚Q PIC  X(008).
002000 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚Q PIC S9(003) COMP-3.
002010 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚Q PIC S9(004) COMP-3.
002020 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚R PIC  X(001).
002030 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚R PIC S9(002) COMP-3.
002040 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚R PIC  X(005).
002050 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚R PIC  X(008).
002060 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚R PIC S9(003) COMP-3.
002070 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚R PIC S9(004) COMP-3.
002080 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚S PIC  X(001).
002090 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚S PIC S9(002) COMP-3.
002100 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚S PIC  X(005).
002110 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚S PIC  X(008).
002120 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚S PIC S9(003) COMP-3.
002130 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚S PIC S9(004) COMP-3.
002140 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚T PIC  X(001).
002150 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚T PIC S9(002) COMP-3.
002160 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚T PIC  X(005).
002170 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚T PIC  X(008).
002180 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚T PIC S9(003) COMP-3.
002190 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚T PIC S9(004) COMP-3.
002200 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚U PIC  X(001).
002210 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚U PIC S9(002) COMP-3.
002220 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚U PIC  X(005).
002230 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚U PIC  X(008).
002240 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚U PIC S9(003) COMP-3.
002250 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚U PIC S9(004) COMP-3.
002260 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚V PIC  X(001).
002270 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚V PIC S9(002) COMP-3.
002280 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚V PIC  X(005).
002290 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚V PIC  X(008).
002300 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚V PIC S9(003) COMP-3.
002310 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚V PIC S9(004) COMP-3.
002320 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚W PIC  X(001).
002330 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚W PIC S9(002) COMP-3.
002340 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚W PIC  X(005).
002350 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚W PIC  X(008).
002360 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚W PIC S9(003) COMP-3.
002370 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚W PIC S9(004) COMP-3.
002380 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚R‚X PIC  X(001).
002390 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚R‚X PIC S9(002) COMP-3.
002400 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚R‚X PIC  X(005).
002410 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚R‚X PIC  X(008).
002420 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚R‚X PIC S9(003) COMP-3.
002430 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚R‚X PIC S9(004) COMP-3.
002440 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚O PIC  X(001).
002450 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚O PIC S9(002) COMP-3.
002460 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚O PIC  X(005).
002470 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚O PIC  X(008).
002480 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚O PIC S9(003) COMP-3.
002490 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚O PIC S9(004) COMP-3.
002500 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚P PIC  X(001).
002510 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚P PIC S9(002) COMP-3.
002520 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚P PIC  X(005).
002530 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚P PIC  X(008).
002540 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚P PIC S9(003) COMP-3.
002550 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚P PIC S9(004) COMP-3.
002560 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚Q PIC  X(001).
002570 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚Q PIC S9(002) COMP-3.
002580 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚Q PIC  X(005).
002590 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚Q PIC  X(008).
002600 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚Q PIC S9(003) COMP-3.
002610 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚Q PIC S9(004) COMP-3.
002620 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚R PIC  X(001).
002630 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚R PIC S9(002) COMP-3.
002640 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚R PIC  X(005).
002650 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚R PIC  X(008).
002660 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚R PIC S9(003) COMP-3.
002670 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚R PIC S9(004) COMP-3.
002680 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚S PIC  X(001).
002690 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚S PIC S9(002) COMP-3.
002700 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚S PIC  X(005).
002710 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚S PIC  X(008).
002720 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚S PIC S9(003) COMP-3.
002730 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚S PIC S9(004) COMP-3.
002740 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚T PIC  X(001).
002750 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚T PIC S9(002) COMP-3.
002760 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚T PIC  X(005).
002770 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚T PIC  X(008).
002780 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚T PIC S9(003) COMP-3.
002790 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚T PIC S9(004) COMP-3.
002800 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚U PIC  X(001).
002810 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚U PIC S9(002) COMP-3.
002820 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚U PIC  X(005).
002830 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚U PIC  X(008).
002840 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚U PIC S9(003) COMP-3.
002850 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚U PIC S9(004) COMP-3.
002860 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚V PIC  X(001).
002870 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚V PIC S9(002) COMP-3.
002880 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚V PIC  X(005).
002890 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚V PIC  X(008).
002900 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚V PIC S9(003) COMP-3.
002910 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚V PIC S9(004) COMP-3.
002920 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚W PIC  X(001).
002930 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚W PIC S9(002) COMP-3.
002940 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚W PIC  X(005).
002950 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚W PIC  X(008).
002960 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚W PIC S9(003) COMP-3.
002970 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚W PIC S9(004) COMP-3.
002980 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚S‚X PIC  X(001).
002990 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚S‚X PIC S9(002) COMP-3.
003000 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚S‚X PIC  X(005).
003010 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚S‚X PIC  X(008).
003020 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚S‚X PIC S9(003) COMP-3.
003030 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚S‚X PIC S9(004) COMP-3.
003040 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚O PIC  X(001).
003050 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚O PIC S9(002) COMP-3.
003060 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚O PIC  X(005).
003070 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚O PIC  X(008).
003080 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚O PIC S9(003) COMP-3.
003090 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚O PIC S9(004) COMP-3.
003100 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚P PIC  X(001).
003110 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚P PIC S9(002) COMP-3.
003120 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚P PIC  X(005).
003130 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚P PIC  X(008).
003140 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚P PIC S9(003) COMP-3.
003150 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚P PIC S9(004) COMP-3.
003160 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚Q PIC  X(001).
003170 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚Q PIC S9(002) COMP-3.
003180 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚Q PIC  X(005).
003190 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚Q PIC  X(008).
003200 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚Q PIC S9(003) COMP-3.
003210 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚Q PIC S9(004) COMP-3.
003220 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚R PIC  X(001).
003230 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚R PIC S9(002) COMP-3.
003240 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚R PIC  X(005).
003250 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚R PIC  X(008).
003260 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚R PIC S9(003) COMP-3.
003270 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚R PIC S9(004) COMP-3.
003280 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚S PIC  X(001).
003290 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚S PIC S9(002) COMP-3.
003300 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚S PIC  X(005).
003310 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚S PIC  X(008).
003320 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚S PIC S9(003) COMP-3.
003330 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚S PIC S9(004) COMP-3.
003340 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚T PIC  X(001).
003350 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚T PIC S9(002) COMP-3.
003360 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚T PIC  X(005).
003370 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚T PIC  X(008).
003380 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚T PIC S9(003) COMP-3.
003390 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚T PIC S9(004) COMP-3.
003400 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚U PIC  X(001).
003410 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚U PIC S9(002) COMP-3.
003420 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚U PIC  X(005).
003430 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚U PIC  X(008).
003440 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚U PIC S9(003) COMP-3.
003450 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚U PIC S9(004) COMP-3.
003460 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚V PIC  X(001).
003470 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚V PIC S9(002) COMP-3.
003480 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚V PIC  X(005).
003490 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚V PIC  X(008).
003500 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚V PIC S9(003) COMP-3.
003510 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚V PIC S9(004) COMP-3.
003520 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚W PIC  X(001).
003530 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚W PIC S9(002) COMP-3.
003540 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚W PIC  X(005).
003550 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚W PIC  X(008).
003560 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚W PIC S9(003) COMP-3.
003570 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚W PIC S9(004) COMP-3.
003580 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚T‚X PIC  X(001).
003590 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚T‚X PIC S9(002) COMP-3.
003600 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚T‚X PIC  X(005).
003610 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚T‚X PIC  X(008).
003620 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚T‚X PIC S9(003) COMP-3.
003630 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚T‚X PIC S9(004) COMP-3.
003640 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚O PIC  X(001).
003650 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚O PIC S9(002) COMP-3.
003660 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚O PIC  X(005).
003670 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚O PIC  X(008).
003680 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚O PIC S9(003) COMP-3.
003690 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚O PIC S9(004) COMP-3.
003700 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚P PIC  X(001).
003710 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚P PIC S9(002) COMP-3.
003720 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚P PIC  X(005).
003730 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚P PIC  X(008).
003740 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚P PIC S9(003) COMP-3.
003750 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚P PIC S9(004) COMP-3.
003760 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚Q PIC  X(001).
003770 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚Q PIC S9(002) COMP-3.
003780 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚Q PIC  X(005).
003790 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚Q PIC  X(008).
003800 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚Q PIC S9(003) COMP-3.
003810 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚Q PIC S9(004) COMP-3.
003820 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚R PIC  X(001).
003830 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚R PIC S9(002) COMP-3.
003840 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚R PIC  X(005).
003850 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚R PIC  X(008).
003860 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚R PIC S9(003) COMP-3.
003870 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚R PIC S9(004) COMP-3.
003880 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚S PIC  X(001).
003890 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚S PIC S9(002) COMP-3.
003900 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚S PIC  X(005).
003910 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚S PIC  X(008).
003920 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚S PIC S9(003) COMP-3.
003930 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚S PIC S9(004) COMP-3.
003940 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚T PIC  X(001).
003950 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚T PIC S9(002) COMP-3.
003960 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚T PIC  X(005).
003970 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚T PIC  X(008).
003980 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚T PIC S9(003) COMP-3.
003990 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚T PIC S9(004) COMP-3.
004000 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚U PIC  X(001).
004010 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚U PIC S9(002) COMP-3.
004020 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚U PIC  X(005).
004030 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚U PIC  X(008).
004040 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚U PIC S9(003) COMP-3.
004050 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚U PIC S9(004) COMP-3.
004060 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚V PIC  X(001).
004070 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚V PIC S9(002) COMP-3.
004080 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚V PIC  X(005).
004090 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚V PIC  X(008).
004100 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚V PIC S9(003) COMP-3.
004110 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚V PIC S9(004) COMP-3.
004120 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚W PIC  X(001).
004130 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚W PIC S9(002) COMP-3.
004140 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚W PIC  X(005).
004150 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚W PIC  X(008).
004160 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚W PIC S9(003) COMP-3.
004170 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚W PIC S9(004) COMP-3.
004180 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚U‚X PIC  X(001).
004190 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚U‚X PIC S9(002) COMP-3.
004200 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚U‚X PIC  X(005).
004210 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚U‚X PIC  X(008).
004220 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚U‚X PIC S9(003) COMP-3.
004230 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚U‚X PIC S9(004) COMP-3.
004240 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚O PIC  X(001).
004250 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚O PIC S9(002) COMP-3.
004260 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚O PIC  X(005).
004270 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚O PIC  X(008).
004280 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚O PIC S9(003) COMP-3.
004290 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚O PIC S9(004) COMP-3.
004300 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚P PIC  X(001).
004310 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚P PIC S9(002) COMP-3.
004320 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚P PIC  X(005).
004330 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚P PIC  X(008).
004340 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚P PIC S9(003) COMP-3.
004350 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚P PIC S9(004) COMP-3.
004360 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚Q PIC  X(001).
004370 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚Q PIC S9(002) COMP-3.
004380 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚Q PIC  X(005).
004390 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚Q PIC  X(008).
004400 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚Q PIC S9(003) COMP-3.
004410 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚Q PIC S9(004) COMP-3.
004420 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚R PIC  X(001).
004430 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚R PIC S9(002) COMP-3.
004440 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚R PIC  X(005).
004450 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚R PIC  X(008).
004460 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚R PIC S9(003) COMP-3.
004470 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚R PIC S9(004) COMP-3.
004480 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚S PIC  X(001).
004490 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚S PIC S9(002) COMP-3.
004500 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚S PIC  X(005).
004510 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚S PIC  X(008).
004520 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚S PIC S9(003) COMP-3.
004530 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚S PIC S9(004) COMP-3.
004540 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚T PIC  X(001).
004550 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚T PIC S9(002) COMP-3.
004560 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚T PIC  X(005).
004570 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚T PIC  X(008).
004580 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚T PIC S9(003) COMP-3.
004590 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚T PIC S9(004) COMP-3.
004600 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚U PIC  X(001).
004610 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚U PIC S9(002) COMP-3.
004620 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚U PIC  X(005).
004630 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚U PIC  X(008).
004640 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚U PIC S9(003) COMP-3.
004650 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚U PIC S9(004) COMP-3.
004660 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚V PIC  X(001).
004670 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚V PIC S9(002) COMP-3.
004680 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚V PIC  X(005).
004690 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚V PIC  X(008).
004700 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚V PIC S9(003) COMP-3.
004710 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚V PIC S9(004) COMP-3.
004720 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚W PIC  X(001).
004730 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚W PIC S9(002) COMP-3.
004740 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚W PIC  X(005).
004750 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚W PIC  X(008).
004760 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚W PIC S9(003) COMP-3.
004770 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚W PIC S9(004) COMP-3.
004780 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚V‚X PIC  X(001).
004790 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚V‚X PIC S9(002) COMP-3.
004800 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚V‚X PIC  X(005).
004810 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚V‚X PIC  X(008).
004820 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚V‚X PIC S9(003) COMP-3.
004830 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚V‚X PIC S9(004) COMP-3.
004840 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚W‚O PIC  X(001).
004850 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚W‚O PIC S9(002) COMP-3.
004860 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚W‚O PIC  X(005).
004870 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚W‚O PIC  X(008).
004880 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚W‚O PIC S9(003) COMP-3.
004890 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚W‚O PIC S9(004) COMP-3.
004900 01  ‚k‚s‚q‚r‚v‚`|ƒƒOƒ^ƒCƒv‚W‚P PIC  X(001).
004910 01  ‚k‚s‚q‚r‚v‚`|‚r‚d‚p‚m‚n‚W‚P PIC S9(002) COMP-3.
004920 01  ‚k‚s‚q‚r‚v‚`|Š¨’è‰È–Ú‚W‚P PIC  X(005).
004930 01  ‚k‚s‚q‚r‚v‚`|ŒûÀ”Ô†‚W‚P PIC  X(008).
004940 01  ‚k‚s‚q‚r‚v‚`|‰ÛÅƒR[ƒh‚W‚P PIC S9(003) COMP-3.
004950 01  ‚k‚s‚q‚r‚v‚`|ŒûÀŽåŠÇŽ–‹ÆŠ‚W‚P PIC S9(004) COMP-3.
004960 01  ‚k‚s‚q‚r‚v‚`|ƒ_ƒ~[‚O‚O‚Q PIC  X(087).
004970 01  ‚k‚s‚q‚r‚v‚`|‹¤’Êî•ñ PIC  X(035).
