000010************************************************
000020* —š—ðƒ}ƒbƒ`ÂŒ ƒŠ[ƒX“WŠJ(LTRSAL_M)
000030************************************************
000040 01  ‚k‚s‚q‚r‚`‚k|‚l|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚`‚k|‚l|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚k‚s‚q‚r‚`‚k|‚l|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚r‚`‚k|‚l|•¨Œ‚m‚n PIC S9(003) COMP-3.
000080 01  ‚k‚s‚q‚r‚`‚k|‚l|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000090 01  ‚k‚s‚q‚r‚`‚k|‚l|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000100 01  ‚k‚s‚q‚r‚`‚k|‚l|‰ð–ñ‹æ•ª PIC  X(001).
000110 01  ‚k‚s‚q‚r‚`‚k|‚l|”N“x|¢‹I PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚r‚`‚k|‚l|”N“x|”N PIC S9(002) COMP-3.
000130 01  ‚k‚s‚q‚r‚`‚k|‚l|”N“x|ŒŽ PIC S9(002) COMP-3.
000140 01  ‚k‚s‚q‚r‚`‚k|‚l|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000150 01  ‚k‚s‚q‚r‚`‚k|‚l|ŽÀƒŠ[ƒX—¿|Šî–{ PIC S9(013) COMP-3.
000160 01  ‚k‚s‚q‚r‚`‚k|‚l|ŽÀƒŠ[ƒX—¿|ŽÀŽ¿ PIC S9(013) COMP-3.
000170 01  ‚k‚s‚q‚r‚`‚k|‚l|‚m‚d‚s|ƒŠ[ƒX—¿|Šî–{ PIC S9(013) COMP-3.
000180 01  ‚k‚s‚q‚r‚`‚k|‚l|‚m‚d‚s|ƒŠ[ƒX—¿|ŽÀŽ¿ PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚r‚`‚k|‚l|—˜‘§|Šî–{ PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚r‚`‚k|‚l|—˜‘§|ŽÀŽ¿ PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚`‚k|‚l|Œ³–{“à“ü PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚`‚k|‚l|Œ³–{Žc‚ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚`‚k|‚l|ÂŒ Žc‚|Šî–{ PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚`‚k|‚l|ÂŒ Žc‚|ŽÀŽ¿ PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚r‚`‚k|‚l|Á”ïÅ|Šz PIC S9(011) COMP-3.
000260 01  ‚k‚s‚q‚r‚`‚k|‚l|Á”ïÅ|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
000270 01  ‚k‚s‚q‚r‚`‚k|‚l|””ï—p PIC S9(013) COMP-3.
000280 01  ‚k‚s‚q‚r‚`‚k|‚l|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000290 01  ‚k‚s‚q‚r‚`‚k|‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000300 01  ‚k‚s‚q‚r‚`‚k|‚l|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
000310 01  ‚k‚s‚q‚r‚`‚k|‚l|‰ñŽûÏ•\Ž¦ PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚r‚`‚k|‚l|‘OŽó[“–•\Ž¦ PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚r‚`‚k|‚l|Žc‰¿‰ñŽû•\Ž¦ PIC S9(001) COMP-3.
