000010************************************************
000020* Ž‘ŽYiŒÅ’èŽ‘ŽY\j(LTRSIZ)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚y|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚r‚h‚y|•¨Œ‚m‚n PIC S9(003) COMP-3.
000060 01  ‚k‚s‚q‚r‚h‚y|‰ð–ñ‹æ•ª PIC  X(001).
000070 01  ‚k‚s‚q‚r‚h‚y|Ä¶‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚r‚h‚y|”[•tæƒR[ƒh PIC  X(006).
000090 01  ‚k‚s‚q‚r‚h‚y|Å‹æ•ª PIC S9(001) COMP-3.
000100 01  ‚k‚s‚q‚r‚h‚y|Å•‰’S‹æ•ª PIC  X(001).
000110 01  ‚k‚s‚q‚r‚h‚y|‘Ï—p”N”’Zk‹æ•ª PIC  X(001).
000120 01  ‚k‚s‚q‚r‚h‚y|ˆÚ“®î•ñ|ˆÚ“®‹æ•ª PIC  X(001).
000130 01  ‚k‚s‚q‚r‚h‚y|ˆÚ“®î•ñ|¢‹I PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚r‚h‚y|ˆÚ“®î•ñ|”NŒŽ“ú PIC  X(006).
000150 01  ‚k‚s‚q‚r‚h‚y|ƒ_ƒ~[‚O‚O‚P PIC  X(010).
000160 01  ‚k‚s‚q‚r‚h‚y|“Á—á|ŠúŠÔ PIC S9(002) COMP-3.
000170 01  ‚k‚s‚q‚r‚h‚y|“Á—á|•ªŽq PIC S9(002) COMP-3.
000180 01  ‚k‚s‚q‚r‚h‚y|“Á—á|•ª•ê PIC S9(003) COMP-3.
000190 01  ‚k‚s‚q‚r‚h‚y|”NÅŠz PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚y|‘O”N“x•]‰¿Šz PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚h‚y|‘O”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚y|“–”N“x•]‰¿Šz PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚h‚y|“–”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚h‚y|“Á•Ê‰ÛÅ•W€Šz PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚y|‘O‰ñ\æ PIC  X(006).
000260 01  ‚k‚s‚q‚r‚h‚y|Ý’uêŠ–¼Š¿Žš PIC  X(040).
000270 01  ‚k‚s‚q‚r‚h‚y|Ý’uêŠ–¼ƒJƒi PIC  X(020).
000280 01  ‚k‚s‚q‚r‚h‚y|Ý’uêŠ—X•Ö”Ô†|e PIC  X(003).
000290 01  ‚k‚s‚q‚r‚h‚y|Ý’uêŠ—X•Ö”Ô†|Žq PIC  X(004).
000300 01  ‚k‚s‚q‚r‚h‚y|Ý’uêŠZŠŠ¿Žš PIC  X(100).
000310 01  ‚k‚s‚q‚r‚h‚y|ƒ_ƒ~[‚O‚O‚Q PIC  X(011).
000320 01  ‚k‚s‚q‚r‚h‚y|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚r‚h‚y|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000340 01  ‚k‚s‚q‚r‚h‚y|‹¤’Êî•ñ PIC  X(035).
