000010************************************************
000020* “–“úŽx•¥³”FFiŽx•¥³”F–¾×)(LTRTSS)
000030************************************************
000040 01  ‚k‚s‚q‚s‚r‚r|Â–±Œ_–ñ‚m‚n PIC  X(010).
000050 01  ‚k‚s‚q‚s‚r‚r|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚s‚r‚r|Œ_–ñ–¾×‚m‚n PIC S9(002) COMP-3.
000070 01  ‚k‚s‚q‚s‚r‚r|³”FŽc‰¿³”F‹æ•ª PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚s‚r‚r|ˆ—ŽžŽž•ª•b PIC S9(006) COMP-3.
000090 01  ‚k‚s‚q‚s‚r‚r|ˆ—‹æ•ª PIC S9(001) COMP-3.
000100 01  ‚k‚s‚q‚s‚r‚r|Â–±ŽæˆøæƒR[ƒh PIC  X(008).
000110 01  ‚k‚s‚q‚s‚r‚r|“–“úŽx•¥‹àŠz PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚s‚r‚r|‘Žx•¥‹àŠz PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚s‚r‚r|“o˜^Œ” PIC S9(005) COMP-3.
000140 01  ‚k‚s‚q‚s‚r‚r|ƒ_ƒ~[‚O‚O‚P PIC  X(017).
000150 01  ‚k‚s‚q‚s‚r‚r|‹¤’Êî•ñ PIC  X(035).
