000010************************************************
000020* Žæˆøæƒ}ƒXƒ^[iŽæˆøæƒŒƒR[ƒhj(LTRTRI)
000030************************************************
000040 01  ‚k‚s‚q‚s‚q‚h|ŽæˆøæƒR[ƒh PIC  X(008).
000050 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ª–¼Šñ‚¹ PIC  X(001).
000060 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ªƒ†[ƒU[ PIC  X(001).
000070 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ª¿‹æ PIC  X(001).
000080 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ªw“üæ PIC  X(001).
000090 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ª•ÛØæ PIC  X(001).
000100 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ªÐ‰îæ PIC  X(001).
000110 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ªˆ´ùæ PIC  X(001).
000120 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ª”„‹pæ PIC  X(001).
000130 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ª‚»‚Ì‘¼ PIC  X(001).
000140 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ªƒOƒ‹[ƒv PIC  X(001).
000150 01  ‚k‚s‚q‚s‚q‚h|–Ú“I‹æ•ªƒ_ƒ~[ PIC  X(004).
000160 01  ‚k‚s‚q‚s‚q‚h|ŠÖ˜AƒR[ƒh–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000170 01  ‚k‚s‚q‚s‚q‚h|ŠÖ˜AƒR[ƒhƒ†[ƒU[ƒR[ƒh PIC  X(008).
000180 01  ‚k‚s‚q‚s‚q‚h|Ž–‹ÆŠƒR[ƒhŽåŠÇ PIC S9(004) COMP-3.
000190 01  ‚k‚s‚q‚s‚q‚h|’S“–ŽÒƒR[ƒh PIC  X(004).
000200 01  ‚k‚s‚q‚s‚q‚h|Žæˆøæ³Ž®–¼ÌŽæˆøæ–¼ÌŠ¿Žš PIC  X(040).
000210 01  ‚k‚s‚q‚s‚q‚h|Žæˆøæ³Ž®–¼ÌŽæˆøæ–¼ÌƒJƒi PIC  X(060).
000220 01  ‚k‚s‚q‚s‚q‚h|‰ïŽÐ•”–å³Ž®–¼Ì—ªŽ®‚PŠ¿Žš PIC  X(040).
000230 01  ‚k‚s‚q‚s‚q‚h|‰ïŽÐ•”–å³Ž®–¼Ì—ªŽ®‚QŠ¿Žš PIC  X(020).
000240 01  ‚k‚s‚q‚s‚q‚h|‰ïŽÐ•”–å³Ž®–¼Ì—ªŽ®ƒJƒi PIC  X(030).
000250 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚PƒT[ƒo[ƒR[ƒh‚P PIC  X(002).
000260 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚PŒÚ‹qƒR[ƒh‚P PIC  X(006).
000270 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚QƒT[ƒo[ƒR[ƒh‚Q PIC  X(002).
000280 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚QŒÚ‹qƒR[ƒh‚Q PIC  X(006).
000290 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚RƒT[ƒo[ƒR[ƒh‚R PIC  X(002).
000300 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚RŒÚ‹qƒR[ƒh‚R PIC  X(006).
000310 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚SƒT[ƒo[ƒR[ƒh‚S PIC  X(002).
000320 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚SŒÚ‹qƒR[ƒh‚S PIC  X(006).
000330 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚TƒT[ƒo[ƒR[ƒh‚T PIC  X(002).
000340 01  ‚k‚s‚q‚s‚q‚h|ŒÚ‹qî•ñ‚TŒÚ‹qƒR[ƒh‚T PIC  X(006).
000350 01  ‚k‚s‚q‚s‚q‚h|“o˜^”NŒŽ”N PIC  X(004).
000360 01  ‚k‚s‚q‚s‚q‚h|“o˜^”NŒŽŒŽ PIC S9(002) COMP-3.
000370 01  ‚k‚s‚q‚s‚q‚h|ŽæˆøæZŠî•ñŽs’¬‘ºƒR[ƒh PIC  X(006).
000380 01  ‚k‚s‚q‚s‚q‚h|ŽæˆøæZŠî•ñ—X•Ö‚m‚ne PIC  X(003).
000390 01  ‚k‚s‚q‚s‚q‚h|ŽæˆøæZŠî•ñ—X•Ö‚m‚nŽq PIC  X(004).
000400 01  ‚k‚s‚q‚s‚q‚h|ŽæˆøæZŠî•ñZŠ‚P’¬–¼“™Š¿Žš PIC  X(030).
000410 01  ‚k‚s‚q‚s‚q‚h|ŽæˆøæZŠî•ñZŠ‚QŒ¨‘‚«Š¿Žš PIC  X(030).
000420 01  ‚k‚s‚q‚s‚q‚h|ŽæˆøæZŠî•ñZŠƒJƒi PIC  X(050).
000430 01  ‚k‚s‚q‚s‚q‚h|“]ƒŠ[ƒXƒR[ƒh PIC  X(002).
000440 01  ‚k‚s‚q‚s‚q‚h|ŒÜ\‰¹‡ƒ\[ƒg‚j‚d‚xˆÊ’u‹æ•ª PIC  X(001).
000450 01  ‚k‚s‚q‚s‚q‚h|ŒÜ\‰¹‡ƒ\[ƒg‚j‚d‚x‰ïŽÐ‹æ•ª PIC  X(006).
000460 01  ‚k‚s‚q‚s‚q‚h|ŒÜ\‰¹‡ƒ\[ƒg‚j‚d‚xƒ†[ƒU–¼ PIC  X(025).
000470 01  ‚k‚s‚q‚s‚q‚h|ƒOƒ‹[ƒvƒR[ƒh PIC  X(008).
000480 01  ‚k‚s‚q‚s‚q‚h|ƒ_ƒ~[‚O‚O‚P PIC  X(018).
000490 01  ‚k‚s‚q‚s‚q‚h|‹¤’Êî•ñ‚b‚o‚c‚j‚x‚n‚s‚t PIC  X(035).
000500 01  ‚k‚s‚q‚s‚q‚h|‹ÆŽíƒR[ƒh PIC  X(002).
000510 01  ‚k‚s‚q‚s‚q‚h|‘åŠé‹ÆƒR[ƒh PIC  X(001).
000520 01  ‚k‚s‚q‚s‚q‚h|ƒNƒ‰ƒX PIC  X(002).
000530 01  ‚k‚s‚q‚s‚q‚h|Ý—§“ú¢‹I PIC  X(001).
000540 01  ‚k‚s‚q‚s‚q‚h|Ý—§“úÝ—§“ú PIC  X(006).
000550 01  ‚k‚s‚q‚s‚q‚h|ŒˆŽZ“ú PIC S9(002) COMP-3.
000560 01  ‚k‚s‚q‚s‚q‚h|ãê”ñãê‹æ•ª PIC  X(001).
000570 01  ‚k‚s‚q‚s‚q‚h|“d˜b”Ô† PIC  X(015).
000580 01  ‚k‚s‚q‚s‚q‚h|Ž‘–{‹à PIC S9(013) COMP-3.
000590 01  ‚k‚s‚q‚s‚q‚h|—^MŒÀ“x’PˆÊ•S–œ PIC S9(006) COMP-3.
000600 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘O”N“x‹ÆÑŒˆŽZŠú PIC S9(003) COMP-3.
000610 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘O”N“x‹ÆÑŒˆŽZ”N“x¢‹I PIC  X(001).
000620 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘O”N“x‹ÆÑŒˆŽZ”N“x PIC  X(004).
000630 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘O”N“x‹ÆÑ”„ã PIC S9(013) COMP-3.
000640 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘O”N“x‹ÆÑŒoí—˜‰v PIC S9(013) COMP-3.
000650 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘O”N“x‹ÆÑ“–Šú—˜‰v PIC S9(013) COMP-3.
000660 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘O”N“x‹ÆÑ\Š“¾ PIC S9(013) COMP-3.
000670 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OX”N“x‹ÆÑŒˆŽZŠú PIC S9(003) COMP-3.
000680 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OX”N“x‹ÆÑŒˆŽZ”N“x¢‹I PIC  X(001).
000690 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OX”N“x‹ÆÑŒˆŽZ”N“x PIC  X(004).
000700 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OX”N“x‹ÆÑ”„ã PIC S9(013) COMP-3.
000710 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OX”N“x‹ÆÑŒoí—˜‰v PIC S9(013) COMP-3.
000720 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OX”N“x‹ÆÑ“–Šú—˜‰v PIC S9(013) COMP-3.
000730 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OX”N“x‹ÆÑ\Š“¾ PIC S9(013) COMP-3.
000740 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OXX”N“x‹ÆÑŒˆŽZŠú PIC S9(003) COMP-3.
000750 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OXX”N“x‹ÆÑŒˆŽZ”N“x¢‹I PIC  X(001).
000760 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OXX”N“x‹ÆÑŒˆŽZ”N“x PIC  X(004).
000770 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OXX”N“x‹ÆÑ”„ã PIC S9(013) COMP-3.
000780 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OXX”N“x‹ÆÑŒoí—˜‰v PIC S9(013) COMP-3.
000790 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OXX”N“x‹ÆÑ“–Šú—˜‰v PIC S9(013) COMP-3.
000800 01  ‚k‚s‚q‚s‚q‚h|‹ÆÑ‘OXX”N“x‹ÆÑ\Š“¾ PIC S9(013) COMP-3.
000810 01  ‚k‚s‚q‚s‚q‚h|ŠO•”î•ñ’é‘ƒf[ƒ^ƒoƒ“ƒNƒR[ƒh 
000820                                       PIC S9(009) COMP-3.
000830 01  ‚k‚s‚q‚s‚q‚h|ŠO•”î•ñ’·‹âƒR[ƒh PIC S9(005) COMP-3.
000840 01  ‚k‚s‚q‚s‚q‚h|ŠO•”î•ñ“Œ‹â–¼•ëƒR[ƒh PIC S9(006) COMP-3.
000850 01  ‚k‚s‚q‚s‚q‚h|ŠO•”î•ñ“Œ‹âŽæˆøæ PIC S9(003) COMP-3.
000860 01  ‚k‚s‚q‚s‚q‚h|ŠO•”î•ñ“Œ‹âŽæˆøæƒR[ƒh PIC S9(008) COMP-3.
000870 01  ‚k‚s‚q‚s‚q‚h|ŠO•”î•ñŠi•tŠi•t‚¯‚P PIC  X(002).
000880 01  ‚k‚s‚q‚s‚q‚h|ŠO•”î•ñŠi•tŠi•t‚¯‚Q PIC  X(001).
000890 01  ‚k‚s‚q‚s‚q‚h|ŠO•”î•ñî•ñŒðŠ·’Ê’m‹æ•ª PIC  X(001).
