000010************************************************
000020* “–“úŽx•¥Šm’èFiŽx•¥Šm’è–¾×)(LTRTSK)
000030************************************************
000040 01  ‚k‚s‚q‚s‚r‚j|Â–±æŒ_–ñ‚m‚n PIC  X(010).
000050 01  ‚k‚s‚q‚s‚r‚j|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚s‚r‚j|Œ_–ñ–¾×‚m‚n PIC S9(002) COMP-3.
000070 01  ‚k‚s‚q‚s‚r‚j|ˆ—ŽžŽž•ª•b PIC S9(006) COMP-3.
000080 01  ‚k‚s‚q‚s‚r‚j|ˆ—‹æ•ª PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚s‚r‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000100 01  ‚k‚s‚q‚s‚r‚j|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000110 01  ‚k‚s‚q‚s‚r‚j|Â–±ŽæˆøæƒR[ƒh PIC  X(008).
000120 01  ‚k‚s‚q‚s‚r‚j|‚q‚d‚e‚m‚n PIC  X(016).
000130 01  ‚k‚s‚q‚s‚r‚j|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚s‚r‚j|Œ_–ñ“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000150 01  ‚k‚s‚q‚s‚r‚j|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚s‚r‚j|ŒŸŽû“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000170 01  ‚k‚s‚q‚s‚r‚j|Â–±‹¦’²ƒR[ƒh PIC S9(002) COMP-3.
000180 01  ‚k‚s‚q‚s‚r‚j|Â–±Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000190 01  ‚k‚s‚q‚s‚r‚j|ÂŒ Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000200 01  ‚k‚s‚q‚s‚r‚j|Ž‘ŽYƒR[ƒh PIC S9(007) COMP-3.
000210 01  ‚k‚s‚q‚s‚r‚j|‰ñŽû•¨Œ‹àŠz PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚s‚r‚j|”„ãÁ”ïÅ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚s‚r‚j|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚s‚r‚j|Žd“üÁ”ïÅ PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚s‚r‚j|”„ãÁ”ïÅ‘ŠŽE‹æ•ª PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚s‚r‚j|Žc‰¿Šz PIC S9(013) COMP-3.
000270 01  ‚k‚s‚q‚s‚r‚j|•¨Œ‘ã‹à‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚s‚r‚j|•¨Œ‘ã‹à‰ñŽû“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000290 01  ‚k‚s‚q‚s‚r‚j|‰ñŽû•û–@ PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚s‚r‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(002).
000310 01  ‚k‚s‚q‚s‚r‚j|‘æ‚P‰ñŽx•¥“ú|¢‹I PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚s‚r‚j|‘æ‚P‰ñŽx•¥“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000330 01  ‚k‚s‚q‚s‚r‚j|‘æ‚P‰ñŽÀƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000340 01  ‚k‚s‚q‚s‚r‚j|‘æ‚P‰ñ‚m‚d‚sƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000350 01  ‚k‚s‚q‚s‚r‚j|‘æ‚P‰ñ—˜‘§ PIC S9(013) COMP-3.
000360 01  ‚k‚s‚q‚s‚r‚j|‘æ‚P‰ñÁ”ïÅŠz PIC S9(013) COMP-3.
000370 01  ‚k‚s‚q‚s‚r‚j|‘æ‚P‰ñ””ï—p PIC S9(013) COMP-3.
000380 01  ‚k‚s‚q‚s‚r‚j|‘æ‚P‰ñƒŠ[ƒX—¿Žx•¥Šz PIC S9(013) COMP-3.
000390 01  ‚k‚s‚q‚s‚r‚j|‘æ‚Q‰ñŽx•¥“ú|¢‹I PIC S9(001) COMP-3.
000400 01  ‚k‚s‚q‚s‚r‚j|‘æ‚Q‰ñŽx•¥“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000410 01  ‚k‚s‚q‚s‚r‚j|‘æ‚Q‰ñŽÀƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000420 01  ‚k‚s‚q‚s‚r‚j|‘æ‚Q‰ñ‚m‚d‚sƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000430 01  ‚k‚s‚q‚s‚r‚j|‘æ‚Q‰ñ—˜‘§ PIC S9(013) COMP-3.
000440 01  ‚k‚s‚q‚s‚r‚j|‘æ‚Q‰ñÁ”ïÅŠz PIC S9(013) COMP-3.
000450 01  ‚k‚s‚q‚s‚r‚j|‘æ‚Q‰ñ””ï—p PIC S9(013) COMP-3.
000460 01  ‚k‚s‚q‚s‚r‚j|‘æ‚Q‰ñƒŠ[ƒX—¿Žx•¥Šz PIC S9(013) COMP-3.
000470 01  ‚k‚s‚q‚s‚r‚j|‘O•¥ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000480 01  ‚k‚s‚q‚s‚r‚j|Á”ïÅŠz PIC S9(013) COMP-3.
000490 01  ‚k‚s‚q‚s‚r‚j|””ï—p¸ŽZ‹æ•ª PIC S9(001) COMP-3.
000500 01  ‚k‚s‚q‚s‚r‚j|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000510 01  ‚k‚s‚q‚s‚r‚j|Á”ïÅŽx•¥‹æ•ª PIC S9(001) COMP-3.
000520 01  ‚k‚s‚q‚s‚r‚j|ÂŒ ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000530 01  ‚k‚s‚q‚s‚r‚j|–³Œ`ƒŠ[ƒXŽ‘ŽY PIC S9(013) COMP-3.
000540 01  ‚k‚s‚q‚s‚r‚j|—LŒ`ƒŠ[ƒXŽ‘ŽY PIC S9(013) COMP-3.
000550 01  ‚k‚s‚q‚s‚r‚j|Œ_–ñŠúŠÔ PIC S9(003) COMP-3.
000560 01  ‚k‚s‚q‚s‚r‚j|‹¤’Êî•ñ PIC  X(035).
