000010************************************************
000020* ˆ—’Ê”Ô(Œo—Žd–ó—p)(LTRTUU)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t|Ž–‹ÆŠ PIC  X(004).
000050 01  ‚k‚s‚q‚s‚t‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000060 01  ‚k‚s‚q‚s‚t‚t|ˆ—’Ê”Ô PIC  X(005).
000070 01  ‚k‚s‚q‚s‚t‚t|ƒ_ƒ~[‚O‚O‚Q PIC  X(050).
000080 01  ‚k‚s‚q‚s‚t‚t|‹¤’Êî•ñ PIC  X(035).
