000010************************************************
000020* ŽèŒ`ŠÇ—iŽóŽæŽèŒ`j(LTRTEU)
000030************************************************
000040 01  ‚k‚s‚q‚s‚d‚t|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚s‚d‚t|‘©” PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚s‚d‚t|–‡” PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚s‚d‚t|Žæˆø“ú|¢‹I PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚s‚d‚t|Žæˆø“ú|”NŒŽ“ú PIC  X(006).
000090 01  ‚k‚s‚q‚s‚d‚t|ŽèŒ`–‡” PIC S9(004) COMP-3.
000100 01  ‚k‚s‚q‚s‚d‚t|‘©‡Œv‹àŠz PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚s‚d‚t|Šú“úŠî€“ú|¢‹I PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚s‚d‚t|Šú“úŠî€“ú|”NŒŽ“ú PIC  X(006).
000130 01  ‚k‚s‚q‚s‚d‚t|Šú“úƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000140 01  ‚k‚s‚q‚s‚d‚t|“`•[”­s“ú|¢‹I PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚s‚d‚t|“`•[”­s“ú|”NŒŽ“ú PIC  X(006).
000160 01  ‚k‚s‚q‚s‚d‚t|”õl—“ PIC  X(020).
000170 01  ‚k‚s‚q‚s‚d‚t|ŽèŒ`‹æ•ª PIC  X(001).
000180 01  ‚k‚s‚q‚s‚d‚t|ŽèŒ`Ží—Þ PIC  X(001).
000190 01  ‚k‚s‚q‚s‚d‚t|ŽèŒ`‚m‚n PIC  X(010).
000200 01  ‚k‚s‚q‚s‚d‚t|Šú“ú|¢‹I PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚s‚d‚t|Šú“ú|”NŒŽ“ú PIC  X(006).
000220 01  ‚k‚s‚q‚s‚d‚t|‹àŠz PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚s‚d‚t|Žæ—§ˆË—Š‹âsƒR[ƒh PIC  X(007).
000240 01  ‚k‚s‚q‚s‚d‚t|Žx•¥‹âsƒR[ƒh PIC  X(007).
000250 01  ‚k‚s‚q‚s‚d‚t|Žx•¥lƒR[ƒh PIC  X(008).
000260 01  ‚k‚s‚q‚s‚d‚t|–¼ÌŠ¿Žš PIC  X(040).
000270 01  ‚k‚s‚q‚s‚d‚t|–¼ÌƒJƒi PIC  X(040).
000280 01  ‚k‚s‚q‚s‚d‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(028).
000290 01  ‚k‚s‚q‚s‚d‚t|‹¤’Êî•ñ PIC  X(035).
