000010************************************************
000020* ŽÀŽ¿—^Mæ(LTRYSN)
000030************************************************
000040 01  ‚k‚s‚q‚x‚r‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚k‚s‚q‚x‚r‚m|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚x‚r‚m|ƒ_ƒ~[‚O‚O‚P PIC  X(014).
000070 01  ‚k‚s‚q‚x‚r‚m|–¼Šñ‚¹ƒR[ƒh‚P PIC  X(008).
000080 01  ‚k‚s‚q‚x‚r‚m|—^Mæ–¼Š¿Žš‚P PIC  X(060).
000090 01  ‚k‚s‚q‚x‚r‚m|•ÛØ’S•Û“à—e‚P PIC  X(002).
000100 01  ‚k‚s‚q‚x‚r‚m|•Û‘S”ÍˆÍ‚P PIC  X(002).
000110 01  ‚k‚s‚q‚x‚r‚m|•‰’SŠ„‡‚P PIC S9(003) COMP-3.
000120 01  ‚k‚s‚q‚x‚r‚m|–¼Šñ‚¹ƒR[ƒh‚Q PIC  X(008).
000130 01  ‚k‚s‚q‚x‚r‚m|—^Mæ–¼Š¿Žš‚Q PIC  X(060).
000140 01  ‚k‚s‚q‚x‚r‚m|•ÛØ’S•Û“à—e‚Q PIC  X(002).
000150 01  ‚k‚s‚q‚x‚r‚m|•Û‘S”ÍˆÍ‚Q PIC  X(002).
000160 01  ‚k‚s‚q‚x‚r‚m|•‰’SŠ„‡‚Q PIC S9(003) COMP-3.
000170 01  ‚k‚s‚q‚x‚r‚m|–¼Šñ‚¹ƒR[ƒh‚R PIC  X(008).
000180 01  ‚k‚s‚q‚x‚r‚m|—^Mæ–¼Š¿Žš‚R PIC  X(060).
000190 01  ‚k‚s‚q‚x‚r‚m|•ÛØ’S•Û“à—e‚R PIC  X(002).
000200 01  ‚k‚s‚q‚x‚r‚m|•Û‘S”ÍˆÍ‚R PIC  X(002).
000210 01  ‚k‚s‚q‚x‚r‚m|•‰’SŠ„‡‚R PIC S9(003) COMP-3.
000220 01  ‚k‚s‚q‚x‚r‚m|–¼Šñ‚¹ƒR[ƒh‚S PIC  X(008).
000230 01  ‚k‚s‚q‚x‚r‚m|—^Mæ–¼Š¿Žš‚S PIC  X(060).
000240 01  ‚k‚s‚q‚x‚r‚m|•ÛØ’S•Û“à—e‚S PIC  X(002).
000250 01  ‚k‚s‚q‚x‚r‚m|•Û‘S”ÍˆÍ‚S PIC  X(002).
000260 01  ‚k‚s‚q‚x‚r‚m|•‰’SŠ„‡‚S PIC S9(003) COMP-3.
000270 01  ‚k‚s‚q‚x‚r‚m|–¼Šñ‚¹ƒR[ƒh‚T PIC  X(008).
000280 01  ‚k‚s‚q‚x‚r‚m|—^Mæ–¼Š¿Žš‚T PIC  X(060).
000290 01  ‚k‚s‚q‚x‚r‚m|•ÛØ’S•Û“à—e‚T PIC  X(002).
000300 01  ‚k‚s‚q‚x‚r‚m|•Û‘S”ÍˆÍ‚T PIC  X(002).
000310 01  ‚k‚s‚q‚x‚r‚m|•‰’SŠ„‡‚T PIC S9(003) COMP-3.
000320 01  ‚k‚s‚q‚x‚r‚m|ƒ_ƒ~[‚O‚O‚Q PIC  X(065).
000330 01  ‚k‚s‚q‚x‚r‚m|‹¤’Êî•ñ PIC  X(035).
