000010************************************************
000020* (MAN_HOSHU)
000030************************************************
000040 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000070 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|ˆ—“ú PIC  X(008).
000080 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|¿‹ŠJŽn“ú PIC  X(008).
000090 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|¿‹ŠúŠÔ PIC S9(003) COMP-3.
000100 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|¿‹‹àŠz‡Œv PIC S9(013) COMP-3.
000110 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|¿‹æƒR[ƒh PIC  X(008).
000120 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|‰ñŽû•ûŽ®‚P PIC  X(001).
000130 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|‰ñŽû•ûŽ®‚Q PIC  X(001).
000140 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000150 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|Žx•¥‰ñ” PIC S9(003) COMP-3.
000160 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|‚a‚d‚f‚h‚m‰ñ” PIC  X(001).
000170 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|ŒvŽZ•ûŽ® PIC  X(001).
000180 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|‹âsƒR[ƒh PIC  X(007).
000190 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|ŒûÀ”Ô† PIC  X(007).
000200 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|—a‹àŽí—Þ PIC  X(001).
000210 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|“ü‹à“ú PIC  X(002).
000220 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|‘æ‚P‰ñ“ü‹à“ú PIC  X(008).
000230 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|ÄƒŠ[ƒXƒR[ƒh PIC  X(001).
000240 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000250 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|Žè”—¿¿‹–¼Ì PIC  X(030).
000260 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|“o˜^“ú PIC  X(008).
000270 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|“o˜^Žž PIC  X(006).
000280 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000290 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|XV“ú PIC  X(008).
000300 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|XVŽž PIC  X(006).
000310 01  ‚l‚`‚m|‚g‚n‚r‚g‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
