000010************************************************
000020* (MAN_WK_APL_MATCH)
000030************************************************
000040 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ˆ—“ú PIC  X(008).
000050 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|‚m‚n PIC  X(004).
000060 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|•¨Œ‚m‚n PIC  X(003).
000080 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ƒAƒ|ƒŒ_–ñ‚m‚n 
                                             PIC  X(007).
000090 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ƒAƒ|ƒŒ_–ñ‚m‚n|Ž}”Ô 
                                             PIC  X(003).
000100 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ŒŸŽû“ú PIC  X(008).
000110 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|–ž—¹“ú PIC  X(008).
000120 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ŠúŠÔ PIC S9(003) COMP-3.
000130 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ƒŠ[ƒX—¿|”NŠz 
                                             PIC S9(013) COMP-3.
000140 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|Ý’uêŠ–¼ PIC  X(020).
000150 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|•¨Œ–¼ PIC  X(020).
000160 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|”—Ê PIC S9(004) COMP-3.
000170 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000180 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ˆ— PIC  X(001).
000190 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|”pŠü•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000200 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|”pŠü”—Ê 
                                             PIC S9(004) COMP-3.
000210 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ÄƒŠ[ƒX•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000220 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ÄƒŠ[ƒX”—Ê 
                                             PIC S9(004) COMP-3.
000230 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ÄƒŠ[ƒX–ž—¹“ú 
                                             PIC  X(008).
000240 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ÄƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000250 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ÄƒŠ[ƒX—¿|”NŠz 
                                             PIC S9(013) COMP-3.
000260 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|Á”ïÅŠz 
                                             PIC S9(013) COMP-3.
000270 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ƒGƒ‰[‹æ•ª PIC  X(001).
000280 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|ƒGƒ‰[ƒƒbƒZ[ƒW 
                                             PIC  X(030).
000290 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|XV“ú PIC  X(008).
000300 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|XVŽž PIC  X(006).
000310 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚l‚`‚s‚b‚g|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
