000010************************************************
000020* (MAN_KEISAN_RITU)
000030************************************************
000040 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|“K—p”NŒŽ“ú PIC  X(008).
000060 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|ÄƒŠ[ƒXƒR[ƒh PIC  X(002).
000070 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|ŒvŽZ’PˆÊ PIC  X(001).
000080 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|’[”ˆ—‹æ•ª PIC  X(001).
000090 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|•ªŽq PIC S9(003) COMP-3.
000100 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|•ª•ê PIC S9(004) COMP-3.
000110 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|“o˜^“ú PIC  X(008).
000120 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|“o˜^Žž PIC  X(006).
000130 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|“o˜^’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000140 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|XV“ú PIC  X(008).
000150 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|XVŽž PIC  X(006).
000160 01  ‚l‚`‚m|‚j‚d‚h‚r‚`‚m|‚q‚h‚s‚t|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
