000010************************************************
000020* (MAN_PATCH_WK_SIN)
000030************************************************
000040 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|¿‹æƒR[ƒh|V 
                                             PIC  X(008).
000060 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|‰ñŽû•ûŽ®‚P|V 
                                             PIC  X(001).
000070 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|‰ñŽû•ûŽ®‚Q|V 
                                             PIC  X(001).
000080 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|‹âsƒR[ƒh|V 
                                             PIC  X(007).
000090 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|ŒûÀ”Ô†|V PIC  X(007).
000100 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|—a‹àŽí—Þ|V PIC  X(001).
000110 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|XV‰ñŽû•ûŽ®‚P|V 
                                             PIC  X(001).
000120 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|XV‰ñŽû•ûŽ®‚Q|V 
                                             PIC  X(001).
000130 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|XV‹âsƒR[ƒh|V 
                                             PIC  X(007).
000140 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|XVŒûÀ”Ô†|V 
                                             PIC  X(007).
000150 01  ‚l‚`‚m|‚o‚`‚s‚b‚g|‚v‚j|‚r‚h‚m|XV—a‹àŽí—Þ|V 
                                             PIC  X(001).
