000010************************************************
000020* (MAN_WK_03_1)
000030************************************************
000040 01  ‚l‚`‚m|‚v‚j|‚O‚R|‚P|’[––”Ô† PIC  X(016).
000050 01  ‚l‚`‚m|‚v‚j|‚O‚R|‚P|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚l‚`‚m|‚v‚j|‚O‚R|‚P|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚l‚`‚m|‚v‚j|‚O‚R|‚P|ŒvŽZƒtƒ‰ƒO PIC S9(001) COMP-3.
