000010************************************************
000020* (MAN_KIHON)
000030************************************************
000040 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000070 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000080 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000090 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000100 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000110 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Žc‰¿‰ñŽû“ú PIC  X(008).
000120 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000130 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Žc‰¿Šz‡Œv PIC S9(013) COMP-3.
000140 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|¿‹æƒR[ƒh PIC  X(008).
000150 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‰ñŽû•ûŽ® PIC  X(001).
000160 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000170 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|“ü‹à“ú PIC  X(002).
000180 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‹âsƒR[ƒh PIC  X(007).
000190 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ŒûÀ”Ô† PIC  X(007).
000200 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|—a‹àŽí—Þ PIC  X(001).
000210 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Â–±‹¦’²ƒR[ƒh PIC  X(002).
000220 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Œp‘±ƒŠ[ƒXˆ—“ú PIC  X(008).
000230 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠJŽn“ú|V PIC  X(008).
000240 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ|V PIC S9(003) COMP-3.
000250 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000260 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000270 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000280 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿“ü‹à“ú PIC  X(008).
000290 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz|V PIC S9(013) COMP-3.
000300 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000310 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|•ÛŒ¯—¿ PIC S9(013) COMP-3.
000320 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|•ÛŽç—¿ PIC S9(013) COMP-3.
000330 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000340 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000350 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000360 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000370 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‰Šú”ï—p PIC S9(013) COMP-3.
000380 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|¿‹æƒR[ƒh|V PIC  X(008).
000390 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‰ñŽû•ûŽ®‚P PIC  X(001).
000400 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‰ñŽû•ûŽ®‚Q PIC  X(001).
000410 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|¿‹ƒTƒCƒNƒ‹|V PIC S9(002) COMP-3.
000420 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
000430 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|˜’uŒŽ” PIC S9(002)V9(2) COMP-3.
000440 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‚a‚d‚f‚h‚m‰ñ” PIC  X(001).
000450 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ŒvŽZ•ûŽ® PIC  X(001).
000460 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‹âsƒR[ƒh|V PIC  X(007).
000470 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ŒûÀ”Ô†|V PIC  X(007).
000480 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|—a‹àŽí—Þ|V PIC  X(001).
000490 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|“ü‹à“ú|V PIC S9(002) COMP-3.
000500 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Žc‰¿‰ñŽû“ú|V PIC  X(008).
000510 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú PIC  X(008).
000520 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ÄƒŠ[ƒXƒR[ƒh|V PIC  X(001).
000530 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000540 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Á”ïÅ’¥Žû‹æ•ª PIC  X(001).
000550 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000560 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000570 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000580 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000590 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000600 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000610 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|‰ïŽÐ•”–å—ªÌ|ƒJƒi PIC  X(030).
000620 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ÄƒŠ[ƒX—¿ŒvŽZ—¦|•ªŽq 
                                             PIC S9(003) COMP-3.
000630 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ÄƒŠ[ƒX—¿ŒvŽZ—¦|•ª•ê 
                                             PIC S9(004) COMP-3.
000640 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ÄƒŠ[ƒX—¿ŒvŽZ’PˆÊ PIC  X(001).
000650 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Ž©“®XV“K—pœŠO‹æ•ª PIC  X(001).
000660 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|¿‹‘”­s—lŽ® PIC  X(001).
000670 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|¿‹‘”­sŒŽ‹æ•ª PIC  X(001).
000680 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|ŒvŽZ•ûŽ®|Œ³ PIC S9(001) COMP-3.
000690 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|Žx•¥‰ñ”|Œ³ PIC S9(003) COMP-3.
000700 01  ‚l‚`‚m|‚j‚h‚g‚n‚m|’P”N“xŒ_–ñ PIC  X(002).
