000010************************************************
000020* ƒRƒ“ƒgƒ[ƒ‹ƒf[ƒ^ÄƒŠ[ƒX•t•Û—¦(MBFM02)
000030************************************************
000040 01  ‚l‚a‚e‚l‚O‚Q|Ž¯•Ê PIC  X(007).
000050 01  ‚l‚a‚e‚l‚O‚Q|Ží•Ê PIC  X(001).
000060 01  ‚l‚a‚e‚l‚O‚Q|‚r‚d‚p PIC S9(003) COMP-3.
000070 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000080 01  ‚l‚a‚e‚l‚O‚Q|¿‹æƒR[ƒh PIC  X(008).
000090 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚Q PIC  X(001).
000100 01  ‚l‚a‚e‚l‚O‚Q|•t•Û—¦‚P PIC  X(002).
000110 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚R PIC  X(001).
000120 01  ‚l‚a‚e‚l‚O‚Q|•t•Û—¦‚Q PIC  X(002).
000130 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚S PIC  X(001).
000140 01  ‚l‚a‚e‚l‚O‚Q|•t•Û—¦‚R PIC  X(002).
000150 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚T PIC  X(001).
000160 01  ‚l‚a‚e‚l‚O‚Q|•t•Û—¦‚S PIC  X(002).
000170 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚U PIC  X(001).
000180 01  ‚l‚a‚e‚l‚O‚Q|•t•Û—¦‚T PIC  X(002).
000190 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚V PIC  X(001).
000200 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚W PIC  X(001).
000210 01  ‚l‚a‚e‚l‚O‚Q|‘ÎÛŽ‘ŽYƒR[ƒh‚P PIC  X(007).
000220 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚X PIC  X(001).
000230 01  ‚l‚a‚e‚l‚O‚Q|‘ÎÛŽ‘ŽYƒR[ƒh‚Q PIC  X(007).
000240 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚P‚O PIC  X(001).
000250 01  ‚l‚a‚e‚l‚O‚Q|‘ÎÛŽ‘ŽYƒR[ƒh‚R PIC  X(007).
000260 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚P‚P PIC  X(001).
000270 01  ‚l‚a‚e‚l‚O‚Q|ƒ_ƒ~[‚O‚O‚P‚Q PIC  X(013).
