000010************************************************
000020* (MFS_MEIGI)
000030************************************************
000040 01  ‚l‚e‚r|‚l‚d‚h‚f‚h|¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚l‚e‚r|‚l‚d‚h‚f‚h|ŒûÀ–¼‹`l–¼ PIC  X(030).
000060 01  ‚l‚e‚r|‚l‚d‚h‚f‚h|“o˜^“ú PIC  X(008).
000070 01  ‚l‚e‚r|‚l‚d‚h‚f‚h|“o˜^Žž PIC  X(006).
000080 01  ‚l‚e‚r|‚l‚d‚h‚f‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚l‚e‚r|‚l‚d‚h‚f‚h|XV“ú PIC  X(008).
000100 01  ‚l‚e‚r|‚l‚d‚h‚f‚h|XVŽž PIC  X(006).
000110 01  ‚l‚e‚r|‚l‚d‚h‚f‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
