000010************************************************
000020* (MFS_JOBCHK)
000030************************************************
000040 01  MFS_JOBCHK-OPEDAY PIC  X(004).
000050 01  MFS_JOBCHK-PAYDAY PIC  X(004).
000060 01  MFS_JOBCHK-GETTXT PIC  X(001).
000070 01  MFS_JOBCHK-DATMAK PIC  X(001).
000080 01  MFS_JOBCHK-LSTPRT PIC  X(001).
000090 01  MFS_JOBCHK-PUTFDD PIC  X(001).
000100 01  MFS_JOBCHK-SNDDAT PIC  X(001).
