000010************************************************
000020* (MST_SINYO_KAPPU)
000030************************************************
000040 01  MST_SINYO_KAPPU-ﾘｰｽ_割賦区分 PIC  X(001).
000050 01  MST_SINYO_KAPPU-保険期間月数 PIC  X(003).
000060 01  MST_SINYO_KAPPU-適用日 PIC  X(008).
000070 01  MST_SINYO_KAPPU-保険料率_A PIC S9(002)V9(8) COMP-3.
000080 01  MST_SINYO_KAPPU-保険料率_B PIC S9(002)V9(8) COMP-3.
000090 01  MST_SINYO_KAPPU-保険料率_C PIC S9(002)V9(8) COMP-3.
000100 01  MST_SINYO_KAPPU-保険料率_D PIC S9(002)V9(8) COMP-3.
000110 01  MST_SINYO_KAPPU-保険料率_予 PIC S9(002)V9(8) COMP-3.
000120 01  MST_SINYO_KAPPU-登録日 PIC  X(008).
000130 01  MST_SINYO_KAPPU-登録時刻 PIC  X(006).
000140 01  MST_SINYO_KAPPU-登録担当者ｺｰﾄﾞ PIC  X(004).
000150 01  MST_SINYO_KAPPU-更新日 PIC  X(008).
000160 01  MST_SINYO_KAPPU-更新時刻 PIC  X(006).
000170 01  MST_SINYO_KAPPU-更新担当者ｺｰﾄﾞ PIC  X(004).
