000010************************************************
000020* (MST_JIGYO)
000030************************************************
000040 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000050 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Ž–‹ÆŠ–¼|‚P PIC  X(020).
000060 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Ž–‹ÆŠ–¼|‚Q PIC  X(020).
000070 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Ž–‹ÆŠ–¼—ªÌ|‚P PIC  X(010).
000080 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Ž–‹ÆŠ–¼—ªÌ|‚Q PIC  X(012).
000090 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Ž–‹ÆŠZŠ PIC  X(090).
000100 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Ž–‹ÆŠ“d˜b”Ô† PIC  X(015).
000110 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Ž–‹ÆŠ‚e‚`‚w”Ô† PIC  X(015).
000120 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|Žx•¥æƒR[ƒhãˆêŒ…ƒGƒŠƒA PIC  X(001).
000130 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|“K—p“ú PIC  X(008).
000140 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|“o˜^“ú PIC  X(008).
000150 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|“o˜^Žž PIC  X(006).
000160 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000170 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|XV“ú PIC  X(008).
000180 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|XVŽž PIC  X(006).
000190 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000200 01  ‚l‚r‚s|‚i‚h‚f‚x‚n|ƒ[ƒN PIC  X(001).
