000010************************************************
000020* (MST_NENGETU)
000030************************************************
000040 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|ˆ—”NŒŽŠÇ—‚h‚c PIC  X(008).
000050 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|“–“úˆ—“ú PIC  X(008).
000060 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|“–ŒŽŒŽ“x PIC  X(008).
000070 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|‘OŒŽŒŽ“x PIC  X(008).
000080 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|—‚ŒŽŒŽ“x PIC  X(008).
000090 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|“–ŒŽŒŸŽû•ª‘—M’÷“ú PIC  X(008).
000100 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|‘Ý•t‹àƒtƒ@ƒNƒ^ƒŠƒ“ƒO‘—M’÷“ú 
                                             PIC  X(008).
000110 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|’†“r‰ð–ñ‘—M’÷“ú PIC  X(008).
000120 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|¬–ñ‘—M’÷“ú PIC  X(008).
000130 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|–ž—¹ÄƒŠ[ƒXŒp‘±ƒŠ[ƒX‘—M’÷“ú 
                                             PIC  X(008).
000140 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|‚r‚e‚b‘—M’÷“ú|‚P PIC  X(008).
000150 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|‚r‚e‚b‘—M’÷“ú|‚Q PIC  X(008).
000160 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|“o˜^“ú PIC  X(008).
000170 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|“o˜^Žž PIC  X(006).
000180 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000190 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|XV“ú PIC  X(008).
000200 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|XVŽž PIC  X(006).
000210 01  ‚l‚r‚s|‚m‚d‚m‚f‚d‚s‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
