000010************************************************
000020* (NTL_SYAIN_CSV)
000030************************************************
000040 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(008).
000060 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|ŽÐˆõ‚h‚c PIC  X(010).
000070 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|Žx“X–¼Ì PIC  X(022).
000080 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|•”–¼Ì PIC  X(026).
000090 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|‰Û–¼Ì PIC  X(026).
000100 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|–¼‘O PIC  X(036).
000110 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|ƒ[ƒ‹ƒAƒhƒŒƒX PIC  X(052).
000120 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|“d˜b”Ô† PIC  X(017).
000130 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|ì¬‚h‚c PIC  X(012).
000140 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|ì¬“ú PIC  X(012).
000150 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|XV‚h‚c PIC  X(012).
000160 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‚b‚r‚u|XV“ú PIC  X(012).
