000010************************************************
000020* (NTL_SNDREC)
000030************************************************
000040 01  NTL_SNDREC-GENREC PIC  X(400).
