000010************************************************
000020* (NTL_LEASE)
000030************************************************
000040 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ƒŒƒR[ƒhŽí•Ê PIC  X(001).
000050 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(006).
000060 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|Žæˆø‹æ•ª PIC  X(001).
000070 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|d—v«‹æ•ª PIC  X(001).
000080 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|”ñ•\Ž¦ƒtƒ‰ƒO PIC  X(001).
000090 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ŒÚ‹q–¼ PIC  X(096).
000100 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|Œ_–ñ‚h‚c PIC  X(022).
000110 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|Œ_–ñŠz PIC S9(013) COMP-3.
000120 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ƒŠ[ƒXŠúŠÔ PIC S9(004) COMP-3.
000130 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ŒŸŽû“ú PIC  X(010).
000140 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|Žæ“¾‰¿Šz‘Š“–Šz PIC S9(013) COMP-3.
000150 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|Œ¸‰¿ž‹p—ÝŒvŠz‘Š“–Šz 
                                             PIC S9(013) COMP-3.
000160 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|Šú––Žc‚‘Š“–Šz PIC S9(013) COMP-3.
000170 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ƒŠ[ƒXÂ–±Šú––Žc‚‚P”NˆÈ“à 
                                             PIC S9(013) COMP-3.
000180 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ƒŠ[ƒXÂ–±Šú––Žc‚‚P”N’´ 
                                             PIC S9(013) COMP-3.
000190 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ƒŠ[ƒXÂ–±Šú––Žc‚ PIC S9(013) COMP-3.
000200 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|“–ŠúŽx•¥ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000210 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|“–ŠúŒ¸‰¿ž‹p”ï‘Š“–Šz 
                                             PIC S9(013) COMP-3.
000220 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|“–ŠúŽx•¥—˜‘§‘Š“–Šz PIC S9(013) COMP-3.
000230 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ŒˆŽZ”NŒŽ|‚e‚q‚n‚l PIC  X(010).
000240 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ŒˆŽZ”NŒŽ|‚s‚n PIC  X(010).
000250 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|’S“–“X–¼ PIC  X(020).
000260 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|’S“–•”–¼ PIC  X(064).
000270 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|’S“–ŽÒ–¼ PIC  X(034).
000280 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ŒÚ‹q‚h‚c PIC  X(012).
000290 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ƒŠ[ƒX–ž—¹“ú PIC  X(010).
000300 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‰ð–ñ“ú PIC  X(010).
000310 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|Ž‘ŽY‰È–Ú PIC  X(002).
000320 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|Ž‘ŽY‰È–Ú–¼ PIC  X(030).
000330 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‘ã•\•¨Œ–¼ PIC  X(064).
000340 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|•½‹ÏŒŽŠzƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000350 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‘O•¥ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000360 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ž‹p•û–@‹æ•ª PIC  X(001).
000370 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ž‹p•û–@‹æ•ª–¼ PIC  X(016).
000380 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ˆ—Šî€‚P PIC  X(001).
000390 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ˆ—Šî€–¼‚P PIC  X(016).
000400 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ˆ—Šî€‚Q PIC  X(001).
000410 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ˆ—Šî€–¼‚Q PIC  X(016).
000420 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ì¬‚h‚c PIC  X(010).
000430 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|ì¬“ú PIC  X(010).
000440 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|XV‚h‚c PIC  X(010).
000450 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|XV“ú PIC  X(010).
