000010************************************************
000020* (NTL_MANTSUS)
000030************************************************
000040 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|ƒŒƒR[ƒhŽí•Ê PIC  X(001).
000050 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(006).
000060 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|Œ_–ñ‚h‚c PIC  X(022).
000070 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|Ž‘ŽY”Ô†ƒL[ PIC  X(026).
000080 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‘—•tæƒR[ƒh PIC  X(020).
000090 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|Ž‘ŽY”Ô† PIC  X(006).
000100 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|•¨ŒŒÂ” PIC S9(006) COMP-3.
000110 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|•¨ŒŒÂ”’PˆÊ PIC  X(004).
000120 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|•¨Œ–¼ PIC  X(080).
000130 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|•¨ŒÝ’uêŠ–¼ PIC  X(090).
000140 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚r‚oŒÚ‹q‚h‚c PIC  X(012).
000150 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|ƒ\[ƒgê—p€–Ú PIC  X(030).
000160 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|”õ–Yî•ñ PIC  X(060).
000170 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|ì¬‚h‚c PIC  X(010).
000180 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|ì¬“ú PIC  X(010).
000190 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|XV‚h‚c PIC  X(010).
000200 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|XV“ú PIC  X(010).
