000010************************************************
000020* (NTL_CUSTOMER_CSV)
000030************************************************
000040 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|ƒŠ[ƒX‰ïŽÐ‚h‚c 
                                             PIC  X(008).
000060 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|ŒÚ‹q‚h‚c PIC  X(014).
000070 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|ŒÚ‹q–¼ PIC  X(098).
000080 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|ZŠ PIC  X(122).
000090 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|“d˜b”Ô† PIC  X(017).
000100 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|ì¬‚h‚c PIC  X(012).
000110 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|ì¬“ú PIC  X(012).
000120 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|XV‚h‚c PIC  X(012).
000130 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|‚b‚r‚u|XV“ú PIC  X(012).
