000010************************************************
000020* (NTL_SYAIN)
000030************************************************
000040 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|ƒŒƒR[ƒhŽí•Ê PIC  X(001).
000050 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(006).
000060 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|ŽÐˆõ‚h‚c PIC  X(008).
000070 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|Žx“X–¼Ì PIC  X(020).
000080 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|•”–¼Ì PIC  X(024).
000090 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|‰Û–¼Ì PIC  X(024).
000100 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|–¼‘O PIC  X(034).
000110 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|ƒ[ƒ‹ƒAƒhƒŒƒX PIC  X(050).
000120 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|“d˜b”Ô† PIC  X(015).
000130 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|ì¬‚h‚c PIC  X(010).
000140 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|ì¬“ú PIC  X(010).
000150 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|XV‚h‚c PIC  X(010).
000160 01  ‚m‚s‚k|‚r‚x‚`‚h‚m|XV“ú PIC  X(010).
