000010************************************************
000020* (NTL_CUSTOMER)
000030************************************************
000040 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|ƒŒƒR[ƒhŽí•Ê PIC  X(001).
000050 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(006).
000060 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|ŒÚ‹q‚h‚c PIC  X(012).
000070 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|ŒÚ‹q–¼ PIC  X(096).
000080 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|ZŠ PIC  X(120).
000090 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|“d˜b”Ô† PIC  X(015).
000100 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|ì¬‚h‚c PIC  X(010).
000110 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|ì¬“ú PIC  X(010).
000120 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|XV‚h‚c PIC  X(010).
000130 01  ‚m‚s‚k|‚b‚t‚r‚s‚n‚l‚d‚q|XV“ú PIC  X(010).
