000010************************************************
000020* (NTL_MANTSU)
000030************************************************
000040 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ƒŒƒR[ƒhŽí•Ê PIC  X(001).
000050 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(006).
000060 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ŒÚ‹q‚h‚c PIC  X(012).
000070 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|Œ_–ñ‚h‚c PIC  X(022).
000080 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|–ž—¹”NŒŽ PIC  X(006).
000090 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘—•tæƒR[ƒh PIC  X(020).
000100 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ÄƒŠ[ƒXŠúŠÔ|Ž© PIC  X(010).
000110 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ÄƒŠ[ƒXŠúŠÔ|ŽŠ PIC  X(010).
000120 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ÄƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000130 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ÄƒŠ[ƒX—¿Á”ïÅ PIC S9(014) COMP-3.
000140 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘—•tæ‰ïŽÐ–¼ PIC  X(064).
000150 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘—•tæ•”–¼ PIC  X(034).
000160 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘—•tæ’S“–ŽÒ–¼ PIC  X(034).
000170 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘—•tæZŠ PIC  X(120).
000180 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘ã—‰ñŽû•ÛŽç—¿ PIC S9(013) COMP-3.
000190 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘ã—‰ñŽû•ÛŽç—¿Á”ïÅ 
                                             PIC S9(014) COMP-3.
000200 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘ã•\•¨Œ–¼ PIC  X(064).
000210 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ƒn[ƒhƒ\ƒtƒg‹æ•ª PIC  X(001).
000220 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ÄƒŠ[ƒX—¿‹æ•ª PIC  X(004).
000230 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‘ã—‰ñŽû•ÛŽç—¿‹æ•ª PIC  X(004).
000240 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ƒ\[ƒgê—p€–Ú PIC  X(030).
000250 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|”õ–Yî•ñ PIC  X(060).
000260 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ì¬‚h‚c PIC  X(010).
000270 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|ì¬“ú PIC  X(010).
000280 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|XV‚h‚c PIC  X(010).
000290 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|XV“ú PIC  X(010).
