000010************************************************
000020* (NTL_MANTSUS_CSV)
000030************************************************
000040 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(008).
000060 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|Œ_–ñ‚h‚c PIC  X(024).
000070 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|Ž‘ŽY”Ô†ƒL[ PIC  X(028).
000080 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|‘—•tæƒR[ƒh PIC  X(022).
000090 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|Ž‘ŽY”Ô† PIC  X(008).
000100 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|•¨ŒŒÂ” PIC  X(008).
000110 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|•¨ŒŒÂ”’PˆÊ PIC  X(006).
000120 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|•¨Œ–¼ PIC  X(082).
000130 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|•¨ŒÝ’uêŠ–¼ PIC  X(092).
000140 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|‚r‚oŒÚ‹q‚h‚c PIC  X(014).
000150 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|ƒ\[ƒgê—p€–Ú PIC  X(032).
000160 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|”õ–Yî•ñ PIC  X(062).
000170 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|ì¬‚h‚c PIC  X(012).
000180 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|ì¬“ú PIC  X(012).
000190 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|XV‚h‚c PIC  X(012).
000200 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t‚r|‚b‚r‚u|XV“ú PIC  X(012).
