000010************************************************
000020* (NTT_MASTER)
000030************************************************
000040 01  ‚m‚s‚s|‚l‚`‚r‚s‚d‚q|“o˜^”Ô† PIC  X(004).
000050 01  ‚m‚s‚s|‚l‚`‚r‚s‚d‚q|æ•ûŽQÆ”Ô† PIC  X(010).
000060 01  ‚m‚s‚s|‚l‚`‚r‚s‚d‚q|¿‹æƒR[ƒh PIC  X(008).
000070 01  ‚m‚s‚s|‚l‚`‚r‚s‚d‚q|•”–å–¼Ì‚P PIC  X(040).
000080 01  ‚m‚s‚s|‚l‚`‚r‚s‚d‚q|•”–å–¼Ì‚Q PIC  X(040).
000090 01  ‚m‚s‚s|‚l‚`‚r‚s‚d‚q|“o˜^ PIC  X(001).
