000010************************************************
000020* (NTT_WK_LIST)
000030************************************************
000040 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ŒŸŽû“ú PIC  X(008).
000060 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|¿‹æƒR[ƒh PIC  X(008).
000070 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|“–ŒŽƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000080 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|“ú•t PIC  X(004).
000090 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|[“–‰ñ PIC  X(003).
000100 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|‘Žx•¥‰ñ” PIC  X(003).
000110 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|Á”ïÅŠz PIC S9(011) COMP-3.
000120 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|–¾×‚m‚n PIC  X(004).
000130 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|•¨Œ–¼ PIC  X(030).
000140 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|æ•ûŽQÆ”Ô† PIC  X(010).
000150 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000160 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|¿‹ƒR[ƒh PIC  X(002).
000170 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒGƒ‰[ƒƒbƒZ[ƒW PIC  X(040).
000180 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ˆ—‹æ•ª PIC  X(001).
000190 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚P PIC  X(001).
000200 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚Q PIC  X(001).
000210 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚R PIC  X(001).
000220 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚S PIC  X(001).
000230 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚T PIC  X(001).
000240 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚U PIC  X(001).
000250 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚V PIC  X(001).
000260 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚W PIC  X(001).
000270 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚X PIC  X(001).
000280 01  ‚m‚s‚s|‚v‚j|‚k‚h‚r‚s|ƒ`ƒFƒbƒN‚P‚O PIC  X(001).
