000010************************************************
000020* (NTT_WK_KIHON)
000030************************************************
000040 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000060 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|¿‹æƒR[ƒh PIC  X(008).
000070 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|“–ŒŽƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000080 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|“ú•t PIC  X(004).
000090 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|[“–‰ñ PIC  X(003).
000100 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|‘Žx•¥‰ñ” PIC  X(003).
000110 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|Á”ïÅŠz PIC S9(011) COMP-3.
000120 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|¿‹ƒR[ƒh PIC  X(002).
000130 01  ‚m‚s‚s|‚v‚j|‚j‚h‚g‚n‚m|Å—¦ PIC S9(002)V9(1) COMP-3.
