000010************************************************
000020* (NTT_WK_MEISAI)
000030************************************************
000040 01  ‚m‚s‚s|‚v‚j|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚m‚s‚s|‚v‚j|‚l‚d‚h‚r‚`‚h|–¾×‚m‚n PIC  X(004).
000060 01  ‚m‚s‚s|‚v‚j|‚l‚d‚h‚r‚`‚h|•¨Œ–¼ PIC  X(030).
000070 01  ‚m‚s‚s|‚v‚j|‚l‚d‚h‚r‚`‚h|æ•ûŽQÆ”Ô† PIC  X(010).
000080 01  ‚m‚s‚s|‚v‚j|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000090 01  ‚m‚s‚s|‚v‚j|‚l‚d‚h‚r‚`‚h|¿‹ƒR[ƒh PIC  X(002).
