000010************************************************
000020* (NYU_NAMELIST)
000030************************************************
000040 01  NYU_NAMELIST-BNKCOD PIC  X(004).
000050 01  NYU_NAMELIST-PAYNUM PIC  X(008).
000060 01  NYU_NAMELIST-CSTNAM PIC  X(030).
000070 01  NYU_NAMELIST-PAYDAY PIC  X(002).
