000010************************************************
000020* (NYU_AUTOAPPL)
000030************************************************
000040 01  NYU_AUTOAPPL-OPEDAY PIC  X(008).
000050 01  NYU_AUTOAPPL-BNKCOD PIC  X(004).
000060 01  NYU_AUTOAPPL-BNKKNJ PIC  X(016).
000070 01  NYU_AUTOAPPL-FLPCNT PIC  X(001).
000080 01  NYU_AUTOAPPL-TOTCNT PIC S9(005) COMP-3.
000090 01  NYU_AUTOAPPL-TOTAMT PIC S9(010) COMP-3.
000100 01  NYU_AUTOAPPL-PAYDAY PIC  X(004).
