000010************************************************
000020* (NYU_AUTOHEAD)
000030************************************************
000040 01  NYU_AUTOHEAD-DATTYP PIC  X(001).
000050 01  NYU_AUTOHEAD-TRNCOD PIC  X(002).
000060 01  NYU_AUTOHEAD-CODTYP PIC  X(001).
000070 01  NYU_AUTOHEAD-CONSIG PIC  X(010).
000080 01  NYU_AUTOHEAD-CONNAM PIC  X(040).
000090 01  NYU_AUTOHEAD-TRNDAY PIC  X(004).
000100 01  NYU_AUTOHEAD-BNKCOD PIC  X(004).
000110 01  NYU_AUTOHEAD-BNKNAM PIC  X(015).
000120 01  NYU_AUTOHEAD-BRCCOD PIC  X(003).
000130 01  NYU_AUTOHEAD-BRCNAM PIC  X(015).
000140 01  NYU_AUTOHEAD-DEPKND PIC  X(001).
000150 01  NYU_AUTOHEAD-DEPNUM PIC  X(007).
000160 01  NYU_AUTOHEAD-DUMMY1 PIC  X(017).
