000010************************************************
000020* (NYU_AUTOADDM)
000030************************************************
000040 01  NYU_AUTOADDM-BNKCOD PIC  X(004).
000050 01  NYU_AUTOADDM-BNKNAM PIC  X(015).
000060 01  NYU_AUTOADDM-BRCCOD PIC  X(003).
000070 01  NYU_AUTOADDM-BRCNAM PIC  X(015).
000080 01  NYU_AUTOADDM-DEPKND PIC  X(001).
000090 01  NYU_AUTOADDM-DEPNUM PIC  X(007).
000100 01  NYU_AUTOADDM-PAYNUM PIC  X(008).
000110 01  NYU_AUTOADDM-CSTNAM PIC  X(030).
000120 01  NYU_AUTOADDM-TRNAMT PIC S9(010) COMP-3.
000130 01  NYU_AUTOADDM-CONTAX PIC S9(008) COMP-3.
000140 01  NYU_AUTOADDM-PAYDAY PIC  X(004).
000150 01  NYU_AUTOADDM-ERRFLG PIC  X(005).
