000010************************************************
000020* (OBA_RCVTRN)
000030************************************************
000040 01  OBA_RCVTRN-CNTNUM PIC  X(009).
000050 01  OBA_RCVTRN-TRNTYP PIC  X(001).
000060 01  OBA_RCVTRN-DIVCOD PIC  X(004).
000070 01  OBA_RCVTRN-DIVNAM PIC  X(020).
000080 01  OBA_RCVTRN-USRCOD PIC  X(008).
000090 01  OBA_RCVTRN-USRNAM PIC  X(060).
000100 01  OBA_RCVTRN-OBJNAM PIC  X(040).
000110 01  OBA_RCVTRN-TRNDAY PIC  X(008).
000120 01  OBA_RCVTRN-BGNDAY PIC  X(008).
000130 01  OBA_RCVTRN-BASDAY PIC  X(008).
000140 01  OBA_RCVTRN-CRERNK PIC  X(004).
000150 01  OBA_RCVTRN-CNTAMT PIC S9(013) COMP-3.
000160 01  OBA_RCVTRN-RCVAMT PIC S9(013) COMP-3.
000170 01  OBA_RCVTRN-BALAMT PIC S9(013) COMP-3.
000180 01  OBA_RCVTRN-REGDAY PIC  X(008).
000190 01  OBA_RCVTRN-REGTIM PIC  X(006).
000200 01  OBA_RCVTRN-REGPSN PIC  X(004).
000210 01  OBA_RCVTRN-MODDAY PIC  X(008).
000220 01  OBA_RCVTRN-MODTIM PIC  X(006).
000230 01  OBA_RCVTRN-MODPSN PIC  X(004).
