000010************************************************
000020* (PAY-BNSMST)
000030************************************************
000040 01  PAY-BNSMST-CNTNUM PIC  X(009).
000050 01  PAY-BNSMST-RELEAS PIC  X(001).
000060 01  PAY-BNSMST-CNTDAY PIC  X(008).
000070 01  PAY-BNSMST-DIVCOD PIC  X(004).
000080 01  PAY-BNSMST-CLTCOD PIC  X(008).
000090 01  PAY-BNSMST-CLTNAM PIC  X(060).
000100 01  PAY-BNSMST-PAYCLT PIC  X(008).
000110 01  PAY-BNSMST-PAYNAM PIC  X(060).
000120 01  PAY-BNSMST-RCVBGN PIC  X(008).
000130 01  PAY-BNSMST-RCVCYC PIC  X(002).
000140 01  PAY-BNSMST-RCVCNT PIC S9(003) COMP-3.
000150 01  PAY-BNSMST-RCVDAY PIC  X(002).
000160 01  PAY-BNSMST-PAYBGN PIC  X(008).
000170 01  PAY-BNSMST-PAYCYC PIC  X(002).
000180 01  PAY-BNSMST-PAYCNT PIC S9(003) COMP-3.
000190 01  PAY-BNSMST-HOLSFT PIC  X(001).
000200 01  PAY-BNSMST-CLTCNT PIC S9(002) COMP-3.
000210 01  PAY-BNSMST-CHCKYN PIC  X(001).
000220 01  PAY-BNSMST-REMARK PIC  X(046).
000230 01  PAY-BNSMST-TRNAMT PIC S9(013) COMP-3.
000240 01  PAY-BNSMST-TRNTAX PIC S9(013) COMP-3.
000250 01  PAY-BNSMST-TRNTOT PIC S9(013) COMP-3.
000260 01  PAY-BNSMST-CHGAMT PIC S9(013) COMP-3.
000270 01  PAY-BNSMST-CHGTAX PIC S9(013) COMP-3.
000280 01  PAY-BNSMST-TAXRAT PIC S9(002)V9(1) COMP-3.
000290 01  PAY-BNSMST-UPDFLG PIC  X(001).
000300 01  PAY-BNSMST-REGDAY PIC  X(008).
000310 01  PAY-BNSMST-REGTIM PIC  X(006).
000320 01  PAY-BNSMST-REGPSN PIC  X(004).
000330 01  PAY-BNSMST-MODDAY PIC  X(008).
000340 01  PAY-BNSMST-MODTIM PIC  X(006).
000350 01  PAY-BNSMST-MODPSN PIC  X(004).
