000010************************************************
000020* (PAY-BILMST-PL)
000030************************************************
000040 01  PAY-BILMST-PL-REGJPN PIC  X(006).
000050 01  PAY-BILMST-PL-CTLNUM PIC  X(009).
000060 01  PAY-BILMST-PL-DATNUM PIC  X(004).
000070 01  PAY-BILMST-PL-UNICOD PIC  X(003).
000080 01  PAY-BILMST-PL-BILNUM PIC  X(009).
000090 01  PAY-BILMST-PL-BNKCOD PIC  X(004).
000100 01  PAY-BILMST-PL-BRCCOD PIC  X(003).
000110 01  PAY-BILMST-PL-DRWDAY PIC  X(008).
000120 01  PAY-BILMST-PL-DRWJPN PIC  X(006).
000130 01  PAY-BILMST-PL-ISUDAY PIC  X(008).
000140 01  PAY-BILMST-PL-ISUJPN PIC  X(006).
000150 01  PAY-BILMST-PL-DUEDAY PIC  X(008).
000160 01  PAY-BILMST-PL-DUEJPN PIC  X(006).
000170 01  PAY-BILMST-PL-CLTSWT PIC  X(001).
000180 01  PAY-BILMST-PL-CLTNAM PIC  X(044).
000190 01  PAY-BILMST-PL-ISUTYP PIC  X(001).
000200 01  PAY-BILMST-PL-ISUTRM PIC  X(002).
000210 01  PAY-BILMST-PL-SEQNUM PIC  X(005).
000220 01  PAY-BILMST-PL-SEPNUM PIC  X(001).
000230 01  PAY-BILMST-PL-SEPPUT PIC  X(001).
000240 01  PAY-BILMST-PL-SNDTYP PIC  X(001).
000250 01  PAY-BILMST-PL-CNTNUM PIC  X(009).
000260 01  PAY-BILMST-PL-ZIPCOD PIC  X(007).
000270 01  PAY-BILMST-PL-MALNAM PIC  X(042).
000280 01  PAY-BILMST-PL-MALNM2 PIC  X(042).
000290 01  PAY-BILMST-PL-MALADR PIC  X(042).
000300 01  PAY-BILMST-PL-MALAD2 PIC  X(042).
000310 01  PAY-BILMST-PL-MALAD3 PIC  X(042).
000320 01  PAY-BILMST-PL-ADRTYP PIC  X(001).
000330 01  PAY-BILMST-PL-DAYBGN PIC  X(008).
000340 01  PAY-BILMST-PL-DAYEND PIC  X(008).
000350 01  PAY-BILMST-PL-PUTFLG PIC  X(001).
000360 01  PAY-BILMST-PL-CNTCNT PIC S9(003) COMP-3.
000370 01  PAY-BILMST-PL-SEPCNT PIC S9(001) COMP-3.
000380 01  PAY-BILMST-PL-SEQCNT PIC S9(001) COMP-3.
000390 01  PAY-BILMST-PL-BILAMT PIC S9(013) COMP-3.
000400 01  PAY-BILMST-PL-TAXAMT PIC S9(013) COMP-3.
000410 01  PAY-BILMST-PL-TOTAMT PIC S9(013) COMP-3.
000420 01  PAY-BILMST-PL-REGDAY PIC  X(008).
000430 01  PAY-BILMST-PL-REGTIM PIC  X(006).
000440 01  PAY-BILMST-PL-REGPSN PIC  X(004).
000450 01  PAY-BILMST-PL-MODDAY PIC  X(008).
000460 01  PAY-BILMST-PL-MODTIM PIC  X(006).
000470 01  PAY-BILMST-PL-MODPSN PIC  X(004).
