000010************************************************
000020* (PAY_GAFPRT)
000030************************************************
000040 01  PAY_GAFPRT-CNTNUM PIC  X(009).
000050 01  PAY_GAFPRT-RELEAS PIC  X(001).
000060 01  PAY_GAFPRT-CNTDAY PIC  X(008).
000070 01  PAY_GAFPRT-DIVCOD PIC  X(004).
000080 01  PAY_GAFPRT-PAYBGN PIC  X(008).
000090 01  PAY_GAFPRT-PAYCYC PIC  X(002).
000100 01  PAY_GAFPRT-PAYCNT PIC S9(003) COMP-3.
000110 01  PAY_GAFPRT-PAYEND PIC  X(008).
000120 01  PAY_GAFPRT-PLNDAY PIC  X(008).
000130 01  PAY_GAFPRT-PAYDAY PIC  X(008).
000140 01  PAY_GAFPRT-HOLSFT PIC  X(001).
000150 01  PAY_GAFPRT-EXPCOD PIC  X(003).
000160 01  PAY_GAFPRT-PAYCLT PIC  X(008).
000170 01  PAY_GAFPRT-PAYNAM PIC  X(060).
000180 01  PAY_GAFPRT-PAYTYP PIC  X(001).
000190 01  PAY_GAFPRT-BNKCOD PIC  X(004).
000200 01  PAY_GAFPRT-BRCCOD PIC  X(003).
000210 01  PAY_GAFPRT-DEPKND PIC  X(001).
000220 01  PAY_GAFPRT-DEPNUM PIC  X(007).
000230 01  PAY_GAFPRT-REMARK PIC  X(046).
000240 01  PAY_GAFPRT-TRNAMT PIC S9(013) COMP-3.
000250 01  PAY_GAFPRT-CHGAMT PIC S9(013) COMP-3.
000260 01  PAY_GAFPRT-TRNTAX PIC S9(013) COMP-3.
000270 01  PAY_GAFPRT-CHGTAX PIC S9(013) COMP-3.
000280 01  PAY_GAFPRT-LEAAMT PIC S9(013) COMP-3.
000290 01  PAY_GAFPRT-TAXRAT PIC S9(002)V9(1) COMP-3.
000300 01  PAY_GAFPRT-UNPBAL PIC S9(013) COMP-3.
000310 01  PAY_GAFPRT-TRNTOT PIC S9(013) COMP-3.
000320 01  PAY_GAFPRT-PAYTOT PIC S9(013) COMP-3.
000330 01  PAY_GAFPRT-PAYFIS PIC S9(013) COMP-3.
