000010************************************************
000020* (PAY_BILPRT)
000030************************************************
000040 01  PAY_BILPRT-REGJPN PIC  X(006).
000050 01  PAY_BILPRT-CTLNUM PIC  X(009).
000060 01  PAY_BILPRT-DATNUM PIC  X(004).
000070 01  PAY_BILPRT-BILNUM PIC  X(009).
000080 01  PAY_BILPRT-DRWJPN PIC  X(006).
000090 01  PAY_BILPRT-DUEJPN PIC  X(006).
000100 01  PAY_BILPRT-SEPNUM PIC  X(001).
000110 01  PAY_BILPRT-CLTNAM PIC  X(044).
000120 01  PAY_BILPRT-SNDTYP PIC  X(001).
000130 01  PAY_BILPRT-CNTNUM PIC  X(009).
000140 01  PAY_BILPRT-ZIPCOD PIC  X(007).
000150 01  PAY_BILPRT-MALNAM PIC  X(042).
000160 01  PAY_BILPRT-MALNM2 PIC  X(042).
000170 01  PAY_BILPRT-MALADR PIC  X(042).
000180 01  PAY_BILPRT-MALAD2 PIC  X(042).
000190 01  PAY_BILPRT-MALAD3 PIC  X(042).
000200 01  PAY_BILPRT-ADRTYP PIC  X(001).
000210 01  PAY_BILPRT-DAYBGN PIC  X(008).
000220 01  PAY_BILPRT-DAYEND PIC  X(008).
000230 01  PAY_BILPRT-SNDDAY PIC  X(008).
000240 01  PAY_BILPRT-DIVCOD PIC  X(004).
000250 01  PAY_BILPRT-DOCTYP PIC  X(001).
000260 01  PAY_BILPRT-SEPCNT PIC S9(001) COMP-3.
000270 01  PAY_BILPRT-TAXTYP PIC S9(006) COMP-3.
000280 01  PAY_BILPRT-BILCNT PIC S9(004) COMP-3.
000290 01  PAY_BILPRT-TAXCNT PIC S9(004) COMP-3.
000300 01  PAY_BILPRT-BILAMT PIC S9(013) COMP-3.
000310 01  PAY_BILPRT-TAXAMT PIC S9(013) COMP-3.
000320 01  PAY_BILPRT-TOTAMT PIC S9(013) COMP-3.
