000010************************************************
000020* (PAY-BNSTRN)
000030************************************************
000040 01  PAY-BNSTRN-CNTNUM PIC  X(009).
000050 01  PAY-BNSTRN-RELEAS PIC  X(001).
000060 01  PAY-BNSTRN-RECNUM PIC  X(004).
000070 01  PAY-BNSTRN-TRNTYP PIC  X(001).
000080 01  PAY-BNSTRN-PAYCLT PIC  X(008).
000090 01  PAY-BNSTRN-PLNDAY PIC  X(008).
000100 01  PAY-BNSTRN-TRNDAY PIC  X(008).
000110 01  PAY-BNSTRN-PAYDAY PIC  X(008).
000120 01  PAY-BNSTRN-RCVAMT PIC S9(013) COMP-3.
000130 01  PAY-BNSTRN-PAYAMT PIC S9(013) COMP-3.
000140 01  PAY-BNSTRN-BALAMT PIC S9(013) COMP-3.
000150 01  PAY-BNSTRN-RCVFLG PIC  X(001).
000160 01  PAY-BNSTRN-DEMFLG PIC  X(001).
000170 01  PAY-BNSTRN-PAYFLG PIC  X(001).
000180 01  PAY-BNSTRN-DIFFLG PIC  X(001).
000190 01  PAY-BNSTRN-REGDAY PIC  X(008).
000200 01  PAY-BNSTRN-REGTIM PIC  X(006).
000210 01  PAY-BNSTRN-REGPSN PIC  X(004).
000220 01  PAY-BNSTRN-MODDAY PIC  X(008).
000230 01  PAY-BNSTRN-MODTIM PIC  X(006).
000240 01  PAY-BNSTRN-MODPSN PIC  X(004).
