000010************************************************
000020* (PAY_PRTWRK)
000030************************************************
000040 01  PAY_PRTWRK-OFCCOD PIC  X(004).
000050 01  PAY_PRTWRK-LEVEL1 PIC  X(002).
000060 01  PAY_PRTWRK-LEVEL2 PIC  X(002).
000070 01  PAY_PRTWRK-PAYAMT PIC S9(011) COMP-3.
000080 01  PAY_PRTWRK-CHGAMT PIC S9(005) COMP-3.
000090 01  PAY_PRTWRK-TAXAMT PIC S9(005) COMP-3.
000100 01  PAY_PRTWRK-CHGTOT PIC S9(005) COMP-3.
000110 01  PAY_PRTWRK-PAYCNT PIC S9(005) COMP-3.
