000010************************************************
000020* (PAY_LBLPRT)
000030************************************************
000040 01  PAY_LBLPRT-CTLNUM PIC  X(009).
000050 01  PAY_LBLPRT-DATNUM PIC  X(004).
000060 01  PAY_LBLPRT-BNKCOD PIC  X(004).
000070 01  PAY_LBLPRT-CNTNUM PIC  X(009).
000080 01  PAY_LBLPRT-ZIPLFT PIC  X(007).
000090 01  PAY_LBLPRT-ADRLF1 PIC  X(042).
000100 01  PAY_LBLPRT-ADRLF2 PIC  X(042).
000110 01  PAY_LBLPRT-ADRLF3 PIC  X(042).
000120 01  PAY_LBLPRT-NAMLFT PIC  X(042).
000130 01  PAY_LBLPRT-DIVLFT PIC  X(042).
000140 01  PAY_LBLPRT-TYPLFT PIC  X(001).
000150 01  PAY_LBLPRT-ZIPRGT PIC  X(007).
000160 01  PAY_LBLPRT-ADRRG1 PIC  X(042).
000170 01  PAY_LBLPRT-ADRRG2 PIC  X(042).
000180 01  PAY_LBLPRT-ADRRG3 PIC  X(042).
000190 01  PAY_LBLPRT-NAMRGT PIC  X(042).
000200 01  PAY_LBLPRT-DIVRGT PIC  X(042).
000210 01  PAY_LBLPRT-TYPRGT PIC  X(001).
