000010************************************************
000020* (PAY_ERRLST)
000030************************************************
000040 01  PAY_ERRLST-DATTYP PIC  X(001).
000050 01  PAY_ERRLST-BNKCOD PIC  X(004).
000060 01  PAY_ERRLST-BNKNAM PIC  X(015).
000070 01  PAY_ERRLST-BRCCOD PIC  X(003).
000080 01  PAY_ERRLST-BRCNAM PIC  X(015).
000090 01  PAY_ERRLST-PAYDAY PIC  X(004).
000100 01  PAY_ERRLST-DEPKND PIC  X(001).
000110 01  PAY_ERRLST-DEPNUM PIC  X(007).
000120 01  PAY_ERRLST-CSTNAM PIC  X(030).
000130 01  PAY_ERRLST-TRNAMT PIC S9(010) COMP-3.
000140 01  PAY_ERRLST-TRNTYP PIC  X(001).
000150 01  PAY_ERRLST-TRNNUM PIC  X(004).
000160 01  PAY_ERRLST-DUMMY1 PIC  X(006).
000170 01  PAY_ERRLST-OPEDAY PIC  X(004).
000180 01  PAY_ERRLST-OFCCOD PIC  X(004).
000190 01  PAY_ERRLST-DUMMY2 PIC  X(002).
000200 01  PAY_ERRLST-PAYTYP PIC  X(001).
000210 01  PAY_ERRLST-USRDEP PIC  X(008).
000220 01  PAY_ERRLST-CHGAMT PIC S9(005) COMP-3.
000230 01  PAY_ERRLST-BNKSEQ PIC  X(001).
000240 01  PAY_ERRLST-REGDAY PIC  X(008).
000250 01  PAY_ERRLST-REGTIM PIC  X(006).
000260 01  PAY_ERRLST-REGPSN PIC  X(004).
000270 01  PAY_ERRLST-MODDAY PIC  X(008).
000280 01  PAY_ERRLST-MODTIM PIC  X(006).
000290 01  PAY_ERRLST-MODPSN PIC  X(004).
000300 01  PAY_ERRLST-ERRFLG PIC  X(005).
