000010************************************************
000020* (PAY_EXPJOB)
000030************************************************
000040 01  PAY_EXPJOB-OPEDAY PIC  X(008).
000050 01  PAY_EXPJOB-PAYDAY PIC  X(008).
000060 01  PAY_EXPJOB-GETTXT PIC  X(001).
000070 01  PAY_EXPJOB-DATMAK PIC  X(001).
000080 01  PAY_EXPJOB-LSTPRT PIC  X(001).
000090 01  PAY_EXPJOB-PUTFDD PIC  X(001).
000100 01  PAY_EXPJOB-SNDDAT PIC  X(001).
