000010************************************************
000020* (PAY_BNSTMP)
000030************************************************
000040 01  PAY_BNSTMP-CNTNUM PIC  X(009).
000050 01  PAY_BNSTMP-RELEAS PIC  X(001).
000060 01  PAY_BNSTMP-RECNUM PIC  X(004).
000070 01  PAY_BNSTMP-TRNTYP PIC  X(001).
000080 01  PAY_BNSTMP-PAYCLT PIC  X(008).
000090 01  PAY_BNSTMP-PLNDAY PIC  X(008).
000100 01  PAY_BNSTMP-TRNDAY PIC  X(008).
000110 01  PAY_BNSTMP-PAYDAY PIC  X(008).
000120 01  PAY_BNSTMP-RCVAMT PIC S9(013) COMP-3.
000130 01  PAY_BNSTMP-PAYAMT PIC S9(013) COMP-3.
000140 01  PAY_BNSTMP-BALAMT PIC S9(013) COMP-3.
000150 01  PAY_BNSTMP-RCVFLG PIC  X(001).
000160 01  PAY_BNSTMP-DEMFLG PIC  X(001).
000170 01  PAY_BNSTMP-PAYFLG PIC  X(001).
000180 01  PAY_BNSTMP-DIFFLG PIC  X(001).
000190 01  PAY_BNSTMP-REGDAY PIC  X(008).
000200 01  PAY_BNSTMP-REGTIM PIC  X(006).
000210 01  PAY_BNSTMP-REGPSN PIC  X(004).
000220 01  PAY_BNSTMP-MODDAY PIC  X(008).
000230 01  PAY_BNSTMP-MODTIM PIC  X(006).
000240 01  PAY_BNSTMP-MODPSN PIC  X(004).
