000010************************************************
000020* (PAY_BNSUPL)
000030************************************************
000040 01  PAY_BNSUPL-OFCCOD PIC  X(004).
000050 01  PAY_BNSUPL-CNTNUM PIC  X(009).
000060 01  PAY_BNSUPL-RELEAS PIC  X(001).
000070 01  PAY_BNSUPL-RECNUM PIC  X(004).
000080 01  PAY_BNSUPL-PAYCLT PIC  X(008).
000090 01  PAY_BNSUPL-PAYNAM PIC  X(060).
000100 01  PAY_BNSUPL-PAYDAY PIC  X(008).
000110 01  PAY_BNSUPL-DIVCOD PIC  X(004).
000120 01  PAY_BNSUPL-EXPCOD PIC  X(003).
000130 01  PAY_BNSUPL-TRNAMT PIC S9(013) COMP-3.
000140 01  PAY_BNSUPL-TRNTAX PIC S9(013) COMP-3.
000150 01  PAY_BNSUPL-PAYAMT PIC S9(013) COMP-3.
000160 01  PAY_BNSUPL-CHGAMT PIC S9(013) COMP-3.
000170 01  PAY_BNSUPL-CHGTAX PIC S9(013) COMP-3.
000180 01  PAY_BNSUPL-TAXRAT PIC S9(002)V9(1) COMP-3.
000190 01  PAY_BNSUPL-REMARK PIC  X(046).
000200 01  PAY_BNSUPL-CHGTYP PIC  X(001).
000210 01  PAY_BNSUPL-TRNNUM PIC  X(010).
000220 01  PAY_BNSUPL-ERRFLG PIC  X(001).
000230 01  PAY_BNSUPL-REGDAY PIC  X(008).
000240 01  PAY_BNSUPL-REGTIM PIC  X(006).
000250 01  PAY_BNSUPL-REGPSN PIC  X(004).
000260 01  PAY_BNSUPL-MODDAY PIC  X(008).
000270 01  PAY_BNSUPL-MODTIM PIC  X(006).
000280 01  PAY_BNSUPL-MODPSN PIC  X(004).
