000010************************************************
000020* (PLP_PRTWRK)
000030************************************************
000040 01  PLP_PRTWRK-FISYER PIC  X(002).
000050 01  PLP_PRTWRK-PRTSEQ PIC  X(002).
000060 01  PLP_PRTWRK-BASMON PIC  X(006).
000070 01  PLP_PRTWRK-DIVCOD PIC  X(004).
000080 01  PLP_PRTWRK-ACCTYP PIC  X(002).
000090 01  PLP_PRTWRK-APPAMT PIC S9(013) COMP-3.
000100 01  PLP_PRTWRK-APPART PIC S9(013) COMP-3.
000110 01  PLP_PRTWRK-APPINT PIC S9(013) COMP-3.
000120 01  PLP_PRTWRK-APPCST PIC S9(013) COMP-3.
000130 01  PLP_PRTWRK-APPBAL PIC S9(013) COMP-3.
000140 01  PLP_PRTWRK-APPPRE PIC S9(013) COMP-3.
000150 01  PLP_PRTWRK-COLLEA PIC S9(013) COMP-3.
000160 01  PLP_PRTWRK-COLCAP PIC S9(013) COMP-3.
000170 01  PLP_PRTWRK-COLCST PIC S9(013) COMP-3.
000180 01  PLP_PRTWRK-COLBAL PIC S9(013) COMP-3.
000190 01  PLP_PRTWRK-CHGTAX PIC S9(013) COMP-3.
000200 01  PLP_PRTWRK-CHGINS PIC S9(013) COMP-3.
000210 01  PLP_PRTWRK-CHGMNT PIC S9(013) COMP-3.
000220 01  PLP_PRTWRK-CHGOT1 PIC S9(013) COMP-3.
000230 01  PLP_PRTWRK-CHGOT2 PIC S9(013) COMP-3.
000240 01  PLP_PRTWRK-BALDEB PIC S9(013) COMP-3.
000250 01  PLP_PRTWRK-BALCST PIC S9(013) COMP-3.
000260 01  PLP_PRTWRK-BALGRT PIC S9(013) COMP-3.
000270 01  PLP_PRTWRK-BALEST PIC S9(013) COMP-3.
000280 01  PLP_PRTWRK-BALPRE PIC S9(013) COMP-3.
000290 01  PLP_PRTWRK-FNCCAP PIC S9(013) COMP-3.
000300 01  PLP_PRTWRK-FNCCOL PIC S9(013) COMP-3.
000310 01  PLP_PRTWRK-FNCBAL PIC S9(013) COMP-3.
000320 01  PLP_PRTWRK-FNCAVE PIC S9(013) COMP-3.
000330 01  PLP_PRTWRK-FNCINT PIC S9(013) COMP-3.
000340 01  PLP_PRTWRK-FNCUNP PIC S9(013) COMP-3.
000350 01  PLP_PRTWRK-DEFCST PIC S9(013) COMP-3.
000360 01  PLP_PRTWRK-DEFPRF PIC S9(013) COMP-3.
000370 01  PLP_PRTWRK-DEFBAL PIC S9(013) COMP-3.
000380 01  PLP_PRTWRK-RDMLEA PIC S9(013) COMP-3.
000390 01  PLP_PRTWRK-RDMAMT PIC S9(013) COMP-3.
000400 01  PLP_PRTWRK-RDMPRF PIC S9(013) COMP-3.
000410 01  PLP_PRTWRK-RDMUNP PIC S9(013) COMP-3.
000420 01  PLP_PRTWRK-RDMCRE PIC S9(013) COMP-3.
000430 01  PLP_PRTWRK-RATAPP PIC S9(013) COMP-3.
000440 01  PLP_PRTWRK-RATLEA PIC S9(013) COMP-3.
000450 01  PLP_PRTWRK-RATCAP PIC S9(013) COMP-3.
000460 01  PLP_PRTWRK-RATINT PIC S9(013) COMP-3.
000470 01  PLP_PRTWRK-RATDEB PIC S9(013) COMP-3.
000480 01  PLP_PRTWRK-RATBAL PIC S9(013) COMP-3.
000490 01  PLP_PRTWRK-BIGAVE PIC S9(013) COMP-3.
000500 01  PLP_PRTWRK-BIGINT PIC S9(013) COMP-3.
000510 01  PLP_PRTWRK-SMLAST PIC S9(013) COMP-3.
000520 01  PLP_PRTWRK-SMLBAL PIC S9(013) COMP-3.
000530 01  PLP_PRTWRK-MONRDM PIC S9(013) COMP-3.
000540 01  PLP_PRTWRK-PAYINT PIC S9(013) COMP-3.
000550 01  PLP_PRTWRK-INTRAT PIC S9(002)V9(4) COMP-3.
