000010************************************************
000020* (POK_KEIYAKU_KONYUM)
000030************************************************
000040 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚j‚n‚m‚x‚t‚l|ƒ[ƒJ[ƒR[ƒh 
                                             PIC  X(002).
000050 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚j‚n‚m‚x‚t‚l|w“üæ–¼ PIC  X(060).
000060 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚j‚n‚m‚x‚t‚l|w“üæZŠ 
                                             PIC  X(100).
000070 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚j‚n‚m‚x‚t‚l|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000080 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚j‚n‚m‚x‚t‚l|Žx•¥ðŒ•¶Œ¾ 
                                             PIC  X(050).
