000010************************************************
000020* (SFC_KIHON)
000030************************************************
000040 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ƒVƒƒ[ƒvŒ_–ñ”Ô† PIC  X(012).
000050 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|•ïŠ‡ƒGƒŠƒAƒR[ƒh PIC  X(001).
000080 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|•ïŠ‡ƒGƒŠƒA–¼ PIC  X(060).
000090 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ƒGƒŠƒAƒR[ƒh PIC  X(002).
000100 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Žx“XƒR[ƒh PIC  X(002).
000110 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000120 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000130 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Žæˆøæ–¼ PIC  X(060).
000140 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|âg‹c‚m‚n PIC  X(010).
000160 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000170 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000180 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|‘æ‚P‰ñ“ü‹à“ú PIC  X(008).
000190 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|“ü‹àŠî€“ú PIC  X(002).
000200 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000210 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|‘OŽóŒŽ” PIC S9(002) COMP-3.
000220 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(2) COMP-3.
000230 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000240 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000250 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000260 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000270 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|w“ü‹àŠz PIC S9(013) COMP-3.
000280 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Žd“üÁ”ïÅ“™Šz PIC S9(013) COMP-3.
000290 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000300 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000310 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000320 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000330 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|‘e—˜‰v PIC S9(013) COMP-3.
000340 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Œ_–ñŽÒ–¼ PIC  X(025).
000350 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|Œ_–ñŽÒZŠ PIC  X(050).
000360 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000370 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000380 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000390 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000400 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000410 01  ‚r‚e‚b|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
