000010************************************************
000020* (SIN_YOSINSAKI)
000030************************************************
000040 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|âg‹c‚m‚n PIC  X(010).
000050 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¼Šñ‚¹ƒR[ƒh‚P PIC  X(008).
000060 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|—^Mæ–¼‚P PIC  X(060).
000070 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•ÛØ’S•Û“à—e‚P PIC  X(002).
000080 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•Û‘S”ÍˆÍ‚P PIC  X(002).
000090 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•‰’SŠ„‡‚P PIC S9(003) COMP-3.
000100 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¼Šñ‚¹ƒR[ƒh‚Q PIC  X(008).
000110 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|—^Mæ–¼‚Q PIC  X(060).
000120 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•ÛØ’S•Û“à—e‚Q PIC  X(002).
000130 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•Û‘S”ÍˆÍ‚Q PIC  X(002).
000140 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•‰’SŠ„‡‚Q PIC S9(003) COMP-3.
000150 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¼Šñ‚¹ƒR[ƒh‚R PIC  X(008).
000160 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|—^Mæ–¼‚R PIC  X(060).
000170 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•ÛØ’S•Û“à—e‚R PIC  X(002).
000180 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•Û‘S”ÍˆÍ‚R PIC  X(002).
000190 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•‰’SŠ„‡‚R PIC S9(003) COMP-3.
000200 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¼Šñ‚¹ƒR[ƒh‚S PIC  X(008).
000210 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|—^Mæ–¼‚S PIC  X(060).
000220 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•ÛØ’S•Û“à—e‚S PIC  X(002).
000230 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•Û‘S”ÍˆÍ‚S PIC  X(002).
000240 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•‰’SŠ„‡‚S PIC S9(003) COMP-3.
000250 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¼Šñ‚¹ƒR[ƒh‚T PIC  X(008).
000260 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|—^Mæ–¼‚T PIC  X(060).
000270 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•ÛØ’S•Û“à—e‚T PIC  X(002).
000280 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•Û‘S”ÍˆÍ‚T PIC  X(002).
000290 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|•‰’SŠ„‡‚T PIC S9(003) COMP-3.
000300 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|ƒŠ[ƒXŽc‚‚P PIC S9(006) COMP-3.
000310 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|Š„•ŠŽc‚‚P PIC S9(006) COMP-3.
000320 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|‘Ý•t‹à‘¼Žc‚‚P 
                                             PIC S9(006) COMP-3.
000330 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢ŒŸŽûŽc‚‚P PIC S9(006) COMP-3.
000340 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢’¥Žû‹à‚P PIC S9(006) COMP-3.
000350 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|ƒŠ[ƒXŽc‚‚Q PIC S9(006) COMP-3.
000360 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|Š„•ŠŽc‚‚Q PIC S9(006) COMP-3.
000370 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|‘Ý•t‹à‘¼Žc‚‚Q 
                                             PIC S9(006) COMP-3.
000380 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢ŒŸŽûŽc‚‚Q PIC S9(006) COMP-3.
000390 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢’¥Žû‹à‚Q PIC S9(006) COMP-3.
000400 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|ƒŠ[ƒXŽc‚‚R PIC S9(006) COMP-3.
000410 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|Š„•ŠŽc‚‚R PIC S9(006) COMP-3.
000420 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|‘Ý•t‹à‘¼Žc‚‚R 
                                             PIC S9(006) COMP-3.
000430 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢ŒŸŽûŽc‚‚R PIC S9(006) COMP-3.
000440 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢’¥Žû‹à‚R PIC S9(006) COMP-3.
000450 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|ƒŠ[ƒXŽc‚‚S PIC S9(006) COMP-3.
000460 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|Š„•ŠŽc‚‚S PIC S9(006) COMP-3.
000470 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|‘Ý•t‹à‘¼Žc‚‚S 
                                             PIC S9(006) COMP-3.
000480 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢ŒŸŽûŽc‚‚S PIC S9(006) COMP-3.
000490 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢’¥Žû‹à‚S PIC S9(006) COMP-3.
000500 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|ƒŠ[ƒXŽc‚‚T PIC S9(006) COMP-3.
000510 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|Š„•ŠŽc‚‚T PIC S9(006) COMP-3.
000520 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|‘Ý•t‹à‘¼Žc‚‚T 
                                             PIC S9(006) COMP-3.
000530 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢ŒŸŽûŽc‚‚T PIC S9(006) COMP-3.
000540 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|–¢’¥Žû‹à‚T PIC S9(006) COMP-3.
000550 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|“o˜^“ú PIC  X(008).
000560 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|“o˜^Žž PIC  X(006).
000570 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000580 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|XV“ú PIC  X(008).
000590 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|XVŽž PIC  X(006).
000600 01  ‚r‚h‚m|‚x‚n‚r‚h‚m‚r‚`‚j‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
