000010************************************************
000020* (SIN_BUKKEN)
000030************************************************
000040 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|âg‹c‚m‚n PIC  X(010).
000050 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Ž‘ŽYƒR[ƒh PIC  X(007).
000070 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Ž‘ŽY–¼ PIC  X(030).
000080 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|»‘¢‹ÆŽÒ PIC  X(060).
000090 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|•¨Œ–¼|Š¿Žš PIC  X(040).
000100 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|w“ü‹àŠz PIC S9(013) COMP-3.
000110 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Žc‰¿•ÛØ‹æ•ª PIC  X(001).
000120 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Žc‰¿Šz PIC S9(013) COMP-3.
000130 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Žc‰¿•ÛØæƒR[ƒh PIC  X(008).
000140 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Žc‰¿•ÛØæ–¼ PIC  X(060).
000150 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|‘Ï—p”N” PIC S9(005) COMP-3.
000160 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|”—Ê PIC S9(004) COMP-3.
000170 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|M—p•ÛŒ¯•t•Û‹æ•ª PIC  X(001).
000180 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|M—p•ÛŒ¯ƒR[ƒh PIC  X(006).
000190 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000200 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000210 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|Ý’uêŠZŠ PIC  X(040).
000220 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|”[•tæƒR[ƒh PIC  X(006).
000230 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000240 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|w“üæ–¼ PIC  X(060).
000250 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|“o˜^“ú PIC  X(008).
000260 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|“o˜^Žž PIC  X(006).
000270 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000280 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|XV“ú PIC  X(008).
000290 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|XVŽž PIC  X(006).
000300 01  ‚r‚h‚m|‚a‚t‚j‚j‚d‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
