000010************************************************
000020* (SIN_KIHON)
000030************************************************
000040 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|âg‹c‚m‚n PIC  X(010).
000050 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|âg‹c‹æ•ª PIC  X(001).
000060 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|\¿“ú PIC  X(008).
000070 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|Œ_–ñ—\’è“ú PIC  X(008).
000080 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ƒƒ“ƒRƒ~•t‹c‚m‚n PIC  X(007).
000090 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|Žæˆøæ‹æ•ª PIC  X(001).
000100 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000110 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000120 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|•¨ŒŠm”FŠî€ PIC  X(001).
000130 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ŒŸŽû—\’è“ú PIC  X(008).
000140 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000150 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ŒvŽZ•ûŽ® PIC  X(001).
000160 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000170 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000180 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000190 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000200 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(2) COMP-3.
000210 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000220 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000230 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿—¦ PIC S9(002)V9(8) COMP-3.
000240 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|‘e—˜‰v PIC S9(013) COMP-3.
000250 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|‘OŽóŒŽ” PIC S9(002) COMP-3.
000260 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|ŒŽŠz•½‹Ï•ÛŽç—¿ PIC S9(013) COMP-3.
000270 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|˜’uŒŽ” PIC S9(002)V9(2) COMP-3.
000280 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000290 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000300 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000310 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000320 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000330 01  ‚r‚h‚m|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
