000010************************************************
000020* (SKY_ISUNAM)
000030************************************************
000040 01  SKY_ISUNAM-ISUTYP PIC  X(001).
000050 01  SKY_ISUNAM-ISUNAM PIC  X(040).
