000010************************************************
000020* (SKY_PRTDEM)
000030************************************************
000040 01  SKY_PRTDEM-CNTNUM PIC  X(009).
000050 01  SKY_PRTDEM-OURDIV PIC  X(004).
000060 01  SKY_PRTDEM-OURTEL PIC  X(015).
000070 01  SKY_PRTDEM-ISUTYP PIC  X(001).
000080 01  SKY_PRTDEM-ISUNAM PIC  X(040).
000090 01  SKY_PRTDEM-CLTCOD PIC  X(008).
000100 01  SKY_PRTDEM-CLTNAM PIC  X(060).
000110 01  SKY_PRTDEM-CLTDIV PIC  X(050).
000120 01  SKY_PRTDEM-ADRTYP PIC  X(001).
000130 01  SKY_PRTDEM-ZIPCOD PIC  X(007).
000140 01  SKY_PRTDEM-CLTADR PIC  X(050).
000150 01  SKY_PRTDEM-CLTAD2 PIC  X(050).
000160 01  SKY_PRTDEM-TELNUM PIC  X(015).
000170 01  SKY_PRTDEM-PAYBGN PIC  X(008).
000180 01  SKY_PRTDEM-PAYEND PIC  X(008).
000190 01  SKY_PRTDEM-PAYDAY PIC  X(008).
000200 01  SKY_PRTDEM-FIXDAY PIC  X(002).
000210 01  SKY_PRTDEM-PAYCYC PIC  X(002).
000220 01  SKY_PRTDEM-PAYTYP PIC  X(001).
000230 01  SKY_PRTDEM-APPLIC PIC  X(020).
000240 01  SKY_PRTDEM-PRTTIM PIC  X(001).
000250 01  SKY_PRTDEM-PRTPTN PIC  X(002).
000260 01  SKY_PRTDEM-PRTMLT PIC  X(001).
000270 01  SKY_PRTDEM-DAYSHW PIC  X(001).
000280 01  SKY_PRTDEM-DEMTYP PIC  X(001).
000290 01  SKY_PRTDEM-ITMNAM PIC  X(040).
000300 01  SKY_PRTDEM-REMARK PIC  X(080).
000310 01  SKY_PRTDEM-REMAR2 PIC  X(080).
000320 01  SKY_PRTDEM-PAYCNT PIC S9(003) COMP-3.
000330 01  SKY_PRTDEM-TOTCNT PIC S9(003) COMP-3.
000340 01  SKY_PRTDEM-DEMCNT PIC S9(003) COMP-3.
000350 01  SKY_PRTDEM-TAXRAT PIC S9(002)V9(2) COMP-3.
000360 01  SKY_PRTDEM-LEAAMT PIC S9(013) COMP-3.
000370 01  SKY_PRTDEM-LEAAMB PIC S9(013) COMP-3.
000380 01  SKY_PRTDEM-MNTCHG PIC S9(013) COMP-3.
000390 01  SKY_PRTDEM-LEATAX PIC S9(013) COMP-3.
000400 01  SKY_PRTDEM-LEATXB PIC S9(013) COMP-3.
000410 01  SKY_PRTDEM-MNTTAX PIC S9(013) COMP-3.
000420 01  SKY_PRTDEM-CNTNM2 PIC  X(009).
000430 01  SKY_PRTDEM-PAYBG2 PIC  X(008).
000440 01  SKY_PRTDEM-APPLI2 PIC  X(020).
000450 01  SKY_PRTDEM-ITMNM2 PIC  X(040).
000460 01  SKY_PRTDEM-PAYCN2 PIC S9(003) COMP-3.
000470 01  SKY_PRTDEM-DEMCN2 PIC S9(003) COMP-3.
000480 01  SKY_PRTDEM-LEAAM2 PIC S9(013) COMP-3.
000490 01  SKY_PRTDEM-MNTCH2 PIC S9(013) COMP-3.
000500 01  SKY_PRTDEM-LEATX2 PIC S9(013) COMP-3.
000510 01  SKY_PRTDEM-MNTTX2 PIC S9(013) COMP-3.
000520 01  SKY_PRTDEM-CNTNM3 PIC  X(009).
000530 01  SKY_PRTDEM-PAYBG3 PIC  X(008).
000540 01  SKY_PRTDEM-APPLI3 PIC  X(020).
000550 01  SKY_PRTDEM-ITMNM3 PIC  X(040).
000560 01  SKY_PRTDEM-PAYCN3 PIC S9(003) COMP-3.
000570 01  SKY_PRTDEM-DEMCN3 PIC S9(003) COMP-3.
000580 01  SKY_PRTDEM-LEAAM3 PIC S9(013) COMP-3.
000590 01  SKY_PRTDEM-MNTCH3 PIC S9(013) COMP-3.
000600 01  SKY_PRTDEM-LEATX3 PIC S9(013) COMP-3.
000610 01  SKY_PRTDEM-MNTTX3 PIC S9(013) COMP-3.
000620 01  SKY_PRTDEM-CNTNM4 PIC  X(009).
000630 01  SKY_PRTDEM-PAYBG4 PIC  X(008).
000640 01  SKY_PRTDEM-APPLI4 PIC  X(020).
000650 01  SKY_PRTDEM-ITMNM4 PIC  X(040).
000660 01  SKY_PRTDEM-PAYCN4 PIC S9(003) COMP-3.
000670 01  SKY_PRTDEM-DEMCN4 PIC S9(003) COMP-3.
000680 01  SKY_PRTDEM-LEAAM4 PIC S9(013) COMP-3.
000690 01  SKY_PRTDEM-MNTCH4 PIC S9(013) COMP-3.
000700 01  SKY_PRTDEM-LEATX4 PIC S9(013) COMP-3.
000710 01  SKY_PRTDEM-MNTTX4 PIC S9(013) COMP-3.
000720 01  SKY_PRTDEM-CNTNM5 PIC  X(009).
000730 01  SKY_PRTDEM-PAYBG5 PIC  X(008).
000740 01  SKY_PRTDEM-APPLI5 PIC  X(020).
000750 01  SKY_PRTDEM-ITMNM5 PIC  X(040).
000760 01  SKY_PRTDEM-PAYCN5 PIC S9(003) COMP-3.
000770 01  SKY_PRTDEM-DEMCN5 PIC S9(003) COMP-3.
000780 01  SKY_PRTDEM-LEAAM5 PIC S9(013) COMP-3.
000790 01  SKY_PRTDEM-MNTCH5 PIC S9(013) COMP-3.
000800 01  SKY_PRTDEM-LEATX5 PIC S9(013) COMP-3.
000810 01  SKY_PRTDEM-MNTTX5 PIC S9(013) COMP-3.
