000010************************************************
000020* (SSF_KEI_MEISAI)
000030************************************************
000040 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|w“üæŽ¯•Ê‚m‚n PIC  X(001).
000070 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|•¨Œ–¼|Š¿Žš PIC  X(040).
000080 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|•¨Œ–¼|ƒJƒi PIC  X(020).
000090 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žd—l»‘¢”Ô† PIC  X(020).
000100 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|»‘¢‹ÆŽÒ PIC  X(060).
000110 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|’P‰¿ PIC S9(013) COMP-3.
000120 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|”—Ê PIC S9(004) COMP-3.
000130 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|w“ü‹àŠz PIC S9(013) COMP-3.
000140 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000150 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000160 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|’†ŒÃ•iƒR[ƒh PIC  X(001).
000170 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“®‘•t•Û‹æ•ª PIC  X(001).
000180 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000190 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“®‘•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000200 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Ž‘ŽYƒR[ƒh PIC  X(007).
000210 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|‘Ï—p”N” PIC S9(002) COMP-3.
000220 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|M—p•ÛŒ¯ƒR[ƒh PIC  X(006).
000230 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Œ^Ž®”Ô† PIC  X(015).
000240 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žc‰¿•ÛØ‹æ•ª PIC  X(001).
000250 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žc‰¿Šz PIC S9(013) COMP-3.
000260 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žc‰¿•ÛØæƒR[ƒh PIC  X(008).
000270 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žc‰¿•ÛØæ–¼ PIC  X(060).
000280 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Å‹æ•ª PIC  X(001).
000290 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Å•‰’SƒR[ƒh PIC  X(001).
000300 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ŒÅ’èŽ‘ŽYÅ—¦ 
                                             PIC S9(002)V9(2) COMP-3.
000310 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“Á—á—¦|•ªŽq 
                                             PIC S9(002) COMP-3.
000320 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“Á—á—¦|•ª•ê 
                                             PIC S9(002) COMP-3.
000330 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“Á—áŠúŠÔ PIC S9(002) COMP-3.
000340 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000350 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼|ƒJƒi PIC  X(020).
000360 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000370 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|”[•tæƒR[ƒh PIC  X(006).
000380 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Ý’uêŠZŠ PIC  X(100).
000390 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚P 
                                             PIC  X(012).
000400 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚Q 
                                             PIC  X(012).
000410 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚R 
                                             PIC  X(012).
000420 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚S 
                                             PIC  X(012).
000430 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žw’è“dŽqŒvŽZ‹@ PIC  X(040).
000440 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|Žg—pŒ Ý’èŽÒ PIC  X(060).
000450 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000460 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“o˜^“ú PIC  X(008).
000470 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“o˜^Žž PIC  X(006).
000480 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000490 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|XV“ú PIC  X(008).
000500 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|XVŽž PIC  X(006).
000510 01  ‚r‚r‚e|‚j‚d‚h|‚l‚d‚h‚r‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
