000010************************************************
000020* (SWP_INTPAY)
000030************************************************
000040 01  SWP_INTPAY-CTLNUM PIC  X(004).
000050 01  SWP_INTPAY-RECNUM PIC  X(004).
000060 01  SWP_INTPAY-INTBGN PIC  X(008).
000070 01  SWP_INTPAY-PAYDAY PIC  X(008).
000080 01  SWP_INTPAY-HOLFLG PIC  X(001).
000090 01  SWP_INTPAY-DAYCNT PIC S9(004) COMP-3.
000100 01  SWP_INTPAY-BALCAP PIC S9(013) COMP-3.
000110 01  SWP_INTPAY-COLAMT PIC S9(013) COMP-3.
000120 01  SWP_INTPAY-RCVRAT PIC S9(002)V9(6) COMP-3.
000130 01  SWP_INTPAY-RCVINT PIC S9(013)V9(2) COMP-3.
000140 01  SWP_INTPAY-RCVYEN PIC S9(013) COMP-3.
000150 01  SWP_INTPAY-PAYRAT PIC S9(002)V9(6) COMP-3.
000160 01  SWP_INTPAY-PAYINT PIC S9(013)V9(2) COMP-3.
000170 01  SWP_INTPAY-PAYYEN PIC S9(013) COMP-3.
000180 01  SWP_INTPAY-DIFINT PIC S9(013)V9(2) COMP-3.
000190 01  SWP_INTPAY-DIFYEN PIC S9(013) COMP-3.
