000010************************************************
000020* (SWP_EXCSWP)
000030************************************************
000040 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ŠÇ—”Ô† PIC  X(004).
000050 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|‹âsƒR[ƒh PIC  X(004).
000060 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|Žx“XƒR[ƒh PIC  X(003).
000070 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|‹âs–¼ PIC  X(050).
000080 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|’÷Œ‹“ú PIC  X(008).
000090 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|•¼ŽíƒR[ƒh PIC  X(003).
000100 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|‘z’èŒ³–{ PIC S9(013) COMP-3.
000110 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|Œ³–{Žc‚ PIC S9(013) COMP-3.
000120 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|–ñ’è•ÙÏŠz PIC S9(013) COMP-3.
000130 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ÅI•ÙÏŠz PIC S9(013) COMP-3.
000140 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|•ÙÏ‰ñ” PIC S9(003) COMP-3.
000150 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ŽóŽæŒÅ’è•Ï“®‹æ•ª PIC  X(001).
000160 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ŽóŽæ—˜—¦Šî” PIC  X(003).
000170 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ŽóŽæ‹à—˜ PIC S9(002)V9(6) COMP-3.
000180 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|Žx•¥ŒÅ’è•Ï“®‹æ•ª PIC  X(001).
000190 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|Žx•¥—˜—¦Šî” PIC  X(003).
000200 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|Žx•¥‹à—˜ PIC S9(002)V9(6) COMP-3.
000210 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ƒ}[ƒWƒ“ PIC S9(002)V9(6) COMP-3.
000220 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|‹x“úˆ—‹æ•ª PIC  X(001).
000230 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ŒŽ––ŒÅ’è‹æ•ª PIC  X(001).
000240 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|’[”ˆ—‹æ•ª PIC  X(001).
000250 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|‰~Š·ŽZ‘Šê PIC S9(004)V9(2) COMP-3.
000260 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ŒvŽZŠJŽn“ú PIC  X(008).
000270 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|ÅIŠú“ú PIC  X(008).
000280 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|Œ_–ñŒŽ” PIC S9(003) COMP-3.
000290 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|—˜•¥ƒTƒCƒNƒ‹ PIC  X(002).
000300 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|—˜•¥˜’uŒŽ” PIC  X(002).
000310 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|Ž‘‹àŒ´‰¿‹æ•ª PIC  X(001).
000320 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|”õl PIC  X(050).
000330 01  ‚r‚v‚o|‚d‚w‚b‚r‚v‚o|XV•WŽ¯ PIC  X(001).
