000010************************************************
000020* (TSL_BNKMST)
000030************************************************
000040 01  TSL_BNKMST-BNKCOD PIC  X(004).
000050 01  TSL_BNKMST-BNKNAM PIC  X(020).
000060 01  TSL_BNKMST-KANNAM PIC  X(020).
000070 01  TSL_BNKMST-PRFCOD PIC  X(002).
000080 01  TSL_BNKMST-BRCCNT PIC S9(003) COMP-3.
