000010************************************************
000020* (ZJK_OVRTIM)
000030************************************************
000040 01  ZJK_OVRTIM-BASYER PIC  X(004).
000050 01  ZJK_OVRTIM-UPDMON PIC  X(002).
000060 01  ZJK_OVRTIM-PSNCOD PIC  X(007).
000070 01  ZJK_OVRTIM-PSNNAM PIC  X(018).
000080 01  ZJK_OVRTIM-SEXTYP PIC  X(001).
000090 01  ZJK_OVRTIM-DIVCOD PIC  X(004).
000100 01  ZJK_OVRTIM-PRTSEQ PIC  X(003).
000110 01  ZJK_OVRTIM-MONATM PIC S9(004) COMP-3.
000120 01  ZJK_OVRTIM-MONBTM PIC S9(004) COMP-3.
000130 01  ZJK_OVRTIM-MONCTM PIC S9(004) COMP-3.
000140 01  ZJK_OVRTIM-MONDTM PIC S9(004) COMP-3.
000150 01  ZJK_OVRTIM-MONETM PIC S9(004) COMP-3.
000160 01  ZJK_OVRTIM-MONVAC PIC S9(002) COMP-3.
000170 01  ZJK_OVRTIM-MONHOL PIC S9(002) COMP-3.
000180 01  ZJK_OVRTIM-YERATM PIC S9(006) COMP-3.
000190 01  ZJK_OVRTIM-YERBTM PIC S9(006) COMP-3.
000200 01  ZJK_OVRTIM-YERCTM PIC S9(006) COMP-3.
000210 01  ZJK_OVRTIM-YERDTM PIC S9(006) COMP-3.
000220 01  ZJK_OVRTIM-YERETM PIC S9(006) COMP-3.
000230 01  ZJK_OVRTIM-YERVAC PIC S9(003) COMP-3.
000240 01  ZJK_OVRTIM-YERHOL PIC S9(003) COMP-3.
000250 01  ZJK_OVRTIM-ATMHOR PIC S9(003) COMP-3.
000260 01  ZJK_OVRTIM-ATMMIN PIC S9(002) COMP-3.
000270 01  ZJK_OVRTIM-BTMHOR PIC S9(003) COMP-3.
000280 01  ZJK_OVRTIM-BTMMIN PIC S9(002) COMP-3.
000290 01  ZJK_OVRTIM-CTMHOR PIC S9(003) COMP-3.
000300 01  ZJK_OVRTIM-CTMMIN PIC S9(002) COMP-3.
000310 01  ZJK_OVRTIM-DTMHOR PIC S9(003) COMP-3.
000320 01  ZJK_OVRTIM-DTMMIN PIC S9(002) COMP-3.
000330 01  ZJK_OVRTIM-ETMHOR PIC S9(003) COMP-3.
000340 01  ZJK_OVRTIM-ETMMIN PIC S9(002) COMP-3.
