000010************************************************
000020* ŽO—mU•ªŒãÄƒŠ[ƒXƒf[ƒ^(ZZPS0005)
000030************************************************
000040 01  ‚y‚y‚o‚r‚O‚O‚O‚T|‚a‚n‚s‚kŒ_–ñ‚m‚n PIC  X(009).
000050 01  ‚y‚y‚o‚r‚O‚O‚O‚T|‚a‚n‚s‚k•¨Œ‚m‚n PIC  X(003).
000060 01  ‚y‚y‚o‚r‚O‚O‚O‚T|ÄƒŠ[ƒX‚b‚c PIC  X(001).
000070 01  ‚y‚y‚o‚r‚O‚O‚O‚T|¿‹‹àŠz‡Œv PIC S9(013) COMP-3.
000080 01  ‚y‚y‚o‚r‚O‚O‚O‚T|•¨Œ–¼ PIC  X(030).
000090 01  ‚y‚y‚o‚r‚O‚O‚O‚T|ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P PIC  X(010).
000100 01  ‚y‚y‚o‚r‚O‚O‚O‚T|ƒŠ[ƒXI—¹“ú|¢‹I PIC  X(001).
000110 01  ‚y‚y‚o‚r‚O‚O‚O‚T|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000120 01  ‚y‚y‚o‚r‚O‚O‚O‚T|”—Ê PIC S9(004) COMP-3.
000130 01  ‚y‚y‚o‚r‚O‚O‚O‚T|ƒ_ƒ~[‚O‚O‚P PIC  X(029).
