000010******************************************************************
000020*         ＜海輝軟件(大連)＞                                     *
000030*      1. プログラム名  : 汎用請求テーブル                       *
000040*      2. プログラムID  : COBIS460                               *
000050*      3. 処理概要      : SUMMIT.請求明細情報全件処理にて、      *
000060*                                                                *
000070*      4. 作成者        : 李貫宇                                 *
000080*      5. 作成日        : 2004.10.10                             *
000090******************************************************************
000100*                                                                 
000110******************************************************************
000120*    ＩＤＥＮＴＩＦＩＣＡＴＩＯＮ  ＤＩＶＩＳＩＯＮ              *
000130******************************************************************
000140 IDENTIFICATION                       DIVISION.                   
000150*                                                                 
000160 PROGRAM-ID.                          COBIS460.                   
000170******************************************************************
000180*    ＥＮＶＩＲＯＮＭＥＮＴ        ＤＩＶＩＳＩＯＮ              *
000190******************************************************************
000200 ENVIRONMENT                          DIVISION.                   
000210******************************************************************
000220*    ＤＡＴＡ                      ＤＩＶＩＳＩＯＮ              *
000230******************************************************************
000240 DATA                                 DIVISION.                   
000250******************************************************************
000260*  ＷＯＲＫＩＮＧーＳＴＯＲＡＧＥ  ＳＥＣＴＩＯＮ                *
000270******************************************************************
000280  WORKING-STORAGE                     SECTION.                    
000290*----------------------------------------------------------------*
000300*    ホスト変数定義エリア                                        *
000310*----------------------------------------------------------------*
000320     EXEC  SQL  BEGIN  DECLARE        SECTION  END-EXEC.          
000330   01  ＷＳー銀行ＣＤ                 PIC  9(07).
000344*                                                                 
000390*--< ＯＲＡＣＬＥ共通変数 >                                       
000391     EXEC  SQL  INCLUDE  SQLCOM.CBL             END-EXEC.         
000392*                                                                 
000393*--< ＯＲＡＣＬＥ ＳＱＬ実行情報 (SQLCA) >                        
000394     EXEC  SQL  INCLUDE  SQLCA.COB              END-EXEC.         
000395*                                                                 
000400*--< SUMMIT請求明細 >                                            
000410     EXEC  SQL  INCLUDE  LTRSKM.CBL           END-EXEC.          
000420*                                                                 
000430*--<移行後_契約内容>                                                
000440     EXEC  SQL  INCLUDE  D31KYK.CBL            END-EXEC.          
000450*                                                                 
000460*--< 移行後_受取口座マスタ>                                                  
000470     EXEC  SQL  INCLUDE  D05GKO.CBL            END-EXEC.          
000480*
000490*--< 汎用請求ＤＢ>                                                  
000500     EXEC  SQL  INCLUDE  D40HSQ.CBL            END-EXEC.          
000510*
000520*--< 共通>                                                  
000530     EXEC  SQL  INCLUDE  IKOTBL001.CBL         END-EXEC.          
000540*
000550*--< 共通>                                                  
000560     EXEC  SQL  INCLUDE  IKOTBL002.CBL         END-EXEC.
000570*
000580*--< 共通>                                                  
000590     EXEC  SQL  INCLUDE  IKOTBL005.CBL         END-EXEC.
000600
000610*          
000620     EXEC  SQL  END  DECLARE          SECTION  END-EXEC.          
000630*                                                                 
000640*----------------------------------------------------------------*
000650*    ＷＯＲＫエリア                                              *
000660*----------------------------------------------------------------*
000661 01  ＷＯＲＫーエリア.
000662   03  ＷＳーＬＴＲＳＫＭ－銀行ＣＤ   PIC  X(07).
000664   03  ＷＳー消込連番                 PIC  X(11).
000665   03  ＷＳー消込連番年               PIC  X(2).
000666   03  ＷＳー消込連番月日             PIC  X(4).
000667   03  ＷＳー消込連番連               PIC  X(5).
000668   03  ＷＳー銀行コード               PIC  X(04).
000669   03  ＷＳー支店コード               PIC  X(03).
000670   03  ＷＳー消込金額                   PIC S9(13).
000671   03  ＷＳー連番                       PIC S9(06) .
000672*
000674   03  ＷＳー請求年月日               PIC  X(08).            
000675   03  ＷＳー消込年月日               PIC  X(08).
000680
000683   03 ＷＳー消込日                     PIC  X(02). 
000684   03 ＷＳー回収金額                   PIC S9(13).
000685   03 ＷＳー回収消費税                 PIC S9(13).
000686   03 ＷＳー未回収金額                 PIC S9(13).
000687   03 ＯＬＤー取引先コード             PIC  X(09).
000688   03 ＯＬＤー請求先コード             PIC  X(05).                                                   
000689*                                                                 
000690*                                                                 
000890*--< エラー判定用 >                                               
000900     03  Ｗーエラーコード             PIC S9(04).                 
000910*                                                                 
000920*--< フラグアリア >                                               
000930     03  フラグアリア.                                            
000940         05  Ｗー終了ーフラグ         PIC  X(01).                 
000950         05  Ｗー異常終了ーフラグ     PIC  X(01).                 
000960*                                                                 
000970*--< 件数エリア >                                                 
000980     03  件数エリア.                                              
000990         05  Ｗー入力ー件数           PIC  9(09).                 
001000         05  Ｗー出力ー件数           PIC  9(09).                 
001010*                                                                 
001250*--< 共通情報 >                                                   
001260 01  Ｗー共通情報.                                                
001270     03  Ｗーシステム日付.                                        
001280         05  Ｗー世紀                 PIC  X(02) VALUE  "20".     
001290         05  Ｗー年月日               PIC  X(06).                 
001300     03  Ｗーシステム時刻             PIC  X(08).                 
001310     03  Ｗー担当者                   PIC  X(08) VALUE "IKOPG   ".
001320*                                                                 
001330*----------------------------------------------------------------*
001340*    サブルーチン名                                              *
001350*----------------------------------------------------------------*
001360 01  CALL-AREA.                                                   
001370*--< 共通ログサブルーチン >                                       
001380     03  CLOCO001                     PIC  X(08) VALUE "CLOCO001".
001390     03  COBCO001                     PIC  X(08) VALUE "COBCO001".
001400*                                                                 
001410*----------------------------------------------------------------*
001420*    ＣＯＰＹ領域                                                *
001430*----------------------------------------------------------------*
001440*--< 共通ログ用パラメータ >                                       
001450 01  IF-CHOCO001.                                                 
001460     COPY  CHOCO001  REPLACING  ==()==  BY  ==共１ー==.           
001470*                                                                 
001480*----------------------------------------------------------------*
001490*    ＩＮＩファイル読込サブルーチン用パラメタ領域                *
001500*----------------------------------------------------------------*
001510 01  PARA-AREA.                                                   
001520     COPY CPBCO001.                                               
001530******************************************************************
001540*    定数用データ定義エリア                                      *
001550******************************************************************
001560 CONSTANT                             SECTION.                    
001570 01  定数領域.                                                    
001580     03  定数ープログラムＩＤ         PIC  X(08) VALUE "COBIS430".
001590     03  定数ープログラム名           PIC  X(80)                  
001600                                      VALUE  "汎用請求テーブル".        
001610     03  定数ーＳＱＬＯＫ             PIC S9(04)  VALUE  ZERO.    
001620     03  定数ーＳＱＬＥＮＤ           PIC S9(04)  VALUE  0100.    
001630     03  定数ー正常状態               PIC S9(04)  VALUE  ZERO.    
001640     03  定数ー異常状態               PIC S9(04)  VALUE  0009.    
001650******************************************************************
001660*    ＰＲＯＣＥＤＵＲＥ            ＤＩＶＩＳＩＯＮ              *
001670******************************************************************
001680 PROCEDURE                            DIVISION.                   
001690*                                                                 
001700     PERFORM  初期処理.                                           
001710*                                                                 
001720     PERFORM  主処理  UNTIL  Ｗー終了ーフラグ  =  "Y".            
001730*                                                                 
001740     PERFORM  終了処理.                                           
001750*                                                                 
001760     STOP     RUN.                                                
001770*                                                                 
001780******************************************************************
001790*    初期処理                                                    *
001800******************************************************************
001810 初期処理                             SECTION.                    
001820 初期処理ーＳＴＡＲＴ.                                            
001830*                                                                 
001840*----------------------------------------------------------------*
001850*    開始メッセージ出力処理                                      *
001860*----------------------------------------------------------------*
001870     INITIALIZE                       IF-CHOCO001.                
001880     MOVE  "3"                        TO  共１ーイベント種別.     
001890     MOVE  定数ープログラムＩＤ       TO  共１ーソースＩＤ.       
001900     MOVE  "0"                        TO  共１ー復帰コード.       
001910     MOVE  "START"                    TO  共１ー処理識別.         
001920     MOVE  定数ープログラム名         TO  共１ーその他メッセージ. 
001930     CALL  CLOCO001                USING  IF-CHOCO001.            
001940*                                                                 
001950*----------------------------------------------------------------*
001960*    作業領域の初期値処理                                        *
001970*----------------------------------------------------------------*
001980     MOVE  SPACE                      TO  ＷＯＲＫーエリア.       
001990     INITIALIZE                           ＷＯＲＫーエリア.       
002020*                                                                 
002030*--< ＣＰＵ日付を取得 >                                           
002040     ACCEPT  Ｗー年月日               FROM  DATE.                 
002050*                                                                 
002060*--< ＣＰＵ時刻を取得 >                                           
002070     ACCEPT  Ｗーシステム時刻         FROM  TIME.                 
002080*                                                                 
002090*--< ＯＲＡＣＬＥ接続 >                                           
002100     PERFORM   ＯＲＡＣＬＥ接続.                                  
002110*                                                                 
002120*--< 結合テーブルカーソル定義 >                                   
002130     PERFORM  結合テーブルカーソル定義.                           
002140*                                                                 
002150*--< 結合テーブルカーソル読込(１件目) >                           
002160     PERFORM  結合テーブルカーソル読込.                           
002170*                                                                 
002180 初期処理ーＥＸＩＴ.                                              
002190     EXIT.                                                        
002200******************************************************************
002210*    ＯＲＡＣＬＥ接続                                            *
002220******************************************************************
002230 ＯＲＡＣＬＥ接続                     SECTION.                    
002240 ＯＲＡＣＬＥ接続ーＳＴＡＲＴ.                                    
002250*                                                                 
002260*--< ＩＮＩファイル読込サブルーチン呼び出し >                     
002270     CALL  COBCO001                USING  PARA-AREA.              
002280*                                                                 
002290     MOVE  PARA-DBSTRING              TO  DB-STRING.              
002300     MOVE  PARA-USERNAME              TO  USERNAME.               
002310     MOVE  PARA-PASSWORD              TO  PASSWD.                 
002320*                                                                 
002330*----------------------------------------------------------------*
002340*    開始接続                                                    *
002350*----------------------------------------------------------------*
002360     IF  DB-STRING  =  SPACE                                      
002370        EXEC  SQL                                                 
002380           CONNECT  :USERNAME  IDENTIFIED  BY  :PASSWD            
002390        END-EXEC                                                  
002400     ELSE                                                         
002410        EXEC  SQL                                                 
002420           CONNECT  :USERNAME  IDENTIFIED  BY  :PASSWD            
002430             USING  :DB-STRING                                    
002440        END-EXEC                                                  
002450     END-IF.                                                      
002460*                                                                 
002470*----------------------------------------------------------------*
002480*    接続状態判定                                                *
002490*----------------------------------------------------------------*
002500     EVALUATE  SQLCODE                                            
002510        WHEN  定数ーＳＱＬＯＫ                                    
002520*--<       接続正常 >                                             
002530           CONTINUE                                               
002540        WHEN  OTHER                                               
002550*--<       接続エラー >                                           
002560           MOVE     -1                TO  Ｗーエラーコード        
002570           PERFORM  エラー処理                                    
002580     END-EVALUATE.                                                
002590*                                                                 
002600 ＯＲＡＣＬＥ接続ーＥＸＩＴ.                                      
002610     EXIT.                                                        
002620******************************************************************
002630*        結合テーブルカーソル定義                                *
002640******************************************************************
002650 結合テーブルカーソル定義             SECTION.                    
002660 結合テーブルカーソル定義ーＳＴＡＲＴ. 
002670*
002680     EXEC SQL                                                     
002690        DECLARE CUR1  CURSOR FOR                                  
002700           SELECT  LTRSKM.ＫＥＹ項目請求先コード                             
002710                  ,LTRSKM.契約番号                         
002720                  ,LTRSKM.再リースコード    
002730                  ,LTRSKM.勘定処理コード                         
002740                  ,LTRSKM.充当回数
002750                  ,LTRSKM.契約番号                      
002760                  ,D31KYK_TBL.契約番号
002770                  ,D31KYK_TBL.再リース回数
002780                  ,D31KYK_TBL.再リース請求間隔       
002790                  ,LTRSKM.回収方式
002791                  ,LTRSKM.請求発行日＿世紀    
002800                  ,LTRSKM.請求発行日＿年月日     
002810                  ,LTRSKM.請求金額     
002820                  ,LTRSKM.消費税＿金額
002830                  ,LTRSKM.消込日＿世紀 
002840                  ,LTRSKM.消込日＿年月日
002850*                  ,LTRSKM.再リース回数    
002860                  ,LTRSKM.消込通番     
002870                  ,LTRSKM.入金予定日    
002880                  ,LTRSKM.消込金額   
002890                  ,LTRSKM.請求金額     
002900                  ,LTRSKM.請求内訳コード    
002910                  ,LTRSKM.事業所コード    
002920                  ,LTRSKM.長短区分    
002930                  ,LTRSKM.銀行ＣＤ
002931                  ,D05GKO_TBL.銀行短縮コード
002940                  ,D05GKO_TBL.銀行コード
002950                  ,D05GKO_TBL.支店コード
002951                  
002960                  ,LTRSKM.消費税＿消費税コード    
002970                  ,LTRSKM.消費税＿徴収区分   
002980                  ,LTRSKM.総支払回数
002990                  ,LTRSKM.共通情報
003000             FROM  LTRSKM
003010                  ,D31KYK_TBL                    
003020                  ,D05GKO_TBL
003030            WHERE  LTRSKM.内部入金区分       =  2
003031              AND  SUBSTR (LTRSKM.請求内訳コード,1,1) = 'G'
003032              OR   SUBSTR (LTRSKM.請求内訳コード,1,1) = 'Y'                
003040              AND  LTRSKM.消込通番 = 0                          
003050     END-EXEC.
003060*                                                                 
003070*----------------------------------------------------------------*
003080*    カーソルＯＰＥＮ処理                                        *
003090*----------------------------------------------------------------*
003100     EXEC  SQL                                                    
003110        OPEN  CUR1                                                
003120     END-EXEC.                                                    
003130*                                                                 
003140*----------------------------------------------------------------*
003150*    カーソルＯＰＥＮ確認                                        *
003160*----------------------------------------------------------------*
003170     EVALUATE  SQLCODE                                            
003180        WHEN  定数ーＳＱＬＯＫ                                    
003190*--<       正常 >                                                 
003200           CONTINUE                                               
003210        WHEN  OTHER                                               
003220*--<       カーソルＯＰＥＮエラー >                               
003230           MOVE -20                   TO  Ｗーエラーコード        
003240           PERFORM  エラー処理                                
003250     END-EVALUATE.                                                
003260*                                                                 
003270 結合テーブルカーソル定義ーＥＸＩＴ.                              
003280     EXIT.                                                        
003290******************************************************************
003300*    結合テーブルカーソル読込                                    *
003310******************************************************************
003320 結合テーブルカーソル読込             SECTION.                    
003330 結合テーブルカーソル読込ーＳＴＡＲＴ.                            
003340*                                                                 
003350*--< 結合テーブルカーソル読込 >                                   
003360     EXEC SQL                                                     
003370         FETCH  CUR1                                              
003380          INTO      ＬＴＲＳＫＭ－ＫＥＹ項目請求先コード              
003390                  ,:ＬＴＲＳＫＭ－契約番号                         
003400                  ,:ＬＴＲＳＫＭ－再リースコード  
003410                  ,:ＬＴＲＳＫＭ－勘定処理コード                         
003420                  ,:ＬＴＲＳＫＭ－充当回数
003430                  ,:ＬＴＲＳＫＭ－契約番号                      
003440                  ,:Ｄ３１－契約番号
003450                  ,:Ｄ３１－再リース回数
003460                  ,:Ｄ３１－再リース請求間隔
003470                  ,:ＬＴＲＳＫＭ－回収方式
003471                  ,:ＬＴＲＳＫＭ－請求発行日－世紀    
003480                  ,:ＬＴＲＳＫＭ－請求発行日－年月日     
003490                  ,:ＬＴＲＳＫＭ－請求金額     
003500                  ,:ＬＴＲＳＫＭ－消費税－金額
003510                  ,:ＬＴＲＳＫＭ－消込日－世紀 
003520                  ,:ＬＴＲＳＫＭ－消込日－年月日
003530*                 ,:ＬＴＲＳＫＭ－再リース回数    
003540                  ,:ＬＴＲＳＫＭ－消込通番     
003550                  ,:ＬＴＲＳＫＭ－入金予定日    
003560                  ,:ＬＴＲＳＫＭ－消込金額   
003570                  ,:ＬＴＲＳＫＭ－請求金額     
003580                  ,:ＬＴＲＳＫＭ－請求内訳コード    
003590                  ,:ＬＴＲＳＫＭ－事業所コード    
003600                  ,:ＬＴＲＳＫＭ－長短区分    
003610                  ,:ＬＴＲＳＫＭ－銀行ＣＤ
003611                  ,:Ｄ０５－銀行短縮コード
003620                  ,:Ｄ０５－銀行コード
003630                  ,:Ｄ０５－支店コード                  
003640                  ,:ＬＴＲＳＫＭ－消費税－消費税コード    
003650                  ,:ＬＴＲＳＫＭ－消費税－徴収区分   
003660                  ,:ＬＴＲＳＫＭ－総支払回数
003670                  ,:ＬＴＲＳＫＭ－共通情報
003680           END-EXEC.                                                    
003690*                                                                 
003700*----------------------------------------------------------------*
003710*    結合テーブルカーソル読込を確認                              *
003720*----------------------------------------------------------------*
003730*
003740     EVALUATE   SQLCODE                                           
003750        WHEN   定数ーＳＱＬＯＫ                                   
003760*--<       正常 > 
003850           CONTINUE                                                        
003860           COMPUTE  Ｗー入力ー件数  =  Ｗー入力ー件数  +  1       
003870        WHEN   定数ーＳＱＬＥＮＤ                                 
003880*--<       読込終了 >                                             
003890           MOVE  "Y"                  TO  Ｗー終了ーフラグ        
003900        WHEN   OTHER                                              
003910*--<       読込エラー >                                           
003920           MOVE     -30               TO  Ｗーエラーコード        
003930           PERFORM  エラー処理                                
003940     END-EVALUATE.                                                
003950*                                                                 
003960 結合テーブルカーソル読込ーＥＸＩＴ.                              
003970     EXIT.                                                        
003980******************************************************************
003990*    主処理                                                      *
004000******************************************************************
004010 主処理                               SECTION.                    
004020 主処理ーＳＴＡＲＴ.                                              
004030*                                                                 
004040     PERFORM  編集出力処理.                                       
004050*                                                                 
004080*                                                                 
004090*     IF  Ｗー終了ーフラグ  =  "Y"                                 
004100*--<    入力データ終わる時最後出力処理 >                          
004110     PERFORM  出力処理.                                         
004111*--< 結合テーブルカーソル読込（２件目以降） >                     
004112     PERFORM  結合テーブルカーソル読込.                           
004120*     END-IF.                                                      
004130*                                                                 
004140 主処理ーＥＸＩＴ.                                                
004150     EXIT.                                                        
004160******************************************************************
004170*     編集出力処理                                               *
004180******************************************************************
004190 編集出力処理                         SECTION.                    
004200 編集出力処理ーＳＴＡＲＴ.
004210*                                                                 
004510*--<    No.01 >
004520        PERFORM 変換処理１.                                       
004530        MOVE  ＬＴＲＳＫＭ－ＫＥＹ項目請求先コード 
004540                                      TO  Ｄ４０－取引先コード.        
004550*                                                                 
004560*--<    No.02 >
004570        PERFORM 変換処理２.                                           
004580        MOVE  ＬＴＲＳＫＭ－ＫＥＹ項目請求先コード  
004590                                      TO  Ｄ４０－請求先コード.    
004600                                                                  
004610*--<    No.03 >
004620        PERFORM 連番処理.                                                   
004630        MOVE ＷＳー連番               TO  Ｄ４０－連番.  
004640*                                                                
004650*--<    No.04 >                                                   
004660        MOVE  ＬＴＲＳＫＭ－契約番号  TO  Ｄ４０－契約番号.          
004670*                                                                 
004680*--<    No.05 >
004690        PERFORM             再リース回数契約種類処理.                                                   
004700        MOVE  ＩＫＯ００２－再リース回数    
004710                                      TO  Ｄ４０－再リース回数.                                                 
004720*                                                                 
004730*--<    No.06 >
004740        PERFORM             再リース回数契約種類処理.                                                   
004750        MOVE  ＩＫＯ００２－契約種類          
004760                                      TO  Ｄ４０－契約種類.        
004770*                                                                 
004780*--<    No.07 >                                                   
004790        MOVE  ＬＴＲＳＫＭ－充当回数  TO  Ｄ４０－請求回数.        
004800*                                                                 
004810*--<    No.08 > 
004820        PERFORM  請求間隔処理.                                                  
004830        MOVE  Ｄ３１－請求間隔        TO  Ｄ４０－請求間隔.         
004840*                                                                 
004850*--<    No.09 >
004860        PERFORM  回収方法処理.                                                  
004870        MOVE  ＬＴＲＳＫＭ－回収方式  TO  Ｄ４０－回収方法.           
004880*                                                                 
004890*--<    No.10 >
004900        PERFORM  請求年月日処理.                                                  
004910        MOVE  ＷＳー請求年月日        TO  Ｄ４０－請求年月日.      
004920*                                                                 
004930*--<    No.11 >
004940        COMPUTE   Ｄ４０－請求金額 =
004950               ＬＴＲＳＫＭ－請求金額 -
004960                                 ＬＴＲＳＫＭ－消費税－金額.
004970*                                                                 
004980*--<    No.12 >
004990        MOVE  ＬＴＲＳＫＭ－消費税－金額           
005000                                      TO  Ｄ４０－請求消費税.           
005010*                                                                 
005020*--<    No.13 >                                                   
005030        PERFORM  消込年月日処理.                                                  
005040        MOVE   ＷＳー消込年月日       TO  Ｄ４０－消込年月日.
005050*                                                                 
005060*--<    No.14 >
005070        PERFORM  消込通番処理.                                                  
005080        MOVE     ＷＳー消込連番      TO  Ｄ４０－消込通番.       
005090*                                                                 
005100*--<    No.15 >                                                   
005110        MOVE  ＬＴＲＳＫＭ－入金予定日
005120                                      TO  Ｄ４０－回収予定日.         
005130*                                                                 
005140*--<    No.16 >                                                   
005150        PERFORM  消込年月日処理.                                    
005160        MOVE  ＷＳー消込年月日        TO  Ｄ４０－回収年月日.      
005170*
005180*--<    No.17 >
005190        PERFORM 回収金額処理.                                                  
005200        MOVE  ＷＳー回収金額          TO  Ｄ４０－回収金額.    
005210*
005220*--<    No.18 >
005230        PERFORM 回収消費税処理.                                                   
005240        MOVE  ＷＳー回収消費税        TO  Ｄ４０－回収消費税.     
005250                                           
005260*
005270*--<    No.19 >
005280        COMPUTE  Ｄ４０－未回収金額   =  Ｄ４０－請求金額
005290                                      +  Ｄ４０－請求金額
005300                                      -  Ｄ４０－回収金額
005310                                      -  Ｄ４０－回収消費税.
005320*
005330*--<    No.20 >                                                   
005340        MOVE  ＷＳー消込日            TO  Ｄ４０－初回入金日.      
005350*
005360*--<    No.21 >
005370        PERFORM 請求内訳コード処理.                                                   
005380        MOVE  ＩＫＯ００５－新請求内訳コード              
005390                                      TO  Ｄ４０－請求内訳コード.  
005400*
005410*--<    No.22 >                                                   
005420        MOVE  ＬＴＲＳＫＭ－事業所コード              
005430                                      TO Ｄ４０－部課コード.  
005440*
005450*--<    No.23 >                                                   
005460        MOVE  ＬＴＲＳＫＭ－長短区分  TO Ｄ４０－長短区分.     
005470*
005480*--<    No.24 >
005490        PERFORM 銀行短縮コード処理                                                    
005500        MOVE  Ｄ０５－銀行短縮コード   TO  Ｄ４０－銀行短縮コード.  
005510*
005520*--<    No.25 >                                                   
005530        MOVE  ＬＴＲＳＫＭ－消費税－消費税コード             
005540                                      TO  Ｄ４０－消費税コード.
005550*
005560*--<    No.26 >                                                   
005570        MOVE  ＬＴＲＳＫＭ－消費税－徴収区分             
005580                                      TO  Ｄ４０－消費税徴収区分.      
005590*
005600*--<    No.27 >
005610        PERFORM   再リース回数契約種類処理.                                                   
005620        MOVE  ＩＫＯ００２－債権勘定処理コード              
005630                                      TO  Ｄ４０－勘定処理コード.   
005640*
005650*--<    No.28 >                                                   
005660        MOVE  ＬＴＲＳＫＭ－総支払回数             
005670                                      TO  Ｄ４０－総請求回数.   
005680*
005690*--<    No.29 >                                                   
005700        MOVE  Ｗーシステム日付        TO  Ｄ４０－登録年月日.      
005710*
005720*--<    No.30 >                                                   
005730        MOVE  Ｗーシステム時刻        TO  Ｄ４０－登録時間.      
005740*
005750*--<    No.31 >                                                   
005760        MOVE  Ｗー担当者              TO  Ｄ４０－登録担当者.     
005770*
005780*--<    No.32 >                                                   
005790        MOVE  Ｗーシステム日付        TO  Ｄ４０－更新年月日.      
005800*
005810*--<    No.33 >                                                   
005820        MOVE  Ｗーシステム時刻        TO  Ｄ４０－更新時間.     
005830*
005840*--<    No.34 >                                                   
005850        MOVE  Ｗー担当者              TO  Ｄ４０－更新者.     
005860*
005870*--<    No.35 >                                                   
005880        MOVE  Ｗー担当者              TO Ｄ４０－入力担当者コード.      
005890*                                                                
005940*                                                                 
005950  編集出力処理ーＥＸＩＴ.                                          
005960     EXIT.
005970******************************************************************
005980*                 変換処理1                                           *
005990******************************************************************
006000 変換処理１                           SECTION.                    
006010 変換処理１ーＳＴＡＲＴ.                                          
006020*                                                                 
006030     EXEC  SQL                                                    
006040           SELECT  新取引先コード                                 
006050             INTO :ＩＫＯ００１－新取引先コード                   
006060             FROM  IKOTBL001
006070            WHERE  IKOTBL001.新取引先コード                          
006080                            =                           
006090                            :ＬＴＲＳＫＭ－ＫＥＹ項目請求先コード 
006100              AND  IKOTBL001.目的ＣＤ = '3'                       
006110     END-EXEC.                                                    
006120*                                                                 
006130*----------------------------------------------------------------*
006140*    変換処理１確認                                              *
006150*----------------------------------------------------------------*
006160     EVALUATE  SQLCODE                                            
006170        WHEN  定数ーＳＱＬＯＫ                                    
006180*--<       正常 >                                                 
006190           CONTINUE                                               
006200        WHEN  OTHER                                               
006210*--<       変換処理１エラー >                                     
006220           MOVE     SPACE             TO                          
006230                                     ＩＫＯ００１－新取引先コード
006240     END-EVALUATE.                                                
006250*                                                                 
006260  変換処理１ーＥＸＩＴ.                                           
006270     EXIT.
006280******************************************************************
006290*                 変換処理2                                           *
006300******************************************************************
006310 変換処理２                           SECTION.                    
006320 変換処理２ーＳＴＡＲＴ.                                          
006330*                                                                 
006340     EXEC  SQL                                                    
006350           SELECT  枝番                                 
006360             INTO :ＩＫＯ００１－枝番                   
006370             FROM  IKOTBL001                                      
006380            WHERE  IKOTBL001.枝番                          
006390                            =                           
006400                            :ＬＴＲＳＫＭ－ＫＥＹ項目請求先コード 
006410              AND  IKOTBL001.目的ＣＤ = '3'                       
006420     END-EXEC.                                                    
006430*                                                                 
006440*----------------------------------------------------------------*
006450*    変換処理２確認                                              *
006460*----------------------------------------------------------------*
006470     EVALUATE  SQLCODE                                            
006480        WHEN  定数ーＳＱＬＯＫ                                    
006490*--<       正常 >                                                 
006500           CONTINUE                                               
006510        WHEN  OTHER                                               
006520*--<       変換処理１エラー >                                     
006530           MOVE     SPACE             TO                          
006540                                      ＩＫＯ００１－新取引先コード
006550     END-EVALUATE.                                                
006560*                                                                 
006570  変換処理２ーＥＸＩＴ.                                           
006580     EXIT.
006590******************************************************************
006600*                  連番処理                                      *
006610******************************************************************
006620 連番処理                           SECTION.                    
006630 連番処理ーＳＴＡＲＴ.
006640         IF  (   Ｄ４０－取引先コード   NOT  =  
006650                                             ＯＬＤー取引先コード
006660             OR Ｄ４０－請求先コード  
006670                                       NOT  =   
006680                                           ＯＬＤー請求先コード)
006690                MOVE  1                  TO   ＷＳー連番
006700          ELSE
006710         COMPUTE    ＷＳー連番 =  ＷＳー連番  +  1 
006720     END-IF.
006730         MOVE Ｄ４０－取引先コード TO  ＯＬＤー取引先コード.
006740         MOVE Ｄ４０－請求先コード TO  ＯＬＤー請求先コード.
006750 連番処理ーＥＸＩＴ.                                           
006760       EXIT.
006770******************************************************************
006780*                  再リース回数契約種類処理                      *
006790******************************************************************
006800 再リース回数契約種類処理                        SECTION.                    
006810 再リース回数契約種類処理ーＳＴＡＲＴ.
006820*
006830        EXEC SQL
006840           SELECT  再リース回数
006850                  ,契約種類
006860                  ,債権勘定処理コード
006870            INTO  :ＩＫＯ００２－再リース回数
006880                 ,:ＩＫＯ００２－契約種類
006890                 ,:ＩＫＯ００２－債権勘定処理コード
006900            FROM  IKOTBL002
006910           WHERE  IKOTBL002.契約ＮＯ    = :ＬＴＲＳＫＭ－契約番号      
006920             AND  IKOTBL002.再リースコード = 
006930                                    :ＬＴＲＳＫＭ－再リースコード    
006931             AND  IKOTBL002.債権勘定処理コード 
006940                                  = :ＬＴＲＳＫＭ－勘定処理コード
006950        END-EXEC.            
006960*                                                                 
006970 再リース回数契約種類処理ーＥＸＩＴ.                                          
006980        EXIT.                                                  
006990******************************************************************
007000*                 請求間隔処処理                                 *
007010******************************************************************
007020 請求間隔処理                          SECTION.                    
007030 請求間隔処理ーＳＴＡＲＴ.
007040        EXEC SQL
007050           SELECT  請求間隔
007060            INTO  :Ｄ３１－請求間隔
007070            FROM  D31KYK_TBL
007080           WHERE  D31KYK_TBL.契約番号      =  :Ｄ４０－契約番号        
007090             AND  D31KYK_TBL.再リース回数  =  
007100                                             :Ｄ４０－再リース回数
007110       END-EXEC.
007120*
007130*----------------------------------------------------------------*
007140* 検索処理を確認 *
007150*----------------------------------------------------------------*
007160          EVALUATE SQLCODE
007170          WHEN 定数ーＳＱＬＯＫ
007180*--< 正常の時 >
007190          CONTINUE
007200          WHEN OTHER
007210*--< 取得しない、初期値をセット >
007220          MOVE ZERO TO  Ｄ３１－請求間隔
007230          END-EVALUATE.
007250*                                                                 
007260 請求間隔処処理ーＥＸＩＴ.                                          
007270          EXIT.                                                  
007280******************************************************************
007290*                  回収方法                                      *
007300******************************************************************
007310 回収方法処理                          SECTION.                    
007320 回収方法処理ーＳＴＡＲＴ.
007330        IF ＬＴＲＳＫＭ－回収方式 = 1
007340           MOVE ZERO TO  Ｄ４０－回収方法
007350        IF ＬＴＲＳＫＭ－回収方式 = 2
007360           MOVE 5 TO  Ｄ４０－回収方法 
007370        IF  ＬＴＲＳＫＭ－回収方式 = 3
007380           MOVE 3 TO Ｄ４０－回収方法
007390        IF ＬＴＲＳＫＭ－回収方式 = 4
007400           MOVE 4 TO  Ｄ４０－回収方法
007410        ELSE 
007420           MOVE ZERO TO  Ｄ４０－回収方法 
007430        END-IF.                     
007440*
007450 回収方法処理ーＥＸＩＴ.                                           
007460     EXIT.
007470
007480******************************************************************
007490*                  請求年月日処理                                *
007500******************************************************************
007510 請求年月日処理                         SECTION.                    
007520 請求年月日処理ーＳＴＡＲＴ.
007530        IF ＬＴＲＳＫＭ－請求発行日－年月日  = ZERO     
007540           MOVE  ZERO                 TO  ＷＳー請求年月日                       
007550        ELSE IF ＬＴＲＳＫＭ－請求発行日－世紀 = 0   
007600                MOVE  "19"                 TO  
007610                                           ＷＳー請求年月日(1:2) 
007611                MOVE  ＬＴＲＳＫＭ－請求発行日－年月日  
007612                                         TO  
007613                                          ＷＳー請求年月日(3:6)       
007620             ELSE                                                      
007630                MOVE  "20"                 TO  
007640                                            ＷＳー請求年月日(1:2)
007641                MOVE  ＬＴＲＳＫＭ－請求発行日－年月日  
007642                                         TO  
007643                                          ＷＳー請求年月日(3:6)
007650         END-IF.
007660*
007670 請求年月日処理ーＥＸＩＴ.                                           
007680     EXIT.
007690******************************************************************
007700*                  請求年月日処理                                *
007710******************************************************************
007720 消込年月日処理                         SECTION.                    
007730 消込年月日処理ーＳＴＡＲＴ.
007740        IF  ＬＴＲＳＫＭ－消込日－年月日  = ZERO     
007750           MOVE  ZERO                 TO  ＷＳー消込年月日                       
007760        ELSE                                              
007770           MOVE  ＬＴＲＳＫＭ－消込日－年月日  
007780                                         TO  
007790                                          ＷＳー消込年月日(3:6)
007800           IF ＬＴＲＳＫＭ－消込日－世紀 = 0   
007810              MOVE  "19"                 TO  
007820                                           ＷＳー消込年月日(1:2)        
007830           ELSE                                                      
007840              MOVE  "20"                 TO  
007850                                           ＷＳー消込年月日(1:2)
007860        END-IF.
007870*
007880 消込年月日処理ーＥＸＩＴ.                                           
007890     EXIT.
007900******************************************************************
007910*                  消込通番処理                                  *
007920******************************************************************
007930 消込通番処理                         SECTION.                    
007940 消込通番処理ーＳＴＡＲＴ.
007941      MOVE ＬＴＲＳＫＭ－消込日－年月日(1:2) 
007951                                   TO ＷＳー消込連番年.                                            
007965      MOVE   ＷＳー消込連番年  TO  ＷＳー消込連番(1:2).
007966      MOVE   ＬＴＲＳＫＭ－消込通番 TO  ＷＳー消込連番(3:9).
007967     
007971 消込通番処理ーＥＸＩＴ.                                           
008000     EXIT.      
008010******************************************************************
008020*                 回収金額処理                                   *
008030******************************************************************
008040 回収金額処理                         SECTION.                    
008050 回収金額処理ーＳＴＡＲＴ.
008060        IF ＬＴＲＳＫＭ－消込金額 >  ZERO
008070           COMPUTE ＷＳー消込金額     =   ＬＴＲＳＫＭ－消込金額
008080                                      -   
008090                                      ＬＴＲＳＫＭ－消費税－金額
008100        ELSE                                                    
008110           MOVE ZERO                TO  ＷＳー消込金額
008120        END-IF.
008130*
008140 回収金額処理ーＥＸＩＴ.                                           
008150     EXIT.      
008160
008170******************************************************************
008180*           回収消費税処理                                       *
008190******************************************************************
008200 回収消費税処理                             SECTION.                    
008210 回収消費税処理ーＳＴＡＲＴ.
008220*
008230         IF ＬＴＲＳＫＭ－消込金額 >  ZERO
008240            MOVE  ＬＴＲＳＫＭ－消費税－金額           
008250                                      TO  ＷＳー回収消費税
008260         ELSE 
008270            MOVE ZERO                 TO  ＷＳー回収消費税
008280         END-IF.
008290*
008300 回収消費税処理ーＥＸＩＴ.                                           
008310     EXIT.      
008320******************************************************************
008330*    請求内訳コード処理                                          *
008340******************************************************************
008350 請求内訳コード処理                             SECTION.                    
008360 請求内訳コード処理ーＳＴＡＲＴ.                      
008370*                                                                 
008380     EXEC  SQL                                                    
008390           SELECT  新請求内訳コード
008400*                   アクセス区分                                   
008410             INTO :ＩＫＯ００５－新請求内訳コード
008420*                 ,:ＩＫＯ００５ーアクセス区分                   
008430             FROM  IKOTBL005
008440*                   LTRSKM                                     
008450            WHERE  IKOTBL005.アクセス区分      = 'A'                                            
008460              AND  IKOTBL005.現請求内訳コード
008470                                               =
008480                                     :ＬＴＲＳＫＭ－請求内訳コード                       
008490     END-EXEC.
008500*
008510 請求内訳コード処理ーＥＸＩＴ.                                           
008520     EXIT.      
008530
008540******************************************************************
008550*                 銀行短縮コード処理                             *
008560******************************************************************
008570 銀行短縮コード処理                          SECTION.                    
008580 銀行短縮コード処理ーＳＴＡＲＴ.
008590     MOVE Ｄ０５－銀行コード TO    ＷＳー銀行ＣＤ(1:4).
008591     MOVE  Ｄ０５－支店コード TO   ＷＳー銀行ＣＤ(5:3).
008600        EXEC SQL
008620          SELECT  銀行短縮コード
008630            INTO :Ｄ０５－銀行短縮コード
008640            FROM  D05GKO_TBL
008641                 ,LTRSKM         
008650           WHERE  LTRSKM.銀行ＣＤ   =  :ＷＳー銀行ＣＤ
008660       END-EXEC.
008670*
008680*----------------------------------------------------------------*
008690* 検索処理を確認 *
008700*----------------------------------------------------------------*
008710          EVALUATE SQLCODE
008720          WHEN 定数ーＳＱＬＯＫ
008730*--< 正常の時 >
008740          CONTINUE
008750          WHEN OTHER
008760*--< 取得しない、初期値をセット >
008770          MOVE ZERO TO  Ｄ０５－銀行短縮コード
008780          END-EVALUATE.
008800*                                                                 
008810 銀行短縮コード処理ーＥＸＩＴ.                                          
008820          EXIT.                                                                                                                                                                      
008830******************************************************************
008840*    出力処理                                                    *
008850******************************************************************
008860 出力処理                             SECTION.                    
008870 出力処理ーＳＴＡＲＴ.                                            
008880*                                                                 
008890       EXEC  SQL                                                  
008900        INSERT  INTO  D40HSQ_TBL                                  
008910           ( 取引先コード                                             
008920            ,請求先コード                                         
008930            ,連番                                             
008940            ,契約番号                                               
008950            ,再リース回数                                             
008960            ,契約種類                                              
008970            ,請求回数                                             
008980            ,請求間隔                                                 
008990            ,回収方法                                               
009000            ,請求年月日                                          
009010            ,請求金額                                              
009020            ,請求消費税                                   
009030            ,消込年月日                                          
009040            ,消込通番                                             
009050            ,回収予定日
009060            ,回収年月日
009070            ,回収金額
009080            ,回収消費税
009090            ,未回収金額
009100            ,初回入金日
009110            ,請求内訳コード
009120            ,部課コード
009130            ,長短区分
009140            ,銀行短縮コード
009150            ,消費税コード
009160            ,消費税徴収区分
009170            ,勘定処理コード
009180            ,総請求回数
009190            ,登録年月日
009200            ,登録時間
009210            ,登録担当者
009220            ,更新年月日
009230            ,更新時間
009240            ,更新者
009250            ,入力担当者コード)                                       
009260       VALUES                                                     
009270             ( :Ｄ４０－取引先コード                                             
009280            ,:Ｄ４０－請求先コード                                         
009290            ,:Ｄ４０－連番                                             
009300            ,:Ｄ４０－契約番号                                               
009310            ,:Ｄ４０－再リース回数                                             
009320            ,:Ｄ４０－契約種類                                              
009330            ,:Ｄ４０－請求回数                                             
009340            ,:Ｄ４０－請求間隔                                                 
009350            ,:Ｄ４０－回収方法                                               
009360            ,:Ｄ４０－請求年月日                                          
009370            ,:Ｄ４０－請求金額                                              
009380            ,:Ｄ４０－請求消費税                                   
009390            ,:Ｄ４０－消込年月日                                          
009400            ,:Ｄ４０－消込通番                                             
009410            ,:Ｄ４０－回収予定日
009420            ,:Ｄ４０－回収年月日
009430            ,:Ｄ４０－回収金額
009440            ,:Ｄ４０－回収消費税
009450            ,:Ｄ４０－未回収金額
009460            ,:Ｄ４０－初回入金日
009470            ,:Ｄ４０－請求内訳コード
009480            ,:Ｄ４０－部課コード
009490            ,:Ｄ４０－長短区分
009500            ,:Ｄ４０－銀行短縮コード
009510            ,:Ｄ４０－消費税コード
009520            ,:Ｄ４０－消費税徴収区分
009530            ,:Ｄ４０－勘定処理コード
009540            ,:Ｄ４０－総請求回数
009550            ,:Ｄ４０－登録年月日
009560            ,:Ｄ４０－登録時間
009570            ,:Ｄ４０－登録担当者
009580            ,:Ｄ４０－更新年月日
009590            ,:Ｄ４０－更新時間
009600            ,:Ｄ４０－更新者
009610            ,:Ｄ４０－入力担当者コード)                           
009620     END-EXEC.                                                    
009630*                                                                 
009640*----------------------------------------------------------------*
009650*    追加処理を確認                                              *
009660*----------------------------------------------------------------*
009670     EVALUATE  SQLCODE                                            
009680        WHEN   定数ーＳＱＬＯＫ                                   
009690*--<       追加成功 >                                             
009700           COMPUTE  Ｗー出力ー件数  =  Ｗー出力ー件数  +  1       
009710        WHEN   OTHER                                              
009720*--<       追加処理エラー >                                       
009730           MOVE     -40               TO  Ｗーエラーコード        
009740           PERFORM  エラー処理                                
009750     END-EVALUATE.                                                
009760*                                                                 
009770 出力処理ーＥＸＩＴ.                                              
009780     EXIT.                                                        
009790******************************************************************
009800*    終了処理                                                    *
009810******************************************************************
009820 終了処理                             SECTION.                    
009830 終了処理ーＳＴＡＲＴ.                                            
009840*                                                                 
009850     PERFORM  ＤＢクローズ処理.                                   
009860*                                                                 
009870     PERFORM  ＤＢコミット処理.                                   
009880*                                                                 
009890     PERFORM  終了メッセージ出力.                                 
009900*                                                                 
009910*--< プログラム正常終了 >                                         
009920     MOVE  定数ー正常状態             TO  PROGRAM-STATUS.         
009930*                                                                 
009940 終了処理ーＥＸＩＴ.                                              
009950     EXIT.                                                        
009960******************************************************************
009970*    終了メッセージ出力                                          *
009980******************************************************************
009990 終了メッセージ出力                   SECTION.                    
010000 終了メッセージ出力ーＳＴＡＲＴ.                                  
010010*                                                                 
010020*----------------------------------------------------------------*
010030*    件数メッセージ出力処理                                      *
010040*----------------------------------------------------------------*
010050     INITIALIZE                       IF-CHOCO001.                
010060     MOVE  "3"                        TO  共１ーイベント種別.     
010070     MOVE  定数ープログラムＩＤ       TO  共１ーソースＩＤ.       
010080     MOVE  "0"                        TO  共１ー復帰コード.       
010090     MOVE  "LTRSKM"                  TO  共１ー処理テーブルＩＤ. 
010100     MOVE  "COUNT"                    TO  共１ー処理識別.         
010110     MOVE  Ｗー入力ー件数             TO  共１ーデータ内容.       
010120     MOVE  "SUMMIT請求明細入力件数"                         
010130                                      TO  共１ーその他メッセージ. 
010140     CALL  CLOCO001                USING  IF-CHOCO001.            
010150*                                                                 
010160     INITIALIZE                       IF-CHOCO001.                
010170     MOVE  "3"                        TO  共１ーイベント種別.     
010180     MOVE  定数ープログラムＩＤ       TO  共１ーソースＩＤ.       
010190     MOVE  "0"                        TO  共１ー復帰コード.       
010200     MOVE  "D40HSQ"                   TO  共１ー処理テーブルＩＤ. 
010210     MOVE  "COUNT"                    TO  共１ー処理識別.         
010220     MOVE  Ｗー出力ー件数             TO  共１ーデータ内容.       
010230     MOVE  "汎用請求DB出力件数"       TO  共１ーその他メッセージ. 
010240     CALL  CLOCO001                USING  IF-CHOCO001.            
010250*                                                                 
010260*----------------------------------------------------------------*
010270*    終了メッセージ出力                                          *
010280*----------------------------------------------------------------*
010290     INITIALIZE                       IF-CHOCO001.                
010300     MOVE  "3"                        TO  共１ーイベント種別.     
010310     MOVE  定数ープログラムＩＤ       TO  共１ーソースＩＤ.       
010320     MOVE  "0"                        TO  共１ー復帰コード.       
010330     MOVE  "END"                      TO  共１ー処理識別.         
010340     MOVE  定数ープログラム名         TO  共１ーその他メッセージ. 
010350     CALL  CLOCO001                USING  IF-CHOCO001.            
010360*                                                                 
010370 終了メッセージ出力ーＥＸＩＴ.                                    
010380     EXIT.                                                        
010390******************************************************************
010400*    ＤＢクローズ                                                *
010410******************************************************************
010420 ＤＢクローズ処理                     SECTION.                    
010430 ＤＢクローズ処理ーＳＴＡＲＴ.                                    
010440*                                                                 
010450*--< カーソル クローズ >                                          
010460     EXEC SQL                                                     
010470        CLOSE  CUR1                                               
010480     END-EXEC.                                                    
010490*                                                                 
010500 ＤＢクローズ処理ーＥＸＩＴ.                                      
010510     EXIT.                                                        
010520******************************************************************
010530*    ＤＢコミット処理                                            *
010540******************************************************************
010550 ＤＢコミット処理                     SECTION.                    
010560 ＤＢコミット処理ーＳＴＡＲＴ.                                    
010570*                                                                 
010580     EXEC  SQL                                                    
010590        COMMIT  WORK  RELEASE                                     
010600     END-EXEC.                                                    
010610*                                                                 
010620     INITIALIZE                       IF-CHOCO001.                
010630     MOVE  "3"                        TO  共１ーイベント種別.     
010640     MOVE  定数ープログラムＩＤ       TO  共１ーソースＩＤ.       
010650     MOVE  "0"                        TO  共１ー復帰コード.       
010660     MOVE  "COMMIT"                   TO  共１ー処理識別.         
010670     MOVE  "コミット実施"             TO  共１ーその他メッセージ. 
010680     CALL  CLOCO001                USING  IF-CHOCO001.            
010690*                                                                 
010700 ＤＢコミット処理ーＥＸＩＴ.                                      
010710     EXIT.                                                        
010720******************************************************************
010730*    ＤＢロールバック処理                                        *
010740******************************************************************
010750 ＤＢロールバック処理                 SECTION.                    
010760 ＤＢロールバック処理ーＳＴＡＲＴ.                                
010770*                                                                 
010780     EXEC  SQL                                                    
010790        ROLLBACK WORK  RELEASE                                    
010800     END-EXEC.                                                    
010810*                                                                 
010820     INITIALIZE                       IF-CHOCO001.                
010830     MOVE  "1"                        TO  共１ーイベント種別.     
010840     MOVE  定数ープログラムＩＤ       TO  共１ーソースＩＤ.       
010850     MOVE  "9"                        TO  共１ー復帰コード.       
010860     MOVE  "ROLLBACK"                 TO  共１ー処理識別.         
010870     MOVE  "ロールバック実施"         TO  共１ーその他メッセージ. 
010880     CALL  CLOCO001                USING  IF-CHOCO001.            
010890*                                                                 
010900 ＤＢロールバック処理ーＥＸＩＴ.                                  
010910     EXIT.                                                        
010920******************************************************************
010930*    エラー処理                                                  *
010940******************************************************************
010950 エラー処理                       SECTION.                    
010960 エラー処理ーＳＴＡＲＴ.                                      
010970*                                                                 
010980     MOVE  "Y"                        TO Ｗー異常終了ーフラグ.    
010990     INITIALIZE                           IF-CHOCO001.            
011000*                                                                 
011010     EVALUATE  Ｗーエラーコード                                   
011020        WHEN  -10                                                 
011030*--<       ＯＲＡＣＬＥ接続失敗 >                                 
011040           MOVE  "1"                  TO  共１ーイベント種別      
011050           MOVE  定数ープログラムＩＤ TO  共１ーソースＩＤ        
011060           MOVE  "9"                  TO  共１ー復帰コード        
011070           MOVE  "CONNECT"            TO  共１ー処理識別          
011080           MOVE  SQLCODE              TO  共１ーデータ内容        
011090           MOVE  SQLERRMC             TO  共１ーその他メッセージ  
011100           CALL  CLOCO001          USING  IF-CHOCO001             
011110*                                                                 
011120        WHEN  -20                                                 
011130*--<       結合テーブルカーソルオープン失敗 >                     
011140           MOVE  "1"                  TO  共１ーイベント種別      
011150           MOVE  定数ープログラムＩＤ TO  共１ーソースＩＤ        
011160           MOVE  "9"                  TO  共１ー復帰コード        
011170           MOVE  "LTRSKY"             TO  共１ー処理テーブルＩＤ  
011180           MOVE  "OPEN"               TO  共１ー処理識別          
011190           MOVE  SQLCODE              TO  共１ーデータ内容        
011200           MOVE  SQLERRMC             TO  共１ーその他メッセージ  
011210           CALL  CLOCO001          USING  IF-CHOCO001             
011220*                                                                 
011230        WHEN  -30                                                 
011240*--<       結合テーブル読込失敗 >                                 
011250           MOVE  "1"                  TO  共１ーイベント種別      
011260           MOVE  定数ープログラムＩＤ TO  共１ーソースＩＤ        
011270           MOVE  "9"                  TO  共１ー復帰コード        
011280           MOVE  "LTRSKM"             TO  共１ー処理テーブルＩＤ  
011290           MOVE  "FETCH"              TO  共１ー処理識別          
011300           MOVE  SQLCODE              TO  共１ーデータ内容        
011310           MOVE  SQLERRMC             TO  共１ーその他メッセージ  
011320           CALL  CLOCO001          USING  IF-CHOCO001             
011330*                                                                 
011340        WHEN  -40                                                 
011350*--<       変則払ＤＢ追加失敗 >                                   
011360           MOVE  "1"                  TO  共１ーイベント種別      
011370           MOVE  定数ープログラムＩＤ TO  共１ーソースＩＤ        
011380           MOVE  "9"                  TO  共１ー復帰コード        
011390           MOVE  "D40HNS"             TO  共１ー処理テーブルＩＤ  
011400           MOVE  "INSERT"             TO  共１ー処理識別          
011410           MOVE  SQLCODE              TO  共１ーデータ内容        
011420           MOVE  SQLERRMC             TO  共１ーその他メッセージ  
011430           CALL  CLOCO001          USING  IF-CHOCO001             
011440*                                                                 
011450        WHEN  OTHER                                               
011460           MOVE  "N"                  TO Ｗー異常終了ーフラグ     
011470     END-EVALUATE.                                                
011480*                                                                 
011490     IF Ｗー異常終了ーフラグ  =  "Y"                              
011500        PERFORM  ＤＢロールバック処理                             
011510*                                                                 
011520        PERFORM  終了メッセージ出力                               
011530*                                                                 
011540*--<    プログラム異常終了のリターンコード >                      
011550        MOVE  定数ー異常状態          TO  PROGRAM-STATUS          
011560*                                                                 
011570        EXIT  PROGRAM                                             
011580     END-IF.                                                      
011590*                                                                 
011600 エラー処理ーＥＸＩＴ.                                            
011610     EXIT.                                                        
011620******************************************************************
011630*                  END OF PROGRAM                                *
011640******************************************************************
