      *****************************************************************
      *   •Ï‘¥•¥(D34HNS_TBL)
      *****************************************************************
       01  •Ï‘¥•¥.
           03  ‚c‚R‚S|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚R‚S|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚R‚S|ŠJŽn‰ñ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S|ŠJŽn”NŒŽ      PIC  X(006).
           03  ‚c‚R‚S|I—¹‰ñ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S|I—¹”NŒŽ      PIC  X(006).
           03  ‚c‚R‚S|‹àŠz          PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S|Á”ïÅ        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚S|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚R‚S|XVŽÒ        PIC  X(008).
           03  ‚c‚R‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚S|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚S|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚R‚S|“o˜^’S“–ŽÒ    PIC  X(008).
