


DATA  DIVISION.
FILE SECTION.

FD  IN-FILE  LABEL RECORD IS STANDARD
01  IN-REC.
     03  DATE  PIC  9(8).
     03  NUM   PIC  9(4).
     03  AMOUNT  PIC  9(3).
     03  PIRCE  PIC  99.

FD  OUT-FILE  LABEL  RECORD IS  STANDARD
01  OUT-REC
     03  DATE  PIC  9(4)/9(2)/9(2)BB.
     03  NUM   PIC  9(4)BB
     03  AMOUNT  PIC  9(3)BB
     03  PIRCE  PIC  99.

FD  OUT-FILE2  LABEL  RECORD IS  STANDARD
01  OUT-REC2 X(23).


WORKING-STORAGE SECTION.


PROCEDURE DIVISION.
INIT.	OPEN INPUT IN-FILE OUTPUT OUT-FILE.
	Êä³ö±êÌâ
	DIAPLAY 'DATE PD-NUM PD-AMOUNT PD-PRICE'.
	DISPLAY '------------------------------'.

S1.
	READ IN-FILE  AT END GO TO S-END.
	
	MOVE DATE OF IN-REC  TO  DATE OF OUT-REC.
	MOVE NUM  OF IN-REC  TO  NUM  OF OUT-REC.
	MOVE AMOUNT OF IN-REC  TO  AMOUNT OF OUT-REC.
	MOVE PRICE OF IN-REC  TO  PRICE OF OUT-REC.

	WRITE OUT-REC

	GO TO  S1.

S-END.	

	CLOSE IN-FILE OUT-FILE.
	 STOP RUN.