000100 IDENTIFICATION DIVISION.                                         00010000
000200*                                                                 00020000
000300 PROGRAM-ID. RPT1000.                                             00030000
000400*                                                                 00040000
000500 ENVIRONMENT DIVISION.                                            00050000
000600*                                                                 00060000
000700 INPUT-OUTPUT SECTION.                                            00070000
000800*                                                                 00080000
000900 FILE-CONTROL.                                                    00090000
001000*                                                                 00100000
001100      SELECT CUSTMAST ASSIGN TO UT-S-CUSTMAST.                    00110000
001200*                                                                 00120000
001300 DATA DIVISION.                                                   00130000
001400*                                                                 00140000
001500 FILE SECTION.                                                    00150000
001600 FD  CUSTMAST.                                                    00160000
001700*                                                                 00170000
001900 01  CUSTOMER-MASTER-RECORD.                                      00190000
001910     05  CM-BRANCH-NUMBER        PIC 9(2).                        00191000
001920     05  CM-SALESREP-NUMBER      PIC 9(2).                        00192000
001930     05  CM-CUSTOMER-NUMBER      PIC 9(5).                        00193000
001940     05  CM-CUSTOMER-NAME        PIC X(20).                       00194000
001950     05  CM-SALES-THIS-YTD       PIC S9(5)V9(2).                  00195000
001960     05  CM-SALES-LAST-YTD       PIC S9(5)V9(2).                  00196000
001970                                                                  00197000
001980                                                                  00198000
001990                                                                  00199000
002000*                                                                 00200000
002100 WORKING-STORAGE SECTION.                                         00210000
002200*                                                                 00220000
002300 01  SWITCHES.                                                    00230000
002400     05  CUSTMAST-EOF-SWITCH     PIC X    VALUE "N".              00240000
002500                                                                  00250000
003200*                                                                 00320000
003300 PROCEDURE DIVISION.                                              00330000
003400*                                                                 00340000
003500 000-CONTROL.                                                     00350000
003600*                                                                 00360000
003700     OPEN INPUT  CUSTMAST                                         00370000
003800     PERFORM 100-READ                                             00380000
003900                UNTIL CUSTMAST-EOF-SWITCH = "Y".                  00390000
004700                                                                  00470000
004800     STOP RUN.                                                    00480000
004900 100-READ.                                                        00490000
005000     READ CUSTMAST                                                00500000
005100                AT END                                            00510000
005200                    MOVE "Y" TO CUSTMAST-EOF-SWITCH.              00520000
005300     IF CUSTMAST-EOF-SWITCH = "N"                                 00530000
005600        DISPLAY ' RECORD : ' CUSTOMER-MASTER-RECORD.              00560000
005700                                                                  00570000
