000010************************************************
000020* (ALM_FORM_0006)
000030************************************************
000040 01  ()ACCCOD           PIC  X(5).
000050 01  ()ACCNAM           PIC  N(16).
000060 01  ()MONCNT           PIC S9(3) COMP-3.
000070 01  ()BASYER           PIC  X(4).
000080 01  ()BASMON           PIC  X(2).
000090 01  ()COLAMT           PIC S9(13) COMP-3.
000100 01  ()BALCAP           PIC S9(13) COMP-3.
