000010************************************************
000020* (ALM_FORM_0001M)
000030************************************************
000040 01  ()MON000           PIC  X(6).
000050 01  ()MON001           PIC  X(6).
000060 01  ()MON002           PIC  X(6).
000070 01  ()MON003           PIC  X(6).
000080 01  ()MON004           PIC  X(6).
000090 01  ()MON005           PIC  X(6).
000100 01  ()MON006           PIC  X(6).
000110 01  ()MON007           PIC  X(6).
000120 01  ()MON008           PIC  X(6).
000130 01  ()MON009           PIC  X(6).
000140 01  ()MON010           PIC  X(6).
000150 01  ()MON011           PIC  X(6).
000160 01  ()MON012           PIC  X(6).
