000010************************************************
000020* (ALM_EXCEL_0001)
000030************************************************
000040 01  ()資負区分               PIC  X(6).
000050 01  ()ＡＬＭコード           PIC  X(2).
000060 01  ()ＡＬＭ明細名           PIC  X(20).
000070 01  ()固定変動               PIC  X(6).
000080 01  ()部門コード             PIC  X(1).
000090 01  ()部門名                 PIC  X(10).
000100 01  ()超短期                 PIC S9(13) COMP-3.
000110 01  ()期日管理               PIC S9(13) COMP-3.
000120 01  ()個別管理               PIC S9(13) COMP-3.
000130 01  ()無期限                 PIC S9(13) COMP-3.
000140 01  ()対象外                 PIC S9(13) COMP-3.
000150 01  ()１ヶ月後               PIC S9(13) COMP-3.
000160 01  ()２ヶ月後               PIC S9(13) COMP-3.
000170 01  ()３ヶ月後               PIC S9(13) COMP-3.
000180 01  ()４ヶ月後               PIC S9(13) COMP-3.
000190 01  ()５ヶ月後               PIC S9(13) COMP-3.
000200 01  ()６ヶ月後               PIC S9(13) COMP-3.
000210 01  ()７ヶ月後               PIC S9(13) COMP-3.
000220 01  ()８ヶ月後               PIC S9(13) COMP-3.
000230 01  ()９ヶ月後               PIC S9(13) COMP-3.
000240 01  ()１０ヶ月後             PIC S9(13) COMP-3.
000250 01  ()１１ヶ月後             PIC S9(13) COMP-3.
000260 01  ()１２ヶ月後             PIC S9(13) COMP-3.
000270 01  ()当年度                 PIC S9(13) COMP-3.
000280 01  ()１年後年度             PIC S9(13) COMP-3.
000290 01  ()２年後年度             PIC S9(13) COMP-3.
000300 01  ()３年後年度             PIC S9(13) COMP-3.
000310 01  ()４年後年度             PIC S9(13) COMP-3.
000320 01  ()５年後年度             PIC S9(13) COMP-3.
000330 01  ()６年後年度             PIC S9(13) COMP-3.
000340 01  ()７年後年度             PIC S9(13) COMP-3.
000350 01  ()８年後年度             PIC S9(13) COMP-3.
000360 01  ()９年後年度             PIC S9(13) COMP-3.
000370 01  ()１０年超               PIC S9(13) COMP-3.
000380 01  ()利息＿超短期           PIC S9(2)V9(2) COMP-3.
000390 01  ()利息＿期日管理         PIC S9(2)V9(2) COMP-3.
000400 01  ()利息＿個別管理         PIC S9(2)V9(2) COMP-3.
000410 01  ()利息＿無期限           PIC S9(2)V9(2) COMP-3.
000420 01  ()利息＿対象外           PIC S9(2)V9(2) COMP-3.
000430 01  ()利息＿１ヶ月後         PIC S9(2)V9(2) COMP-3.
000440 01  ()利息＿２ヶ月後         PIC S9(2)V9(2) COMP-3.
000450 01  ()利息＿３ヶ月後         PIC S9(2)V9(2) COMP-3.
000460 01  ()利息＿４ヶ月後         PIC S9(2)V9(2) COMP-3.
000470 01  ()利息＿５ヶ月後         PIC S9(2)V9(2) COMP-3.
000480 01  ()利息＿６ヶ月後         PIC S9(2)V9(2) COMP-3.
000490 01  ()利息＿７ヶ月後         PIC S9(2)V9(2) COMP-3.
000500 01  ()利息＿８ヶ月後         PIC S9(2)V9(2) COMP-3.
000510 01  ()利息＿９ヶ月後         PIC S9(2)V9(2) COMP-3.
000520 01  ()利息＿１０ヶ月後       PIC S9(2)V9(2) COMP-3.
000530 01  ()利息＿１１ヶ月後       PIC S9(2)V9(2) COMP-3.
000540 01  ()利息＿１２ヶ月後       PIC S9(2)V9(2) COMP-3.
000550 01  ()利息＿当年度           PIC S9(2)V9(2) COMP-3.
000560 01  ()利息＿１年後年度       PIC S9(2)V9(2) COMP-3.
000570 01  ()利息＿２年後年度       PIC S9(2)V9(2) COMP-3.
000580 01  ()利息＿３年後年度       PIC S9(2)V9(2) COMP-3.
000590 01  ()利息＿４年後年度       PIC S9(2)V9(2) COMP-3.
000600 01  ()利息＿５年後年度       PIC S9(2)V9(2) COMP-3.
000610 01  ()利息＿６年後年度       PIC S9(2)V9(2) COMP-3.
000620 01  ()利息＿７年後年度       PIC S9(2)V9(2) COMP-3.
000630 01  ()利息＿８年後年度       PIC S9(2)V9(2) COMP-3.
000640 01  ()利息＿９年後年度       PIC S9(2)V9(2) COMP-3.
000650 01  ()利息＿１０年超         PIC S9(2)V9(2) COMP-3.
