000010************************************************
000020* (ALM_LIADET)
000030************************************************
000040 01  ()ALMDET           PIC  X(2).
000050 01  ()DETNAM           PIC  N(16).
