000010************************************************
000020* (ALM_FORM_0001Y)
000030************************************************
000040 01  ()YER000           PIC  X(4).
000050 01  ()YER001           PIC  X(4).
000060 01  ()YER002           PIC  X(4).
000070 01  ()YER003           PIC  X(4).
000080 01  ()YER004           PIC  X(4).
000090 01  ()YER005           PIC  X(4).
000100 01  ()YER006           PIC  X(4).
000110 01  ()YER007           PIC  X(4).
000120 01  ()YER008           PIC  X(4).
000130 01  ()YER009           PIC  X(4).
000140 01  ()YER010           PIC  X(4).
000150 01  ()YER011           PIC  X(4).
000160 01  ()YER012           PIC  X(4).
