000010************************************************
000020* (ANK_WORK003)
000030************************************************
000040 01  ()KEY                 PIC S9(1) COMP-3.
000050 01  ()物件ＮＯ               PIC S9(3) COMP-3.
000060 01  ()購入金額               PIC S9(13) COMP-3.
000070 01  ()耐用年数               PIC S9(2) COMP-3.
000080 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000090 01  ()固定資産税額           PIC S9(13) COMP-3.
000100 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000110 01  ()動総保険料             PIC S9(13) COMP-3.
000120 01  ()残価額                 PIC S9(13) COMP-3.
000130 01  ()基本リース料           PIC S9(13) COMP-3.
000140 01  ()個別リース料           PIC S9(13) COMP-3.
000150 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000160 01  ()最終物件ＮＯ           PIC S9(3) COMP-3.
000170 01  ()最終購入金額           PIC S9(13) COMP-3.
000180 01  ()最終耐用年数           PIC S9(2) COMP-3.
000190 01  ()最終固定資産税率       PIC S9(2)V9(2) COMP-3.
000200 01  ()最終固定資産税額       PIC S9(13) COMP-3.
000210 01  ()最終動総保険料率       PIC S9(2)V9(3) COMP-3.
000220 01  ()最終動総保険料         PIC S9(13) COMP-3.
000230 01  ()最終残価額             PIC S9(13) COMP-3.
000240 01  ()最終基本リース料       PIC S9(13) COMP-3.
000250 01  ()最終個別リース料       PIC S9(13) COMP-3.
000260 01  ()最終リース料率         PIC S9(2)V9(8) COMP-3.
000270 01  ()物件数                 PIC S9(3) COMP-3.
000280 01  ()購入金額合計           PIC S9(13) COMP-3.
000290 01  ()加重耐用年数           PIC S9(2)V9(3) COMP-3.
000300 01  ()固定資産税額合計       PIC S9(13) COMP-3.
000310 01  ()加重保険料率           PIC S9(2)V9(3) COMP-3.
000320 01  ()動総保険料合計         PIC S9(13) COMP-3.
000330 01  ()残価額合計             PIC S9(13) COMP-3.
000340 01  ()基本リース料合計       PIC S9(13) COMP-3.
000350 01  ()個別リース料合計       PIC S9(13) COMP-3.
000360 01  ()登録日                 PIC  X(8).
000370 01  ()登録時刻               PIC  X(6).
000380 01  ()登録担当者コード       PIC  X(4).
000390 01  ()更新日                 PIC  X(8).
000400 01  ()更新時刻               PIC  X(6).
000410 01  ()更新担当者コード       PIC  X(4).
