000010************************************************
000020* (ANK_WORK008)
000030************************************************
000040 01  ()KEY                 PIC  X(1).
000050 01  ()案件番号               PIC  X(10).
000060 01  ()見積枝番               PIC  X(2).
000070 01  ()取引先名               PIC  N(30).
000080 01  ()登録日                 PIC  X(8).
000090 01  ()登録時刻               PIC  X(6).
000100 01  ()登録担当者コード       PIC  X(4).
000110 01  ()更新日                 PIC  X(8).
000120 01  ()更新時刻               PIC  X(6).
000130 01  ()更新担当者コード       PIC  X(4).
