000010************************************************
000020* (ANK_KANNI)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()顧客コード             PIC  X(6).
000080 01  ()取引先名               PIC  N(30).
000090 01  ()見積日                 PIC  X(8).
000100 01  ()取引形態コード         PIC  X(2).
000110 01  ()購入金額合計           PIC S9(13) COMP-3.
000120 01  ()契約金額               PIC S9(13) COMP-3.
000130 01  ()リース期間             PIC S9(3) COMP-3.
000140 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000150 01  ()粗利益                 PIC S9(13) COMP-3.
000160 01  ()登録日                 PIC  X(8).
000170 01  ()登録時刻               PIC  X(6).
000180 01  ()登録担当者コード       PIC  X(4).
000190 01  ()更新日                 PIC  X(8).
000200 01  ()更新時刻               PIC  X(6).
000210 01  ()更新担当者コード       PIC  X(4).
