000010************************************************
000020* (ANK_LPWK_HUBARAI)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()支払連番               PIC S9(3) COMP-3.
000070 01  ()端末番号               PIC  N(8).
000080 01  ()元本                   PIC S9(13) COMP-3.
000090 01  ()賦金                   PIC S9(13) COMP-3.
000100 01  ()諸費用                 PIC S9(13) COMP-3.
000110 01  ()利息                   PIC S9(13) COMP-3.
000120 01  ()元本内入               PIC S9(13) COMP-3.
000130 01  ()一括弁済金             PIC S9(13) COMP-3.
000140 01  ()固定資産税月額         PIC S9(13) COMP-3.
000150 01  ()動総保険月額           PIC S9(13) COMP-3.
000160 01  ()リース期間             PIC S9(3) COMP-3.
000170 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000180 01  ()契約総額               PIC S9(13) COMP-3.
000190 01  ()購入金額               PIC S9(13) COMP-3.
000200 01  ()残価額                 PIC S9(13) COMP-3.
