000010************************************************
000020* (ANK_WORK001)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()見積書提出先           PIC  N(30).
000070 01  ()見積日                 PIC  X(8).
000080 01  ()住所                   PIC  N(50).
000090 01  ()担当部店               PIC  N(10).
000100 01  ()電話番号               PIC  N(10).
000110 01  ()ＦＡＸ番号             PIC  N(10).
000120 01  ()物件名１               PIC  N(20).
000130 01  ()数量１                 PIC S9(4) COMP-3.
000140 01  ()単位１                 PIC  N(2).
000150 01  ()購入金額１             PIC S9(13) COMP-3.
000160 01  ()物件名２               PIC  N(20).
000170 01  ()数量２                 PIC S9(4) COMP-3.
000180 01  ()単位２                 PIC  N(2).
000190 01  ()購入金額２             PIC S9(13) COMP-3.
000200 01  ()物件名３               PIC  N(20).
000210 01  ()数量３                 PIC S9(4) COMP-3.
000220 01  ()単位３                 PIC  N(2).
000230 01  ()購入金額３             PIC S9(13) COMP-3.
000240 01  ()物件名４               PIC  N(20).
000250 01  ()数量４                 PIC S9(4) COMP-3.
000260 01  ()単位４                 PIC  N(2).
000270 01  ()購入金額４             PIC S9(13) COMP-3.
000280 01  ()物件名５               PIC  N(20).
000290 01  ()数量５                 PIC S9(4) COMP-3.
000300 01  ()単位５                 PIC  N(2).
000310 01  ()購入金額５             PIC S9(13) COMP-3.
000320 01  ()購入金額合計           PIC S9(13) COMP-3.
000330 01  ()計算方式１             PIC  X(1).
000340 01  ()計算方式２             PIC  X(1).
000350 01  ()計算方式３             PIC  X(1).
000360 01  ()リース期間１           PIC S9(3) COMP-3.
000370 01  ()リース期間２           PIC S9(3) COMP-3.
000380 01  ()リース期間３           PIC S9(3) COMP-3.
000390 01  ()請求サイクル１         PIC S9(2) COMP-3.
000400 01  ()請求サイクル２         PIC S9(2) COMP-3.
000410 01  ()請求サイクル３         PIC S9(2) COMP-3.
000420 01  ()リース料１             PIC S9(13) COMP-3.
000430 01  ()リース料２             PIC S9(13) COMP-3.
000440 01  ()リース料３             PIC S9(13) COMP-3.
000450 01  ()消費税等額１           PIC S9(13) COMP-3.
000460 01  ()消費税等額２           PIC S9(13) COMP-3.
000470 01  ()消費税等額３           PIC S9(13) COMP-3.
000480 01  ()前受リース料１         PIC S9(13) COMP-3.
000490 01  ()前受リース料２         PIC S9(13) COMP-3.
000500 01  ()前受リース料３         PIC S9(13) COMP-3.
000510 01  ()リース料支払方法１     PIC  N(20).
000520 01  ()リース料支払方法２     PIC  N(20).
000530 01  ()再リース料             PIC  N(30).
000540 01  ()検収予定日             PIC  X(8).
000550 01  ()設置場所名             PIC  N(30).
000560 01  ()保守契約               PIC  N(30).
000570 01  ()連帯保証人             PIC  N(30).
000580 01  ()付随条項               PIC  N(250).
000590 01  ()見積有効期限           PIC  X(8).
000600 01  ()案件リファレンス１     PIC  N(10).
000610 01  ()案件リファレンス２     PIC  N(10).
000620 01  ()購入金額非表示区分     PIC S9(1) COMP-3.
000630 01  ()料率非表示区分         PIC S9(1) COMP-3.
000640 01  ()登録日                 PIC  X(8).
000650 01  ()登録時刻               PIC  X(6).
000660 01  ()登録担当者コード       PIC  X(4).
000670 01  ()更新日                 PIC  X(8).
000680 01  ()更新時刻               PIC  X(6).
000690 01  ()更新担当者コード       PIC  X(4).
