000010************************************************
000020* (APR_SYOHIN_MST)
000030************************************************
000040 01  ()アポロ商品コード       PIC  X(4).
000050 01  ()アポロ商品分類名       PIC  N(10).
000060 01  ()物件名＿漢字           PIC  N(20).
000070 01  ()物件名                 PIC  N(10).
000080 01  ()機種名                 PIC  N(10).
000090 01  ()資産コード             PIC  X(7).
000100 01  ()耐用年数               PIC  X(2).
000110 01  ()保険料率               PIC S9(2)V9(3) COMP-3.
000120 01  ()動総保険コード         PIC  X(4).
000130 01  ()信用保険コード＿リース PIC  X(6).
000140 01  ()信用保険コード＿割賦   PIC  X(6).
000150 01  ()登録日                 PIC  X(8).
000160 01  ()登録時刻               PIC  X(6).
000170 01  ()登録担当者コード       PIC  X(4).
000180 01  ()更新日                 PIC  X(8).
000190 01  ()更新時刻               PIC  X(6).
000200 01  ()更新担当者コード       PIC  X(4).
