000010************************************************
000020* (APR_LPWK_CHOHYO)
000030************************************************
000040 01  ()KEY                 PIC  X(1).
000050 01  ()’ •[‚P                 PIC  X(1).
000060 01  ()’ •[‚Q                 PIC  X(1).
000070 01  ()’ •[‚R                 PIC  X(1).
