000010************************************************
000020* 解約履歴（債権分）(CISUF962)
000030************************************************
000040    03   ()契約ＮＯ               PIC  X(9).
000050    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()解約日                 PIC  X(7).
000070    03   ()契約種類               PIC S9(3)  SIGN LEADING SEPARATE.
000080    03   ()解約区分               PIC S9(1)  SIGN LEADING SEPARATE.
