000010************************************************
000020* 回収履歴ファイル(CISUF510)
000030************************************************
000040    03   ()契約番号               PIC  X(10).
000050    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()契約種類               PIC  X(3).
000070    03   ()請求区分               PIC  X(1).
000080    03   ()連番                   PIC S9(6)  SIGN LEADING SEPARATE.
000090    03   ()申請連番               PIC S9(2)  SIGN LEADING SEPARATE.
000100    03   ()損害金請求方法         PIC  X(1).
000110    03   ()消込通番               PIC  X(11).
000120    03   ()消込回数               PIC S9(3)  SIGN LEADING SEPARATE.
000130    03   ()収入予定日             PIC  X(8).
000140    03   ()入金日                 PIC  X(8).
000150    03   ()回収方法               PIC  X(1).
000160    03   ()入金科目               PIC  X(5).
000170    03   ()入金額                 PIC S9(13)  SIGN LEADING SEPARATE.
000180    03   ()入金額消費税           PIC S9(13)  SIGN LEADING SEPARATE.
000190    03   ()振込手数料             PIC S9(13)  SIGN LEADING SEPARATE.
000200    03   ()入金種類               PIC  X(1).
000210    03   ()仮受金番号             PIC  X(15).
000220    03   ()エントリ日             PIC  X(8).
000230    03   ()取引先コード           PIC  X(9).
000240    03   ()請求先コード           PIC  X(5).
000250    03   ()銀行コード             PIC  X(4).
000260    03   ()支店コード             PIC  X(3).
000270    03   ()口座種類               PIC  X(1).
000280    03   ()口座番号               PIC  X(10).
000290    03   ()入金区分               PIC  X(2).
000300    03   ()更新年月日             PIC  X(8).
000310    03   ()更新時間               PIC  X(8).
000320    03   ()更新者                 PIC  X(8).
000330    03   ()入力担当者コード       PIC  X(8).
000340    03   ()督促段階               PIC  X(1).
000350    03   ()督促処理年月日         PIC  X(8).
000360    03   ()費目                   PIC  X(1).
000370    03   ()当社他社識別           PIC  X(1).
000380    03   ()返金経路               PIC  X(1).
000390    03   ()入返金区分             PIC  X(1).
000400    03   ()他社入金額             PIC S9(13)  SIGN LEADING SEPARATE.
000410    03   ()協調転区分             PIC  X(1).
000420    03   ()主契約区分             PIC  X(1).
000430    03   ()仮受金処理済フラグ     PIC  X(1).
000440    03   ()主－請求区分           PIC  X(1).
000450    03   ()登録年月日             PIC  X(8).
000460    03   ()登録時間               PIC  X(8).
000470    03   ()登録担当者             PIC  X(8).
000480    03   ()元本入金額             PIC S9(13)  SIGN LEADING SEPARATE.
000490    03   ()利息入金額             PIC S9(13)  SIGN LEADING SEPARATE.
000500    03   ()回収履歴区分           PIC  X(1).
000510    03   ()消込対象額             PIC S9(13)  SIGN LEADING SEPARATE.
000520    03   ()消込対象額消費税       PIC S9(13)  SIGN LEADING SEPARATE.
000530    03   ()消込取消区分           PIC  X(1).
000540    03   ()消込時回収年月日       PIC  X(8).
000550    03   ()消込時入金年月日       PIC  X(8).
000560    03   ()他社入金額消費税       PIC S9(13)  SIGN LEADING SEPARATE.
000570    03   ()自社入金額             PIC S9(13)  SIGN LEADING SEPARATE.
000580    03   ()自社入金額消費税       PIC S9(13)  SIGN LEADING SEPARATE.
