000010************************************************
000020* チェックリストファイル(CISUF461)
000030************************************************
000040    03   ()突合済フラグ           PIC  X(1).
000050    03   ()FILLER           PIC  X(1).
000060    03   ()請求先コード           PIC  X(8).
000070    03   ()FILLER           PIC  X(1).
000080    03   ()契約番号               PIC  X(9).
000090    03   ()FILLER           PIC  X(1).
000100    03   ()再リースコード         PIC S9(1).
000110    03   ()FILLER           PIC  X(1).
000120    03   ()入金予定日             PIC  X(7).
000130    03   ()FILLER           PIC  X(1).
000140    03   ()請求内訳コード         PIC  X(3).
000150    03   ()FILLER           PIC  X(1).
000160    03   ()総支払回数             PIC S9(3).
000170    03   ()FILLER           PIC  X(1).
000180    03   ()回収方式               PIC S9(1).
000190    03   ()FILLER           PIC  X(1).
000200    03   ()長短区分               PIC S9(1).
000210    03   ()FILLER           PIC  X(1).
000220    03   ()事業所コード           PIC S9(4).
000230    03   ()FILLER           PIC  X(1).
000240    03   ()請求発行日             PIC  X(7).
000250    03   ()FILLER           PIC  X(1).
000260    03   ()勘定処理コード         PIC S9(2).
000270    03   ()FILLER           PIC  X(1).
000280    03   ()消込通番               PIC S9(9).
000290    03   ()FILLER           PIC  X(1).
000300    03   ()消込日                 PIC  X(7).
000310    03   ()FILLER           PIC  X(1).
000320    03   ()消費税徴収区分         PIC S9(1).
000330    03   ()FILLER           PIC  X(1).
000340    03   ()消費税額               PIC S9(13).
000350    03   ()FILLER           PIC  X(1).
000360    03   ()消費税コード           PIC S9(2).
000370    03   ()FILLER           PIC  X(1).
000380    03   ()リース料等             PIC S9(13).
000390    03   ()FILLER           PIC  X(1).
000400    03   ()請求金額               PIC S9(13).
000410    03   ()FILLER           PIC  X(1).
000420    03   ()消込金額               PIC S9(13).
000430    03   ()FILLER           PIC  X(1).
000440    03   ()内部入金区分           PIC S9(1).
000450    03   ()FILLER           PIC  X(1).
000460    03   ()銀行ＣＤ               PIC S9(7).
000470    03   ()FILLER           PIC  X(1).
000480    03   ()旧請求内訳コード       PIC  X(3).
000490    03   ()FILLER           PIC  X(1).
000500    03   ()ユーザコード           PIC  X(8).
000510    03   ()FILLER           PIC  X(1).
000520    03   ()債協コード             PIC  X(2).
000530    03   ()FILLER           PIC  X(1).
