000010************************************************
000020* 変換テーブルWK(CISUF908)
000030************************************************
000040    03   ()取引先コード           PIC  X(8).
000050    03   ()目的ＣＤ               PIC  X(1).
000060    03   ()新取引先コード         PIC  X(7).
000070    03   ()枝番                   PIC  X(3).
000080    03   ()与信括りコード         PIC  X(7).
000090    03   ()名寄せコード           PIC  X(8).
000100    03   ()ユーザコード           PIC  X(8).
000110    03   ()識別コード             PIC  X(1).
