000010************************************************
000020* 契約枝番管理ファイル(CISUF940)
000030************************************************
000040    03   ()契約番号               PIC  X(10).
000050    03   ()最終枝番               PIC  X(2).
000060    03   ()包括申請連番           PIC S9(2)  SIGN LEADING SEPARATE.
000070    03   ()登録年月日             PIC  X(8).
000080    03   ()登録時間               PIC  X(8).
000090    03   ()登録担当者             PIC  X(8).
000100    03   ()更新年月日             PIC  X(8).
000110    03   ()更新時間               PIC  X(8).
000120    03   ()更新者                 PIC  X(8).
000130    03   ()入力担当者コード       PIC  X(8).
