000010************************************************
000020* 取引先マスタＫＥＹ保管Ｆ(CISUF011)
000030************************************************
000040    03   ()ＫＥＹ項目.
000050     05  ()取引先コード           PIC  X(7).
000060    03   ()ＳＵＭＭＩＴ用抽出ＫＥＹ.
000070     05  ()顧客コード             PIC  X(6).
000080     05  ()サーバコード           PIC  X(2).
000090    03   ()ＰＬＡＮＥＴ用抽出ＫＥＹ.
000100     05  ()ユーザコード           PIC  X(8).
000110    03   ()ＦＯＣＵＳ用抽出ＫＥＹ.
000120     05  ()帝国データバンクコード PIC S9(9)  SIGN LEADING SEPARATE.
