000010************************************************
000020* グループコード変換テーブルWK(CISUF900)
000030************************************************
000040    03   ()取引先コード           PIC  X(8).
000050    03   ()名寄せ取引先コード     PIC  X(8).
000060    03   ()ユーザー取引先コード   PIC  X(8).
000070    03   ()新グループコード       PIC  X(7).
