000010************************************************
000020* 解約履歴復元ヘッダー(CISUF96A)
000030************************************************
000040    03   ()解約履歴契約ＮＯ       PIC  X(9).
000050    03   ()解約履歴再リース回数   PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()解約履歴契約種類       PIC S9(3)  SIGN LEADING SEPARATE.
