000010************************************************
000020* 契約内容(CISUF341)
000030************************************************
000040    03   ()契約番号               PIC  X(10).
000050    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()見積番号               PIC S9(7)  SIGN LEADING SEPARATE.
000070    03   ()見積番号枝番           PIC S9(2)  SIGN LEADING SEPARATE.
000080    03   ()取引先コード           PIC  X(9).
000090    03   ()稟議決裁日             PIC  X(8).
000100    03   ()貸付実行予定日         PIC  X(8).
000110    03   ()成約年月日             PIC  X(8).
000120    03   ()引渡年月日             PIC  X(8).
000130    03   ()契約開始日             PIC  X(8).
000140    03   ()契約終了日             PIC  X(8).
000150    03   ()期間                   PIC S9(3)  SIGN LEADING SEPARATE.
000160    03   ()契約件名               PIC  X(60).
000170    03   ()エンドユーザコード     PIC  X(9).
000180    03   ()契約区分               PIC  X(1).
000190    03   ()紹介ルート             PIC  X(1).
000200    03   ()担当部課コード         PIC  X(4).
000210    03   ()担当者コード           PIC  X(8).
000220    03   ()変則払                 PIC  X(1).
000230    03   ()月額料金               PIC S9(13)  SIGN LEADING SEPARATE.
000240    03   ()契約総額               PIC S9(13)  SIGN LEADING SEPARATE.
000250    03   ()次回再リース料         PIC S9(13)  SIGN LEADING SEPARATE.
000260    03   ()再リース料金区分       PIC  X(1).
000270    03   ()信用保険区分           PIC  X(1).
000280    03   ()担保区分               PIC  X(1).
000290    03   ()協調区分               PIC  X(1).
000300    03   ()契約先コード           PIC  X(5).
000310    03   ()主幹事先コード         PIC  X(9).
000320    03   ()利回り                 PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000330    03   ()ユーザ利回り           PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000340    03   ()長プラ金利             PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000350    03   ()社内金利               PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000360    03   ()請求先コード           PIC  X(5).
000370    03   ()請求書作成区分         PIC  X(1).
000380    03   ()請求件名               PIC  X(60).
000390    03   ()第１回回収方法         PIC  X(1).
000400    03   ()第１回回収サイト       PIC S9(2)  SIGN LEADING SEPARATE.
000410    03   ()第１回回収日           PIC S9(2)  SIGN LEADING SEPARATE.
000420    03   ()第１回回収回数         PIC S9(2)  SIGN LEADING SEPARATE.
000430    03   ()振替開始年月           PIC  X(6).
000440    03   ()前払区分               PIC  X(1).
000450    03   ()頭金区分               PIC  X(1).
000460    03   ()営業コメント欄１       PIC  X(80).
000470    03   ()営業コメント欄２       PIC  X(80).
000480    03   ()状態フラグ             PIC  X(1).
000490    03   ()満了案内送付区分       PIC  X(1).
000500    03   ()満了案内回答区分       PIC  X(1).
000510    03   ()主契約区分             PIC  X(1).
000520    03   ()遡及処理区分           PIC  X(1).
000530    03   ()遡及処理年月           PIC  X(6).
000540    03   ()検収エントリ日         PIC  X(8).
000550    03   ()検収取消日             PIC  X(8).
000560    03   ()検収取消エントリ日     PIC  X(8).
000570    03   ()検収処理年月           PIC  X(6).
000580    03   ()検収取消年月           PIC  X(6).
000590    03   ()当初回収期間           PIC S9(3)  SIGN LEADING SEPARATE.
000600    03   ()最新回収期間           PIC S9(3)  SIGN LEADING SEPARATE.
000610    03   ()最終物件番号           PIC S9(4)  SIGN LEADING SEPARATE.
000620    03   ()再リースデータ作成区分 PIC  X(1).
000630    03   ()再リース自動作成年月日 PIC  X(8).
000640    03   ()リース割賦前払月数     PIC S9(2)  SIGN LEADING SEPARATE.
000650    03   ()頭金請求書作成フラグ   PIC  X(1).
000660    03   ()前払請求書作成フラグ   PIC  X(1).
000670    03   ()頭金請求済フラグ       PIC  X(1).
000680    03   ()前払請求済フラグ       PIC  X(1).
000690    03   ()解約申請フラグ         PIC  X(1).
000700    03   ()解約フラグ             PIC  X(1).
000710    03   ()解約年月日             PIC  X(8).
000720    03   ()総回収回数             PIC S9(3)  SIGN LEADING SEPARATE.
000730    03   ()物件確認               PIC  X(1).
000740    03   ()まるめ単位             PIC  X(1).
000750    03   ()内訳印刷方法           PIC  X(1).
000760    03   ()契約期間回数印刷有無   PIC  X(1).
000770    03   ()成約エントリ日         PIC  X(8).
000780    03   ()成約取消エントリ日     PIC  X(8).
000790    03   ()成約処理年月           PIC  X(6).
000800    03   ()成約取消年月           PIC  X(6).
000810    03   ()再リース請求間隔       PIC S9(2)  SIGN LEADING SEPARATE.
000820    03   ()再リース回収間隔       PIC S9(2)  SIGN LEADING SEPARATE.
000830    03   ()更新年月日             PIC  X(8).
000840    03   ()更新時間               PIC  X(8).
000850    03   ()更新者                 PIC  X(8).
000860    03   ()当初利回り             PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000870    03   ()当初粗利額             PIC S9(13)  SIGN LEADING SEPARATE.
000880    03   ()当初月額料金           PIC S9(13)  SIGN LEADING SEPARATE.
000890    03   ()当初契約総額           PIC S9(13)  SIGN LEADING SEPARATE.
000900    03   ()以降回収サイト         PIC S9(2)  SIGN LEADING SEPARATE.
000910    03   ()以降回収日             PIC S9(2)  SIGN LEADING SEPARATE.
000920    03   ()以降回収間隔           PIC S9(2)  SIGN LEADING SEPARATE.
000930    03   ()旧取引番号             PIC  X(10).
000940    03   ()解約エントリ日         PIC  X(8).
000950    03   ()解約処理年月           PIC  X(6).
000960    03   ()解約取消エントリ日     PIC  X(8).
000970    03   ()解約取消処理年月       PIC  X(6).
000980    03   ()満了予約フラグ         PIC  X(1).
000990    03   ()満了予約エントリ日     PIC  X(8).
001000    03   ()満了処理年月           PIC  X(6).
001010    03   ()再リースエントリ日     PIC  X(8).
001020    03   ()再リース処理年月       PIC  X(6).
001030    03   ()再リース取消エントリ日 PIC  X(8).
001040    03   ()再リース取消処理年月   PIC  X(6).
001050    03   ()承継エントリ日         PIC  X(8).
001060    03   ()承継処理年月           PIC  X(6).
001070    03   ()承継取消エントリ日     PIC  X(8).
001080    03   ()承継取消処理年月       PIC  X(6).
001090    03   ()売却エントリ日         PIC  X(8).
001100    03   ()売却処理年月           PIC  X(6).
001110    03   ()条件変更エントリ日     PIC  X(8).
001120    03   ()条件変更処理年月       PIC  X(6).
001130    03   ()管理債権レベル         PIC  X(1).
001140    03   ()契約料率               PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
001150    03   ()粗利額                 PIC S9(13)  SIGN LEADING SEPARATE.
001160    03   ()当初契約料率           PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
001170    03   ()以降回収方法           PIC  X(1).
001180    03   ()請求サイト             PIC S9(2)  SIGN LEADING SEPARATE.
001190    03   ()請求間隔               PIC S9(2)  SIGN LEADING SEPARATE.
001200    03   ()請求基準月             PIC S9(2)  SIGN LEADING SEPARATE.
001210    03   ()契約取引区分           PIC  X(1).
001220    03   ()責任区分               PIC  X(1).
001230    03   ()相殺区分               PIC  X(1).
001240    03   ()注文書出力区分         PIC  X(1).
001250    03   ()満了案内帳票区分       PIC  X(1).
001260    03   ()再リース料フラグ       PIC  X(1).
001270    03   ()再リース自動継続区分   PIC  X(1).
001280    03   ()契約書式               PIC  X(1).
001290    03   ()物件保管場所           PIC  X(1).
001300    03   ()請求先区分             PIC  X(1).
001310    03   ()不動産担保設定額       PIC S9(13)  SIGN LEADING SEPARATE.
001320    03   ()有価証券担保設定額     PIC S9(13)  SIGN LEADING SEPARATE.
001330    03   ()その他担保設定額       PIC S9(13)  SIGN LEADING SEPARATE.
001340    03   ()保証人有無区分         PIC  X(1).
001350    03   ()未収残高対象外フラグ   PIC  X(1).
001360    03   ()保険会社区分           PIC  X(4).
001370    03   ()動総保険料             PIC S9(13)  SIGN LEADING SEPARATE.
001380    03   ()動総付保開始年月日     PIC  X(8).
001390    03   ()入力担当者コード       PIC  X(8).
001400    03   ()請求取引先コード       PIC  X(9).
001410    03   ()問合せ番号             PIC  X(10).
001420    03   ()再リース区分           PIC  X(1).
001430    03   ()旧契約番号             PIC  X(10).
001440    03   ()購入選択権付リース区分 PIC  X(1).
001450    03   ()再リース申請書有無区分 PIC  X(1).
001460    03   ()再リース申請フラグ     PIC  X(1).
001470    03   ()承継申請フラグ         PIC  X(1).
001480    03   ()申請連番               PIC S9(2)  SIGN LEADING SEPARATE.
001490    03   ()リスケフラグ           PIC  X(1).
001500    03   ()粗利益額－表           PIC S9(13)  SIGN LEADING SEPARATE.
001510    03   ()お支払明細書作成済フラグ PIC  X(1).
001520    03   ()お支払明細書要否       PIC  X(1).
001530    03   ()申請年月日             PIC  X(8).
001540    03   ()対象元本額             PIC S9(13)  SIGN LEADING SEPARATE.
001550    03   ()消費税率区分           PIC  X(2).
001560    03   ()申請書出力年月日       PIC  X(8).
001570    03   ()再リース申請書出力年月日 PIC  X(8).
001580    03   ()請求基準               PIC  X(1).
001590    03   ()次回再リース回収サイト PIC S9(2)  SIGN LEADING SEPARATE.
001600    03   ()次回再リース回収日     PIC S9(2)  SIGN LEADING SEPARATE.
001610    03   ()雑費保守料             PIC S9(13)  SIGN LEADING SEPARATE.
001620    03   ()雑費販促費             PIC S9(13)  SIGN LEADING SEPARATE.
001630    03   ()雑費信用保険           PIC S9(13)  SIGN LEADING SEPARATE.
001640    03   ()雑費その他             PIC S9(13)  SIGN LEADING SEPARATE.
001650    03   ()徴求完了フラグ         PIC  X(1).
001660    03   ()徴求完了取消フラグ     PIC  X(1).
001670    03   ()次回再リース区分       PIC  X(1).
001680    03   ()契約書発行済フラグ     PIC  X(1).
001690    03   ()注文書発行済フラグ     PIC  X(1).
001700    03   ()その他発行済フラグ     PIC  X(1).
001710    03   ()営業コメント欄３       PIC  X(80).
001720    03   ()社内金利区分           PIC  X(1).
001730    03   ()雑費調整額             PIC S9(13)  SIGN LEADING SEPARATE.
001740    03   ()オープンブラインド区分 PIC  X(1).
001750    03   ()協調回収区分           PIC  X(1).
001760    03   ()単年度契約             PIC  X(1).
001770    03   ()バック取引             PIC  X(1).
001780    03   ()否認区分               PIC  X(1).
001790    03   ()前渡金区分             PIC  X(1).
001800    03   ()非課税区分             PIC  X(1).
001810    03   ()包括区分               PIC  X(1).
001820    03   ()海外設置区分           PIC  X(1).
001830    03   ()物件コメント           PIC  X(40).
001840    03   ()解約金計算方法         PIC  X(1).
001850    03   ()搬入予定日             PIC  X(8).
001860    03   ()申請契約額加算フラグ   PIC  X(1).
001870    03   ()紹介先取引先           PIC  X(9).
001880    03   ()紹介先契約先           PIC  X(5).
001890    03   ()紹介先ＢＴＭ           PIC  X(4).
001900    03   ()紹介先僚店             PIC  X(4).
001910    03   ()紹介先銀行             PIC  X(4).
001920    03   ()紹介先支店             PIC  X(3).
001930    03   ()請求日                 PIC  X(2).
001940    03   ()契約取消理由１         PIC  X(80).
001950    03   ()契約取消理由２         PIC  X(80).
001960    03   ()契約取消申請書発行済フラグ PIC  X(1).
001970    03   ()決裁登録申請フラグ     PIC  X(1).
001980    03   ()契約登録申請フラグ     PIC  X(1).
001990    03   ()検収登録申請フラグ     PIC  X(1).
002000    03   ()契約取消申請フラグ     PIC  X(1).
002010    03   ()検収取消申請フラグ     PIC  X(1).
002020    03   ()変更申請フラグ         PIC  X(1).
002030    03   ()変更フラグ             PIC  X(1).
002040    03   ()変更年月日             PIC  X(8).
002050    03   ()債務協調コード         PIC  X(2).
002060    03   ()一般大口区分           PIC  X(1).
002070    03   ()制度リース             PIC  X(1).
002080    03   ()基本利回り総額分       PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002090    03   ()実質利回り総額分       PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002100    03   ()粗利額総額分           PIC S9(13)  SIGN LEADING SEPARATE.
002110    03   ()一般社内金利           PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002120    03   ()一般基本利回り         PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002130    03   ()一般実質利回り         PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002140    03   ()一般粗利額             PIC S9(13)  SIGN LEADING SEPARATE.
002150    03   ()一般基本利回り総額分   PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002160    03   ()一般実質利回り総額分   PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002170    03   ()一般粗利額自社分       PIC S9(13)  SIGN LEADING SEPARATE.
002180    03   ()強制保存フラグ         PIC  X(1).
002190    03   ()登録年月日             PIC  X(8).
002200    03   ()登録時間               PIC  X(8).
002210    03   ()登録担当者             PIC  X(8).
002220    03   ()転リース提携先コード   PIC  X(3).
002230    03   ()斡旋手数料             PIC S9(13)  SIGN LEADING SEPARATE.
002240    03   ()業務区分               PIC  X(1).
002250    03   ()買戻義務区分           PIC  X(1).
002260    03   ()代理回収               PIC  X(1).
002270    03   ()買取金額               PIC S9(13)  SIGN LEADING SEPARATE.
002280    03   ()金利変動区分           PIC  X(1).
002290    03   ()連動金利区分           PIC  X(2).
002300    03   ()割引率                 PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002310    03   ()貸付金額               PIC S9(13)  SIGN LEADING SEPARATE.
002320    03   ()貸付金利               PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002330    03   ()資金使途区分           PIC  X(2).
002340    03   ()資金使途文言           PIC  X(80).
002350    03   ()支払委託取引形態       PIC  X(1).
002360    03   ()融資方法               PIC  X(1).
002370    03   ()返済条件               PIC  X(1).
002380    03   ()リース種類区分         PIC  X(1).
002390    03   ()資産科目区分           PIC  X(1).
002400    03   ()重要性基準区分         PIC  X(1).
002410    03   ()前渡金金利             PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002420    03   ()トリプルオプション方式 PIC  X(1).
002430    03   ()引合中止区分           PIC  X(1).
002440    03   ()内容変更申請連番       PIC S9(2)  SIGN LEADING SEPARATE.
002450    03   ()承継分割種類           PIC  X(1).
002460    03   ()承継区分               PIC  X(1).
002470    03   ()満了条件区分           PIC  X(1).
002480    03   ()第１回目回収日文言     PIC  X(40).
002490    03   ()第２回目以降回収日文言 PIC  X(40).
002500    03   ()譲渡条件付リース区分   PIC  X(1).
002510    03   ()残価回収サイト         PIC S9(2)V9(2)  SIGN LEADING SEPARATE.
002520    03   ()債権買取区分           PIC  X(1).
002530    03   ()支払基準月             PIC S9(2)  SIGN LEADING SEPARATE.
002540    03   ()損害賠償金文言         PIC  X(80).
002550    03   ()流動化番号             PIC  X(6).
002560    03   ()流動化先               PIC  X(7).
002570    03   ()信託先設定日           PIC  X(8).
002580    03   ()信託終了日             PIC  X(8).
002590    03   ()債権流動化区分         PIC  X(1).
002600    03   ()差入予約区分           PIC  X(1).
002610    03   ()債権買取日             PIC  X(8).
002620    03   ()相殺条項区分           PIC  X(1).
002630    03   ()譲渡禁止特約           PIC  X(1).
002640    03   ()先方契約番号           PIC  X(16).
002650    03   ()再リース料分子         PIC S9(4)  SIGN LEADING SEPARATE.
002660    03   ()再リース料分母         PIC S9(4)  SIGN LEADING SEPARATE.
002670    03   ()営業コメント欄４       PIC  X(80).
002680    03   ()新規先区分             PIC  X(1).
002690    03   ()親密先区分             PIC  X(1).
002700    03   ()財務部金利             PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002710    03   ()一般前渡金金利         PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
002720    03   ()決裁ランク             PIC  X(1).
002730    03   ()お礼状発行フラグ       PIC  X(1).
002740    03   ()移行フラグ             PIC  X(1).
002750    03   ()再リース申請条件区分   PIC  X(2).
002760    03   ()問い合わせ担当部店コード PIC  X(4).
002770    03   ()問い合わせ担当者名     PIC  X(20).
002780    03   ()再リース料支払予定日   PIC  X(8).
002790    03   ()満了通知書回答期限     PIC  X(8).
002800    03   ()申請区分               PIC  X(1).
002810    03   ()内容申請書印刷回数     PIC S9(2)  SIGN LEADING SEPARATE.
002820    03   ()内容申請書印刷済フラグ PIC  X(1).
002830    03   ()契約件名自動登録区分   PIC  X(1).
002840    03   ()返済原資               PIC  X(80).
002850    03   ()否認処理区分           PIC  X(1).
002860    03   ()解約理由               PIC  X(2).
002870    03   ()流動化先契約先コード   PIC  X(5).
