000010************************************************
000020* CISUF62H      DMK FIP team
000030************************************************
000040    03  ()経理                PIC  X(10).
000070    03  FILLER                PIC  X(01).
000060    03  ()枝番                PIC  X(01).
000070    03  FILLER                PIC  X(01).
000060    03  ()支払通番            PIC  X(10).
000070    03  FILLER                PIC  X(01).
000080    03  ()支払先コード        PIC  X(04).
000070    03  FILLER                PIC  X(01).
000040    03  ()支払済フラグ        PIC  X(01).
000070    03  FILLER                PIC  X(01).
000050    03  ()支払日              PIC  X(07).
000070    03  FILLER                PIC  X(01).
000060    03  ()現支払金額          PIC  9(13).
000070    03  FILLER                PIC  X(01).
000080    03  ()取引先コード        PIC  X(09).
000070    03  FILLER                PIC  X(01).
000040    03  ()現支払先コード      PIC  X(05).
000070    03  FILLER                PIC  X(01).
000050    03  ()契約番号            PIC  X(10).
000070    03  FILLER                PIC  X(01).
000060    03  ()再リース回数        PIC  9(02).
000070    03  FILLER                PIC  X(01).
000080    03  ()契約種類            PIC  X(03).
000070    03  FILLER                PIC  X(01).
000040    03  ()支払種類            PIC  X(02).
000070    03  FILLER                PIC  X(01).
000050    03  ()支払年月日          PIC  X(08).
000070    03  FILLER                PIC  X(01).
000060    03  ()支払金額            PIC  9(13).
000070    03  FILLER                PIC  X(01).
000080    03  ()状態フラグ          PIC  X(01).
