000010************************************************
000020* (COM_LOG)
000030************************************************
000040 01  ()ＫＥＹ                 PIC  X(6).
000050 01  ()エラー有無フラグ       PIC  X(1).
000060 01  ()プロジェクトコード     PIC  X(3).
000070 01  ()プロジェクト名         PIC  N(15).
000080 01  ()プログラムＩＤ         PIC  N(15).
000090 01  ()プログラム名           PIC  N(15).
000100 01  ()メッセージ             PIC  N(100).
000110 01  ()業務日付               PIC  X(8).
000120 01  ()マシンデート           PIC  X(8).
000130 01  ()マシンタイム           PIC  X(6).
