000010******************************************************************
000020*         ＜東銀リース＞                                         *
000030*      1. プログラム名    ：日付算出                             *
000040*      2. コピー句ID      ：CPBCO004                             *
000050*      3. 処理概要        ：1、基準日の該当する月の末日を求める  *
000060*                           2、基準日より先日付、遡り日付を求める*
000070*                           3、先日付、遡り日付の月の末日を求める*
000080*      4. 作成者          ：金子 晃                              *
000090*      5. 作成日          ：2004.05.13                           *
000100******************************************************************
000110*     ＜改訂履歴 １．１版＞                                      *
000120******************************************************************
000150  03  ()入力領域.
000160    05  ()Ｉ－基準日           PIC  9(008).
000170    05  ()Ｉ－加算単位         PIC  X(001).
000180    05  ()Ｉ－加算数           PIC S9(003).
000190  03  ()出力領域.
000200    05  ()Ｏ－当月末日         PIC  9(002).
000210    05  ()Ｏ－当月末日年月日   PIC  9(008).
000220    05  ()Ｏ－加算後日付       PIC  9(008).
000230    05  ()Ｏ－加算後末日       PIC  9(002).
000240    05  ()Ｏ－加算後末日年月日 PIC  9(008).
000250    05  ()Ｏ－エラーメッセージ PIC  X(040).
000260    05  ()Ｏ－リターンコード   PIC  9(001).
