      *****************************************************************
      *   見積物件(D27MBK_TBL)
      *****************************************************************
           03  ()見積番号－連番
                                     PIC S9(007).
           03  ()見積番号枝番        PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()物件番号            PIC S9(003).
           03  ()取得価額            PIC S9(013).
           03  ()資産分類コード
                                     PIC  X(005).
           03  ()耐用年数            PIC S9(002).
           03  ()中古区分            PIC  X(001).
           03  ()税法区分            PIC  X(001).
           03  ()動総付保区分        PIC  X(001).
           03  ()固定資産税区分
                                     PIC  X(001).
           03  ()残価設定額          PIC S9(013).
           03  ()月額料金            PIC S9(013).
           03  ()保険会社区分        PIC  X(004).
           03  ()取得額消費税        PIC S9(013).
           03  ()動総率              PIC S9(002)V9(008).
           03  ()動総保険料現価
                                     PIC S9(013).
           03  ()固定資産税現価
                                     PIC S9(013).
           03  ()契約総額結果        PIC S9(013).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()合算先契約種類
                                     PIC  X(003).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()支払日パターン
                                     PIC  X(001).
           03  ()購入先コード        PIC  X(009).
           03  ()解約物件契約番号
                                     PIC  X(015).
           03  ()一次二次判別区分
                                     PIC  X(001).
           03  ()動総保険料          PIC S9(013).
           03  ()固定資産税          PIC S9(013).
           03  ()残価区分            PIC  X(001).
           03  ()固定資産税率        PIC S9(002)V9(008).
           03  ()物件名称            PIC  X(060).
           03  ()型式                PIC  X(025).
           03  ()数量                PIC S9(004).
           03  ()単位                PIC  X(001).
           03  ()設置場所名          PIC  X(080).
           03  ()郵便番号            PIC  X(007).
           03  ()納付先コード        PIC  X(006).
           03  ()住所１              PIC  X(060).
           03  ()住所２              PIC  X(060).
           03  ()住所３              PIC  X(060).
           03  ()税負担区分          PIC  X(001).
           03  ()少額資産区分        PIC  X(001).
           03  ()製造者名            PIC  X(060).
           03  ()物件区分            PIC  X(002).
           03  ()物件種類区分        PIC  X(002).
           03  ()メーカー区分        PIC  X(003).
           03  ()物件名カナ          PIC  X(060).
           03  ()税種類区分          PIC  X(001).
           03  ()設置場所名カナ
                                     PIC  X(080).
           03  ()保証会社            PIC  X(009).
           03  ()他社残価保証先
                                     PIC  X(009).
           03  ()指定電子計算機
                                     PIC  X(040).
           03  ()電子計算機所有者
                                     PIC  X(040).
           03  ()他社購入額          PIC S9(013).
           03  ()自社残価            PIC S9(013).
           03  ()他社残価            PIC S9(013).
           03  ()保守区分            PIC  X(001).
           03  ()代理回収保守区分
                                     PIC  X(001).
           03  ()リファレンス番号１
                                     PIC  X(010).
           03  ()リファレンス番号２
                                     PIC  X(010).
           03  ()リファレンス番号３
                                     PIC  X(010).
           03  ()リファレンス番号４
                                     PIC  X(010).
           03  ()短縮申請区分        PIC  X(001).
           03  ()所有区分            PIC  X(001).
           03  ()支払保守料総額
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()機械番号            PIC  X(020).
           03  ()損害保険区分        PIC  X(001).
           03  ()賠償保険区分        PIC  X(001).
           03  ()住所コード          PIC  X(011).
