      *****************************************************************
      *   解約履歴＿債権解約(D467KSK_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()解約連番            PIC S9(002).
           03  ()解約承継区分
                                     PIC  X(001).
           03  ()解約料金            PIC S9(013).
           03  ()解約後料金          PIC S9(013).
           03  ()解約後消費税
                                     PIC S9(013).
           03  ()月額料金            PIC S9(013).
           03  ()解約後契約金額
                                     PIC S9(013).
           03  ()解約後契約金額消費税
                                     PIC S9(013).
           03  ()まるめ単位          PIC  X(001).
           03  ()合意解約金          PIC S9(013).
           03  ()損害賠償金          PIC S9(013).
           03  ()売却代充当区分
                                     PIC  X(001).
           03  ()売却代充当額
                                     PIC S9(013).
           03  ()過入金額            PIC S9(013).
           03  ()過払金額            PIC S9(013).
           03  ()次回再リース料
                                     PIC S9(013).
           03  ()消費税率区分
                                     PIC  X(002).
           03  ()解約金請求金額合計
                                     PIC S9(013).
           03  ()解約金請求額消費税
                                     PIC S9(013).
           03  ()解約回数            PIC S9(002).
           03  ()解約売上年月
                                     PIC  X(006).
           03  ()未徴収金残高
                                     PIC S9(013).
           03  ()過入金返金額
                                     PIC S9(013).
           03  ()過入金返金額消費税
                                     PIC S9(013).
           03  ()前受金返金額
                                     PIC S9(013).
           03  ()前受金返金額消費税
                                     PIC S9(013).
           03  ()返金取引先コード
                                     PIC  X(007).
           03  ()返金請求先コード
                                     PIC  X(003).
           03  ()過入金返金日
                                     PIC  X(008).
           03  ()返金日別途指定フラグ
                                     PIC  X(001).
           03  ()返金銀行コード
                                     PIC  X(004).
           03  ()返金支店コード
                                     PIC  X(003).
           03  ()返金口座種類
                                     PIC  X(001).
           03  ()返金口座番号
                                     PIC  X(010).
           03  ()返金口座名義人
                                     PIC  X(030).
           03  ()解約分前払リース料
                                     PIC S9(013).
           03  ()解約分前払リース料消費税
                                     PIC S9(013).
           03  ()前受リース料処理区分
                                     PIC  X(001).
           03  ()残回収回数          PIC S9(003).
           03  ()残リース料          PIC S9(013).
           03  ()解約残価            PIC S9(013).
           03  ()解約保証残価
                                     PIC S9(013).
           03  ()減額法１１０
                                     PIC S9(013).
           03  ()減額法１０５
                                     PIC S9(013).
           03  ()保険価格１１０
                                     PIC S9(013).
           03  ()実質元本残１０５
                                     PIC S9(013).
           03  ()実質未回収元本残
                                     PIC S9(013).
           03  ()未徴収固定資産税
                                     PIC S9(013).
           03  ()未徴収保険料
                                     PIC S9(013).
           03  ()未徴収合計額
                                     PIC S9(013).
           03  ()実質元本残１０２
                                     PIC S9(013).
           03  ()解約計上粗利
                                     PIC S9(013).
           03  ()勘定処理コード
                                     PIC  X(002).
           03  ()解約仕訳コード
                                     PIC  X(003).
           03  ()請求件名            PIC  X(040).
           03  ()入金停止日          PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
