      *****************************************************************
      *   解約履歴＿債権採算(D466KSS_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()回収サイト          PIC S9(002).
           03  ()回収日              PIC S9(002).
           03  ()回収方法            PIC  X(001).
           03  ()基本利回り          PIC S9(002)V9(008).
           03  ()実質利回り          PIC S9(002)V9(008).
           03  ()粗利額              PIC S9(013).
           03  ()一般基本利回り
                                     PIC S9(002)V9(008).
           03  ()一般実質利回り
                                     PIC S9(002)V9(008).
           03  ()一般粗利額          PIC S9(013).
           03  ()固定資産税          PIC S9(013).
           03  ()動総保険料          PIC S9(013).
           03  ()委託保守料          PIC S9(013).
           03  ()固定資産税現価
                                     PIC S9(013).
           03  ()動総保険料現価
                                     PIC S9(013).
           03  ()委託保守料現価
                                     PIC S9(013).
           03  ()一般固定資産税現価
                                     PIC S9(013).
           03  ()一般動総保険料現価
                                     PIC S9(013).
           03  ()一般委託保守料現価
                                     PIC S9(013).
           03  ()前受メリット
                                     PIC S9(013).
           03  ()一般前受メリット
                                     PIC S9(013).
           03  ()繰延メリット
                                     PIC S9(013).
           03  ()一般繰延メリット
                                     PIC S9(013).
           03  ()基本リース料総額
                                     PIC S9(013).
           03  ()基本リース料１回分
                                     PIC S9(013).
           03  ()固定資産税費用総額
                                     PIC S9(013).
           03  ()固定資産税費用１回分
                                     PIC S9(013).
           03  ()動総保険料費用総額
                                     PIC S9(013).
           03  ()動総保険料費用１回分
                                     PIC S9(013).
           03  ()リース料総額
                                     PIC S9(013).
           03  ()リース料１回分
                                     PIC S9(013).
           03  ()前受メリット総額
                                     PIC S9(013).
           03  ()前受メリット１回分
                                     PIC S9(013).
           03  ()繰延メリット総額
                                     PIC S9(013).
           03  ()繰延メリット１回分
                                     PIC S9(013).
           03  ()実質リース料総額
                                     PIC S9(013).
           03  ()実質リース料１回分
                                     PIC S9(013).
           03  ()実質リース料現価
                                     PIC S9(013).
           03  ()初期費用            PIC S9(013).
           03  ()期中費用現価
                                     PIC S9(013).
           03  ()基本リース料総額当社
                                     PIC S9(013).
           03  ()基本リース料１回分当社
                                     PIC S9(013).
           03  ()固定資産税費用総額当社
                                     PIC S9(013).
           03  ()固定資産税費用１回分当社
                                     PIC S9(013).
           03  ()動総保険料費用総額当社
                                     PIC S9(013).
           03  ()動総保険料費用１回分当社
                                     PIC S9(013).
           03  ()リース料総額当社
                                     PIC S9(013).
           03  ()リース料１回分当社
                                     PIC S9(013).
           03  ()前受メリット総額当社
                                     PIC S9(013).
           03  ()前受メリット１回分当社
                                     PIC S9(013).
           03  ()繰延メリット総額当社
                                     PIC S9(013).
           03  ()繰延メリット１回分当社
                                     PIC S9(013).
           03  ()実質リース料総額当社
                                     PIC S9(013).
           03  ()実質リース料１回分当社
                                     PIC S9(013).
           03  ()実質リース料現価当社
                                     PIC S9(013).
           03  ()残価回収現価当社
                                     PIC S9(013).
           03  ()初期費用当社
                                     PIC S9(013).
           03  ()期中費用現価当社
                                     PIC S9(013).
           03  ()残価回収現価
                                     PIC S9(013).
           03  ()粗利益全体          PIC S9(013).
           03  ()一般実質リース料現価
                                     PIC S9(013).
           03  ()一般残価回収現価
                                     PIC S9(013).
           03  ()一般期中費用現価
                                     PIC S9(013).
           03  ()一般粗利額全体
                                     PIC S9(013).
           03  ()一般実質リース料現価当社
                                     PIC S9(013).
           03  ()一般残価回収現価当社
                                     PIC S9(013).
           03  ()一般期中費用現価当社
                                     PIC S9(013).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
