      *****************************************************************
      *   口振状態管理(D87KJK_TBL)
      *****************************************************************
           03  ()振替銀行コード
                                     PIC  X(004).
           03  ()約定日              PIC  X(002).
           03  ()振替銀行名          PIC  X(040).
           03  ()振替日              PIC  X(008).
           03  ()作成日              PIC  X(008).
           03  ()委託者コード        PIC  X(010).
           03  ()委託者名            PIC  X(030).
           03  ()引落日－月          PIC  X(002).
           03  ()引落日－日          PIC  X(002).
           03  ()取引銀行番号        PIC  X(004).
           03  ()取引銀行名          PIC  X(015).
           03  ()取引支店番号        PIC  X(003).
           03  ()取引支店名          PIC  X(015).
           03  ()委託者預金種目
                                     PIC  X(001).
           03  ()委託者口座番号
                                     PIC  X(010).
           03  ()約定年月日          PIC  X(008).
           03  ()口振ステータス
                                     PIC  X(001).
           03  ()引落日－年          PIC  X(002).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()変更済フラグ        PIC  X(001).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()ファイル名          PIC  X(008).
           03  ()取引銀行名漢字
                                     PIC  X(016).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()担当者コード        PIC  X(008).
           03  ()ファイル作成先
                                     PIC  X(040).
           03  ()振替先電話番号
                                     PIC  X(015).
           03  ()送信先電話番号
                                     PIC  X(015).
           03  ()送信先ＦＡＸ番号
                                     PIC  X(015).
