      *****************************************************************
      *   提携物件(D337TKB_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()契約種類            PIC  X(001).
           03  ()物件番号            PIC S9(003).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()提携先区分          PIC  X(002).
           03  ()提携先契約番号
                                     PIC  X(012).
           03  ()提携先物件番号
                                     PIC  X(003).
           03  ()契約年月日          PIC  X(008).
           03  ()検収予定年月日
                                     PIC  X(008).
           03  ()検収年月日          PIC  X(008).
           03  ()期間                PIC S9(003).
           03  ()リース料            PIC S9(013).
           03  ()リース料単価金額
                                     PIC S9(013).
           03  ()リース料消費税額単価
                                     PIC S9(013).
           03  ()リース金額（初め）
                                     PIC S9(013).
           03  ()諸費用その他１
                                     PIC S9(013).
           03  ()月額平均保守料
                                     PIC S9(013).
           03  ()前受月数            PIC S9(003).
           03  ()前受リース料
                                     PIC S9(013).
           03  ()契約金額            PIC S9(013).
           03  ()支払回数            PIC S9(002).
           03  ()設置期間            PIC S9(003).
           03  ()一回リース料入金年月日
                                     PIC  X(008).
           03  ()物件名（漢字）
                                     PIC  X(060).
           03  ()物件名（カナ）
                                     PIC  X(060).
           03  ()仕様製造番号
                                     PIC  X(020).
           03  ()数量                PIC S9(003).
           03  ()購入金額            PIC S9(013).
           03  ()仕入消費税額
                                     PIC S9(013).
           03  ()資産コード          PIC  X(007).
           03  ()耐用年数            PIC S9(002).
           03  ()中古資産コード
                                     PIC  X(001).
           03  ()動総保険コード
                                     PIC  X(004).
           03  ()動総保険料率
                                     PIC S9(002)V9(008).
           03  ()納付先コード
                                     PIC  X(006).
           03  ()税区分              PIC  X(001).
           03  ()税負担コード
                                     PIC  X(001).
           03  ()設置場所郵便番号
                                     PIC  X(007).
           03  ()設置場所住所
                                     PIC  X(100).
           03  ()設置場所名（漢字）
                                     PIC  X(080).
           03  ()設置場所名（カナ）
                                     PIC  X(080).
           03  ()型式番号            PIC  X(015).
           03  ()個別リース料
                                     PIC S9(013).
           03  ()残価額              PIC S9(013).
           03  ()残価保証区分
                                     PIC  X(001).
           03  ()会社コード          PIC  X(002).
           03  ()支店コード          PIC  X(006).
           03  ()エンドユーザー：氏名
                                     PIC  X(060).
           03  ()エンドユーザー：郵便番号
                                     PIC  X(007).
           03  ()エンドユーザー：住所
                                     PIC  X(100).
           03  ()エンドユーザー：電話番号
                                     PIC  X(012).
           03  ()エンドユーザー：生年月日
                                     PIC  X(008).
           03  ()リース料単位区分
                                     PIC  X(001).
           03  ()再リース料係数
                                     PIC S9(005).
           03  ()手数料比率          PIC S9(003).
           03  ()ユーザーリファレンスＮＯ１
                                     PIC  X(010).
           03  ()ユーザーリファレンスＮＯ２
                                     PIC  X(010).
           03  ()ユーザーリファレンスＮＯ３
                                     PIC  X(010).
           03  ()勘定処理コード
                                     PIC  X(002).
           03  ()売主名              PIC  X(060).
           03  ()売主住所            PIC  X(060).
           03  ()支払条件コード
                                     PIC  X(030).
           03  ()開始年月日          PIC  X(008).
           03  ()終了年月日          PIC  X(008).
           03  ()枝番                PIC S9(003).
           03  ()再リース料          PIC S9(013).
           03  ()保守契約先名
                                     PIC  X(030).
           03  ()実質リース料ＰＶ
                                     PIC S9(013).
           03  ()残価ＰＶ            PIC S9(013).
           03  ()一部解約区分
                                     PIC  X(001).
           03  ()解約理由コード
                                     PIC  X(001).
           03  ()資産処分コード
                                     PIC  X(001).
           03  ()支払済前払リース料
                                     PIC S9(013).
           03  ()支払済前払リース料消費税
                                     PIC S9(013).
           03  ()過剰リース料
                                     PIC S9(013).
           03  ()過剰リース料消費税
                                     PIC S9(013).
           03  ()未払いリース料
                                     PIC S9(013).
           03  ()未払いリース料消費税
                                     PIC S9(013).
           03  ()提携規損金          PIC S9(013).
           03  ()提携規損金消費税
                                     PIC S9(013).
           03  ()差引金額            PIC S9(013).
           03  ()差引金額消費税
                                     PIC S9(013).
           03  ()未払月数            PIC S9(003).
           03  ()振込停止年月日
                                     PIC  X(008).
           03  ()契約区分            PIC S9(002).
           03  ()会員番号            PIC  X(016).
           03  ()解約年月日          PIC  X(008).
           03  ()解約リース料
                                     PIC S9(013).
           03  ()資産番号            PIC S9(009).
           03  ()旧資産番号          PIC S9(009).
           03  ()売却額              PIC S9(013).
           03  ()売却額消費税
                                     PIC S9(013).
           03  ()売却事務代行手数料
                                     PIC S9(013).
           03  ()売却事務代行手数料消費税
                                     PIC S9(013).
           03  ()売却年月日          PIC  X(008).
           03  ()機種コード          PIC  X(015).
           03  ()機番                PIC  X(012).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
