      *****************************************************************
      *   契約番号採番テーブル(D316SBN_TBL)
      *****************************************************************
           03  ()部所                PIC  X(002).
           03  ()契約形態            PIC  X(001).
           03  ()最終契約番号
                                     PIC  X(010).
           03  ()部所名              PIC  X(020).
           03  ()開始番号            PIC S9(009).
           03  ()終了番号            PIC S9(009).
           03  ()採番前最終番号
                                     PIC  X(010).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
