      *****************************************************************
      *   承継管理テーブル(D230SKS_TBL)
      *****************************************************************
           03  ()承継元－契約番号
                                     PIC  X(010).
           03  ()承継元－再リース回数
                                     PIC S9(002).
           03  ()承継申請連番
                                     PIC S9(002).
           03  ()承継先－連番
                                     PIC S9(002).
           03  ()承継先－契約番号
                                     PIC  X(010).
           03  ()承継先－再リース回数
                                     PIC S9(002).
           03  ()承継先－契約開始日
                                     PIC  X(008).
           03  ()エントリ日          PIC  X(008).
           03  ()業務年月            PIC  X(006).
           03  ()再リース承継区分
                                     PIC  X(001).
           03  ()元契約番号          PIC  X(010).
           03  ()元再リース回数
                                     PIC S9(002).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(006).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
