      *****************************************************************
      *   資産種類マスタ(D12SIB_TBL)
      *****************************************************************
           03  ()資産種類            PIC  X(007).
           03  ()適用年月日          PIC  X(008).
           03  ()資産大分類名称
                                     PIC  X(040).
           03  ()資産名称            PIC  X(060).
           03  ()耐用年数            PIC S9(002).
           03  ()税法区分            PIC  X(001).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()申告用判定コード
                                     PIC  X(001).
           03  ()開示用判定コード
                                     PIC  X(001).
           03  ()年次統計用判定コード
                                     PIC  X(001).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()資産名称カナ        PIC  X(040).
           03  ()資産略称            PIC  X(010).
           03  ()資産略称カナ        PIC  X(012).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
