      *****************************************************************
      *   帳票管理テーブル(D980CYK_TBL)
      *****************************************************************
           03  ()帳票担当者コード
                                     PIC  X(008).
           03  ()帳票ＮＯ            PIC S9(012).
           03  ()部課コード          PIC  X(004).
           03  ()帳票担当者名
                                     PIC  X(020).
           03  ()処理ＩＤ            PIC  X(008).
           03  ()帳票名              PIC  X(080).
           03  ()件数                PIC S9(006).
           03  ()作成日              PIC  X(008).
           03  ()作成時刻            PIC  X(008).
           03  ()最新印刷日          PIC  X(008).
           03  ()最新印刷時刻
                                     PIC  X(008).
           03  ()印刷状態            PIC  X(002).
           03  ()エラーコード
                                     PIC  X(006).
           03  ()エラータイトル
                                     PIC  X(020).
           03  ()区分                PIC  X(001).
           03  ()頁数                PIC S9(004).
           03  ()未印刷削除日
                                     PIC  X(008).
           03  ()印刷済削除日
                                     PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
