      *****************************************************************
      *   条件指示マスタ(D092JKS_TBL)
      *****************************************************************
           03  ()区分                PIC  X(001).
           03  ()条件指示番号
                                     PIC S9(003).
           03  ()条件指示名称
                                     PIC  X(120).
           03  ()担保徴求区分
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
