      *****************************************************************
      *   取引先残高情報マスタ(D015TRZ_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()処理年月            PIC  X(006).
           03  ()グループコード
                                     PIC  X(009).
           03  ()契約数              PIC S9(006).
           03  ()債権残高            PIC S9(013).
           03  ()債権残高消費税
                                     PIC S9(013).
           03  ()約定債権残高
                                     PIC S9(013).
           03  ()約定債権残高消費税
                                     PIC S9(013).
           03  ()与信残高            PIC S9(013).
           03  ()与信残高消費税
                                     PIC S9(013).
           03  ()未徴収金残高
                                     PIC S9(013).
           03  ()未徴収金残高消費税
                                     PIC S9(013).
           03  ()前受金残高          PIC S9(013).
           03  ()前受金残高消費税
                                     PIC S9(013).
           03  ()約定元本残高
                                     PIC S9(013).
           03  ()保証残価            PIC S9(013).
           03  ()決裁済契約総額
                                     PIC S9(013).
           03  ()契約済未検収契約総額
                                     PIC S9(013).
           03  ()成約総額            PIC S9(013).
           03  ()粗利総額            PIC S9(013).
           03  ()未消込残高          PIC S9(013).
           03  ()債権残確定年月日
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
