      *****************************************************************
      *   手形印紙税マスタ(D183TIZ_TBL)
      *****************************************************************
           03  ()適用年月日          PIC  X(008).
           03  ()連番                PIC S9(007).
           03  ()範囲金額            PIC S9(013).
           03  ()印紙税              PIC S9(013).
           03  ()文書種類区分
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
