      *****************************************************************
      *   保険金送金先マスタ(D114HSK_TBL)
      *****************************************************************
           03  ()送金先コード
                                     PIC  X(002).
           03  ()送金先名            PIC  X(080).
           03  ()送金先名略称
                                     PIC  X(010).
           03  ()送金先名カナ
                                     PIC  X(025).
           03  ()送金先名略称カナ
                                     PIC  X(012).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()支払先コード
                                     PIC  X(005).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
