      *****************************************************************
      *   契約番号テーブル(D315KNO_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()最新再リース回数
                                     PIC S9(002).
           03  ()最終物件番号
                                     PIC S9(004).
           03  ()請求回収条件変更フラグ
                                     PIC  X(001).
           03  ()欠落請求書発行済フラグ
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()年号                PIC  X(002).
           03  ()物件処分申請連番
                                     PIC S9(002).
           03  ()予約中再リース回数
                                     PIC S9(002).
           03  ()前回再リース回数
                                     PIC S9(002).
           03  ()依頼番号            PIC S9(007).
           03  ()最終枝番            PIC S9(003).
           03  ()包括申請連番
                                     PIC S9(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
