      *****************************************************************
      *   管理与信(D85KRY_TBL)
      *****************************************************************
           03  ()与信管理先コード
                                     PIC  X(009).
           03  ()与信管理先名        PIC  X(080).
           03  ()主管部店コード
                                     PIC  X(004).
           03  ()債務者格付          PIC  X(004).
           03  ()自動与信区分        PIC  X(001).
           03  ()解約理由            PIC  X(002).
           03  ()事故年月日          PIC  X(008).
           03  ()解約区分            PIC  X(001).
           03  ()対外債権残高        PIC S9(013).
           03  ()対外債権残高消費税
                                     PIC S9(013).
           03  ()前受金残高          PIC S9(013).
           03  ()前受金残高消費税
                                     PIC S9(013).
           03  ()貸付金別口          PIC S9(013).
           03  ()貸付金別口消費税
                                     PIC S9(013).
           03  ()非稼働資産          PIC S9(013).
           03  ()貯蔵品              PIC S9(013).
           03  ()信用保険求償        PIC S9(013).
           03  ()求償入金情報        PIC  X(002).
           03  ()貸倒引当金有税
                                     PIC S9(013).
           03  ()貸倒引当金無税
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
