      *****************************************************************
      *   業種マスタ(D833GYS_TBL)
      *****************************************************************
           03  ()帝国業種コード
                                     PIC  X(005).
           03  ()帝国業種名称
                                     PIC  X(060).
           03  ()帝国業種カナ名称
                                     PIC  X(060).
           03  ()日銀業種コード
                                     PIC  X(007).
           03  ()日銀業種名称
                                     PIC  X(060).
           03  ()日本産業分類コード
                                     PIC  X(007).
           03  ()日本産業分類名称
                                     PIC  X(060).
           03  ()ＢＴＭ業種コード
                                     PIC  X(007).
           03  ()ＢＴＭ業種名称
                                     PIC  X(060).
           03  ()予備１              PIC  X(007).
           03  ()名称１              PIC  X(060).
           03  ()予備２              PIC  X(007).
           03  ()名称２              PIC  X(060).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
