      *****************************************************************
      *   解約申請＿貸付金繰越弁済(D518KKK_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()申請連番            PIC S9(002).
           03  ()弁済予定日          PIC  X(008).
           03  ()全部一部区分
                                     PIC  X(001).
           03  ()元本繰上回数
                                     PIC S9(003).
           03  ()約定元本金額
                                     PIC S9(013).
           03  ()繰上元本金額
                                     PIC S9(013).
           03  ()約定利息            PIC S9(013).
           03  ()経過利息            PIC S9(013).
           03  ()戻し利息            PIC S9(013).
           03  ()違約金              PIC S9(013).
           03  ()消費税              PIC S9(013).
           03  ()元本残高            PIC S9(013).
           03  ()消込フラグ          PIC  X(001).
           03  ()確定フラグ          PIC  X(001).
           03  ()決裁フラグ          PIC  X(001).
           03  ()決裁日              PIC  X(008).
           03  ()確定日              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
