      *****************************************************************
      *   管理与信状況(D855KJO_TBL)
      *****************************************************************
           03  ()与信管理先コード
                                     PIC  X(009).
           03  ()状況識別区分
                                     PIC  X(001).
           03  ()連番                PIC S9(004).
           03  ()年月日              PIC  X(008).
           03  ()状況内容            PIC  X(200).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
