      *****************************************************************
      *   日本特殊陶業部署マスタ(D081NTG_TBL)
      *****************************************************************
           03  ()登録番号            PIC  X(004).
           03  ()先方参照番号
                                     PIC  X(010).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()部門名称１          PIC  X(040).
           03  ()部門名称２          PIC  X(040).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
