      *****************************************************************
      *   契約売掛債権明細(D414USM_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()明細番号            PIC S9(003).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()額面金額            PIC S9(013).
           03  ()期日                PIC  X(008).
           03  ()利息期日            PIC  X(008).
           03  ()日数                PIC S9(003).
           03  ()割引率              PIC S9(002)V9(008).
           03  ()割引料              PIC S9(013).
           03  ()取立手数料等
                                     PIC S9(013).
           03  ()取立手数料等消費税額
                                     PIC S9(013).
           03  ()買取代金額          PIC S9(013).
           03  ()社内金利区分
                                     PIC  X(001).
           03  ()社内金利            PIC S9(002)V9(008).
           03  ()実質年率            PIC S9(002)V9(008).
           03  ()粗利                PIC S9(013).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()社内金利－一般
                                     PIC S9(002)V9(008).
           03  ()粗利－一般          PIC S9(013).
           03  ()期限前決済日
                                     PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
