      *****************************************************************
      *   入金振込人照会マスタ(D14NYS_TBL)
      *****************************************************************
           03  ()取引先コード        PIC  X(009).
           03  ()請求先コード        PIC  X(005).
           03  ()連番                PIC S9(002).
           03  ()一括入金コード
                                     PIC  X(005).
           03  ()振込名義人名        PIC  X(048).
           03  ()仕向銀行名          PIC  X(015).
           03  ()仕向支店名          PIC  X(015).
           03  ()最新使用日          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()読替名              PIC  X(048).
           03  ()振込手数料          PIC S9(013).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
