      *****************************************************************
      *   譲渡人別原債務者マスタ(D093JYS_TBL)
      *****************************************************************
           03  ()譲渡人取引先コード
                                     PIC  X(009).
           03  ()譲渡人契約先コード
                                     PIC  X(005).
           03  ()原債務者取引先コード
                                     PIC  X(009).
           03  ()原債務者契約先コード
                                     PIC  X(005).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
