      *****************************************************************
      *   見積割賦展開(D29KPT_TBL)
      *****************************************************************
           03  ()見積番号－連番
                                     PIC S9(007).
           03  ()見積番号枝番        PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()連番                PIC S9(003).
           03  ()サーバ番号          PIC  X(002).
           03  ()物件番号            PIC S9(003).
           03  ()回収年月日          PIC  X(008).
           03  ()元本                PIC S9(013).
           03  ()利息                PIC S9(013).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()売上年月            PIC  X(006).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()元本残高            PIC S9(013).
           03  ()賦払金              PIC S9(013).
           03  ()諸費用              PIC S9(013).
           03  ()残リース料          PIC S9(013).
           03  ()返済年月日          PIC  X(008).
           03  ()期間月数            PIC S9(003).
           03  ()期間日数            PIC S9(003).
           03  ()利息計算開始日
                                     PIC  X(008).
           03  ()利息計算終了日
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
