      *****************************************************************
      *   徴求書類(D342CHS_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()徴求管理種類
                                     PIC  X(001).
           03  ()申請連番            PIC S9(002).
           03  ()書類種類            PIC  X(003).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()支払先コード
                                     PIC  X(005).
           03  ()書類連番            PIC S9(003).
           03  ()支払依頼時チェック
                                     PIC  X(001).
           03  ()取得年月日          PIC  X(008).
           03  ()徴求書類取得済フラグ
                                     PIC  X(001).
           03  ()連番                PIC S9(002).
           03  ()コメント欄          PIC  X(080).
           03  ()徴求書類作成区分
                                     PIC  X(001).
           03  ()回収済フラグ
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()注文書番号          PIC  X(015).
           03  ()送付日              PIC  X(008).
           03  ()発効日              PIC  X(008).
           03  ()支払予定日          PIC  X(008).
           03  ()書類登録者          PIC  X(008).
           03  ()契約登録時チェック
                                     PIC  X(001).
           03  ()検収登録時チェック
                                     PIC  X(001).
           03  ()部店長点検日
                                     PIC  X(008).
           03  ()部店長点検者
                                     PIC  X(008).
           03  ()ミドルオフィス点検日
                                     PIC  X(008).
           03  ()ミドルオフィス点検者
                                     PIC  X(008).
           03  ()事務管理部受領日
                                     PIC  X(008).
           03  ()事務管理部受領者
                                     PIC  X(008).
           03  ()無効フラグ          PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
