      *****************************************************************
      *   グループマスタ(D084GRP_TBL)
      *****************************************************************
           03  ()グループコード
                                     PIC  X(009).
           03  ()グループ名          PIC  X(080).
           03  ()グループ名カナ
                                     PIC  X(040).
           03  ()部課コード          PIC  X(004).
           03  ()担当者コード
                                     PIC  X(008).
           03  ()郵便番号            PIC  X(007).
           03  ()住所コード          PIC  X(011).
           03  ()住所１              PIC  X(060).
           03  ()住所２              PIC  X(060).
           03  ()住所３              PIC  X(060).
           03  ()使用不可フラグ
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
