      *****************************************************************
      *   GLOVIAセキュリティマスタ(D061GLS_TBL)
      *****************************************************************
           03  ()ユーザＩＤ          PIC  X(010).
           03  ()会社コード          PIC  X(002).
           03  ()アクセス権限
                                     PIC  X(012).
           03  ()自部門コード１
                                     PIC  X(005).
           03  ()自部門コード２
                                     PIC  X(005).
           03  ()自部門コード３
                                     PIC  X(005).
           03  ()自部門コード４
                                     PIC  X(005).
           03  ()自部門コード５
                                     PIC  X(005).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()更新者              PIC  X(008).
