      *****************************************************************
      *   協調転物件代金売却(D346KTB_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()連番                PIC S9(003).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()回収サイト          PIC S9(002).
           03  ()回収日              PIC S9(002).
           03  ()回収予定日          PIC  X(008).
           03  ()売却代金            PIC S9(013).
           03  ()売却代金消費税
                                     PIC S9(013).
           03  ()売却代手数料
                                     PIC S9(013).
           03  ()売却代総額          PIC S9(013).
           03  ()売却代総額消費税
                                     PIC S9(013).
           03  ()回収額              PIC S9(013).
           03  ()回収額消費税
                                     PIC S9(013).
           03  ()回収年月日          PIC  X(008).
           03  ()未回収額            PIC S9(013).
           03  ()請求書発行済フラグ
                                     PIC  X(001).
           03  ()取消請求書発行済フラグ
                                     PIC  X(001).
           03  ()請求書番号          PIC S9(007).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()回収方法            PIC  X(001).
           03  ()ソフト売却代金
                                     PIC S9(013).
           03  ()ソフト売却代金消費税
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()請求内訳コード
                                     PIC  X(003).
           03  ()消込通番            PIC  X(011).
           03  ()初回入金日          PIC  X(008).
           03  ()消込年月日          PIC  X(008).
