      *****************************************************************
      *   休日カレンダ(D801KKM_TBL)
      *****************************************************************
           03  ()休日年月日          PIC  X(008).
           03  ()カレンダ区分
                                     PIC  X(001).
           03  ()休日区分            PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
