      *****************************************************************
      *   GLOVIA利用者マスタ(D063GLT_TBL)
      *****************************************************************
           03  ()ユーザＩＤ          PIC  X(010).
           03  ()会社コード          PIC  X(002).
           03  ()社員コード          PIC  X(008).
           03  ()パスワード          PIC  X(010).
           03  ()パスワード有効期間区分
                                     PIC  X(002).
           03  ()データベース利用者名
                                     PIC  X(010).
           03  ()データベースパスワード
                                     PIC  X(010).
           03  ()ＬｉｓｔＷＯＲＫ連携用利用者名
                                     PIC  X(010).
           03  ()ＬｉｓｔＷＯＲＫ連携用パスワード
                                     PIC  X(010).
           03  ()ユーザ開放域
                                     PIC  X(064).
           03  ()システムリザーブ
                                     PIC  X(064).
           03  ()利用者区分          PIC  X(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()更新者              PIC  X(008).
