      *****************************************************************
      *   変更申請(D360HSI_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()変更予定日          PIC  X(008).
           03  ()変更内容            PIC  X(002).
           03  ()申請状態フラグ
                                     PIC  X(001).
           03  ()申請エントリ日
                                     PIC  X(008).
           03  ()申請書出力年月日
                                     PIC  X(008).
           03  ()処理年月日          PIC  X(008).
           03  ()処理年月            PIC  X(006).
           03  ()取消年月日          PIC  X(008).
           03  ()取消年月            PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()担当部店コード
                                     PIC  X(004).
