      *****************************************************************
      *   契約内容個別情報(D310KKJ_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()対抗要件            PIC  X(002).
           03  ()割引料              PIC S9(013).
           03  ()受取手数料          PIC S9(013).
           03  ()受取手数料消費税
                                     PIC S9(013).
           03  ()取立手数料          PIC S9(013).
           03  ()取立手数料消費税
                                     PIC S9(013).
           03  ()利率基数区分
                                     PIC  X(001).
           03  ()利息端数区分
                                     PIC  X(001).
           03  ()片端両端区分
                                     PIC  X(001).
           03  ()休日対応区分
                                     PIC  X(001).
           03  ()利息計算区分
                                     PIC  X(001).
           03  ()初回利息区分
                                     PIC  X(001).
           03  ()実質年率            PIC S9(002)V9(008).
           03  ()スプレッド          PIC S9(002)V9(008).
           03  ()初回元本回収日
                                     PIC  X(008).
           03  ()元本サイクル
                                     PIC S9(002).
           03  ()元本回数            PIC S9(003).
           03  ()初回利息回収日
                                     PIC  X(008).
           03  ()利息サイクル
                                     PIC S9(002).
           03  ()利息回数            PIC S9(003).
           03  ()見直しサイクル
                                     PIC S9(002).
           03  ()利率確定期限
                                     PIC  X(008).
           03  ()第１回返済日
                                     PIC  X(008).
           03  ()第２回返済日
                                     PIC  X(008).
           03  ()返済原資            PIC  X(080).
           03  ()裏付取引            PIC  X(060).
           03  ()手形裏書方法
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
