      *****************************************************************
      *   商品マスタ(D031FKM_TBL)
      *****************************************************************
           03  ()物件区分            PIC  X(002).
           03  ()種類区分            PIC  X(002).
           03  ()メーカー区分
                                     PIC  X(003).
           03  ()物件区分名          PIC  X(060).
           03  ()種類区分名          PIC  X(060).
           03  ()メーカー名          PIC  X(060).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
