      *****************************************************************
      *   見積債権展開(D270MST_TBL)
      *****************************************************************
           03  ()見積番号－連番
                                     PIC S9(007).
           03  ()見積番号枝番
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()連番                PIC S9(003).
           03  ()物件番号            PIC S9(003).
           03  ()見積番号－担当者
                                     PIC  X(002).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()回収年月            PIC  X(006).
           03  ()回収額              PIC S9(013).
           03  ()回収額消費税
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
