      *****************************************************************
      *   売却見積(D52BAM_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数        PIC S9(002).
           03  ()取引先コード        PIC  X(009).
           03  ()処分先コード        PIC  X(005).
           03  ()売却日              PIC  X(008).
           03  ()売却代              PIC S9(013).
           03  ()売却代消費税        PIC S9(013).
           03  ()売却代消費税率
                                     PIC S9(002)V9(007).
           03  ()売却代消費税率区分
                                     PIC  X(002).
           03  ()売却代回収日        PIC  X(008).
           03  ()引渡先区分          PIC  X(001).
           03  ()売却委託手数料
                                     PIC S9(013).
           03  ()引取負担区分        PIC  X(001).
           03  ()引取費用            PIC S9(013).
           03  ()諸費用消費税        PIC S9(013).
           03  ()見積決定フラグ
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
