000010*****************************************************************
000020*   買掛(D412KIK_TBL)
000030*****************************************************************
000040     03  ()契約番号            PIC  X(010).
000050     03  ()再リース回数
000060                               PIC S9(002).
000070     03  ()契約種類            PIC  X(003).
000080     03  ()買掛連番            PIC S9(003).
000090     03  ()連番                PIC S9(003).
000100     03  ()取引先コード
000110                               PIC  X(009).
000120     03  ()支払先コード
000130                               PIC  X(005).
000140     03  ()支払取引先コード
000150                               PIC  X(009).
000160     03  ()支払支払先コード
000170                               PIC  X(005).
000180     03  ()支払方法            PIC  X(001).
000190     03  ()前渡金区分          PIC  X(001).
000200     03  ()支払サイト          PIC S9(002).
000210     03  ()支払日              PIC S9(002).
000220     03  ()実支払日            PIC  X(008).
000230     03  ()手形振出サイト
000240                               PIC S9(002).
000250     03  ()手形振出日          PIC S9(002).
000260     03  ()手形受渡方法
000270                               PIC  X(001).
000280     03  ()定価                PIC S9(013).
000290     03  ()ユーザ向値引額
000300                               PIC S9(013).
000310     03  ()自社向値引額
000320                               PIC S9(013).
000330     03  ()ユーザ向購入額
000340                               PIC S9(013).
000350     03  ()自社向購入額
000360                               PIC S9(013).
000370     03  ()自社向購入額消費税
000380                               PIC S9(013).
000390     03  ()相殺種類            PIC  X(001).
000400     03  ()相殺区分            PIC  X(001).
000410     03  ()相殺額              PIC S9(013).
000420     03  ()相殺金額消費税
000430                               PIC S9(013).
000440     03  ()相殺契約番号
000450                               PIC  X(010).
000460     03  ()支払金額            PIC S9(013).
000470     03  ()支払金額消費税
000480                               PIC S9(013).
000490     03  ()支払金額消費税補正額
000500                               PIC S9(013).
000510     03  ()前渡金金利          PIC S9(002)V9(008).
000520     03  ()購入区分            PIC  X(001).
000530     03  ()見積物件番号
000540                               PIC S9(004).
000550     03  ()貴社見積番号
000560                               PIC  X(020).
000570     03  ()注文書番号          PIC S9(002).
000580     03  ()支払条件            PIC  X(060).
000590     03  ()残価設定額          PIC S9(013).
000600     03  ()他社購入額          PIC S9(013).
000610     03  ()他社残価設定額
000620                               PIC S9(013).
000630     03  ()ソフト当社向購入額
000640                               PIC S9(013).
000650     03  ()ソフト当社向購入額消費税
000660                               PIC S9(013).
000670     03  ()更新年月日          PIC  X(008).
000680     03  ()更新時間            PIC  X(008).
000690     03  ()更新者              PIC  X(008).
000700     03  ()登録年月日          PIC  X(008).
000710     03  ()登録時間            PIC  X(008).
000720     03  ()登録担当者          PIC  X(008).
000730     03  ()入力担当者コード
000740                               PIC  X(008).
000750     03  ()手数料相殺区分
000760                               PIC  X(001).
000770     03  ()手数料相殺金額
000780                               PIC S9(013).
000790     03  ()手数料相殺金額消費税
000800                               PIC S9(013).
