      *****************************************************************
      *   決裁条件マスタ(D040KSJ_TBL)
      *****************************************************************
           03  ()適用年月日          PIC  X(008).
           03  ()決裁グループコード
                                     PIC  X(002).
           03  ()決裁区分            PIC  X(002).
           03  ()部所長決裁限度額
                                     PIC S9(013).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()基準レート          PIC S9(002)V9(007).
           03  ()格付                PIC  X(003).
           03  ()期間                PIC S9(003).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
