      *****************************************************************
      *   解約申請＿債権展開(D515KST_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()連番                PIC S9(003).
           03  ()消費税率            PIC S9(002)V9(008).
           03  ()消費税率区分
                                     PIC  X(002).
           03  ()売上年月            PIC  X(006).
           03  ()売上額              PIC S9(013).
           03  ()売上消費税          PIC S9(013).
           03  ()売上消費税補正額
                                     PIC S9(013).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()請求年月日          PIC  X(008).
           03  ()請求額              PIC S9(013).
           03  ()請求消費税          PIC S9(013).
           03  ()請求消費税補正額
                                     PIC S9(013).
           03  ()回収予定日          PIC  X(008).
           03  ()回収年月日          PIC  X(008).
           03  ()回収額              PIC S9(013).
           03  ()回収額消費税
                                     PIC S9(013).
           03  ()請求書発行済フラグ
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()請求書発行日
                                     PIC  X(008).
           03  ()請求書番号          PIC S9(007).
           03  ()未回収額            PIC S9(013).
           03  ()委託保守区分
                                     PIC  X(001).
           03  ()委託保守料          PIC S9(013).
           03  ()委託保守消費税
                                     PIC S9(013).
           03  ()請求契約番号
                                     PIC  X(015).
           03  ()回収方法            PIC  X(001).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()経理回収額          PIC S9(013).
           03  ()経理締売上額
                                     PIC S9(013).
           03  ()経理締売上消費税
                                     PIC S9(013).
           03  ()手形受取フラグ
                                     PIC  X(001).
           03  ()自社売上額          PIC S9(013).
           03  ()自社売上額消費税
                                     PIC S9(013).
           03  ()他社回収額          PIC S9(013).
           03  ()他社回収額消費税
                                     PIC S9(013).
           03  ()自社請求額          PIC S9(013).
           03  ()自社請求消費税
                                     PIC S9(013).
           03  ()請求内訳コード
                                     PIC  X(003).
           03  ()消込通番            PIC  X(011).
           03  ()履歴連番            PIC S9(002).
           03  ()売上債権残          PIC S9(013).
           03  ()自社売上債権残
                                     PIC S9(013).
           03  ()元本                PIC S9(013).
           03  ()利息                PIC S9(013).
           03  ()諸費用              PIC S9(013).
           03  ()元本残高            PIC S9(013).
           03  ()自社元本            PIC S9(013).
           03  ()自社利息            PIC S9(013).
           03  ()自社固定資産税
                                     PIC S9(013).
           03  ()自社動総保険料
                                     PIC S9(013).
           03  ()自社諸費用          PIC S9(013).
           03  ()自社委託保守料
                                     PIC S9(013).
           03  ()自社売上元本
                                     PIC S9(013).
           03  ()自社売上利息
                                     PIC S9(013).
           03  ()自社売上元本残高
                                     PIC S9(013).
           03  ()自社元本残高
                                     PIC S9(013).
           03  ()自社分支払利息適用
                                     PIC S9(013).
           03  ()自社社内金利利息適用
                                     PIC S9(013).
           03  ()自社社内金利利息一般
                                     PIC S9(013).
           03  ()自社分支払利息一般
                                     PIC S9(013).
           03  ()金利                PIC S9(002)V9(008).
           03  ()返済年月日          PIC  X(008).
           03  ()期間月数            PIC S9(003).
           03  ()期間日数            PIC S9(003).
           03  ()利息計算開始日
                                     PIC  X(008).
           03  ()利息計算終了日
                                     PIC  X(008).
           03  ()自社回収額          PIC S9(013).
           03  ()自社回収消費税
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()初回入金日          PIC  X(008).
           03  ()前払充当区分
                                     PIC  X(001).
           03  ()請求回              PIC S9(003).
           03  ()消込年月日          PIC  X(008).
