      *****************************************************************
      *   貸付金書替情報＿契約(D369KKJ_TBL)
      *****************************************************************
           03  ()契約番号－連番
                                     PIC S9(007).
           03  ()明細番号            PIC S9(003).
           03  ()書替元契約番号
                                     PIC  X(010).
           03  ()書替元元本残高
                                     PIC S9(013).
           03  ()書替元利息額
                                     PIC S9(013).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
