000010************************************************
000020* ﾌｧｸﾀﾘﾝｸﾞ（基本情報）(CPBIS027)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()契約番号               PIC  X(9).
000060    03  ()ユーザーコード         PIC  X(8).
000070    03  ()請求先コード           PIC  X(8).
000080    03  ()事業所コード           PIC S9(4).
000090    03  ()担当者コード           PIC S9(4).
000100    03  ()契約日                 PIC  X(7).
000110    03  ()実行日                 PIC  X(7).
000120    03  ()勘定処理コード         PIC S9(2).
000130    03  ()社内金利               PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000140    03  ()月利複利率             PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000150    03  ()粗利益                 PIC S9(13)  SIGN LEADING SEPARATE.
000160    03  ()額面金額               PIC S9(13)  SIGN LEADING SEPARATE.
000170    03  ()業務区分               PIC S9(1).
000180    03  ()期日                   PIC  X(7).
000190    03  ()銀行コード             PIC  X(7).
000200    03  ()口座番号               PIC  X(7).
000210    03  ()預金種類               PIC S9(1).
000220    03  ()案件発生区分           PIC  X(1).
000230    03  ()稟議区分               PIC S9(1).
000240    03  ()利率基数コード         PIC S9(1).
000250    03  ()利息端数処理コード     PIC S9(1).
000260    03  ()前取後取区分           PIC S9(1).
000270    03  ()片端両端区分           PIC S9(1).
000280    03  ()金利変動区分           PIC S9(1).
000290    03  ()連動金利区分           PIC S9(2).
000300    03  ()スプレッド             PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000310    03  ()休日対応区分           PIC S9(1).
000320    03  ()原債務者コード         PIC  X(8).
000330    03  ()原債務者情報１         PIC  X(40).
000340    03  ()原債務者情報２         PIC  X(40).
000350    03  ()原債務者情報３         PIC  X(40).
000360    03  ()支払承認情報.
000370     05  ()承認ＮＯ               PIC  X(6).
000380     05  ()支払承認日             PIC  X(7).
000390     05  ()支払承認情報－担当者コード PIC  X(4).
000400    03  ()支払方法コード         PIC S9(2).
000410    03  ()期日管理実行日         PIC  X(7).
000420    03  ()請求ＤＢ登録日         PIC  X(7).
000430    03  ()予備                   PIC  X(90).
000440    03  ()共通情報               PIC  X(35).
