000010************************************************
000020* コードマスタ(動産総合保険・料率)(CPBIS018)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()動総保険コード.
000070      07  ()保険会社コード         PIC  X(1).
000080      07  ()保険料種別             PIC  X(3).
000090     05  FILLER           PIC  X(7).
000100    03  ()適用範囲                          OCCURS 5.
000110     05  ()適用年月日ＦＲＯＭ.
000120      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000130      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000140     05  ()保険料率               PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
000150     05  FILLER           PIC  X(18).
000160    03  ()共通情報               PIC  X(35).
