000010************************************************
000020* ˆ—’Ê”Ô(“ü‹àÁž’Ê”Ô)(CPBIS075)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()‚j‚d‚x‚P               PIC  X(2).
000060     05  ()‚j‚d‚x‚Q               PIC  X(8).
000070    03  ()Ì”Ô“ú.
000080     05  ()ŒŽ                     PIC S9(2).
000090     05  ()“ú                     PIC S9(2).
000100    03  ()ˆê˜A”Ô†Ì”Ô—p         PIC S9(5).
000110    03  FILLER           PIC  X(46).
000120    03  ()‹¤’Êî•ñ               PIC  X(35).
