000010************************************************
000020* コードマスタ(信用保険料率区分・割賦)(CPBIS015)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()信用保険.
000070      07  ()信用保険－機械区分     PIC  X(2).
000080     05  FILLER           PIC  X(9).
000090    03  ()適用範囲                          OCCURS 5.
000100     05  ()適用年月日ＦＲＯＭ.
000110      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000120      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000130     05  ()最長保険期間           PIC S9(2)  SIGN LEADING SEPARATE.
000140     05  ()保険料率区分           PIC  X(1).
000150     05  FILLER           PIC  X(20).
000160    03  ()共通情報               PIC  X(35).
