000010************************************************
000020* 解約履歴債権ファイル(リース展開)(CPBIS156)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()ＫＥＹ－契約番号       PIC  X(9).
000060     05  ()ＫＥＹ－物件ＮＯ       PIC S9(3).
000070     05  ()ＫＥＹ－解約区分       PIC  X(1).
000080     05  ()ＫＥＹ－解約日.
000090      07  ()ＫＥＹ－解約日－世紀   PIC S9(1).
000100      07  ()ＫＥＹ－解約日－年月日 PIC S9(6).
000110     05  ()ＫＥＹ－請求コード     PIC S9(2).
000120     05  ()ＫＥＹ－再リースコード PIC S9(1).
000130     05  ()ＫＥＹ－レコード区分   PIC  X(2).
000140    03  ()ＫＥＹ１.
000150     05  ()契約番号               PIC  X(9).
000160    03  ()ＫＥＹ２.
000170     05  ()再リースコード         PIC S9(1).
000180     05  ()物件ＮＯ               PIC S9(3).
000190     05  ()請求コード             PIC S9(2).
000200     05  ()勘定処理コード         PIC S9(2).
000210     05  ()解約区分               PIC  X(1).
000220    03  ()キー年度.
000230     05  ()年度－世紀             PIC  X(1).
000240     05  ()年度－年               PIC  X(2).
000250     05  ()年度－月               PIC  X(2).
000260    03  ()支払回数番号           PIC S9(4)    SIGN LEADING SEPARATE.
000270    03  ()実リース料.
000280     05  ()実リース料－基本       PIC S9(13)  SIGN LEADING SEPARATE.
000290     05  ()実リース料－実質       PIC S9(13)  SIGN LEADING SEPARATE.
000300    03  ()ＮＥＴ－リース料.
000310     05  ()ＮＥＴ－リース料基本   PIC S9(13)  SIGN LEADING SEPARATE.
000320     05  ()ＮＥＴ－リース料実質   PIC S9(13)  SIGN LEADING SEPARATE.
000330    03  ()利息.
000340     05  ()利息－基本             PIC  S9(13) SIGN LEADING SEPARATE.
000350     05  ()利息－実質             PIC  S9(13) SIGN LEADING SEPARATE.
000360    03  ()元本内入               PIC S9(13)   SIGN LEADING SEPARATE.
000370    03  ()元本残高               PIC S9(13)   SIGN LEADING SEPARATE.
000380    03  ()債権残高.
000390     05  ()債権残高－基本         PIC S9(13)  SIGN LEADING SEPARATE.
000400     05  ()債権残高－実質         PIC S9(13)  SIGN LEADING SEPARATE.
000410    03  ()消費税.
000420     05  ()消費税－額             PIC S9(11)  SIGN LEADING SEPARATE.
000430     05  ()消費税－回収方式       PIC  X(1).
000440    03  ()諸費用                 PIC S9(13)   SIGN LEADING SEPARATE.
000450    03  ()消費税率               PIC S9(2)V9(1)
000455                                              SIGN LEADING SEPARATE.
000460    03  FILLER           PIC  X(4).
000470    03  ()回収方式               PIC  X(1).
000480    03  ()回収済表示             PIC  X(1).
000490    03  ()前受充当表示           PIC  X(1).
000500    03  ()残価回収表示           PIC  X(1).
