000010************************************************
000020* 名称マスタ（勘定科目名）(CPBIS112)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()勘定科目コード         PIC  X(5).
000100      07  FILLER           PIC  X(6).
000110    03  ()フラグ.
000120     05  ()登録削除               PIC  X(1).
000130     05  FILLER           PIC  X(4).
000140    03  ()勘定科目名称           PIC  X(32).
000150    03  ()集計科目               PIC  X(5).
000160    03  ()科目タイプ             PIC  X(1).
000170    03  ()資負区分               PIC  X(1).
000180    03  ()ＡＬＭ区分             PIC S9(1).
000190    03  ()適用日.
000200     05  ()適用日－世紀           PIC S9(1).
000210     05  ()適用日－年月日         PIC S9(6).
000220    03  FILLER           PIC  X(98).
000230    03  ()共通情報               PIC  X(35).
