000010************************************************
000020* 資産（資産基本）(CPBIS048)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()契約ＮＯ               PIC  X(9).
000060    03  ()事業所コード           PIC S9(4).
000070    03  ()ユーザコード           PIC  X(8).
000080    03  ()担当者コード           PIC S9(4).
000090    03  ()契約状態区分.
000100     05  ()原契約                 PIC  X(1).
000110     05  ()継続                   PIC  X(1).
000120     05  ()再リース               PIC  X(1).
000130     05  ()割賦                   PIC  X(1).
000140     05  ()手数料                 PIC  X(1).
000150     05  ()ファクタリング         PIC  X(1).
000160     05  ()金消                   PIC  X(1).
000170     05  ()支払保証               PIC  X(1).
000180    03  FILLER           PIC  X(5).
000190    03  ()契約情報.
000200     05  ()契約日.
000210      07  ()契約日－世紀           PIC S9(1).
000220      07  ()契約日－年月日         PIC  X(6).
000230     05  ()検収日.
000240      07  ()検収日－世紀           PIC S9(1).
000250      07  ()検収日－年月日         PIC  X(6).
000260     05  ()残価回収日.
000270      07  ()残価回収日－世紀       PIC S9(1).
000280      07  ()残価回収日－年月日     PIC  X(6).
000290     05  ()購入金額合計           PIC S9(13)  SIGN LEADING SEPARATE.
000300     05  ()残価合計額             PIC S9(13)  SIGN LEADING SEPARATE.
000310     05  ()物件枝番号             PIC S9(3)  SIGN LEADING SEPARATE.
000320     05  ()数量合計               PIC S9(5)  SIGN LEADING SEPARATE.
000330     05  ()単年度契約             PIC  X(2).
000340     05  ()転リース提携先コード   PIC  X(2).
000350     05  ()債権協調コード         PIC  X(2).
000360     05  ()仕入消費税額合計       PIC S9(13)  SIGN LEADING SEPARATE.
000370     05  ()案件発生区分           PIC  X(1).
000380     05  ()稟議区分               PIC  X(1).
000390    03  ()最終物件ＮＯ           PIC S9(3).
000400    03  ()協調区分.
000410     05  ()幹事非幹事区分         PIC  X(1).
000420     05  ()ＯＰＥＮＣＬＯＳＥ区分 PIC  X(1).
000430     05  ()回収手順               PIC  X(1).
000440    03  ()否認区分               PIC  X(1).
000450    03  FILLER           PIC  X(33).
000460    03  ()地位継承元情報.
000470     05  ()元契約ＮＯ             PIC  X(9).
000480     05  ()元最終物件ＮＯ         PIC S9(3).
000490     05  ()元事業所コード         PIC S9(4).
000500     05  ()元ユーザコード         PIC  X(8).
000510    03  ()処理年月度.
000520     05  ()処理年月度－世紀       PIC S9(1).
000530     05  ()処理年月度－年月       PIC  X(4).
000540    03  ()共通情報               PIC  X(35).
