000010************************************************
000020* コードマスタ(動総短期料率メンバー)(CPBIS020)
000030************************************************
000040    03  ()ＫＥＹ１.
000050     05  ()識別コード             PIC  X(4).
000060     05  FILLER           PIC  X(11).
000070    03  ()ＫＥＹ２.
000080     05  ()適用年月日ＦＲＯＭ.
000090      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000100      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000110     05  ()適用継続区分           PIC S9(1).
000120    03  ()適用範囲                          OCCURS 5.
000130     05  ()既経過期間.
000140      07  ()既経過期間月数         PIC S9(2)  SIGN LEADING SEPARATE.
000150      07  ()既経過期間日数         PIC S9(2)  SIGN LEADING SEPARATE.
000160     05  ()動総短期保険料率       PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000170     05  FILLER           PIC  X(2).
000180    03  FILLER           PIC  X(2).
000190    03  ()共通情報               PIC  X(35).
