000010************************************************
000020* 請求（請求明細情報）(CPBIS082)
000030************************************************
000040    03  ()ＫＥＹ項目請求先コード PIC  X(8).
000050    03  ()ＫＥＹ項目.
000060     05  ()契約番号               PIC  X(9).
000070     05  ()再リースコード         PIC S9(1).
000080     05  ()入金予定日             PIC  X(7).
000090     05  ()請求内訳コード         PIC  X(3).
000100    03  ()総支払回数             PIC S9(3)  SIGN LEADING SEPARATE.
000110    03  ()充当回数               PIC S9(3)  SIGN LEADING SEPARATE.
000120    03  ()回収方式               PIC S9(1).
000130    03  ()長短区分               PIC S9(1).
000140    03  ()事業所コード           PIC S9(4).
000150    03  ()請求発行日.
000160     05  ()請求発行日－世紀       PIC S9(1).
000170     05  ()請求発行日－年月日     PIC  X(6).
000180    03  ()勘定処理コード         PIC S9(2).
000190    03  ()消込通番               PIC S9(9).
000200    03  ()消込日.
000210     05  ()消込日－世紀           PIC S9(1).
000220     05  ()消込日－年月日         PIC  X(6).
000230    03  ()消費税.
000240     05  ()消費税－徴収区分       PIC S9(1).
000250     05  ()消費税－金額           PIC S9(13)  SIGN LEADING SEPARATE.
000260     05  ()消費税－消費税コード   PIC S9(2).
000270    03  ()リース料等             PIC S9(13)  SIGN LEADING SEPARATE.
000280    03  ()請求金額               PIC S9(13)  SIGN LEADING SEPARATE.
000290    03  ()消込金額               PIC S9(13)  SIGN LEADING SEPARATE.
000300    03  ()内部入金区分           PIC S9(1).
000310    03  ()銀行ＣＤ               PIC S9(7).
000320    03  ()旧請求内訳コード       PIC  X(3).
000330    03  ()ユーザコード           PIC  X(8).
000340    03  ()債協コード             PIC  X(2).
000350    03  ()突合済フラグ           PIC  X(1).
000360    03  FILLER           PIC  X(5).
000370    03  ()共通情報               PIC  X(35).
