000010************************************************
000020* 取引先マスター（請求先レコード）(CPBIS060)
000030************************************************
000040    03  ()取引先コード           PIC  X(8).
000050    03  ()請求先コード           PIC  X(8).
000060    03  ()請求書発行様式         PIC  X(1).
000070    03  ()請求書発行月区分       PIC  X(1).
000080    03  ()リース料入金単位       PIC S9(1).
000090    03  ()振込手数料負担         PIC S9(1).
000100    03  ()銀行情報自振銀行コード PIC  X(7).
000110    03  ()銀行情報自振口座番号   PIC  X(7).
000120    03  ()銀行情報自振預金種類   PIC  X(1).
000130    03  ()再リース情報計算率分子 PIC S9(3)  SIGN LEADING SEPARATE.
000140    03  ()再リース情報計算率分母 PIC S9(4)  SIGN LEADING SEPARATE.
000150    03  ()再リース情報計算単位   PIC  X(1).
000160    03  ()再リース情報計算方式   PIC  X(1).
000170    03  ()請求先部門正式名称漢字 PIC  X(40).
000180    03  ()請求先部門正式名称     PIC  X(20).
000190    03  ()満了通知書発行様式     PIC  X(1).
000200    03  ()自動更新適用除外区分   PIC  X(1).
000210    03  FILLER           PIC  X(69).
000220    03  ()共通情報ＣＰＤＫＹＯＴＵ PIC  X(35).
