000010************************************************
000020* 銀行マスター（銀行レコード）(CPBIS030)
000030************************************************
000040    03  ()銀行コード             PIC  X(4).
000050    03  ()銀行名称漢字           PIC  X(30).
000060    03  ()銀行名称カナ           PIC  X(30).
000070    03  FILLER           PIC  X(101).
000080    03  ()共通情報               PIC  X(35).
