000010************************************************
000020* ŽØ“ü‹àŠÇ—iŽØ“ü‹à“WŠJƒŒƒR[ƒhj(CPBIS055)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()ŠÇ—‚m‚n               PIC  X(7).
000060     05  ()Ž}”Ô                   PIC S9(2).
000070    03  ()“WŠJ‚m‚n               PIC S9(3).
000080    03  ()ƒtƒ‰ƒO.
000090     05  ()“o˜^íœ               PIC  X(1).
000100     05  ()Œ³–{•ÔÏ               PIC  X(1).
000110     05  ()—˜‘§•ÔÏ               PIC  X(1).
000120     05  FILLER           PIC  X(2).
000130    03  ()‹¤’Ê•”.
000140     05  ()•ÔÏ‹æ•ª               PIC  X(1).
000150     05  ()•ÔÏ“ú.
000160      07  ()•ÔÏ“ú|¢‹I           PIC S9(1).
000170      07  ()•ÔÏ“ú|”NŒŽ“ú         PIC S9(6).
000180     05  ()‹x“ú‹æ•ª               PIC  X(1).
000190     05  ()—˜‘§Šî€“ú.
000200      07  ()—˜‘§Šî€“ú|¢‹I       PIC S9(1).
000210      07  ()—˜‘§Šî€“ú|”NŒŽ“ú     PIC S9(6).
000220     05  ()“ú”                   PIC S9(4).
000230     05  ()—˜—¦                   PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
000240     05  ()ŠúŠÔ                   PIC S9(3).
000250     05  ()ŒvŽZ‹æ•ª               PIC  X(1).
000260     05  ()Œ³–{Žc‚               PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000270     05  ()‰~‰ÝŽc‚I’l           PIC S9(13)  SIGN LEADING SEPARATE.
000280     05  FILLER           PIC  X(15).
000290    03  ()Œ³–{•ÔÏî•ñ.
000300     05  ()Œ³–{•ÔÏî•ñ|Œ³–{•ÔÏŠz PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000310     05  ()Œ³–{•ÔÏî•ñ|‚d‚w‹æ•ª PIC  X(4).
000320     05  ()Œ³–{•ÔÏî•ñ|Š·ŽZ‘Šê PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000330     05  ()Œ³–{•ÔÏî•ñ|‰~‰Ý•ÔÏŠz PIC S9(13)  SIGN LEADING SEPARATE.
000340     05  ()Œ³–{•ÔÏî•ñ|‘Î‰¿‚e‚h‚w PIC  X(1).
000350     05  ()Œ³–{•ÔÏî•ñ|—\–ñIŒ‹“ú.
000360      07  ()Œ³–{•ÔÏî•ñ|—\–ñIŒ‹“ú|¢‹I PIC S9(1).
000370      07  ()Œ³–{•ÔÏî•ñ|—\–ñIŒ‹“ú”NŒŽ“ú PIC S9(6).
000380     05  FILLER           PIC  X(15).
000390    03  ()Œ³–{•ÔÏŽ’lî•ñ.
000400     05  ()‚d‚w‹æ•ª               PIC  X(4).
000410     05  ()Š·ŽZ‘Šê               PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000420     05  ()‰~‰ÝŽ’lŠz             PIC S9(13)  SIGN LEADING SEPARATE.
000430     05  ()‘Î‰¿‚e‚h‚w             PIC  X(1).
000440     05  ()ˆ×‘Ö·‘¹‰v             PIC S9(13)  SIGN LEADING SEPARATE.
000450     05  FILLER           PIC  X(15).
000460    03  ()—˜‘§•ÔÏî•ñ.
000470     05  ()—˜‘§•ÔÏî•ñ|—˜‘§Šz   PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000480     05  ()—˜‘§•ÔÏî•ñ|‚d‚w‹æ•ª PIC  X(4).
000490     05  ()—˜‘§•ÔÏî•ñ|Š·ŽZ‘Šê PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000500     05  ()—˜‘§•ÔÏî•ñ|‰~‰Ý—˜‘§Šz PIC S9(13)  SIGN LEADING SEPARATE.
000510     05  ()—˜‘§•ÔÏî•ñ|‘Î‰¿‚e‚h‚w PIC  X(1).
000520     05  ()—˜‘§•ÔÏî•ñ|—\–ñIŒ‹“ú.
000530      07  ()—˜‘§•ÔÏî•ñ|—\–ñIŒ‹“ú|¢‹I PIC S9(1).
000540      07  ()—˜‘§•ÔÏî•ñ|—\–ñIŒ‹“ú”NŒŽ“ú PIC S9(6).
000550    03  FILLER           PIC  X(80).
000560    03  ()‹¤’Êî•ñ               PIC  X(35).
