000010************************************************
000020* 処理通番(業務用処理通番)(CPBIS064)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()ＫＥＹ１               PIC  X(2).
000060     05  ()ＫＥＹ２.
000070      07  ()業務識別コード.
000080       09  ()サブシステム区分       PIC  X(1).
000090       09  ()業務コード             PIC S9(3).
000100      07  FILLER           PIC  X(4).
000110    03  ()一連番号採番用         PIC S9(5).
000120    03  FILLER           PIC  X(50).
000130    03  ()共通情報               PIC  X(35).
