000010************************************************
000020* 入金消込管理ＤＢ（請求先情報)(CPBIS099)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()消込通番               PIC S9(9).
000060    03  ()請求先コード           PIC  X(8).
000070    03  ()請求金額               PIC S9(13)  SIGN LEADING SEPARATE.
000080    03  ()契約ＮＯ               PIC  X(9).
000090    03  ()再リースコード         PIC S9(1).
000100    03  ()入金予定日             PIC  X(7).
000110    03  ()請求内訳コード         PIC  X(3).
000120    03  ()回収区分               PIC S9(1).
000130    03  ()充当回数回数           PIC S9(3)  SIGN LEADING SEPARATE.
000140    03  ()最新入金日.
000150     05  ()最新入金日－世紀       PIC S9(1).
000160     05  ()最新入金日－年月日     PIC  X(6).
000170    03  FILLER           PIC  X(19).
000180    03  ()共通情報               PIC  X(35).
