000010************************************************
000020* 買掛金（支払）(CPBIS106)
000030************************************************
000040    03  ()ＫＥＹ項目契約番号.
000050     05  ()契約番号－１           PIC  X(7).
000060     05  ()契約番号－２           PIC  X(2).
000070    03  ()購入先識別番号         PIC  X(2).
000080    03  ()支払先条件識別番号     PIC S9(2).
000090    03  ()物件金額               PIC S9(13)  SIGN LEADING SEPARATE.
000100    03  ()仕入消費税             PIC S9(13)  SIGN LEADING SEPARATE.
000110    03  ()充当相殺金額           PIC S9(13)  SIGN LEADING SEPARATE.
000120    03  ()前渡金                 PIC S9(13)  SIGN LEADING SEPARATE.
000130    03  ()支払金額               PIC S9(13)  SIGN LEADING SEPARATE.
000140    03  ()支払条件コード         PIC S9(2).
000150    03  ()支払条件名             PIC  X(40).
000160    03  ()支払方法               PIC S9(2).
000170    03  ()支払予定日.
000180     05  ()支払予定日－日付－世紀 PIC S9(1).
000190     05  ()支払予定日－日付－年月日 PIC  X(6).
000200    03  ()手形期日.
000210     05  ()手形期日－日付－世紀   PIC S9(1).
000220     05  ()手形期日－日付－年月日 PIC  X(6).
000230    03  ()支払手形分割区分       PIC S9(1).
000240    03  ()支払手形統合区分       PIC S9(1).
000250    03  ()充当相殺関連契約番号   PIC  X(9).
000260    03  ()支払日振出日.
000270     05  ()支払日振出日－日付－世紀 PIC S9(1).
000280     05  ()支払日振出日－日付－年月日 PIC  X(6).
000290    03  ()振込情報.
000300     05  ()振込情報－口座名       PIC  X(56).
000310     05  ()振込情報－銀行コード   PIC S9(7).
000320     05  ()振込情報－預金種別     PIC S9(1).
000330     05  ()振込情報－口座番号     PIC S9(7).
000340    03  ()手形小切手情報.
000350     05  ()手形小切手情報－受渡コード PIC S9(1).
000360     05  ()手形小切手情報－郵送先名 PIC  X(56).
000370     05  ()手形小切手情報－郵便番号.
000380      07  ()手形小切手情報－郵便番号－親 PIC  X(3).
000390      07  ()手形小切手情報－郵便番号－子 PIC  X(4).
000400     05  ()手形小切手情報－郵送先住所 PIC  X(98).
000410    03  ()支払確認.
000420     05  ()支払確認－日付.
000430      07  ()支払確認－日付－世紀   PIC S9(1).
000440      07  ()支払確認－日付－年月日 PIC  X(6).
000450     05  ()支払確認－担当者コード PIC S9(4).
000460    03  ()支払承認.
000470     05  ()支払承認－日付.
000480      07  ()支払承認－日付－世紀   PIC S9(1).
000490      07  ()支払承認－日付－年月日 PIC  X(6).
000500     05  ()支払承認－担当者コード PIC S9(4).
000510     05  ()支払承認－承認ＮＯ     PIC  X(6).
000520     05  ()支払承認－取消日.
000530      07  ()支払承認－取消日－世紀 PIC S9(1).
000540      07  ()支払承認－取消日－年月日 PIC  X(6).
000550    03  ()休日判定区分           PIC S9(1).
000560    03  FILLER           PIC  X(33).
000570    03  ()共通情報               PIC  X(35).
