000010************************************************
000020* 名称マスタ（送金先名）(CPBIS126)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()送金先コード           PIC S9(2).
000100      07  FILLER           PIC  X(9).
000110    03  ()送金先名               PIC  X(40).
000120    03  FILLER           PIC  X(110).
000130    03  ()共通情報               PIC  X(35).
