000010************************************************
000020* コードマスタ(短縮コード変換・銀行口座)(CPBIS017)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  FILLER           PIC  X(1).
000070     05  ()短縮コード             PIC  X(2).
000080     05  FILLER           PIC  X(8).
000090    03  ()適用範囲                          OCCURS 5.
000100     05  ()適用年月日ＦＲＯＭ.
000110      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000120      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000130     05  ()銀行コード             PIC  X(7).
000140     05  ()預金種類               PIC  X(1).
000150     05  ()口座番号               PIC  X(7).
000160     05  FILLER           PIC  X(8).
000170    03  ()共通情報               PIC  X(35).
