000010************************************************
000020* コードマスタ(シャープ支店コード変換テーブル)(CPBIS004)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()シャープ支店コード     PIC  X(2).
000070     05  FILLER           PIC  X(9).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用年月日ＦＲＯＭ.
000100      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000110      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000120     05  ()事業所コード           PIC S9(4).
000130     05  ()ユーザーコード         PIC  X(8).
000140     05  FILLER           PIC  X(11).
000150    03  ()共通情報               PIC  X(35).
