000010************************************************
000020* ˆ—’Ê”Ô(Œo—Žd–ó—p)(CPBIS065)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()Ž–‹ÆŠ                 PIC  X(4).
000060     05  FILLER           PIC  X(6).
000070    03  ()ˆ—’Ê”Ô               PIC  X(5).
000080    03  FILLER           PIC  X(50).
000090    03  ()‹¤’Êî•ñ               PIC  X(35).
