000010************************************************
000020* 債務（債務展開）(CPBIS042)
000030************************************************
000040    03  ()キー.
000050     05  ()債務契約ＮＯ           PIC  X(10).
000060     05  ()再リースコード         PIC S9(1).
000070    03  ()契約明細ＮＯ           PIC S9(2).
000080    03  ()レコードシーケンス     PIC S9(1).
000090    03  ()キー年度.
000100     05  ()世紀                   PIC S9(1).
000110     05  ()年                     PIC S9(2).
000120     05  ()月                     PIC S9(2).
000130    03  ()展開部.
000140     05  ()支払回数番号           PIC S9(4).
000150     05  ()実リース料             PIC S9(13)  SIGN LEADING SEPARATE.
000160     05  ()ＮＥＴリース料         PIC S9(13)  SIGN LEADING SEPARATE.
000170     05  ()利息                   PIC S9(13)  SIGN LEADING SEPARATE.
000180     05  ()元本支払額             PIC S9(13)  SIGN LEADING SEPARATE.
000190     05  ()元本残高               PIC S9(13)  SIGN LEADING SEPARATE.
000200     05  ()債務残高               PIC S9(13)  SIGN LEADING SEPARATE.
000210     05  ()消費税額               PIC S9(13)  SIGN LEADING SEPARATE.
000220     05  ()消費税残高             PIC S9(13)  SIGN LEADING SEPARATE.
000230     05  ()諸費用                 PIC S9(13)  SIGN LEADING SEPARATE.
000240     05  ()実支払額               PIC S9(13)  SIGN LEADING SEPARATE.
000250     05  ()消費税率               PIC S9(2)V9(1)  SIGN LEADING SEPARATE.
000260     05  FILLER           PIC  X(7).
000270     05  ()支払データ作成日.
000280      07  ()支払データ作成日－世紀 PIC S9(1).
000290      07  ()支払データ作成日－年月日 PIC  X(6).
000300     05  ()請求データ作成日.
000310      07  ()請求データ作成日－世紀 PIC S9(1).
000320      07  ()請求データ作成日－年月日 PIC  X(6).
000330      07  ()請求データ作成日－区分 PIC  X(1).
000340     05  ()仕訳データ作成日.
000350      07  ()仕訳データ作成日－世紀 PIC S9(1).
000360      07  ()仕訳データ作成日－年月日 PIC  X(6).
000370    03  ()共通情報               PIC  X(35).
