000010************************************************
000020* コードマスタ(手形印紙税)(CPBIS010)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  FILLER           PIC  X(11).
000070    03  ()テーブル情報.
000080     05  ()適用日.
000090      07  ()適用日－世紀           PIC S9(1).
000100      07  ()適用日－年月日         PIC S9(6).
000110     05  ()テーブル個数.
000120      07  ()旧テーブル             PIC S9(3)  SIGN LEADING SEPARATE.
000130      07  ()新テーブル             PIC S9(3)  SIGN LEADING SEPARATE.
000140    03  FILLER           PIC  X(139).
000150    03  ()共通情報               PIC  X(35).
