000010************************************************
000020* 買掛金基本(CPBIS104)
000030************************************************
000040    03  ()ＫＥＹ項目契約番号.
000050     05  ()契約番号－１           PIC  X(7).
000060     05  ()契約番号－２           PIC  X(2).
000070    03  ()事業所コード           PIC S9(4).
000080    03  ()ユーザコード           PIC  X(8).
000090    03  ()名寄せコード           PIC  X(8).
000100    03  ()担当者コード           PIC S9(4).
000110    03  ()検収日.
000120     05  ()検収日－世紀           PIC S9(1).
000130     05  ()検収日－検収日         PIC  X(6).
000140    03  ()転リース提携先リース   PIC S9(2).
000150    03  ()最終契約枝番           PIC  X(2).
000160    03  ()充当相殺区分           PIC S9(1).
000170    03  ()前途金区分             PIC S9(1).
000180    03  ()取引日.
000190     05  ()取引日－世紀           PIC S9(1).
000200     05  ()取引日－検収日         PIC  X(6).
000210    03  FILLER           PIC  X(30).
000220    03  ()購入先レコード件数     PIC S9(2)  SIGN LEADING SEPARATE.
000230    03  ()共通情報               PIC  X(35).
