000010************************************************
000020* 解約履歴資産ファイル（明細＋保険＋固定資産税＋償却）(CPBIS154)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()ＫＥＹ－契約ＮＯ       PIC  X(9).
000060     05  ()ＫＥＹ－解約日.
000070      07  ()ＫＥＹ－解約日－世紀   PIC S9(1).
000080      07  ()ＫＥＹ－解約日－年月日 PIC  X(6).
000090     05  ()ＫＥＹ－解約処理コード PIC  X(1).
000100     05  ()ＫＥＹ－物件ＮＯ       PIC S9(3).
000110     05  ()ＫＥＹ－解約区分       PIC  X(1).
000120    03  ()ＫＥＹ１.
000130     05  ()契約ＮＯ               PIC  X(9).
000140     05  ()物件ＮＯ               PIC S9(3).
000150     05  ()解約区分               PIC  X(1).
000160     05  ()再生区分               PIC  X(1).
000170    03  ()再リースコード         PIC S9(1).
000180    03  ()リース開始日.
000190     05  ()リース開始日－世紀     PIC S9(1).
000200     05  ()リース開始日－年月日   PIC  X(6).
000210    03  ()リース終了日.
000220     05  ()リース終了日－世紀     PIC S9(1).
000230     05  ()リース終了日－年月日   PIC  X(6).
000240    03  ()ファイナンス終了日.
000250     05  ()ファイナンス終了日－世紀 PIC S9(1).
000260     05  ()ファイナンス終了日－年月日 PIC  X(6).
000270    03  ()リース期間             PIC S9(3)  SIGN LEADING SEPARATE.
000280    03  ()勘定処理コード         PIC S9(2).
000290    03  ()資産コード             PIC S9(7).
000300    03  ()中古資産コード         PIC S9(1).
000310    03  ()資産処分コード         PIC  X(1).
000320    03  ()耐用年数               PIC S9(2).
000330    03  ()付保区分.
000340     05  ()付保区分－動産総合     PIC  X(1).
000350     05  ()付保区分－信用保険     PIC  X(1).
000360    03  ()数量                   PIC S9(4)  SIGN LEADING SEPARATE.
000370    03  ()個別リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000380    03  ()個別契約金額           PIC S9(13)  SIGN LEADING SEPARATE.
000390    03  ()残価情報.
000400     05  ()残価情報－残価保証区分 PIC S9(1).
000410     05  ()残価情報－残価保証先コード PIC  X(8).
000420     05  ()残価情報－残価保証先名 PIC  X(60).
000430     05  ()残価情報－残価額１保証 PIC S9(13)  SIGN LEADING SEPARATE.
000440     05  ()残価情報－残価額２見積 PIC S9(13)  SIGN LEADING SEPARATE.
000450     05  ()残価情報－継続リース償却対象額 PIC S9(13)  SIGN LEADING SEPARATE.
000460    03  FILLER           PIC  X(8).
000470    03  ()物件名漢字             PIC  X(60).
000480    03  ()物件名カナ             PIC  X(30).
000490    03  ()仕様製造番号           PIC  X(20).
000500    03  ()解約情報.
000510     05  ()解約対象コード         PIC  X(1).
000520     05  ()解約処理コード         PIC  X(1).
000530     05  ()解約日.
000540      07  ()解約日－世紀           PIC S9(1).
000550      07  ()解約日－年月日         PIC  X(6).
000560    03  ()処理日再リース継続リース.
000570     05  ()処理日再リース継続リース世紀 PIC S9(1).
000580     05  ()処理日再リース継続リース年月日 PIC  X(6).
000590    03  ()再リース周回コード     PIC S9(1).
000600    03  FILLER           PIC  X(3).
000610    03  ()購入先情報.
000620     05  ()購入先コード           PIC  X(8).
000630     05  ()購入先金額             PIC S9(13)  SIGN LEADING SEPARATE.
000640     05  ()仕入消費税             PIC S9(13)  SIGN LEADING SEPARATE.
000650    03  ()ディーラーコード       PIC  X(5).
000660    03  FILLER           PIC  X(13).
000670    03  ()リファレンス情報.
000680     05  ()ユーザリファレンスＮＯ１ PIC  X(12).
000690     05  ()ユーザリファレンスＮＯ２ PIC  X(12).
000700     05  ()ユーザリファレンスＮＯ３ PIC  X(12).
000710     05  ()ユーザリファレンスＮＯ４ PIC  X(12).
000720    03  FILLER           PIC  X(57).
000730    03  ()地位承継情報.
000740     05  ()地位承継情報－承継区分 PIC  X(1).
000750     05  ()地位承継情報－元物件ＮＯ PIC S9(3).
000760     05  ()地位承継情報－承継日.
000770      07  ()地位承継情報－承継日－世紀 PIC S9(1).
000780      07  ()地位承継情報－承継日－年月日 PIC  X(6).
000790    03  FILLER           PIC  X(8).
000800    03  ()処理年月度.
000810     05  ()処理年月度－世紀       PIC S9(1).
000820     05  ()処理年月度－年月       PIC  X(4).
000830    03  ()共通情報               PIC  X(35).
000840    03  ()保険情報.
000850     05  ()保険情報－保険会社コード PIC  X(1).
000860     05  ()保険情報－保険料種別   PIC  X(3).
000870    03  ()保険新規継続区分       PIC  X(1).
000880    03  ()事故有無区分           PIC  X(1).
000890    03  ()付保日.
000900     05  ()付保日－世紀           PIC S9(1).
000910     05  ()付保日－年月日         PIC  X(6).
000920    03  ()事故日.
000930     05  ()事故日－世紀           PIC S9(1).
000940     05  ()事故日－年月日         PIC  X(6).
000950    03  ()無事故戻し日.
000960     05  ()無事故戻し日－世紀     PIC S9(1).
000970     05  ()無事故戻し日－年月日   PIC  X(6).
000980    03  ()規定損害金ＵＰ率       PIC S9(2)V9(7)  SIGN LEADING SEPARATE.
000990    03  ()動総保険価格           PIC S9(13)  SIGN LEADING SEPARATE.
001000    03  ()動総保険料             PIC S9(13)  SIGN LEADING SEPARATE.
001010    03  ()動総払戻し保険料       PIC S9(13)  SIGN LEADING SEPARATE.
001020    03  ()動総無事故戻し料       PIC S9(13)  SIGN LEADING SEPARATE.
001030    03  ()動総申込明細情報.
001040     05  ()当年度.
001050      07  ()動総申込明細情報－当年度ページ PIC S9(5)  SIGN LEADING SEPARATE.
001060      07  ()動総申込明細情報－当年度桁数 PIC S9(2)  SIGN LEADING SEPARATE.
001070     05  ()前年度.
001080      07  ()動総申込明細情報－前年度ページ PIC S9(5)  SIGN LEADING SEPARATE.
001090      07  ()動総申込明細情報－前年度桁数 PIC S9(2)  SIGN LEADING SEPARATE.
001100     05  FILLER           PIC  X(8).
001110    03  ()再リース付保率         PIC S9(2)  SIGN LEADING SEPARATE.
001120    03  ()動総保険料率           PIC S9(3)V9(6)  SIGN LEADING SEPARATE.
001130    03  FILLER           PIC  X(10).
001140    03  ()信用保険コード.
001150     05  ()信用保険コード－リース割賦区分 PIC  X(1).
001160     05  ()信用保険コード－機械区分 PIC  X(2).
001170     05  ()信用保険コード－機種名番号 PIC  X(2).
001180    03  ()型式番号               PIC  X(15).
001190    03  ()通知書発送日.
001200     05  ()通知書発送日－世紀     PIC S9(1).
001210     05  ()通知書発送日－年月日   PIC  X(6).
001220    03  ()符号一連番号           PIC  X(5).
001230    03  ()信用保険料             PIC S9(13)  SIGN LEADING SEPARATE.
001240    03  ()動総保険証券番号       PIC  X(11).
001250    03  FILLER           PIC  X(15).
001260    03  ()保険情報－処理年月度.
001270     05  ()保険情報－処理年月度－世紀 PIC S9(1).
001280     05  ()保険情報－処理年月度－年月 PIC  X(4).
001290    03  ()固定資産税申告情報.
001300     05  ()納付先コード           PIC  X(6).
001310     05  ()税区分                 PIC S9(1).
001320     05  ()税負担区分             PIC  X(1).
001330     05  ()耐用年数短縮区分       PIC  X(1).
001340     05  ()移動情報.
001350      07  ()移動情報－移動区分     PIC  X(1).
001360      07  ()移動情報－移動日.
001370       09  ()移動情報－世紀         PIC S9(1).
001380       09  ()移動情報－年月日       PIC  X(6).
001390     05  FILLER           PIC  X(10).
001400    03  ()償却資産税申告.
001410     05  ()特例.
001420      07  ()特例－期間             PIC S9(2)  SIGN LEADING SEPARATE.
001430      07  ()特例－率.
001440       09  ()特例－分子             PIC S9(2)  SIGN LEADING SEPARATE.
001450       09  ()特例－分母             PIC S9(3)  SIGN LEADING SEPARATE.
001460     05  ()年税額                 PIC S9(13)  SIGN LEADING SEPARATE.
001470     05  ()前年度評価額           PIC S9(13)  SIGN LEADING SEPARATE.
001480     05  ()前年度理論簿価         PIC S9(13)  SIGN LEADING SEPARATE.
001490     05  ()当年度評価額           PIC S9(13)  SIGN LEADING SEPARATE.
001500     05  ()当年度理論簿価         PIC S9(13)  SIGN LEADING SEPARATE.
001510     05  ()特別課税標準額         PIC S9(13)  SIGN LEADING SEPARATE.
001520    03  ()前回申告先             PIC  X(6).
001530    03  ()設置場所名漢字         PIC  X(40).
001540    03  ()設置場所名カナ         PIC  X(20).
001550    03  ()設置場所郵便番号.
001560     05  ()設置場所郵便番号－親   PIC  X(3).
001570     05  ()設置場所郵便番号－子   PIC  X(4).
001580    03  ()設置場所住所漢字       PIC  X(100).
001590    03  FILLER           PIC  X(11).
001600    03  ()固定資産申告情報－処理年月度.
001610     05  ()固定資産申告情報処理年月度世紀 PIC S9(1).
001620     05  ()固定資産申告情報処理年月度年月 PIC  X(4).
001630    03  ()償却計算情報.
001640     05  ()償却計算会社.
001650      07  ()会社前期末簿価         PIC S9(13)  SIGN LEADING SEPARATE.
001660      07  ()会社当月償却高         PIC S9(13)  SIGN LEADING SEPARATE.
001670      07  ()会社当期償却高         PIC S9(13)  SIGN LEADING SEPARATE.
001680      07  ()会社現在簿価           PIC S9(13)  SIGN LEADING SEPARATE.
001690     05  FILLER           PIC  X(10).
001700    03  ()償却計算法定.
001710     05  ()法定償却区分           PIC S9(2).
001720     05  ()法定割増区分           PIC S9(2).
001730     05  ()法定特別償却率.
001740      07  ()法定特別償却率－分子   PIC S9(2)  SIGN LEADING SEPARATE.
001750      07  ()法定特別償却率－分母   PIC S9(3)  SIGN LEADING SEPARATE.
001760     05  ()法定前期末簿価法定     PIC S9(13)  SIGN LEADING SEPARATE.
001770     05  ()法定普通償却費         PIC S9(13)  SIGN LEADING SEPARATE.
001780     05  ()法定割増償却費         PIC S9(13)  SIGN LEADING SEPARATE.
001790     05  ()法定特別償却費         PIC S9(13)  SIGN LEADING SEPARATE.
001800     05  ()法定当期末簿価         PIC S9(13)  SIGN LEADING SEPARATE.
001810     05  ()法定繰越超過額         PIC S9(13)  SIGN LEADING SEPARATE.
001820     05  ()法定償却限度額         PIC S9(13)  SIGN LEADING SEPARATE.
001830    03  FILLER           PIC  X(15).
001840    03  ()理論簿価情報.
001850     05  ()会社理論前期末簿価     PIC S9(13)  SIGN LEADING SEPARATE.
001860     05  ()会社理論当期末簿価     PIC S9(13)  SIGN LEADING SEPARATE.
001870    03  ()当期償却過不足額       PIC S9(13)  SIGN LEADING SEPARATE.
001880    03  FILLER           PIC  X(28).
001890    03  ()償却計算情報－処理年月度.
001900     05  ()償却計算情報処理年月度世紀 PIC S9(1).
001910     05  ()償却計算情報処理年月度年月 PIC  X(4).
