000010************************************************
000020* コードマスタ(動総保険証券番号)(CPBIS021)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()保険会社コード         PIC  X(1).
000070     05  FILLER           PIC  X(10).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用年月日ＦＲＯＭ.
000100      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000110      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000120     05  ()動総保険証券番号       PIC  X(11).
000130     05  FILLER           PIC  X(12).
000140    03  ()共通情報               PIC  X(35).
