000010************************************************
000020* 解約累積ファイル(明細)(CPBIS146)
000030************************************************
000040    03  ()ＳＯＲＴＫＥＹ.
000050     05  ()ＫＥＹ－入力事業所ＣＤ PIC S9(4).
000060     05  ()ＫＥＹ－データ識別     PIC S9(2).
000070     05  ()ＫＥＹ－事業所ＣＤ     PIC S9(4).
000080     05  ()ＫＥＹ－レコード区分   PIC  X(1).
000090     05  ()ＫＥＹ－契約ＮＯ       PIC  X(9).
000100     05  ()ＫＥＹ－物件ＮＯ       PIC S9(3).
000110     05  ()ＫＥＹ－勘定処理ＣＤ   PIC S9(2).
000120     05  ()ＫＥＹ－ダミー         PIC  X(4).
000130     05  ()ＫＥＹ－再リースＣＤ   PIC S9(1).
000140    03  ()物件ＮＯ               PIC S9(3).
000150    03  ()物件名漢字             PIC  X(60).
000160    03  ()物件名カナ             PIC  X(30).
000170    03  ()仕様製造番号           PIC  X(20).
000180    03  ()数量                   PIC S9(4)  SIGN LEADING SEPARATE.
000190    03  ()資産ＣＤ               PIC S9(7).
000200    03  ()購入先情報.
000210     05  ()購入先ＣＤ             PIC  X(8).
000220     05  ()購入金額               PIC S9(13)  SIGN LEADING SEPARATE.
000230    03  ()ディーラーＣＤ         PIC  X(5).
000240    03  ()解約対象ＣＤ           PIC  X(1).
000250    03  ()物件枝番数             PIC S9(3)  SIGN LEADING SEPARATE.
000260    03  ()納付先ＣＤ             PIC  X(6).
000270    03  ()設置場所名漢字         PIC  X(40).
000280    03  ()設置場所名カナ         PIC  X(20).
000290    03  ()設置場所郵便番号.
000300     05  ()設置場所郵便番号－親   PIC  X(3).
000310     05  ()設置場所郵便番号－子   PIC  X(4).
000320    03  ()設置場所住所漢字       PIC  X(100).
000330    03  ()税区分                 PIC S9(1).
000340    03  ()耐用年数               PIC S9(2)  SIGN LEADING SEPARATE.
000350    03  ()中古資産ＣＤ           PIC S9(1).
000360    03  ()資産処分ＣＤ           PIC  X(1).
000370    03  ()償却区分               PIC S9(2).
000380    03  ()解約日.
000390     05  ()解約日－世紀           PIC S9(1).
000400     05  ()解約日－年             PIC S9(2).
000410     05  ()解約日－月             PIC S9(2).
000420     05  ()解約日－日             PIC S9(2).
000430    03  ()割増区分               PIC S9(2).
000440    03  ()特例区分               PIC S9(2).
000450    03  ()残価情報.
000460     05  ()残価保証区分           PIC S9(1).
000470     05  ()残価保証先ＣＤ         PIC  X(8).
000480     05  ()残価保証先名漢字       PIC  X(60).
000490     05  ()残価１保証             PIC S9(13)  SIGN LEADING SEPARATE.
000500     05  ()残価２見積             PIC S9(13)  SIGN LEADING SEPARATE.
000510     05  ()継続リース償却対象額   PIC S9(13)  SIGN LEADING SEPARATE.
000520    03  ()動総保険ＣＤ.
000530     05  ()保険会社ＣＤ           PIC  X(1).
000540     05  ()保険料種別             PIC  X(3).
000550    03  ()動総保険価格           PIC S9(13)  SIGN LEADING SEPARATE.
000560    03  ()動総保険料             PIC S9(13)  SIGN LEADING SEPARATE.
000570    03  ()信用保険情報.
000580     05  ()信用保険ＣＤ.
000590      07  ()信用保険ＣＤ－付保区分 PIC  X(1).
000600      07  ()信用保険ＣＤ－リース割賦区分 PIC  X(1).
000610      07  ()信用保険ＣＤ－機械区分 PIC  X(2).
000620      07  ()信用保険ＣＤ－機械名番号 PIC  X(2).
000630     05  ()形式番号               PIC  X(15).
000640    03  ()消費税率３規定損害金   PIC S9(2)V9(1)  SIGN LEADING SEPARATE.
000650    03  ()シャープ解約処理       PIC  X(1).
000660    03  ()個別リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000670    03  ()税負担ＣＤ             PIC  X(1).
000680    03  ()当前年度評価額         PIC S9(13)  SIGN LEADING SEPARATE.
000690    03  ()当前年度理論簿価       PIC S9(13)  SIGN LEADING SEPARATE.
000700    03  ()会社理論前期末簿価     PIC S9(13)  SIGN LEADING SEPARATE.
000710    03  ()会社前期末簿価         PIC S9(13)  SIGN LEADING SEPARATE.
000720    03  ()法定前期末簿価         PIC S9(13)  SIGN LEADING SEPARATE.
000730    03  ()規定損害金             PIC S9(13)  SIGN LEADING SEPARATE.
000740    03  ()売却代金               PIC S9(13)  SIGN LEADING SEPARATE.
000750    03  ()解約入金日.
000760     05  ()解約入金日－世紀       PIC S9(1).
000770     05  ()解約入金日－年         PIC S9(2).
000780     05  ()解約入金日－月         PIC S9(2).
000790     05  ()解約入金日－日         PIC S9(2).
000800    03  FILLER           PIC  X(34).
000810    03  ()ユーザリファレンス情報.
000820     05  ()リファレンスＮＯ１     PIC  X(12).
000830     05  ()リファレンスＮＯ２     PIC  X(12).
000840     05  ()リファレンスＮＯ３     PIC  X(12).
000850     05  ()リファレンスＮＯ４     PIC  X(12).
000860    03  ()残存分.
000870     05  ()残存分購入金額         PIC S9(13)  SIGN LEADING SEPARATE.
000880     05  ()残価額                 PIC S9(13)  SIGN LEADING SEPARATE.
000890     05  ()残存分個別リース料     PIC S9(13)  SIGN LEADING SEPARATE.
000900    03  ()再リース付保率符号桁   PIC  X(1).
000910    03  ()再リース付保率         PIC S9(2).
000920    03  ()売却引渡区分           PIC  X(1).
000930    03  ()廃棄引渡先区分         PIC  X(1).
000940    03  ()再リース周回ＣＤ       PIC S9(1).
000950    03  FILLER           PIC  X(26).
000960    03  ()仕訳情報明細.
000970     05  ()解約処理ＣＤ           PIC  X(1).
000980     05  ()売却金額入金予定日.
000990      07  ()売却金額入金予定日－世紀 PIC S9(1).
001000      07  ()売却金額入金予定日－年 PIC S9(2).
001010      07  ()売却金額入金予定日－月 PIC S9(2).
001020      07  ()売却金額入金予定日－日 PIC S9(2).
001030     05  ()売却金額入金先ＣＤ     PIC  X(8).
001040     05  ()売却先名カナ           PIC  X(30).
001050     05  ()引渡費用               PIC S9(13)  SIGN LEADING SEPARATE.
001060     05  ()当期償却費用           PIC S9(13)  SIGN LEADING SEPARATE.
001070     05  ()解約時簿価             PIC S9(13)  SIGN LEADING SEPARATE.
001080    03  FILLER           PIC  X(33).
