000010************************************************
000020* 名称マスタ（管販費名）(CPBIS113)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()管販費コード           PIC  X(3).
000100      07  FILLER           PIC  X(8).
000110    03  ()フラグ.
000120     05  ()登録削除               PIC  X(1).
000130     05  FILLER           PIC  X(4).
000140    03  ()管販費名称             PIC  X(16).
000150    03  ()集計コード             PIC  X(3).
000160    03  ()管販費タイプ           PIC  X(1).
000170    03  ()適用日.
000180     05  ()適用日－世紀           PIC S9(1).
000190     05  ()適用日－年月日         PIC S9(6).
000200    03  FILLER           PIC  X(118).
000210    03  ()共通情報               PIC  X(35).
