000010************************************************
000020* コードマスタ(消費税率)(CPBIS012)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()課税種類               PIC  X(7).
000070     05  FILLER           PIC  X(4).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用年月日ＦＲＯＭ     PIC  X(7).
000100     05  ()適用年月日ＦＲＯＭ税率 PIC S9(2)V9(3).
000110     05  FILLER           PIC  X(19).
000120    03  ()共通情報               PIC  X(35).
