000010************************************************
000020* 提携コードマスタ(ＨＯＹＡ商品コード)(CPBIS085)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()ＨＯＹＡ商品ＣＤ       PIC  X(3).
000070     05  FILLER           PIC  X(8).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用日付               PIC  X(7).
000100     05  ()資産コード             PIC S9(7).
000110     05  FILLER           PIC  X(16).
000120    03  ()共通情報               PIC  X(35).
