000010************************************************
000020* コードマスタ(信用保険料率・割賦)(CPBIS013)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()保険期間月数           PIC S9(3).
000070     05  FILLER           PIC  X(8).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用年月日ＦＲＯＭ.
000100      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000110      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000120     05  ()保険料率Ａ             PIC S9(2)V9(4)  SIGN LEADING SEPARATE.
000130     05  ()保険料率Ｂ             PIC S9(2)V9(4)  SIGN LEADING SEPARATE.
000140     05  ()保険料率Ｃ             PIC S9(2)V9(4)  SIGN LEADING SEPARATE.
000150     05  ()保険料率Ｄ             PIC S9(2)V9(4)  SIGN LEADING SEPARATE.
000160     05  ()保険料率予             PIC S9(2)V9(4)  SIGN LEADING SEPARATE.
000170     05  FILLER           PIC  X(8).
000180    03  ()共通情報               PIC  X(35).
