000010************************************************
000020* 解約履歴債権ファイル（基本）(CPBIS178)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()物件ＮＯ               PIC  X(3).
000070     05  ()解約区分               PIC  X(1).
000080     05  ()解約日.
000090      07  ()解約日－世紀           PIC  X(1).
000100      07  ()解約日－年月日         PIC  X(6).
000110     05  ()請求コード             PIC  X(2).
000120     05  ()再リースコード         PIC  X(1).
000130     05  ()レコード区分           PIC  X(2).
000140    03  ()ＫＥＹ契約ＮＯ         PIC  X(9).
000150    03  ()事業所コード           PIC  X(4).
000160    03  ()ユーザコード           PIC  X(8).
000170    03  ()担当者コード           PIC  X(4).
000180    03  ()契約状態区分.
000190     05  ()原契約                 PIC  X(1).
000200     05  ()継続リース             PIC  X(1).
000210     05  ()再リース               PIC  X(1).
000220     05  ()割賦                   PIC  X(1).
000230     05  ()手数料                 PIC  X(1).
000240     05  ()ファクタリング         PIC  X(1).
000250     05  ()金消                   PIC  X(1).
000260     05  ()支払保証               PIC  X(1).
000270    03  ()検収集計表対象外区分   PIC  X(1).
000280    03  FILLER           PIC  X(4).
000290    03  ()転リース提携先コード   PIC  X(2).
000300    03  ()否認区分               PIC  X(1).
000310    03  FILLER           PIC  X(27).
000320    03  ()地位継承元情報.
000330     05  ()元事業所コード         PIC  X(4).
000340     05  ()元ユーザコード         PIC  X(8).
000350    03  ()処理年月度.
000360     05  ()処理年月度－世紀       PIC  X(1).
000370     05  ()処理年月度－年月       PIC  X(4).
000380    03  ()共通情報               PIC  X(35).
