000010************************************************
000020* 資産（保険情報）(CPBIS051)
000030************************************************
000040    03  ()物件番号.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()物件ＮＯ               PIC S9(3).
000070     05  ()解約区分               PIC  X(1).
000080     05  ()再生区分               PIC  X(1).
000090    03  ()動産保険コード.
000100     05  ()保険会社コード         PIC  X(1).
000110     05  ()保険料種別             PIC  X(3).
000120    03  ()保険新規継続区分       PIC  X(1).
000130    03  ()事故有無区分           PIC  X(1).
000140    03  ()付保日.
000150     05  ()付保日－世紀           PIC S9(1).
000160     05  ()付保日－年月日         PIC  X(6).
000170    03  ()事故日.
000180     05  ()事故日－世紀           PIC S9(1).
000190     05  ()事故日－年月日         PIC  X(6).
000200    03  ()無事故戻し日.
000210     05  ()無事故戻し日－世紀     PIC S9(1).
000220     05  ()無事故戻し日－年月日   PIC  X(6).
000230    03  ()規定損害金ＵＰ率       PIC S9(3)V9(7).
000240    03  ()動総保険価格           PIC S9(13)  SIGN LEADING SEPARATE.
000250    03  ()動総保険料             PIC S9(13)  SIGN LEADING SEPARATE.
000260    03  ()動総払戻し保険料       PIC S9(13)  SIGN LEADING SEPARATE.
000270    03  ()動総無事故戻し料       PIC S9(13)  SIGN LEADING SEPARATE.
000280    03  ()動総申込明細情報.
000290     05  ()当年度.
000300      07  ()当年度ページ           PIC S9(5)  SIGN LEADING SEPARATE.
000310      07  ()当年度桁数             PIC S9(2).
000320     05  ()前年度.
000330      07  ()前年度ページ           PIC S9(5)  SIGN LEADING SEPARATE.
000340      07  ()前年度桁数             PIC S9(2).
000350     05  FILLER           PIC  X(8).
000360    03  ()再リース付保率         PIC S9(2).
000370    03  ()動総保険料率           PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000380    03  FILLER           PIC  X(10).
000390    03  ()信用保険コード.
000400     05  ()リース割賦区分         PIC  X(1).
000410     05  ()機械区分               PIC  X(2).
000420     05  ()機種名番号             PIC  X(2).
000430    03  ()型式番号               PIC  X(15).
000440    03  ()通知書送付日.
000450     05  ()通知書送付日－世紀     PIC S9(1).
000460     05  ()通知書送付日－年月日   PIC  X(6).
000470    03  ()符号一連番号           PIC  X(5).
000480    03  ()信用保険料             PIC S9(13)  SIGN LEADING SEPARATE.
000490    03  ()動総保険証券番号       PIC  X(11).
000500    03  FILLER           PIC  X(15).
000510    03  ()処理年月度.
000520     05  ()処理年月度－世紀       PIC S9(1).
000530     05  ()処理年月度－年月       PIC  X(4).
000540    03  ()共通情報               PIC  X(35).
