000010************************************************
000020* 共通情報(CPBIS139)
000030************************************************
000040    03  ()登録日.
000050     05  ()登録日－世紀           PIC  X(1).
000060     05  ()登録日－年月.
000070      07  ()登録日－年             PIC  X(2).
000080      07  ()登録日－月             PIC  X(2).
000090      07  ()登録日－日             PIC  X(2).
000100    03  ()更新情報.
000110     05  ()更新日付.
000120      07  ()更新日付－年月.
000130       09  ()更新日付－年           PIC  X(2).
000140       09  ()更新日付－月           PIC  X(2).
000150       09  ()更新日付－日           PIC  X(2).
000160     05  ()更新時刻.
000170      07  ()更新時刻時分           PIC  X(4).
000180      07  ()更新時刻秒             PIC  X(2).
000190     05  ()担当者コード           PIC  X(4).
000200     05  ()ＷＳ名                 PIC  X(8).
000210     05  ()更新回数               PIC S9(2).
000220     05  ()削除区分               PIC  X(1).
000230     05  ()その他区分             PIC  X(1).
