000010************************************************
000020* (CPM_PRTTRN)
000030************************************************
000040 01  ()CTLNUM           PIC  X(6).
000050 01  ()DEBCRE           PIC  X(1).
000060 01  ()TRNDAY           PIC  X(8).
000070 01  ()BORCAP           PIC S9(13) COMP-3.
000080 01  ()BALAMT           PIC S9(13) COMP-3.
