000010*****                            * ヒズケ ケイサン ( カサン )   LD-AREA   *
000020*
000030 01  WS030-AREA.
000040     03  WS030-G.
000050         05  WS030-G-SYORI-KBN               PIC  9(01).
000060         05  WS030-G-KIJUN.
000070*             07  WS030-G-KIJUN-C             PIC  9(01).
000080             07  WS030-G-KIJUN-Y             PIC  9(04).
000090             07  WS030-G-KIJUN-M             PIC  9(02).
000100             07  WS030-G-KIJUN-D             PIC  9(02).
000110         05  WS030-G-KIKAN1.
000120             07  WS030-G-KIKAN1-Y            PIC  9(02).
000130             07  WS030-G-KIKAN1-M            PIC  9(02).
000140         05  WS030-G-KIKAN2.
000150             07  WS030-G-KIKAN2-M            PIC  9(03).
000160         05  WS030-G-KIKAN3.
000170             07  WS030-G-KIKAN3-KBN          PIC  9(01).
000180             07  WS030-G-KIKAN3-D            PIC  9(04).
000190*
000200     03  WS030-P.
000210         05  WS030-P-HIZK.
000220*             07  WS030-P-C                   PIC  9(01).
000230             07  WS030-P-Y                   PIC  9(04).
000240             07  WS030-P-M                   PIC  9(02).
000250             07  WS030-P-D                   PIC  9(02).
000260         05  WS030-P-RTNCD                   PIC  X(02).
000270
