000010*****                            * ñaü∑ CHECK  LD-AREA           *
000020*
000030 01  WS010-AREA.
000040     03  WS010-G.
000050         05  WS010-G-HIZK.
000060*             07  WS010-G-C                   PIC  9(01).
000070             07  WS010-G-Y                   PIC  9(04).
000080             07  WS010-G-M                   PIC  9(02).
000090             07  WS010-G-D                   PIC  9(02).
000100*
000110     03  WS010-P.
000120         05  WS010-P-ALLY                    PIC  9(04).
000130         05  WS010-P-HIZK.
000140*             07  WS010-P-C                   PIC  9(01).
000150             07  WS010-P-Y                   PIC  9(04).
000160             07  WS010-P-M                   PIC  9(02).
000170             07  WS010-P-D                   PIC  9(02).
000180         05  WS010-P-RTNCD                   PIC  X(02).
000190
