000010************************************************
000020* (DFS_ADDLST)
000030************************************************
000040 01  ()PAYNUM           PIC  X(8).
000050 01  ()CSTNUM           PIC  X(12).
000060 01  ()PAYDAY           PIC  X(2).
000070 01  ()BNKCOD           PIC  X(4).
000080 01  ()BNKNAM           PIC  X(15).
000090 01  ()BRCCOD           PIC  X(3).
000100 01  ()BRCNAM           PIC  X(15).
000110 01  ()DEPKND           PIC  X(1).
000120 01  ()DEPNUM           PIC  X(7).
000130 01  ()CSTNAM           PIC  X(30).
000140 01  ()TRNAMT           PIC S9(10) COMP-3.
000150 01  ()CONTAX           PIC S9(5) COMP-3.
