000010************************************************
000020* (DFS_CNVMST)
000030************************************************
000040 01  ()PAYNUM           PIC  X(8).
000050 01  ()CSTNAM           PIC  X(30).
000060 01  ()REGDAY           PIC  X(8).
000070 01  ()REGTIM           PIC  X(6).
000080 01  ()REGPSN           PIC  X(4).
000090 01  ()MODDAY           PIC  X(8).
000100 01  ()MODTIM           PIC  X(6).
000110 01  ()MODPSN           PIC  X(4).
