000010************************************************
000020* (ELP_PSNMST)
000030************************************************
000040 01  ()PSNCOD           PIC  X(7).
000050 01  ()PSNNAM           PIC  N(9).
000060 01  ()DIVCOD           PIC  X(4).
000070 01  ()SEXTYP           PIC  X(1).
000080 01  ()SHTCOD           PIC  X(4).
000090 01  ()PRTSEQ           PIC  X(3).
