000010************************************************
000020* (ELP_INTRAT)
000030************************************************
000040 01  ()LONTYP           PIC  X(1).
000050 01  ()LONNAM           PIC  N(6).
000060 01  ()APLDAY           PIC  X(8).
000070 01  ()INTRAT           PIC S9(2)V9(6) COMP-3.
000080 01  ()OLDAPL           PIC  X(8).
000090 01  ()OLDRAT           PIC S9(2)V9(6) COMP-3.
