000010************************************************
000020* (EMC_WK_LIST)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()請求コード             PIC  X(2).
000060 01  ()物件ＮＯ               PIC  X(4).
000070 01  ()名寄せコード           PIC  X(8).
000080 01  ()ユーザーコード         PIC  X(8).
000090 01  ()請求先コード           PIC  X(8).
000100 01  ()銀行短縮コード         PIC  X(2).
000110 01  ()銀行コード             PIC  X(4).
000120 01  ()支店コード             PIC  X(3).
000130 01  ()名称１                 PIC  N(20).
000140 01  ()名称２                 PIC  N(20).
000150 01  ()保守料                 PIC S9(13) COMP-3.
000160 01  ()リファレンス１         PIC  X(12).
000170 01  ()リファレンス２         PIC  X(12).
000180 01  ()リファレンス３         PIC  X(12).
000190 01  ()リファレンス４         PIC  X(12).
000200 01  ()メッセージ             PIC  N(25).
