000010************************************************
000020* (EMC_WK_SEIMEN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()検収日                 PIC  X(8).
000060 01  ()日付                   PIC  X(4).
000070 01  ()入金日                 PIC  X(2).
000080 01  ()請求先コード           PIC  X(8).
000090 01  ()充当回                 PIC  X(3).
000100 01  ()総支払回数             PIC  X(3).
000110 01  ()税率                   PIC S9(2)V9(1) COMP-3.
000120 01  ()当月リース料           PIC S9(13) COMP-3.
000130 01  ()消費税額               PIC S9(11) COMP-3.
000140 01  ()明細ＮＯ               PIC  X(4).
000150 01  ()物件名                 PIC  X(30).
000160 01  ()個別リース料           PIC S9(13) COMP-3.
000170 01  ()ユーザーリファレンス１ PIC  X(10).
000180 01  ()ユーザーリファレンス２ PIC  X(10).
000190 01  ()ユーザーリファレンス３ PIC  X(10).
000200 01  ()ユーザーリファレンス４ PIC  X(10).
000210 01  ()備考                   PIC  N(35).
000220 01  ()チェック１             PIC  X(1).
000230 01  ()チェック２             PIC  X(1).
000240 01  ()チェック３             PIC  X(1).
000250 01  ()チェック４             PIC  X(1).
000260 01  ()チェック５             PIC  X(1).
000270 01  ()チェック６             PIC  X(1).
000280 01  ()チェック７             PIC  X(1).
000290 01  ()チェック８             PIC  X(1).
000300 01  ()チェック９             PIC  X(1).
000310 01  ()チェック１０           PIC  X(1).
000320 01  ()チェック１１           PIC  X(1).
000330 01  ()チェック１２           PIC  X(1).
000340 01  ()チェック１３           PIC  X(1).
000350 01  ()チェック１４           PIC  X(1).
000360 01  ()チェック１５           PIC  X(1).
000370 01  ()チェック１６           PIC  X(1).
