000010************************************************
000020* (EMC_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()請求コード             PIC  X(2).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()再リースコード         PIC  X(1).
000080 01  ()契約日                 PIC  X(8).
000090 01  ()検収日                 PIC  X(8).
000100 01  ()リース期間             PIC S9(3) COMP-3.
000110 01  ()請求先コード           PIC  X(8).
000120 01  ()名寄せコード           PIC  X(8).
000130 01  ()入金日                 PIC  X(2).
000140 01  ()当月リース料           PIC S9(13) COMP-3.
000150 01  ()当月債権残高           PIC S9(13) COMP-3.
000160 01  ()当月前受リース料残高   PIC S9(13) COMP-3.
000170 01  ()日付                   PIC  X(4).
000180 01  ()充当回                 PIC  X(3).
000190 01  ()総支払回数             PIC  X(3).
000200 01  ()契約金額               PIC S9(13) COMP-3.
000210 01  ()勘定コード             PIC  X(2).
000220 01  ()消費税額               PIC S9(11) COMP-3.
000230 01  ()徴収区分               PIC  X(1).
000240 01  ()税率                   PIC S9(2)V9(1) COMP-3.
