000010************************************************
000020* (EMC_WK_SEIKYU)
000030************************************************
000040 01  ()契約番号               PIC  X(10).
000050 01  ()物件名                 PIC  X(30).
000060 01  ()検収日                 PIC  X(8).
000070 01  ()リース期間             PIC S9(3) COMP-3.
000080 01  ()充当回                 PIC  X(3).
000090 01  ()総支払回数             PIC  X(3).
000100 01  ()当月リース料           PIC S9(13) COMP-3.
000110 01  ()消費税額               PIC S9(11) COMP-3.
000120 01  ()当社契約番号           PIC  X(10).
000130 01  ()日付                   PIC  X(4).
000140 01  ()請求先コード           PIC  X(8).
000150 01  ()請求コード             PIC  X(2).
000160 01  ()入金日                 PIC  X(2).
000170 01  ()税率                   PIC S9(2)V9(1) COMP-3.
000180 01  ()ユーザーコード         PIC  X(8).
000190 01  ()数量                   PIC S9(4) COMP-3.
000200 01  ()ユーザーリファレンス２ PIC  X(10).
000210 01  ()ユーザーリファレンス３ PIC  X(10).
000220 01  ()ユーザーリファレンス４ PIC  X(10).
000230 01  ()郵便番号               PIC  X(7).
000240 01  ()住所                   PIC  N(40).
000250 01  ()取引先名               PIC  N(20).
000260 01  ()部署名                 PIC  N(20).
