000010************************************************
000020* (EXP_SIMEXC)
000030************************************************
000040 01  ()”Ô†                   PIC  X(4).
000050 01  ()Ž}”Ô                   PIC  X(2).
000060 01  ()Ž–‹ÆŠ                 PIC  X(4).
000070 01  ()Ž–‹ÆŠ–¼               PIC  X(20).
000080 01  ()Œ_–ñ”Ô†               PIC  X(7).
000090 01  ()Žx•¥“ú                 PIC  X(8).
000100 01  ()Žx•¥ŠJŽnŒŽ             PIC  X(6).
000110 01  ()Žx•¥I—¹ŒŽ             PIC  X(6).
000120 01  ()”N“x                   PIC  X(4).
000130 01  ()‰È–Ú                   PIC  X(5).
000140 01  ()‰È–Ú–¼                 PIC  X(20).
000150 01  ()‰È–Ú‹æ•ª               PIC  X(24).
000160 01  ()Žx•¥‹æ•ª               PIC  X(1).
000170 01  ()ƒTƒCƒNƒ‹               PIC  X(2).
000180 01  ()Žx•¥æ                 PIC  X(8).
000190 01  ()Žx•¥æ–¼               PIC  N(25).
000200 01  ()Žxo€–Ú               PIC  N(25).
000210 01  ()ˆóüŒ`Ž®               PIC  X(1).
000220 01  ()•¨Œ”                 PIC S9(3) COMP-3.
000230 01  ()Žx•¥‰ñ”               PIC S9(3) COMP-3.
000240 01  ()’P‰¿                   PIC S9(13) COMP-3.
000250 01  ()Žx•¥‹àŠz               PIC S9(13) COMP-3.
000260 01  ()Žx•¥”N“x•ª             PIC S9(13) COMP-3.
000270 01  ()Žx•¥ŽÀÑ               PIC S9(13) COMP-3.
000280 01  ()Žx•¥—\’è               PIC S9(13) COMP-3.
000290 01  ()‡Œv‹àŠz               PIC S9(13) COMP-3.
000300 01  ()—\ŽZ‹àŠz               PIC S9(13) COMP-3.
000310 01  ()ŒŽ•Ê_‚SŒŽ             PIC S9(13) COMP-3.
000320 01  ()ŒŽ•Ê_‚TŒŽ             PIC S9(13) COMP-3.
000330 01  ()ŒŽ•Ê_‚UŒŽ             PIC S9(13) COMP-3.
000340 01  ()ŒŽ•Ê_‚VŒŽ             PIC S9(13) COMP-3.
000350 01  ()ŒŽ•Ê_‚WŒŽ             PIC S9(13) COMP-3.
000360 01  ()ŒŽ•Ê_‚XŒŽ             PIC S9(13) COMP-3.
000370 01  ()ŒŽ•Ê_‚P‚OŒŽ           PIC S9(13) COMP-3.
000380 01  ()ŒŽ•Ê_‚P‚PŒŽ           PIC S9(13) COMP-3.
000390 01  ()ŒŽ•Ê_‚P‚QŒŽ           PIC S9(13) COMP-3.
000400 01  ()ŒŽ•Ê_‚PŒŽ             PIC S9(13) COMP-3.
000410 01  ()ŒŽ•Ê_‚QŒŽ             PIC S9(13) COMP-3.
000420 01  ()ŒŽ•Ê_‚RŒŽ             PIC S9(13) COMP-3.
