000010************************************************
000020* (FCT_KEY)
000030************************************************
000040 01  ()事業所コード           PIC  X(4).
000050 01  ()契約番号               PIC  X(7).
000060 01  ()契約枝番               PIC  X(2).
000070 01  ()処理ステータス         PIC  X(1).
000080 01  ()登録日                 PIC  X(8).
000090 01  ()登録時刻               PIC  X(6).
000100 01  ()登録担当者コード       PIC  X(4).
000110 01  ()更新日                 PIC  X(8).
000120 01  ()更新時刻               PIC  X(6).
000130 01  ()更新担当者コード       PIC  X(4).
