000010************************************************
000020* (FCT_SOSIN2)
000030************************************************
000040 01  ()データ識別コード       PIC  X(2).
000050 01  ()送信事業所コード       PIC  X(4).
000060 01  ()作成日付               PIC  X(8).
000070 01  ()作成時刻               PIC  X(6).
000080 01  ()契約番号               PIC  X(7).
000090 01  ()契約枝番               PIC  X(2).
000100 01  ()レコード区分           PIC  X(1).
000110 01  ()勘定処理コード         PIC  X(2).
000120 01  ()名寄せコード１         PIC  X(8).
000130 01  ()与信先名１             PIC  N(30).
000140 01  ()保証担保内容１         PIC  X(2).
000150 01  ()保全範囲１             PIC  X(2).
000160 01  ()負担割合１             PIC S9(3) COMP-3.
000170 01  ()名寄せコード２         PIC  X(8).
000180 01  ()与信先名２             PIC  N(30).
000190 01  ()保証担保内容２         PIC  X(2).
000200 01  ()保全範囲２             PIC  X(2).
000210 01  ()負担割合２             PIC S9(3) COMP-3.
000220 01  ()名寄せコード３         PIC  X(8).
000230 01  ()与信先名３             PIC  N(30).
000240 01  ()保証担保内容３         PIC  X(2).
000250 01  ()保全範囲３             PIC  X(2).
000260 01  ()負担割合３             PIC S9(3) COMP-3.
000270 01  ()名寄せコード４         PIC  X(8).
000280 01  ()与信先名４             PIC  N(30).
000290 01  ()保証担保内容４         PIC  X(2).
000300 01  ()保全範囲４             PIC  X(2).
000310 01  ()負担割合４             PIC S9(3) COMP-3.
000320 01  ()名寄せコード５         PIC  X(8).
000330 01  ()与信先名５             PIC  N(30).
000340 01  ()保証担保内容５         PIC  X(2).
000350 01  ()保全範囲５             PIC  X(2).
000360 01  ()負担割合５             PIC S9(3) COMP-3.
