000010************************************************
000020* (FCT_SOSIN1)
000030************************************************
000040 01  ()データ識別コード       PIC  X(2).
000050 01  ()送信事業所コード       PIC  X(4).
000060 01  ()作成日付               PIC  X(8).
000070 01  ()作成時刻               PIC  X(6).
000080 01  ()契約番号               PIC  X(7).
000090 01  ()契約枝番               PIC  X(2).
000100 01  ()レコード区分           PIC  X(1).
000110 01  ()データ区分             PIC  X(1).
000120 01  ()勘定処理コード         PIC  X(2).
000130 01  ()業務区分               PIC  X(1).
000140 01  ()案件発生区分           PIC  X(1).
000150 01  ()稟議区分               PIC  X(1).
000160 01  ()担当者コード           PIC  X(4).
000170 01  ()事業所コード           PIC  X(4).
000180 01  ()ユーザーコード         PIC  X(8).
000190 01  ()契約日                 PIC  X(8).
000200 01  ()実行日                 PIC  X(8).
000210 01  ()期日                   PIC  X(8).
000220 01  ()額面金額               PIC S9(13) COMP-3.
000230 01  ()社内金利サイン領域     PIC  X(1).
000240 01  ()社内金利               PIC S9(2)V9(8) COMP-3.
000250 01  ()月利複利率サイン領域   PIC  X(1).
000260 01  ()月利複利率             PIC S9(2)V9(8) COMP-3.
000270 01  ()粗利益サイン領域       PIC  X(1).
000280 01  ()粗利益                 PIC S9(13) COMP-3.
000290 01  ()銀行コード             PIC  X(7).
000300 01  ()預金種類               PIC  X(1).
000310 01  ()口座ＮＯ               PIC  X(7).
000320 01  ()連動金利区分           PIC  X(2).
000330 01  ()スプレッドサイン領域   PIC  X(1).
000340 01  ()スプレッド             PIC S9(2)V9(8) COMP-3.
000350 01  ()片端両端区分           PIC  X(1).
000360 01  ()金利変動区分           PIC  X(1).
000370 01  ()前取後取区分           PIC  X(1).
000380 01  ()利息端数処理コード     PIC  X(1).
000390 01  ()利率基数コード         PIC  X(1).
000400 01  ()休日対応区分           PIC  X(1).
000410 01  ()原債務者コード         PIC  X(8).
000420 01  ()原債務者情報１         PIC  N(20).
000430 01  ()原債務者情報２         PIC  N(20).
000440 01  ()原債務者情報３         PIC  N(20).
000450 01  ()請求先コード           PIC  X(8).
000460 01  ()利息期日               PIC  X(8).
000470 01  ()期限前決済日           PIC  X(8).
000480 01  ()戻し利息額サイン領域   PIC  X(1).
000490 01  ()戻し利息額             PIC S9(13) COMP-3.
000500 01  ()戻し利率サイン領域     PIC  X(1).
000510 01  ()戻し利率               PIC S9(2)V9(8) COMP-3.
000520 01  ()戻し日数               PIC S9(4) COMP-3.
000530 01  ()戻し利息相殺コード     PIC  X(1).
000540 01  ()返済手数料             PIC S9(13) COMP-3.
000550 01  ()返済手数料消費税等額   PIC S9(13) COMP-3.
000560 01  ()買戻予定日             PIC  X(8).
000570 01  ()買取代金支払日         PIC  X(8).
000580 01  ()期間日数               PIC S9(4) COMP-3.
000590 01  ()買取金額               PIC S9(13) COMP-3.
000600 01  ()割引料                 PIC S9(13) COMP-3.
000610 01  ()割引率サイン領域       PIC  X(1).
000620 01  ()割引率                 PIC S9(2)V9(8) COMP-3.
000630 01  ()回収方式               PIC  X(1).
000640 01  ()代理回収区分           PIC  X(1).
000650 01  ()受取手数料             PIC S9(13) COMP-3.
000660 01  ()受取手数料消費税等額   PIC S9(13) COMP-3.
000670 01  ()債権の表示             PIC  N(30).
000680 01  ()手形種類               PIC  X(1).
000690 01  ()取引銀行コード         PIC  X(7).
000700 01  ()支払人名               PIC  N(30).
000710 01  ()支払場所               PIC  N(30).
000720 01  ()手形番号               PIC  X(10).
000730 01  ()手形の裏書方法         PIC  X(1).
000740 01  ()手形振出日             PIC  X(8).
000750 01  ()手形決済日             PIC  X(8).
000760 01  ()手形決済確認日         PIC  X(8).
000770 01  ()手形保証期間初め       PIC  X(8).
000780 01  ()手形保証期間終わり     PIC  X(8).
000790 01  ()保証料                 PIC S9(13) COMP-3.
000800 01  ()手形保証金額           PIC S9(13) COMP-3.
000810 01  ()保証料率サイン領域     PIC  X(1).
000820 01  ()保証料率               PIC S9(2)V9(8) COMP-3.
000830 01  ()手形保証日数           PIC S9(4) COMP-3.
000840 01  ()保証料支払日           PIC  X(8).
000850 01  ()保証料回収方式         PIC  X(1).
000860 01  ()確認先                 PIC  N(10).
000870 01  ()確認内容               PIC  N(40).
