000010************************************************
000020* (IBS_CITY)
000030************************************************
000040 01  ()都市コード             PIC  X(3).
000050 01  ()国コード               PIC  X(3).
000060 01  ()名称＿日本語           PIC  N(10).
000070 01  ()名称＿英語             PIC  N(10).
000080 01  ()登録日                 PIC  X(8).
000090 01  ()登録時刻               PIC  X(6).
000100 01  ()登録担当者コード       PIC  X(4).
000110 01  ()更新日                 PIC  X(8).
000120 01  ()更新時刻               PIC  X(6).
000130 01  ()更新担当者コード       PIC  X(4).
