000010************************************************
000020* (IBS_WORK)
000030************************************************
000040 01  ()ŽæˆøæƒR[ƒh           PIC  X(8).
000050 01  ()Žæˆøæ–¼ÌQŠ¿Žš       PIC  N(20).
