000010************************************************
000020* (JOM_FORM_0011)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()ÅIŽ}”Ô               PIC  X(2).
000060 01  ()ŒŸŽû“ú                 PIC  X(8).
