000010************************************************
000020* (JOM_FORM_0010)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()契約番号               PIC  X(9).
000060 01  ()物件ＮＯ               PIC  X(3).
000070 01  ()ジョモ支店コード       PIC  X(2).
000080 01  ()支店名漢字             PIC  N(30).
000090 01  ()設置場所名             PIC  N(10).
000100 01  ()ジョモ商品コード       PIC  X(4).
000110 01  ()物件名                 PIC  N(15).
000120 01  ()解約後リース料         PIC S9(13) COMP-3.
000130 01  ()変更済標識             PIC  X(1).
