000010************************************************
000020* (JOM_SYOHIN_MST)
000030************************************************
000040 01  ()ジョモ商品コード       PIC  X(4).
000050 01  ()ジョモ商品分類名       PIC  N(15).
000060 01  ()物件名＿漢字           PIC  N(20).
000070 01  ()物件名                 PIC  N(10).
000080 01  ()機種名                 PIC  N(10).
000090 01  ()資産コード             PIC  X(7).
000100 01  ()耐用年数               PIC  X(2).
000110 01  ()税区分                 PIC  X(1).
000120 01  ()固定資産税率           PIC S9(2)V9(1) COMP-3.
000130 01  ()保険料率               PIC S9(2)V9(3) COMP-3.
000140 01  ()動総保険コード         PIC  X(4).
000150 01  ()信用保険コード＿リース PIC  X(6).
000160 01  ()信用保険コード＿割賦   PIC  X(6).
