000010************************************************
000020* (JOM_FORM_0017)
000030************************************************
000040 01  ()ジョモ支店コード       PIC  X(2).
000050 01  ()ジョモ契約番号         PIC  X(9).
000060 01  ()ジョモ物件ＮＯ         PIC  X(3).
000070 01  ()メッセージ             PIC  N(30).
