000010************************************************
000020* (JOM_SNDREC)
000030************************************************
000040 01  ()SNDREC           PIC  N(512).
