000010************************************************
000020* (KAI_WK_KIROKHYO)
000030************************************************
000040 01  ()å_ñÒî‘çÜ               PIC  X(9).
000050 01  ()èàóùì‡óe               PIC  N(0.5).
