000010************************************************
000020* (KAI_WK_IREISINSEI)
000030************************************************
000040 01  ()担当部店               PIC  N(10).
000050 01  ()解約日                 PIC  X(8).
000060 01  ()契約番号               PIC  X(9).
000070 01  ()名寄せコード           PIC  X(8).
000080 01  ()契約先名               PIC  N(30).
000090 01  ()異例申請内容営業       PIC  N(200).
000100 01  ()営業部担当意見営業     PIC  N(200).
000110 01  ()異例申請内容総合       PIC  N(200).
000120 01  ()営業部担当意見総合     PIC  N(200).
000130 01  ()異例申請内容事務       PIC  N(200).
000140 01  ()営業部担当意見事務     PIC  N(200).
