000010************************************************
000020* (KAI_KAPPU)
000030************************************************
000040 01  ()å_ñÒî‘çÜ               PIC  X(9).
