000010************************************************
000020* (KAI_SAIMEI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件NO               PIC  X(3).
000060 01  ()ＳＦＣ解約処理         PIC  X(1).
000070 01  ()規損金消費税率         PIC S9(2)V9(1) COMP-3.
000080 01  ()残価額                 PIC S9(13) COMP-3.
000090 01  ()個別リース料           PIC S9(13) COMP-3.
000100 01  ()購入金額               PIC S9(13) COMP-3.
000110 01  ()数量                   PIC S9(4) COMP-3.
000120 01  ()資産処分コード         PIC  X(1).
000130 01  ()規定損失金額           PIC S9(13) COMP-3.
000140 01  ()売却金額               PIC S9(13) COMP-3.
000150 01  ()売却先名カナ           PIC  X(30).
000160 01  ()引取費用               PIC S9(13) COMP-3.
000170 01  ()売却金額入金予定日     PIC  X(8).
000180 01  ()売却金額入金先コード   PIC  X(8).
000190 01  ()登録日                 PIC  X(8).
000200 01  ()登録時刻               PIC  X(6).
000210 01  ()登録担当者コード       PIC  X(4).
000220 01  ()更新日                 PIC  X(8).
000230 01  ()更新時刻               PIC  X(6).
000240 01  ()更新担当者コード       PIC  X(4).
