000010************************************************
000020* (KAI_WK_CYOUSEI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()調整有無               PIC  X(1).
000060 01  ()調整金額               PIC S9(13) COMP-3.
000070 01  ()調整理由               PIC  N(10).
000080 01  ()第３者支払者名カナ     PIC  N(15).
000090 01  ()第３者支払者名漢字     PIC  N(20).
