000010************************************************
000020* (KAI_WK_TENKAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()展開番号               PIC S9(3) COMP-3.
000060 01  ()リース料               PIC S9(13) COMP-3.
000070 01  ()回数                   PIC S9(13) COMP-3.
000080 01  ()消費税等額             PIC S9(13) COMP-3.
000090 01  ()合計                   PIC S9(13) COMP-3.
