000010************************************************
000020* (KEI_LOST)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()顧客コード             PIC  X(6).
000080 01  ()取引先名               PIC  N(30).
000090 01  ()取引形態コード         PIC  X(2).
000100 01  ()案件発生区分           PIC  X(1).
000110 01  ()契約日                 PIC  X(8).
000120 01  ()リース期間             PIC S9(3) COMP-3.
000130 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000140 01  ()リース料               PIC S9(13) COMP-3.
000150 01  ()購入金額合計           PIC S9(13) COMP-3.
000160 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000170 01  ()粗利益                 PIC S9(13) COMP-3.
000180 01  ()契約金額               PIC S9(13) COMP-3.
000190 01  ()物件名                 PIC  N(30).
000200 01  ()受注リース会社         PIC  N(20).
000210 01  ()他社受注利回り         PIC S9(2)V9(8) COMP-3.
000220 01  ()ロスト理由区分         PIC  X(2).
000230 01  ()ロスト案件満了日       PIC  X(8).
000240 01  ()ロストコメント         PIC  N(50).
000250 01  ()登録日                 PIC  X(8).
000260 01  ()登録時刻               PIC  X(6).
000270 01  ()登録担当者コード       PIC  X(4).
000280 01  ()更新日                 PIC  X(8).
000290 01  ()更新時刻               PIC  X(6).
000300 01  ()更新担当者コード       PIC  X(4).
