000010************************************************
000020* (KEI_WK_YOTEI3)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()˜A”Ô                   PIC S9(3) COMP-3.
000060 01  ()’[––”Ô†               PIC  N(8).
000070 01  ()‰ñ”‚P                 PIC S9(3) COMP-3.
000080 01  ()Žx•¥Šú“ú‚P             PIC  X(10).
000090 01  ()Žx•¥‹àŠz‚P             PIC S9(13) COMP-3.
000100 01  ()Žx•¥Žc‚‚P             PIC S9(13) COMP-3.
000110 01  ()‰ñ”‚Q                 PIC S9(3) COMP-3.
000120 01  ()Žx•¥Šú“ú‚Q             PIC  X(10).
000130 01  ()Žx•¥‹àŠz‚Q             PIC S9(13) COMP-3.
000140 01  ()Žx•¥Žc‚‚Q             PIC S9(13) COMP-3.
