000010************************************************
000020* (KEI_BKDATE_KEY)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()ì¬“ú                 PIC  X(8).
000060 01  ()ì¬Žž               PIC  X(6).
000070 01  ()ì¬’S“–ŽÒƒR[ƒh       PIC  X(4).
