000010************************************************
000020* (KEI_LPWK_KEI_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()顧客コード             PIC  X(6).
000080 01  ()取引先名               PIC  N(30).
000090 01  ()担当者コード           PIC  X(4).
000100 01  ()勘定処理コード         PIC  X(2).
000110 01  ()債務協調コード         PIC  X(2).
000120 01  ()取引形態コード         PIC  X(2).
000130 01  ()案件発生区分           PIC  X(1).
000140 01  ()物件確認基準           PIC  X(1).
000150 01  ()契約日                 PIC  X(8).
000160 01  ()検収予定日             PIC  X(8).
000170 01  ()検収日                 PIC  X(8).
000180 01  ()計算方式               PIC  X(1).
000190 01  ()リース期間             PIC S9(3) COMP-3.
000200 01  ()請求サイクル           PIC S9(2) COMP-3.
000210 01  ()支払回数               PIC S9(3) COMP-3.
000220 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000230 01  ()前受月数               PIC S9(2) COMP-3.
000240 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000250 01  ()月額平均保守料         PIC S9(13) COMP-3.
000260 01  ()その他諸費用総額       PIC S9(13) COMP-3.
000270 01  ()前渡金利息             PIC S9(13) COMP-3.
000280 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000290 01  ()消費税徴収区分         PIC  X(1).
000300 01  ()リース料               PIC S9(13) COMP-3.
000310 01  ()前受リース料           PIC S9(13) COMP-3.
000320 01  ()転リース提携先コード   PIC  X(2).
000330 01  ()単年度契約             PIC  X(2).
000340 01  ()充当_相殺区分         PIC  X(1).
000350 01  ()前渡金区分             PIC  X(1).
000360 01  ()再リース料表示区分     PIC  X(1).
000370 01  ()再リース料             PIC S9(13) COMP-3.
000380 01  ()保守契約先名           PIC  N(30).
000390 01  ()損害賠償金文言         PIC  N(68).
000400 01  ()特約                   PIC  N(400).
000410 01  ()購入金額合計           PIC S9(13) COMP-3.
000420 01  ()残価額合計             PIC S9(13) COMP-3.
000430 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000440 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000450 01  ()粗利益                 PIC S9(13) COMP-3.
000460 01  ()契約金額               PIC S9(13) COMP-3.
000470 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000480 01  ()基本リース料率         PIC S9(2)V9(8) COMP-3.
000490 01  ()固定資産税総額         PIC S9(13) COMP-3.
000500 01  ()動総保険料総額         PIC S9(13) COMP-3.
000510 01  ()規定損失金物件金額     PIC S9(13) COMP-3.
000520 01  ()計算方法_規定損失金   PIC  X(2).
000530 01  ()ロンコミ付議ＮＯ       PIC  X(7).
000540 01  ()決済区分               PIC  X(1).
000550 01  ()初回リース料           PIC S9(13) COMP-3.
000560 01  ()終回リース料           PIC S9(13) COMP-3.
000570 01  ()代表物件名             PIC  N(20).
000580 01  ()請求区分１             PIC  X(1).
000590 01  ()請求区分２             PIC  X(1).
000600 01  ()第１回リース料受取り条件 PIC  N(10).
000610 01  ()２回目以降リース料受取り条件 PIC  N(10).
000620 01  ()手形枚数               PIC S9(3) COMP-3.
000630 01  ()入金基準日             PIC  X(2).
000640 01  ()預金種類               PIC  X(1).
000650 01  ()銀行コード             PIC  X(7).
000660 01  ()口座番号               PIC  X(7).
000670 01  ()銀行支店名             PIC  N(30).
000680 01  ()端末番号               PIC  N(8).
000690 01  ()動総付保区分           PIC  X(1).
000700 01  ()支払方法文言           PIC  N(100).
000710 01  ()搬入予定日             PIC  X(8).
