000010************************************************
000020* (KEI_NASCA_SYOHIN)
000030************************************************
000040 01  ()機械番号               PIC  N(5).
000050 01  ()物件名_カナ           PIC  N(10).
000060 01  ()資産コード             PIC  X(7).
