000010************************************************
000020* (KEI_SETTI_MST)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()設置場所コード         PIC  X(3).
000060 01  ()設置場所名_漢字       PIC  N(20).
000070 01  ()設置場所名_カナ       PIC  N(10).
000080 01  ()設置場所郵便番号       PIC  X(7).
000090 01  ()納付先コード           PIC  X(6).
000100 01  ()設置場所住所           PIC  N(50).
000110 01  ()登録日                 PIC  X(8).
000120 01  ()登録時刻               PIC  X(6).
000130 01  ()登録担当者コード       PIC  X(4).
000140 01  ()更新日                 PIC  X(8).
000150 01  ()更新時刻               PIC  X(6).
000160 01  ()更新担当者コード       PIC  X(4).
