000010************************************************
000020* (KEI_KIHON_IMP)
000030************************************************
000040 01  ()WD1                 PIC  X(9).
000050 01  ()WD2                 PIC  X(4).
000060 01  ()WD3                 PIC  X(10).
000070 01  ()WD4                 PIC  X(1).
000080 01  ()WD5                 PIC  X(1).
000090 01  ()WD6                 PIC  X(8).
000100 01  ()WD7                 PIC  X(6).
000110 01  ()WD8                 PIC  N(30).
000120 01  ()WD9                 PIC  X(4).
000130 01  ()WD10               PIC  X(2).
000140 01  ()WD11               PIC  X(2).
000150 01  ()WD12               PIC  X(2).
000160 01  ()WD13               PIC  X(1).
000170 01  ()WD14               PIC  X(1).
000180 01  ()WD15               PIC  X(3).
000190 01  ()WD16               PIC  X(1).
000200 01  ()WD17               PIC  X(8).
000210 01  ()WD18               PIC  X(8).
000220 01  ()WD19               PIC  X(8).
000230 01  ()WD20               PIC  X(1).
000240 01  ()WD21               PIC  X(3).
000250 01  ()WD22               PIC  X(2).
000260 01  ()WD23               PIC  X(3).
000270 01  ()WD24               PIC  X(5).
000280 01  ()WD25               PIC  X(2).
000290 01  ()WD26               PIC  X(5).
000300 01  ()WD27               PIC  X(13).
000310 01  ()WD28               PIC  X(13).
000320 01  ()WD29               PIC  X(13).
000330 01  ()WD30               PIC  X(4).
000340 01  ()WD31               PIC  X(1).
000350 01  ()WD32               PIC  X(13).
000360 01  ()WD33               PIC  X(13).
000370 01  ()WD34               PIC  X(2).
000380 01  ()WD35               PIC  X(2).
000390 01  ()WD36               PIC  X(1).
000400 01  ()WD37               PIC  X(1).
000410 01  ()WD38               PIC  X(1).
000420 01  ()WD39               PIC  X(13).
000430 01  ()WD40               PIC  N(30).
000440 01  ()WD41               PIC  N(400).
000450 01  ()WD42               PIC  X(13).
000460 01  ()WD43               PIC  X(13).
000470 01  ()WD44               PIC  X(11).
000480 01  ()WD45               PIC  X(11).
000490 01  ()WD46               PIC  X(13).
000500 01  ()WD47               PIC  X(13).
000510 01  ()WD48               PIC  X(11).
000520 01  ()WD49               PIC  X(11).
000530 01  ()WD50               PIC  X(13).
000540 01  ()WD51               PIC  X(13).
000550 01  ()WD52               PIC  X(13).
000560 01  ()WD53               PIC  X(13).
000570 01  ()WD54               PIC  X(13).
000580 01  ()WD55               PIC  X(13).
000590 01  ()WD56               PIC  X(13).
000600 01  ()WD57               PIC  X(13).
000610 01  ()WD58               PIC  X(13).
000620 01  ()WD59               PIC  X(13).
000630 01  ()WD60               PIC  X(13).
000640 01  ()WD61               PIC  X(13).
000650 01  ()WD62               PIC  X(13).
000660 01  ()WD63               PIC  X(13).
000670 01  ()WD64               PIC  X(13).
000680 01  ()WD65               PIC  X(2).
000690 01  ()WD66               PIC  X(7).
000700 01  ()WD67               PIC  X(1).
000710 01  ()WD68               PIC  X(1).
000720 01  ()WD69               PIC  X(13).
000730 01  ()WD70               PIC  X(13).
