000010************************************************
000020* (KEI_LPWK_RINGI_MEISAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()ＷＫ連番               PIC S9(5) COMP-3.
000070 01  ()端末番号               PIC  N(8).
000080 01  ()購入先識別ＮＯ         PIC  X(1).
000090 01  ()物件名_漢字           PIC  N(20).
000100 01  ()製造業者               PIC  N(30).
000110 01  ()数量                   PIC S9(4) COMP-3.
000120 01  ()購入金額               PIC S9(13) COMP-3.
000130 01  ()資産コード             PIC  X(7).
000140 01  ()耐用年数               PIC S9(2) COMP-3.
000150 01  ()信用保険コード         PIC  X(6).
000160 01  ()残価額                 PIC S9(13) COMP-3.
000170 01  ()残価保証先名           PIC  N(30).
000180 01  ()設置場所名_漢字       PIC  N(20).
000190 01  ()設置場所住所           PIC  N(50).
000200 01  ()資産マスタ資産名       PIC  N(15).
000210 01  ()購入先名               PIC  N(30).
000220 01  ()取引先名               PIC  N(30).
000230 01  ()契約日                 PIC  X(8).
