000010************************************************
000020* (KEI_WK_YOTEI2)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()端末番号               PIC  N(8).
000060 01  ()契約日                 PIC  X(8).
000070 01  ()リース開始日           PIC  X(8).
000080 01  ()リース期間満了日       PIC  X(8).
000090 01  ()お支払回数             PIC S9(3) COMP-3.
000100 01  ()リース料総額           PIC S9(13) COMP-3.
000110 01  ()１回当たりリース料     PIC  X(18).
000120 01  ()１回当たり消費税等     PIC  X(18).
000130 01  ()代表物件名             PIC  X(40).
000140 01  ()物件設置場所           PIC  X(40).
000150 01  ()支払開始日             PIC  X(10).
