000010************************************************
000020* (KEI_KEITAI_CD)
000030************************************************
000040 01  ()取引形態コード         PIC  X(2).
000050 01  ()取引形態               PIC  N(15).
000060 01  ()契約番号の上１桁       PIC  N(0.5).
000070 01  ()登録日                 PIC  X(8).
000080 01  ()登録時刻               PIC  X(6).
000090 01  ()登録担当者コード       PIC  X(4).
000100 01  ()更新日                 PIC  X(8).
000110 01  ()更新時刻               PIC  X(6).
000120 01  ()更新担当者コード       PIC  X(4).
