000010************************************************
000020* (KEI_LPWK_EDA_SEIKYU)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()取引先区分             PIC  X(1).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()顧客コード             PIC  X(6).
000080 01  ()勘定処理コード         PIC  X(2).
000090 01  ()取引形態コード         PIC  X(2).
000100 01  ()契約日                 PIC  X(8).
000110 01  ()検収日                 PIC  X(8).
000120 01  ()計算方式               PIC  X(1).
000130 01  ()リース期間             PIC S9(3) COMP-3.
000140 01  ()請求サイクル           PIC S9(2) COMP-3.
000150 01  ()支払回数               PIC S9(3) COMP-3.
000160 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000170 01  ()前受月数               PIC S9(2) COMP-3.
000180 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000190 01  ()消費税徴収区分         PIC  X(1).
000200 01  ()リース料               PIC S9(13) COMP-3.
000210 01  ()前受リース料           PIC S9(13) COMP-3.
000220 01  ()購入金額合計           PIC S9(13) COMP-3.
000230 01  ()契約金額               PIC S9(13) COMP-3.
000240 01  ()固定資産税総額         PIC S9(13) COMP-3.
000250 01  ()動総保険料総額         PIC S9(13) COMP-3.
000260 01  ()初回リース料           PIC S9(13) COMP-3.
000270 01  ()終回リース料           PIC S9(13) COMP-3.
000280 01  ()基本リース料           PIC S9(13) COMP-3.
000290 01  ()月額固定資産税総額     PIC S9(13) COMP-3.
000300 01  ()月額動総保険料総額     PIC S9(13) COMP-3.
000310 01  ()請求先コード           PIC  X(8).
000320 01  ()請求先名               PIC  N(30).
000330 01  ()請求先部門名称         PIC  N(20).
000340 01  ()請求先郵便番号３桁     PIC  X(3).
000350 01  ()請求先郵便番号４桁     PIC  X(4).
000360 01  ()都道府県               PIC  N(5).
000370 01  ()請求先住所１           PIC  N(20).
000380 01  ()請求先住所２           PIC  N(20).
000390 01  ()請求区分１             PIC  X(1).
000400 01  ()請求区分２             PIC  X(1).
000410 01  ()第１回リース料受取り条件 PIC  N(10).
000420 01  ()２回目以降リース料受取り条件 PIC  N(10).
000430 01  ()手形枚数               PIC S9(3) COMP-3.
000440 01  ()入金基準日             PIC  X(2).
000450 01  ()預金種類               PIC  X(1).
000460 01  ()銀行コード             PIC  X(7).
000470 01  ()口座番号               PIC  X(7).
000480 01  ()第１回リース料入金日   PIC  X(8).
000490 01  ()第２回リース料入金日   PIC  X(8).
000500 01  ()前受リース料入金日     PIC  X(8).
000510 01  ()残価回収日             PIC  X(8).
000520 01  ()銀行短縮コード         PIC  X(2).
000530 01  ()物件ＮＯ               PIC  X(3).
000540 01  ()物件名_漢字           PIC  N(20).
000550 01  ()物件名_カナ           PIC  N(10).
000560 01  ()ユーザーリファレンス１ PIC  N(6).
000570 01  ()回数                   PIC  X(1).
000580 01  ()消費税額１             PIC S9(13) COMP-3.
000590 01  ()消費税額２             PIC S9(13) COMP-3.
000600 01  ()リース料１             PIC S9(13) COMP-3.
000610 01  ()リース料２             PIC S9(13) COMP-3.
000620 01  ()予備                   PIC  X(10).
000630 01  ()端末番号               PIC  N(8).
