000010************************************************
000020* (KEI_KONYUM)
000030************************************************
000040 01  ()ディーラーコード       PIC  X(5).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()購入先コード＿センター PIC  X(8).
000070 01  ()購入先名               PIC  N(30).
000080 01  ()支払先コード           PIC  X(4).
000090 01  ()購入先郵便番号         PIC  X(7).
000100 01  ()購入先住所             PIC  N(50).
000110 01  ()購入先担当者           PIC  N(10).
000120 01  ()電話番号               PIC  N(7.5).
000130 01  ()ＦＡＸ番号             PIC  N(7.5).
000140 01  ()支払繰延月数           PIC S9(2)V9(2) COMP-3.
000150 01  ()支払条件文言           PIC  N(20).
000160 01  ()コメント               PIC  N(50).
000170 01  ()購入先名カナ           PIC  N(15).
000180 01  ()登録日                 PIC  X(8).
000190 01  ()登録時刻               PIC  X(6).
000200 01  ()登録担当者コード       PIC  X(4).
000210 01  ()更新日                 PIC  X(8).
000220 01  ()更新時刻               PIC  X(6).
000230 01  ()更新担当者コード       PIC  X(4).
