000010************************************************
000020* (KEI_TSRYO_KHN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()請求先コード           PIC  X(8).
000080 01  ()事業所コード           PIC  X(4).
000090 01  ()担当者コード           PIC  X(4).
000100 01  ()処理日                 PIC  X(8).
000110 01  ()リース開始日           PIC  X(8).
000120 01  ()銀行短縮コード         PIC  X(2).
000130 01  ()銀行コード             PIC  X(7).
000140 01  ()口座番号               PIC  X(7).
000150 01  ()預金種類               PIC  X(1).
000160 01  ()関連契約番号           PIC  X(9).
000170 01  ()消費税徴収区分         PIC  X(1).
000180 01  ()ＳＦＣ判定区分         PIC  X(1).
000190 01  ()データ区分             PIC  X(1).
000200 01  ()入金日                 PIC S9(2) COMP-3.
000210 01  ()請求サイクル           PIC S9(2) COMP-3.
000220 01  ()請求区分１             PIC  X(1).
000230 01  ()請求区分２             PIC  X(1).
000240 01  ()勘定処理コード         PIC  X(2).
000250 01  ()請求コード             PIC  X(2).
000260 01  ()リース期間             PIC S9(3) COMP-3.
000270 01  ()支払回数               PIC S9(3) COMP-3.
000280 01  ()ＢＥＧＩＮ回数         PIC  X(1).
000290 01  ()計算方式               PIC  X(1).
000300 01  ()再リースコード         PIC  X(1).
000310 01  ()請求金額合計           PIC S9(13) COMP-3.
000320 01  ()第１回リース料入金日   PIC  X(8).
000330 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000340 01  ()手数料口前受金額       PIC S9(13) COMP-3.
000350 01  ()手数料口前受入金日     PIC  X(8).
000360 01  ()手数料請求名称         PIC  N(15).
000370 01  ()再リース付保率         PIC S9(2) COMP-3.
000380 01  ()送信区分               PIC  X(1).
000390 01  ()登録日                 PIC  X(8).
000400 01  ()登録時刻               PIC  X(6).
000410 01  ()登録担当者コード       PIC  X(4).
000420 01  ()更新日                 PIC  X(8).
000430 01  ()更新時刻               PIC  X(6).
000440 01  ()更新担当者コード       PIC  X(4).
