000010************************************************
000020* (KOK_HOUMON)
000030************************************************
000040 01  ()ŒÚ‹qƒR[ƒh             PIC  X(6).
000050 01  ()–Ê’k“ú                 PIC  X(8).
000060 01  ()Œß‘OŒßŒã               PIC  X(1).
000070 01  ()ŽæˆøŒ©ž‚Ý‹æ•ª         PIC  X(1).
000080 01  ()Hì•ûj‹æ•ª           PIC  X(1).
000090 01  ()–K–â–Ú“I‹æ•ª           PIC  X(1).
000100 01  ()æ•û’S“–ŽÒ‚P           PIC  N(7).
000110 01  ()–ðE’S“–‚P             PIC  N(7).
000120 01  ()æ•û’S“–ŽÒ‚Q           PIC  N(7).
000130 01  ()–ðE’S“–‚Q             PIC  N(7).
000140 01  ()æ•û’S“–ŽÒ‚R           PIC  N(7).
000150 01  ()–ðE’S“–‚R             PIC  N(7).
000160 01  ()“–ŽÐ–Ê’kŽÒ‚P           PIC  N(7).
000170 01  ()“–ŽÐ–Ê’kŽÒ‚Q           PIC  N(7).
000180 01  ()“–ŽÐ–Ê’kŽÒ‚R           PIC  N(7).
000190 01  ()–Ê’k“à—e               PIC  N(1000).
000200 01  ()Ž©—Rƒƒ‚               PIC  N(50).
000210 01  ()–K–âŽÒ–¼               PIC  N(10).
000220 01  ()“o˜^“ú                 PIC  X(8).
000230 01  ()“o˜^Žž               PIC  X(6).
000240 01  ()“o˜^’S“–ŽÒƒR[ƒh       PIC  X(4).
000250 01  ()XV“ú                 PIC  X(8).
000260 01  ()XVŽž               PIC  X(6).
000270 01  ()XV’S“–ŽÒƒR[ƒh       PIC  X(4).
