000010************************************************
000020* (KOK_KOUSAKU)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()面談日                 PIC  X(8).
000060 01  ()工作開始日             PIC  X(8).
000070 01  ()工作開始事業所         PIC  N(7).
000080 01  ()工作開始担当者         PIC  N(7).
000090 01  ()先方担当者１           PIC  N(7).
000100 01  ()役職担当１             PIC  N(7).
000110 01  ()先方担当者２           PIC  N(7).
000120 01  ()役職担当２             PIC  N(7).
000130 01  ()当社面談者１           PIC  N(7).
000140 01  ()当社面談者２           PIC  N(7).
000150 01  ()開始経緯               PIC  X(1).
000160 01  ()工作方針               PIC  X(1).
000170 01  ()取引見込み             PIC  X(1).
000180 01  ()リース利用             PIC  X(1).
000190 01  ()支払リース料           PIC S9(4) COMP-3.
000200 01  ()利用物件               PIC  N(30).
000210 01  ()リース窓口             PIC  N(30).
000220 01  ()初回面談内容           PIC  N(400).
000230 01  ()訪問者名               PIC  N(10).
000240 01  ()登録日                 PIC  X(8).
000250 01  ()登録時刻               PIC  X(6).
000260 01  ()登録担当者コード       PIC  X(4).
000270 01  ()更新日                 PIC  X(8).
000280 01  ()更新時刻               PIC  X(6).
000290 01  ()更新担当者コード       PIC  X(4).
