000010************************************************
000020* (KOK_SOUKI_SOSIN)
000030************************************************
000040 01  ()送信データ             PIC  N(175).
