000010************************************************
000020* (KOK_TANTO)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()先方担当者名１         PIC  N(7).
000060 01  ()役職名１               PIC  N(7).
000070 01  ()直通電話１             PIC  N(7.5).
000080 01  ()Ｅメール１             PIC  N(20).
000090 01  ()コメント１             PIC  N(100).
000100 01  ()先方担当者名２         PIC  N(7).
000110 01  ()役職名２               PIC  N(7).
000120 01  ()直通電話２             PIC  N(7.5).
000130 01  ()Ｅメール２             PIC  N(20).
000140 01  ()コメント２             PIC  N(100).
000150 01  ()先方担当者名３         PIC  N(7).
000160 01  ()役職名３               PIC  N(7).
000170 01  ()先方担当者名４         PIC  N(7).
000180 01  ()役職名４               PIC  N(7).
000190 01  ()登録日                 PIC  X(8).
000200 01  ()登録時刻               PIC  X(6).
000210 01  ()登録担当者コード       PIC  X(4).
000220 01  ()更新日                 PIC  X(8).
000230 01  ()更新時刻               PIC  X(6).
000240 01  ()更新担当者コード       PIC  X(4).
