000010************************************************
000020* (KTK_YOSIN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()データ区分             PIC  X(1).
000060 01  ()名寄せコード１         PIC  X(8).
000070 01  ()与信先名１             PIC  N(30).
000080 01  ()保証担保内容１         PIC  X(2).
000090 01  ()保全範囲１             PIC  X(2).
000100 01  ()負担割合１             PIC S9(3) COMP-3.
000110 01  ()名寄せコード２         PIC  X(8).
000120 01  ()与信先名２             PIC  N(30).
000130 01  ()保証担保内容２         PIC  X(2).
000140 01  ()保全範囲２             PIC  X(2).
000150 01  ()負担割合２             PIC S9(3) COMP-3.
000160 01  ()名寄せコード３         PIC  X(8).
000170 01  ()与信先名３             PIC  N(30).
000180 01  ()保証担保内容３         PIC  X(2).
000190 01  ()保全範囲３             PIC  X(2).
000200 01  ()負担割合３             PIC S9(3) COMP-3.
000210 01  ()名寄せコード４         PIC  X(8).
000220 01  ()与信先名４             PIC  N(30).
000230 01  ()保証担保内容４         PIC  X(2).
000240 01  ()保全範囲４             PIC  X(2).
000250 01  ()負担割合４             PIC S9(3) COMP-3.
000260 01  ()名寄せコード５         PIC  X(8).
000270 01  ()与信先名５             PIC  N(30).
000280 01  ()保証担保内容５         PIC  X(2).
000290 01  ()保全範囲５             PIC  X(2).
000300 01  ()負担割合５             PIC S9(3) COMP-3.
000310 01  ()登録日                 PIC  X(8).
000320 01  ()登録時刻               PIC  X(6).
000330 01  ()登録担当者コード       PIC  X(4).
000340 01  ()更新日                 PIC  X(8).
000350 01  ()更新時刻               PIC  X(6).
000360 01  ()更新担当者コード       PIC  X(4).
