000010************************************************
000020* (KTK_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()データ区分             PIC  X(1).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()担当者コード           PIC  X(4).
000080 01  ()ユーザーコード         PIC  X(8).
000090 01  ()名寄せコード           PIC  X(8).
000100 01  ()顧客コード             PIC  X(6).
000110 01  ()新規書替区分           PIC  X(1).
000120 01  ()契約日                 PIC  X(8).
000130 01  ()実行日                 PIC  X(8).
000140 01  ()勘定処理コード         PIC  X(2).
000150 01  ()貸付種類               PIC  X(1).
000160 01  ()元本元利区分           PIC  X(1).
000170 01  ()貸付金額               PIC S9(13) COMP-3.
000180 01  ()契約期間               PIC S9(3) COMP-3.
000190 01  ()期日                   PIC  X(8).
000200 01  ()長短区分               PIC  X(1).
000210 01  ()金利変動区分           PIC  X(1).
000220 01  ()約定弁済区分           PIC  X(1).
000230 01  ()受取手数料             PIC S9(13) COMP-3.
000240 01  ()受取手数料消費税等額   PIC S9(13) COMP-3.
000250 01  ()支払日                 PIC  X(8).
000260 01  ()支払繰延月数           PIC S9(2)V9(2) COMP-3.
000270 01  ()支払先コード           PIC  X(4).
000280 01  ()支払先名               PIC  N(20).
000290 01  ()支払先銀行コード       PIC  X(7).
000300 01  ()支払先口座番号         PIC  X(7).
000310 01  ()支払先預金種類         PIC  X(1).
000320 01  ()支払承認ＮＯ           PIC  X(6).
000330 01  ()支払承認日             PIC  X(8).
000340 01  ()支払承認担当者コード   PIC  X(4).
000350 01  ()利率基数コード         PIC  X(1).
000360 01  ()初回日割区分           PIC  X(1).
000370 01  ()利息端数処理コード     PIC  X(1).
000380 01  ()前取後取区分           PIC  X(1).
000390 01  ()片端両端区分           PIC  X(1).
000400 01  ()休日対応区分           PIC  X(1).
000410 01  ()連動金利区分           PIC  X(2).
000420 01  ()見直しサイクル         PIC S9(3) COMP-3.
000430 01  ()スプレッド             PIC S9(2)V9(8) COMP-3.
000440 01  ()入金日                 PIC S9(2) COMP-3.
000450 01  ()第１回内入日           PIC  X(8).
000460 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000470 01  ()内入サイクル           PIC S9(2) COMP-3.
000480 01  ()内入回数               PIC S9(3) COMP-3.
000490 01  ()第１回利払日           PIC  X(8).
000500 01  ()利払サイクル           PIC S9(2) COMP-3.
000510 01  ()利払回数               PIC S9(3) COMP-3.
000520 01  ()約定日計算区分         PIC  X(1).
000530 01  ()わかち計算区分         PIC  X(1).
000540 01  ()金利変更基準日コード   PIC  X(1).
000550 01  ()利率確定期限           PIC  X(8).
000560 01  ()利率                   PIC S9(2)V9(8) COMP-3.
000570 01  ()社内金利               PIC S9(2)V9(8) COMP-3.
000580 01  ()月利複利率＿基本       PIC S9(2)V9(8) COMP-3.
000590 01  ()月利複利率＿実質       PIC S9(2)V9(8) COMP-3.
000600 01  ()粗利益                 PIC S9(13) COMP-3.
000610 01  ()案件発生区分           PIC  X(1).
000620 01  ()取引先区分             PIC  X(1).
000630 01  ()稟議ＮＯ               PIC  X(10).
000640 01  ()稟議区分               PIC  X(1).
000650 01  ()ローンコミ付議ＮＯ     PIC  X(7).
000660 01  ()取引形態コード         PIC  X(2).
000670 01  ()決裁区分               PIC  X(1).
000680 01  ()担保区分               PIC  X(1).
000690 01  ()担保情報詳細           PIC  N(50).
000700 01  ()営業部意見             PIC  N(100).
000710 01  ()事務連絡事項           PIC  N(100).
000720 01  ()借入方式               PIC  X(1).
000730 01  ()資金使途区分           PIC  X(1).
000740 01  ()資金使途詳細           PIC  N(50).
000750 01  ()特約条項１             PIC  N(400).
000760 01  ()特約条項２             PIC  N(400).
000770 01  ()特約条項３             PIC  N(400).
000780 01  ()特約条項４             PIC  N(400).
000790 01  ()特約条項５             PIC  N(400).
000800 01  ()特約条項６             PIC  N(400).
000810 01  ()特約条項７             PIC  N(400).
000820 01  ()特約条項８             PIC  N(400).
000830 01  ()特約条項９             PIC  N(400).
000840 01  ()特約条項１０           PIC  N(400).
000850 01  ()物件名                 PIC  N(20).
000860 01  ()設置場所名             PIC  N(20).
000870 01  ()設置場所郵便番号       PIC  X(7).
000880 01  ()設置場所住所           PIC  N(50).
000890 01  ()請求先コード           PIC  X(8).
000900 01  ()銀行コード             PIC  X(7).
000910 01  ()口座番号               PIC  X(7).
000920 01  ()預金種類               PIC  X(1).
000930 01  ()書替元契約番号１       PIC  X(9).
000940 01  ()書替元元本残高１       PIC S9(13) COMP-3.
000950 01  ()書替元利息額１         PIC S9(13) COMP-3.
000960 01  ()書替元契約番号２       PIC  X(9).
000970 01  ()書替元元本残高２       PIC S9(13) COMP-3.
000980 01  ()書替元利息額２         PIC S9(13) COMP-3.
000990 01  ()書替元契約番号３       PIC  X(9).
001000 01  ()書替元元本残高３       PIC S9(13) COMP-3.
001010 01  ()書替元利息額３         PIC S9(13) COMP-3.
001020 01  ()書替元契約番号４       PIC  X(9).
001030 01  ()書替元元本残高４       PIC S9(13) COMP-3.
001040 01  ()書替元利息額４         PIC S9(13) COMP-3.
001050 01  ()書替元契約番号５       PIC  X(9).
001060 01  ()書替元元本残高５       PIC S9(13) COMP-3.
001070 01  ()書替元利息額５         PIC S9(13) COMP-3.
001080 01  ()決済日                 PIC  X(8).
001090 01  ()決済時元本残高         PIC S9(13) COMP-3.
001100 01  ()決済時利息額           PIC S9(13) COMP-3.
001110 01  ()戻し利息額             PIC S9(13) COMP-3.
001120 01  ()戻し利率               PIC S9(2)V9(8) COMP-3.
001130 01  ()戻し日数               PIC S9(4) COMP-3.
001140 01  ()戻し利息相殺コード     PIC  X(1).
001150 01  ()返済手数料             PIC S9(13) COMP-3.
001160 01  ()返済手数料消費税等額   PIC S9(13) COMP-3.
001170 01  ()稟議書発行区分         PIC  X(1).
001180 01  ()契約書発行区分         PIC  X(1).
001190 01  ()登録日                 PIC  X(8).
001200 01  ()登録時刻               PIC  X(6).
001210 01  ()登録担当者コード       PIC  X(4).
001220 01  ()更新日                 PIC  X(8).
001230 01  ()更新時刻               PIC  X(6).
001240 01  ()更新担当者コード       PIC  X(4).
