000010************************************************
000020* (LEA_KIHON)
000030************************************************
000040 01  ()KEY                 PIC  X(1).
000050 01  ()計算方式               PIC  X(1).
000060 01  ()リース期間             PIC S9(3) COMP-3.
000070 01  ()請求サイクル           PIC S9(2) COMP-3.
000080 01  ()支払回数               PIC S9(3) COMP-3.
000090 01  ()前受月数               PIC S9(2) COMP-3.
000100 01  ()据置期間               PIC S9(2)V9(2) COMP-3.
000110 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000120 01  ()月額平均保守料         PIC S9(13) COMP-3.
000130 01  ()初期費用               PIC S9(13) COMP-3.
000140 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000150 01  ()消費税徴収区分         PIC  X(1).
000160 01  ()リース料               PIC S9(13) COMP-3.
000170 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000180 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000190 01  ()粗利益                 PIC S9(13) COMP-3.
000200 01  ()契約金額               PIC S9(13) COMP-3.
000210 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000220 01  ()基本リース料           PIC S9(13) COMP-3.
000230 01  ()月額固定資産税計       PIC S9(13) COMP-3.
000240 01  ()月額動総保険料計       PIC S9(13) COMP-3.
000250 01  ()月額前受メリット       PIC S9(13) COMP-3.
000260 01  ()月額繰延メリット計     PIC S9(13) COMP-3.
000270 01  ()実質リース料ＰＶ       PIC S9(13) COMP-3.
000280 01  ()残価ＰＶ               PIC S9(13) COMP-3.
000290 01  ()物件数                 PIC S9(3) COMP-3.
000300 01  ()繰延数                 PIC S9(2) COMP-3.
000310 01  ()登録日                 PIC  X(8).
000320 01  ()登録時刻               PIC  X(6).
000330 01  ()登録担当者コード       PIC  X(4).
000340 01  ()更新日                 PIC  X(8).
000350 01  ()更新時刻               PIC  X(6).
000360 01  ()更新担当者コード       PIC  X(4).
