000010************************************************
000020* (MAN_HOSHU)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()勘定処理コード         PIC  X(2).
000070 01  ()処理日                 PIC  X(8).
000080 01  ()請求開始日             PIC  X(8).
000090 01  ()請求期間               PIC S9(3) COMP-3.
000100 01  ()請求金額合計           PIC S9(13) COMP-3.
000110 01  ()請求先コード           PIC  X(8).
000120 01  ()回収方式１             PIC  X(1).
000130 01  ()回収方式２             PIC  X(1).
000140 01  ()請求サイクル           PIC S9(2) COMP-3.
000150 01  ()支払回数               PIC S9(3) COMP-3.
000160 01  ()ＢＥＧＩＮ回数         PIC  X(1).
000170 01  ()計算方式               PIC  X(1).
000180 01  ()銀行コード             PIC  X(7).
000190 01  ()口座番号               PIC  X(7).
000200 01  ()預金種類               PIC  X(1).
000210 01  ()入金日                 PIC  X(2).
000220 01  ()第１回入金日           PIC  X(8).
000230 01  ()再リースコード         PIC  X(1).
000240 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000250 01  ()手数料請求名称         PIC  N(15).
000260 01  ()登録日                 PIC  X(8).
000270 01  ()登録時刻               PIC  X(6).
000280 01  ()登録担当者コード       PIC  X(4).
000290 01  ()更新日                 PIC  X(8).
000300 01  ()更新時刻               PIC  X(6).
000310 01  ()更新担当者コード       PIC  X(4).
