000010************************************************
000020* (MAN_WK_03_1)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()契約番号               PIC  X(9).
000060 01  ()物件ＮＯ               PIC  X(3).
000070 01  ()計算フラグ             PIC S9(1) COMP-3.
