000010************************************************
000020* (MAN_IKOU)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()物件名_漢字           PIC  N(20).
000070 01  ()設置場所名_漢字       PIC  N(20).
000080 01  ()設置場所住所           PIC  N(50).
000090 01  ()資産処分コード         PIC  X(1).
000100 01  ()満了処理日             PIC  X(8).
000110 01  ()売却物件金額           PIC S9(13) COMP-3.
000120 01  ()売却数量               PIC S9(4) COMP-3.
000130 01  ()売却引渡先区分         PIC  X(1).
000140 01  ()売却引渡先名_漢字     PIC  N(30).
000150 01  ()売却引渡先名_カナ     PIC  N(15).
000160 01  ()売却金額入金先コード   PIC  X(8).
000170 01  ()売却金額               PIC S9(13) COMP-3.
000180 01  ()売却税率               PIC S9(2)V9(1) COMP-3.
000190 01  ()売却委託手数料         PIC S9(13) COMP-3.
000200 01  ()売却金額入金予定日     PIC  X(8).
000210 01  ()受渡期限               PIC  N(30).
000220 01  ()支払条件               PIC  N(30).
000230 01  ()廃棄物件金額           PIC S9(13) COMP-3.
000240 01  ()廃棄数量               PIC S9(4) COMP-3.
000250 01  ()廃棄引渡先区分         PIC  X(1).
000260 01  ()廃棄引渡先名_漢字     PIC  N(30).
000270 01  ()廃棄引渡先名_カナ     PIC  N(15).
000280 01  ()引取費用               PIC S9(13) COMP-3.
000290 01  ()再リース処理日         PIC  X(8).
000300 01  ()再リース物件金額       PIC S9(13) COMP-3.
000310 01  ()再リース数量           PIC S9(4) COMP-3.
000320 01  ()再リース開始日         PIC  X(8).
000330 01  ()再リース期間           PIC S9(3) COMP-3.
000340 01  ()再リース料_請求金額   PIC S9(13) COMP-3.
000350 01  ()再リース取扱手数料     PIC S9(13) COMP-3.
000360 01  ()請求先コード           PIC  X(8).
000370 01  ()回収方式１             PIC  X(1).
000380 01  ()回収方式２             PIC  X(1).
000390 01  ()請求サイクル           PIC S9(2) COMP-3.
000400 01  ()支払回数               PIC S9(3) COMP-3.
000410 01  ()ＢＥＧＩＮ回数         PIC  X(1).
000420 01  ()計算方式               PIC  X(1).
000430 01  ()銀行コード             PIC  X(7).
000440 01  ()口座番号               PIC  X(7).
000450 01  ()預金種類               PIC  X(1).
000460 01  ()入金日                 PIC S9(2) COMP-3.
000470 01  ()第１回リース料入金日   PIC  X(8).
000480 01  ()再リースコード_新     PIC  X(1).
000490 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000500 01  ()再リース付保率_新     PIC S9(2) COMP-3.
000510 01  ()保守契約区分           PIC  X(1).
000520 01  ()残価額_新             PIC S9(13) COMP-3.
000530 01  ()登録日                 PIC  X(8).
000540 01  ()登録時刻               PIC  X(6).
000550 01  ()登録担当者コード       PIC  X(4).
000560 01  ()更新日                 PIC  X(8).
000570 01  ()更新時刻               PIC  X(6).
000580 01  ()更新担当者コード       PIC  X(4).
