000010************************************************
000020* (MAN_PATAN)
000030************************************************
000040 01  ()ユーザーコード         PIC  X(8).
000050 01  ()ユーザー名_漢字       PIC  N(30).
000060 01  ()ユーザー名_カナ       PIC  N(25).
000070 01  ()引渡区分               PIC  X(1).
000080 01  ()売却金額入金先コード   PIC  X(8).
000090 01  ()引渡先名_漢字         PIC  N(30).
000100 01  ()引渡先名_カナ         PIC  N(25).
000110 01  ()売却委託手数料割合     PIC S9(2)V9(2) COMP-3.
000120 01  ()売却代金入金予定日プラス月数 PIC S9(2) COMP-3.
000130 01  ()売却代金入金予定日日   PIC  X(2).
000140 01  ()受渡期限               PIC  N(15).
000150 01  ()支払条件               PIC  N(20).
000160 01  ()再リース料計算率       PIC S9(4) COMP-3.
000170 01  ()再リース料計算単位     PIC  X(1).
000180 01  ()再リース料端数処理コード PIC  X(1).
000190 01  ()支払サイクル           PIC S9(2) COMP-3.
000200 01  ()支払回数               PIC S9(3) COMP-3.
000210 01  ()ＢＥＧＩＮ回数         PIC S9(1) COMP-3.
000220 01  ()再リース料入金日プラス月数 PIC S9(2) COMP-3.
000230 01  ()再リース料入金日日     PIC  X(2).
000240 01  ()入金基準日             PIC  X(2).
000250 01  ()回収方式_１           PIC  X(1).
000260 01  ()回収方式_２           PIC  X(1).
000270 01  ()再リース取扱手数料割合 PIC S9(2)V9(2) COMP-3.
000280 01  ()請求書送付先住所       PIC  N(50).
000290 01  ()請求書送付先会社名     PIC  N(30).
000300 01  ()請求先コード_１       PIC  X(8).
000310 01  ()請求先コード_２       PIC  X(8).
000320 01  ()請求先コード_３       PIC  X(8).
000330 01  ()請求先コード_４       PIC  X(8).
000340 01  ()請求先コード_５       PIC  X(8).
000350 01  ()請求先コード_６       PIC  X(8).
000360 01  ()請求先コード_７       PIC  X(8).
000370 01  ()請求先コード_８       PIC  X(8).
000380 01  ()請求先コード_９       PIC  X(8).
000390 01  ()請求先コード_１０     PIC  X(8).
000400 01  ()請求先コード_１１     PIC  X(8).
000410 01  ()請求先コード_１２     PIC  X(8).
000420 01  ()請求先コード_１３     PIC  X(8).
000430 01  ()請求先コード_１４     PIC  X(8).
000440 01  ()請求先コード_１５     PIC  X(8).
000450 01  ()帳票出力年月日プラス月数 PIC S9(2) COMP-3.
000460 01  ()帳票出力年月日日       PIC  X(2).
000470 01  ()登録日                 PIC  X(8).
000480 01  ()登録時刻               PIC  X(6).
000490 01  ()登録担当者コード       PIC  X(4).
000500 01  ()更新日                 PIC  X(8).
000510 01  ()更新時刻               PIC  X(6).
000520 01  ()更新担当者コード       PIC  X(4).
000530 01  ()引渡先区分_廃棄       PIC  X(1).
