000010************************************************
000020* (MAN_WK_APL_MATCH)
000030************************************************
000040 01  ()処理日                 PIC  X(8).
000050 01  ()ＮＯ                   PIC  X(4).
000060 01  ()契約番号               PIC  X(9).
000070 01  ()物件ＮＯ               PIC  X(3).
000080 01  ()アポロ契約ＮＯ         PIC  X(7).
000090 01  ()アポロ契約ＮＯ＿枝番   PIC  X(3).
000100 01  ()検収日                 PIC  X(8).
000110 01  ()満了日                 PIC  X(8).
000120 01  ()期間                   PIC S9(3) COMP-3.
000130 01  ()リース料＿年額         PIC S9(13) COMP-3.
000140 01  ()設置場所名             PIC  N(10).
000150 01  ()物件名                 PIC  N(10).
000160 01  ()数量                   PIC S9(4) COMP-3.
000170 01  ()物件金額               PIC S9(13) COMP-3.
000180 01  ()処理                   PIC  X(1).
000190 01  ()廃棄物件金額           PIC S9(13) COMP-3.
000200 01  ()廃棄数量               PIC S9(4) COMP-3.
000210 01  ()再リース物件金額       PIC S9(13) COMP-3.
000220 01  ()再リース数量           PIC S9(4) COMP-3.
000230 01  ()再リース満了日         PIC  X(8).
000240 01  ()再リース期間           PIC S9(3) COMP-3.
000250 01  ()再リース料＿年額       PIC S9(13) COMP-3.
000260 01  ()消費税額               PIC S9(13) COMP-3.
000270 01  ()エラー区分             PIC  X(1).
000280 01  ()エラーメッセージ       PIC  N(15).
000290 01  ()更新日                 PIC  X(8).
000300 01  ()更新時刻               PIC  X(6).
000310 01  ()更新担当者コード       PIC  X(4).
