000010************************************************
000020* (MAN_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()担当者コード           PIC  X(4).
000070 01  ()ユーザーコード         PIC  X(8).
000080 01  ()名寄せコード           PIC  X(8).
000090 01  ()契約日                 PIC  X(8).
000100 01  ()検収日                 PIC  X(8).
000110 01  ()残価回収日             PIC  X(8).
000120 01  ()契約金額               PIC S9(13) COMP-3.
000130 01  ()残価額合計             PIC S9(13) COMP-3.
000140 01  ()請求先コード           PIC  X(8).
000150 01  ()回収方式               PIC  X(1).
000160 01  ()請求サイクル           PIC S9(2) COMP-3.
000170 01  ()入金日                 PIC  X(2).
000180 01  ()銀行コード             PIC  X(7).
000190 01  ()口座番号               PIC  X(7).
000200 01  ()預金種類               PIC  X(1).
000210 01  ()債務協調コード         PIC  X(2).
000220 01  ()継続リース処理日       PIC  X(8).
000230 01  ()リース開始日_新       PIC  X(8).
000240 01  ()リース期間_新         PIC S9(3) COMP-3.
000250 01  ()勘定処理コード         PIC  X(2).
000260 01  ()リース料               PIC S9(13) COMP-3.
000270 01  ()前受リース料           PIC S9(13) COMP-3.
000280 01  ()前受リース料入金日     PIC  X(8).
000290 01  ()契約金額_新           PIC S9(13) COMP-3.
000300 01  ()固定資産税             PIC S9(13) COMP-3.
000310 01  ()保険料                 PIC S9(13) COMP-3.
000320 01  ()保守料                 PIC S9(13) COMP-3.
000330 01  ()その他１               PIC S9(13) COMP-3.
000340 01  ()その他２               PIC S9(13) COMP-3.
000350 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000360 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000370 01  ()初期費用               PIC S9(13) COMP-3.
000380 01  ()請求先コード_新       PIC  X(8).
000390 01  ()回収方式１             PIC  X(1).
000400 01  ()回収方式２             PIC  X(1).
000410 01  ()請求サイクル_新       PIC S9(2) COMP-3.
000420 01  ()支払回数               PIC S9(3) COMP-3.
000430 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000440 01  ()ＢＥＧＩＮ回数         PIC  X(1).
000450 01  ()計算方式               PIC  X(1).
000460 01  ()銀行コード_新         PIC  X(7).
000470 01  ()口座番号_新           PIC  X(7).
000480 01  ()預金種類_新           PIC  X(1).
000490 01  ()入金日_新             PIC S9(2) COMP-3.
000500 01  ()残価回収日_新         PIC  X(8).
000510 01  ()第１回リース料入金日   PIC  X(8).
000520 01  ()再リースコード_新     PIC  X(1).
000530 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000540 01  ()消費税徴収区分         PIC  X(1).
000550 01  ()登録日                 PIC  X(8).
000560 01  ()登録時刻               PIC  X(6).
000570 01  ()登録担当者コード       PIC  X(4).
000580 01  ()更新日                 PIC  X(8).
000590 01  ()更新時刻               PIC  X(6).
000600 01  ()更新担当者コード       PIC  X(4).
000610 01  ()会社部門略称_カナ     PIC  N(15).
000620 01  ()再リース料計算率_分子 PIC S9(3) COMP-3.
000630 01  ()再リース料計算率_分母 PIC S9(4) COMP-3.
000640 01  ()再リース料計算単位     PIC  X(1).
000650 01  ()自動更新適用除外区分   PIC  X(1).
000660 01  ()請求書発行様式         PIC  X(1).
000670 01  ()請求書発行月区分       PIC  X(1).
000680 01  ()計算方式_元           PIC S9(1) COMP-3.
000690 01  ()支払回数_元           PIC S9(3) COMP-3.
000700 01  ()単年度契約             PIC  X(2).
