000010************************************************
000020* (MFS_KOBMOD)
000030************************************************
000040 01  ()JOBTYP           PIC  X(4).
000050 01  ()REGTIM           PIC  X(6).
000060 01  ()PAYNUM           PIC  X(8).
000070 01  ()CSTNUM           PIC  X(12).
000080 01  ()PAYDAY           PIC  X(2).
000090 01  ()BNKCOD           PIC  X(4).
000100 01  ()BRCCOD           PIC  X(3).
000110 01  ()CSTNAM           PIC  X(30).
000120 01  ()DEPKND           PIC  X(1).
000130 01  ()DEPNUM           PIC  X(7).
000140 01  ()TRNAMT           PIC S9(10) COMP-3.
000150 01  ()PAYDAY_O       PIC  X(2).
000160 01  ()BNKCOD_O       PIC  X(4).
000170 01  ()BRCCOD_O       PIC  X(3).
000180 01  ()CSTNAM_O       PIC  X(30).
000190 01  ()DEPKND_O       PIC  X(1).
000200 01  ()DEPNUM_O       PIC  X(7).
000210 01  ()TRNAMT_O       PIC S9(10) COMP-3.
000220 01  ()PAYDAY_M       PIC  X(1).
000230 01  ()BNKCOD_M       PIC  X(1).
000240 01  ()BRCCOD_M       PIC  X(1).
000250 01  ()CSTNAM_M       PIC  X(1).
000260 01  ()DEPKND_M       PIC  X(1).
000270 01  ()DEPNUM_M       PIC  X(1).
000280 01  ()TRNAMT_M       PIC  X(1).
