000010************************************************
000020* (MFS_WK_ERR)
000030************************************************
000040 01  ()銀行コード             PIC  X(4).
000050 01  ()支店コード             PIC  X(3).
000060 01  ()預金種類               PIC  X(1).
000070 01  ()口座番号               PIC  X(7).
000080 01  ()預金者名               PIC  X(30).
000090 01  ()請求金額               PIC S9(10) COMP-3.
000100 01  ()請求先コード           PIC  X(8).
000110 01  ()PAYDAY           PIC  X(4).
