000010************************************************
000020* (MST_SINYO_KAPPU)
000030************************************************
000040 01  ()リース_割賦区分       PIC  X(1).
000050 01  ()保険期間月数           PIC  X(3).
000060 01  ()適用日                 PIC  X(8).
000070 01  ()保険料率＿Ａ           PIC S9(2)V9(8) COMP-3.
000080 01  ()保険料率＿Ｂ           PIC S9(2)V9(8) COMP-3.
000090 01  ()保険料率＿Ｃ           PIC S9(2)V9(8) COMP-3.
000100 01  ()保険料率＿Ｄ           PIC S9(2)V9(8) COMP-3.
000110 01  ()保険料率＿予           PIC S9(2)V9(8) COMP-3.
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
