000010************************************************
000020* (MST_GINKO)
000030************************************************
000040 01  ()銀行短縮コード         PIC  X(2).
000050 01  ()銀行コード             PIC  X(4).
000060 01  ()銀行名                 PIC  N(15).
000070 01  ()支店コード             PIC  X(3).
000080 01  ()支店名                 PIC  N(15).
000090 01  ()銀行支店名             PIC  N(15).
000100 01  ()預金種類               PIC  X(1).
000110 01  ()口座番号               PIC  X(7).
000120 01  ()入金日                 PIC  X(2).
000130 01  ()回収方式               PIC  X(1).
000140 01  ()適用日                 PIC  X(8).
000150 01  ()登録日                 PIC  X(8).
000160 01  ()登録時刻               PIC  X(6).
000170 01  ()登録担当者コード       PIC  X(4).
000180 01  ()更新日                 PIC  X(8).
000190 01  ()更新時刻               PIC  X(6).
000200 01  ()更新担当者コード       PIC  X(4).
000210 01  ()入金日_２             PIC  X(2).
000220 01  ()入金日_３             PIC  X(2).
000230 01  ()入金日_４             PIC  X(2).
000240 01  ()入金日_５             PIC  X(2).
000250 01  ()入金日_６             PIC  X(2).
