000010************************************************
000020* (MST_SISAN)
000030************************************************
000040 01  ()資産コード             PIC  X(7).
000050 01  ()資産名                 PIC  N(15).
000060 01  ()資産名_略称           PIC  N(5).
000070 01  ()耐用年数_年数         PIC S9(3) COMP-3.
000080 01  ()適用日_１             PIC  X(8).
000090 01  ()法定減価償却率_１     PIC S9(2)V9(8) COMP-3.
000100 01  ()適用日_２             PIC  X(8).
000110 01  ()法定減価償却率_２     PIC S9(2)V9(8) COMP-3.
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
