000010************************************************
000020* (MST_DOSO)
000030************************************************
000040 01  ()動総保険コード         PIC  X(4).
000050 01  ()適用日_１             PIC  X(8).
000060 01  ()動総保険料率_１       PIC S9(2)V9(8) COMP-3.
000070 01  ()適用日_２             PIC  X(8).
000080 01  ()動総保険料率_２       PIC S9(2)V9(8) COMP-3.
000090 01  ()適用日_３             PIC  X(8).
000100 01  ()動総保険料率_３       PIC S9(2)V9(8) COMP-3.
000110 01  ()適用日_４             PIC  X(8).
000120 01  ()動総保険料率_４       PIC S9(2)V9(8) COMP-3.
000130 01  ()適用日_５             PIC  X(8).
000140 01  ()動総保険料率_５       PIC S9(2)V9(8) COMP-3.
000150 01  ()登録日                 PIC  X(8).
000160 01  ()登録時刻               PIC  X(6).
000170 01  ()登録担当者コード       PIC  X(4).
000180 01  ()更新日                 PIC  X(8).
000190 01  ()更新時刻               PIC  X(6).
000200 01  ()更新担当者コード       PIC  X(4).
000210 01  ()取引先区分             PIC  X(1).
000220 01  ()保険会社名             PIC  N(20).
000230 01  ()物件名                 PIC  N(30).
