000010************************************************
000020* (NTL_CUSTOMER)
000030************************************************
000040 01  ()レコード種別           PIC  X(1).
000050 01  ()リース会社ＩＤ         PIC  X(6).
000060 01  ()顧客ＩＤ               PIC  X(12).
000070 01  ()顧客名                 PIC  X(96).
000080 01  ()住所                   PIC  X(120).
000090 01  ()電話番号               PIC  X(15).
000100 01  ()作成ＩＤ               PIC  X(10).
000110 01  ()作成日                 PIC  X(10).
000120 01  ()更新ＩＤ               PIC  X(10).
000130 01  ()更新日                 PIC  X(10).
