000010************************************************
000020* (NTL_SYAIN_CSV)
000030************************************************
000040 01  ()レコード種別           PIC  N(1.5).
000050 01  ()リース会社ＩＤ         PIC  N(4).
000060 01  ()社員ＩＤ               PIC  N(5).
000070 01  ()支店名称               PIC  N(11).
000080 01  ()部名称                 PIC  N(13).
000090 01  ()課名称                 PIC  N(13).
000100 01  ()名前                   PIC  N(18).
000110 01  ()メールアドレス         PIC  N(26).
000120 01  ()電話番号               PIC  N(8.5).
000130 01  ()作成ＩＤ               PIC  N(6).
000140 01  ()作成日                 PIC  N(6).
000150 01  ()更新ＩＤ               PIC  N(6).
000160 01  ()更新日                 PIC  N(6).
