000010************************************************
000020* (NYU_NAMEMODL)
000030************************************************
000040 01  ()JOBTYP           PIC  X(4).
000050 01  ()BNKCOD           PIC  X(4).
000060 01  ()PAYNUM           PIC  X(8).
000070 01  ()CSTNAM           PIC  X(30).
000080 01  ()BNKCOD_O       PIC  X(4).
000090 01  ()PAYNUM_O       PIC  X(8).
000100 01  ()CSTNAM_O       PIC  X(30).
000110 01  ()REGTIM           PIC  X(6).
000120 01  ()BNKCOD_M       PIC  X(1).
000130 01  ()PAYNUM_M       PIC  X(1).
000140 01  ()CSTNAM_M       PIC  X(1).
