000010************************************************
000020* (NYU_AUTOHEAD)
000030************************************************
000040 01  ()DATTYP           PIC  X(1).
000050 01  ()TRNCOD           PIC  X(2).
000060 01  ()CODTYP           PIC  X(1).
000070 01  ()CONSIG           PIC  X(10).
000080 01  ()CONNAM           PIC  X(40).
000090 01  ()TRNDAY           PIC  X(4).
000100 01  ()BNKCOD           PIC  X(4).
000110 01  ()BNKNAM           PIC  X(15).
000120 01  ()BRCCOD           PIC  X(3).
000130 01  ()BRCNAM           PIC  X(15).
000140 01  ()DEPKND           PIC  X(1).
000150 01  ()DEPNUM           PIC  X(7).
000160 01  ()DUMMY1           PIC  X(17).
