000010************************************************
000020* (OBA_PRTWRK)
000030************************************************
000040 01  ()CNTNUM           PIC  X(9).
000050 01  ()TRNTYP           PIC  X(1).
000060 01  ()DIVCOD           PIC  X(4).
000070 01  ()DIVNAM           PIC  N(10).
000080 01  ()USRCOD           PIC  X(8).
000090 01  ()USRNAM           PIC  N(30).
000100 01  ()OBJNAM           PIC  N(20).
000110 01  ()TRNDAY           PIC  X(8).
000120 01  ()BGNDAY           PIC  X(8).
000130 01  ()BASDAY           PIC  X(8).
000140 01  ()CRERNK           PIC  X(4).
000150 01  ()CNTAMT           PIC S9(13) COMP-3.
000160 01  ()RCVAMT           PIC S9(13) COMP-3.
000170 01  ()BALAMT           PIC S9(13) COMP-3.
000180 01  ()REGDAY           PIC  X(8).
000190 01  ()REGTIM           PIC  X(6).
000200 01  ()REGPSN           PIC  X(4).
000210 01  ()MODDAY           PIC  X(8).
000220 01  ()MODTIM           PIC  X(6).
000230 01  ()MODPSN           PIC  X(4).
000240 01  ()SRTWRK           PIC  X(9).
