000010************************************************
000020* (OBA_EXCWRK)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()貸借コード             PIC  X(1).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()事業所名               PIC  N(10).
000080 01  ()ユーザーコード         PIC  X(8).
000090 01  ()ユーザー名             PIC  N(30).
000100 01  ()備考                   PIC  N(20).
000110 01  ()取引日                 PIC  X(8).
000120 01  ()開始日                 PIC  X(8).
000130 01  ()基準日                 PIC  X(8).
000140 01  ()債務者格付             PIC  X(4).
000150 01  ()債権金額               PIC S9(13) COMP-3.
000160 01  ()回収金額               PIC S9(13) COMP-3.
000170 01  ()債権残高               PIC S9(13) COMP-3.
000180 01  ()登録日                 PIC  X(8).
000190 01  ()登録時刻               PIC  X(6).
000200 01  ()登録者                 PIC  X(4).
000210 01  ()変更日                 PIC  X(8).
000220 01  ()変更時刻               PIC  X(6).
000230 01  ()変更者                 PIC  X(4).
