000010************************************************
000020* (PAY_LBLPRT)
000030************************************************
000040 01  ()CTLNUM           PIC  X(9).
000050 01  ()DATNUM           PIC  X(4).
000060 01  ()BNKCOD           PIC  X(4).
000070 01  ()CNTNUM           PIC  X(9).
000080 01  ()ZIPLFT           PIC  X(7).
000090 01  ()ADRLF1           PIC  X(42).
000100 01  ()ADRLF2           PIC  X(42).
000110 01  ()ADRLF3           PIC  X(42).
000120 01  ()NAMLFT           PIC  X(42).
000130 01  ()DIVLFT           PIC  X(42).
000140 01  ()TYPLFT           PIC  X(1).
000150 01  ()ZIPRGT           PIC  X(7).
000160 01  ()ADRRG1           PIC  X(42).
000170 01  ()ADRRG2           PIC  X(42).
000180 01  ()ADRRG3           PIC  X(42).
000190 01  ()NAMRGT           PIC  X(42).
000200 01  ()DIVRGT           PIC  X(42).
000210 01  ()TYPRGT           PIC  X(1).
