000010************************************************
000020* (PAY_PRTWRK)
000030************************************************
000040 01  ()OFCCOD           PIC  X(4).
000050 01  ()LEVEL1           PIC  X(2).
000060 01  ()LEVEL2           PIC  X(2).
000070 01  ()PAYAMT           PIC S9(11) COMP-3.
000080 01  ()CHGAMT           PIC S9(5) COMP-3.
000090 01  ()TAXAMT           PIC S9(5) COMP-3.
000100 01  ()CHGTOT           PIC S9(5) COMP-3.
000110 01  ()PAYCNT           PIC S9(5) COMP-3.
