000010************************************************
000020* (PAY_CNVMOD)
000030************************************************
000040 01  ()JOBTYP           PIC  X(4).
000050 01  ()REGTIM           PIC  X(6).
000060 01  ()BNKCOD           PIC  X(4).
000070 01  ()BRCCOD           PIC  X(3).
000080 01  ()DEPKND           PIC  X(1).
000090 01  ()DEPNUM           PIC  X(7).
000100 01  ()CSTNAM           PIC  X(30).
000110 01  ()CSTNAM_O       PIC  X(30).
