000010************************************************
000020* (PAY_TAXADD)
000030************************************************
000040 01  ()DIVCOD           PIC  X(4).
000050 01  ()DOCTYP           PIC  X(1).
000060 01  ()TAXTYP           PIC S9(6) COMP-3.
000070 01  ()TAXCNT           PIC S9(4) COMP-3.
000080 01  ()TAXAMT           PIC S9(12) COMP-3.
000090 01  ()BILCNT           PIC S9(4) COMP-3.
000100 01  ()BILAMT           PIC S9(12) COMP-3.
