000010************************************************
000020* (PAY_DATMOD)
000030************************************************
000040 01  ()JOBTYP           PIC  X(4).
000050 01  ()REGTIM           PIC  X(6).
000060 01  ()OPEDAY           PIC  X(4).
000070 01  ()PAYDAY           PIC  X(4).
000080 01  ()TRNNUM           PIC  X(4).
000090 01  ()OFCCOD           PIC  X(4).
000100 01  ()USRDEP           PIC  X(8).
000110 01  ()BNKCOD           PIC  X(4).
000120 01  ()BNKNAM           PIC  X(15).
000130 01  ()BRCCOD           PIC  X(3).
000140 01  ()BRCNAM           PIC  X(15).
000150 01  ()DEPKND           PIC  X(1).
000160 01  ()DEPNUM           PIC  X(7).
000170 01  ()CSTNAM           PIC  X(30).
000180 01  ()TRNAMT           PIC S9(10) COMP-3.
000190 01  ()CHGAMT           PIC S9(5) COMP-3.
000200 01  ()BNKCOD_O       PIC  X(4).
000210 01  ()BNKNAM_O       PIC  X(15).
000220 01  ()BRCCOD_O       PIC  X(3).
000230 01  ()BRCNAM_O       PIC  X(15).
000240 01  ()DEPKND_O       PIC  X(1).
000250 01  ()DEPNUM_O       PIC  X(7).
000260 01  ()CSTNAM_O       PIC  X(30).
000270 01  ()TRNAMT_O       PIC S9(10) COMP-3.
000280 01  ()CHGAMT_O       PIC S9(5) COMP-3.
000290 01  ()BNKCOD_M       PIC  X(1).
000300 01  ()BNKNAM_M       PIC  X(1).
000310 01  ()BRCCOD_M       PIC  X(1).
000320 01  ()BRCNAM_M       PIC  X(1).
000330 01  ()DEPKND_M       PIC  X(1).
000340 01  ()DEPNUM_M       PIC  X(1).
000350 01  ()CSTNAM_M       PIC  X(1).
000360 01  ()TRNAMT_M       PIC  X(1).
000370 01  ()CHGAMT_M       PIC  X(1).
