000010************************************************
000020* (POK_KEIYAKU)
000030************************************************
000040 01  ()管理№                 PIC  X(9).
000050 01  ()機種コード             PIC  X(15).
000060 01  ()機番                   PIC  X(12).
000070 01  ()初期発注ＮＯ           PIC  X(11).
000080 01  ()機械代金               PIC S9(13) COMP-3.
000090 01  ()リース支払開始年月     PIC  X(6).
000100 01  ()リース会社コード       PIC  X(1).
000110 01  ()月額リース料           PIC S9(13) COMP-3.
000120 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000130 01  ()リース支払回数         PIC S9(3) COMP-3.
000140 01  ()リース解約年月         PIC  X(6).
000150 01  ()設置先名称             PIC  N(20).
000160 01  ()設置先行政区分１       PIC  X(2).
000170 01  ()設置先行政区分２       PIC  X(3).
000180 01  ()設置先都道府県名       PIC  N(4).
000190 01  ()設置先市区町村名       PIC  N(11).
000200 01  ()設置先町域名           PIC  N(37).
000210 01  ()設置先補助住所         PIC  N(30).
000220 01  ()設置先電話番号         PIC  N(6).
000230 01  ()機械分類名称           PIC  N(8).
000240 01  ()メーカーコード         PIC  X(2).
000250 01  ()ビルバリ有無名称       PIC  N(10).
000260 01  ()課＿出張所コード       PIC  X(5).
000270 01  ()課＿出張所略名         PIC  N(12).
000280 01  ()設置契約先コード＿会社 PIC  X(5).
000290 01  ()設置契約先コード＿事業所 PIC  X(5).
000300 01  ()契約先略称             PIC  N(12).
