000010************************************************
000020* (POK_SOSIN)
000030************************************************
000040 01  ()ÉfÅ[É^                 PIC  N(450).
