000010************************************************
000020* (SFC_KIHON)
000030************************************************
000040 01  ()シャープ契約番号       PIC  X(12).
000050 01  ()契約番号               PIC  X(9).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()包括エリアコード       PIC  X(1).
000080 01  ()包括エリア名           PIC  N(30).
000090 01  ()エリアコード           PIC  X(2).
000100 01  ()支店コード             PIC  X(2).
000110 01  ()ユーザーコード         PIC  X(8).
000120 01  ()顧客コード             PIC  X(6).
000130 01  ()取引先名               PIC  N(30).
000140 01  ()担当者コード           PIC  X(4).
000150 01  ()稟議ＮＯ               PIC  X(10).
000160 01  ()契約日                 PIC  X(8).
000170 01  ()検収日                 PIC  X(8).
000180 01  ()第１回入金日           PIC  X(8).
000190 01  ()入金基準日             PIC  X(2).
000200 01  ()リース期間             PIC S9(3) COMP-3.
000210 01  ()前受月数               PIC S9(2) COMP-3.
000220 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000230 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000240 01  ()リース料               PIC S9(13) COMP-3.
000250 01  ()前受リース料           PIC S9(13) COMP-3.
000260 01  ()転リース提携先コード   PIC  X(2).
000270 01  ()購入金額               PIC S9(13) COMP-3.
000280 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000290 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000300 01  ()契約金額               PIC S9(13) COMP-3.
000310 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000320 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000330 01  ()粗利益                 PIC S9(13) COMP-3.
000340 01  ()契約者名               PIC  X(25).
000350 01  ()契約者住所             PIC  X(50).
000360 01  ()登録日                 PIC  X(8).
000370 01  ()登録時刻               PIC  X(6).
000380 01  ()登録担当者コード       PIC  X(4).
000390 01  ()更新日                 PIC  X(8).
000400 01  ()更新時刻               PIC  X(6).
000410 01  ()更新担当者コード       PIC  X(4).
