000010************************************************
000020* (SFC_WK_YOTEI)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()契約番号               PIC  X(7).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()取引先名               PIC  N(30).
000080 01  ()契約日                 PIC  X(8).
000090 01  ()契約金額               PIC S9(13) COMP-3.
000100 01  ()入金基準日             PIC  X(2).
000110 01  ()支払月                 PIC S9(6) COMP-3.
000120 01  ()リース料               PIC S9(13) COMP-3.
