000010************************************************
000020* (SIN_KEIYAKUSAKI)
000030************************************************
000040 01  ()稟議ＮＯ               PIC  X(10).
000050 01  ()顧客コード             PIC  X(6).
000060 01  ()取引先名漢字           PIC  N(30).
000070 01  ()親会社名               PIC  N(30).
000080 01  ()取引先住所             PIC  N(45).
000090 01  ()業種コード             PIC  X(2).
000100 01  ()業種                   PIC  N(15).
000110 01  ()設立年月日             PIC  X(8).
000120 01  ()資本金                 PIC S9(6) COMP-3.
000130 01  ()上場区分               PIC  X(1).
000140 01  ()大企業コード           PIC  X(1).
000150 01  ()従業員数               PIC S9(6) COMP-3.
000160 01  ()取引開始日             PIC  X(8).
000170 01  ()ＢＴＭ取引区分         PIC  X(1).
000180 01  ()ＢＴＭ担当部店         PIC  N(15).
000190 01  ()直通電話１             PIC  X(15).
000200 01  ()先方担当者名１         PIC  N(7).
000210 01  ()決算年月               PIC  X(6).
000220 01  ()売上高                 PIC S9(13) COMP-3.
000230 01  ()経常利益               PIC S9(13) COMP-3.
000240 01  ()当期利益               PIC S9(13) COMP-3.
000250 01  ()申告所得               PIC S9(13) COMP-3.
000260 01  ()自己資本               PIC S9(13) COMP-3.
000270 01  ()総資産                 PIC S9(13) COMP-3.
000280 01  ()ユーザーコード         PIC  X(8).
000290 01  ()ユーザーリース残高     PIC S9(6) COMP-3.
000300 01  ()ユーザー割賦残高       PIC S9(6) COMP-3.
000310 01  ()ユーザー貸付金他残高   PIC S9(6) COMP-3.
000320 01  ()ユーザー未検収残高     PIC S9(6) COMP-3.
000330 01  ()ユーザー未徴収金       PIC S9(6) COMP-3.
000340 01  ()名寄せコード           PIC  X(8).
000350 01  ()名寄せリース残高       PIC S9(6) COMP-3.
000360 01  ()名寄せ割賦残高         PIC S9(6) COMP-3.
000370 01  ()名寄せ貸付金他残高     PIC S9(6) COMP-3.
000380 01  ()名寄せ未検収残高       PIC S9(6) COMP-3.
000390 01  ()名寄せ未徴収金         PIC S9(6) COMP-3.
000400 01  ()登録日                 PIC  X(8).
000410 01  ()登録時刻               PIC  X(6).
000420 01  ()登録担当者コード       PIC  X(4).
000430 01  ()更新日                 PIC  X(8).
000440 01  ()更新時刻               PIC  X(6).
000450 01  ()更新担当者コード       PIC  X(4).
