000010************************************************
000020* (SKY_PRTTYP)
000030************************************************
000040 01  ()PRTPTN           PIC  X(2).
000050 01  ()PRTNAM           PIC  N(50).
