000010************************************************
000020* (SSF_KEI_SEIKYU)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()請求先コード           PIC  X(8).
000060 01  ()請求先名               PIC  N(30).
000070 01  ()請求先郵便番号         PIC  X(7).
000080 01  ()請求先住所             PIC  N(50).
000090 01  ()請求先電話番号         PIC  N(7.5).
000100 01  ()請求先部門名称         PIC  N(20).
000110 01  ()請求区分１             PIC  X(1).
000120 01  ()請求区分２             PIC  X(1).
000130 01  ()第１回リース料受取り条件 PIC  N(10).
000140 01  ()２回目以降リース料受取り条件 PIC  N(10).
000150 01  ()手形枚数               PIC S9(3) COMP-3.
000160 01  ()入金基準日             PIC  X(2).
000170 01  ()預金種類               PIC  X(1).
000180 01  ()銀行コード             PIC  X(7).
000190 01  ()口座番号               PIC  X(7).
000200 01  ()第１回リース料入金日   PIC  X(8).
000210 01  ()第２回リース料入金日   PIC  X(8).
000220 01  ()前受リース料入金日     PIC  X(8).
000230 01  ()残価回収日             PIC  X(8).
000240 01  ()銀行短縮コード         PIC  X(2).
000250 01  ()登録日                 PIC  X(8).
000260 01  ()登録時刻               PIC  X(6).
000270 01  ()登録担当者コード       PIC  X(4).
000280 01  ()更新日                 PIC  X(8).
000290 01  ()更新時刻               PIC  X(6).
000300 01  ()更新担当者コード       PIC  X(4).
