000010************************************************
000020* (SSF_LPWK_CHOHYO)
000030************************************************
000040 01  ()í[ññî‘çÜ               PIC  N(8).
000050 01  ()òAî‘                   PIC S9(4) COMP-3.
000060 01  ()í†ï[ÇP                 PIC S9(1) COMP-3.
000070 01  ()í†ï[ÇQ                 PIC S9(1) COMP-3.
000080 01  ()í†ï[ÇR                 PIC S9(1) COMP-3.
000090 01  ()í†ï[ÇS                 PIC S9(1) COMP-3.
000100 01  ()í†ï[ÇT                 PIC S9(1) COMP-3.
000110 01  ()í†ï[ÇU                 PIC S9(1) COMP-3.
000120 01  ()í†ï[ÇV                 PIC S9(1) COMP-3.
000130 01  ()í†ï[ÇW                 PIC S9(1) COMP-3.
000140 01  ()í†ï[ÇX                 PIC S9(1) COMP-3.
000150 01  ()í†ï[ÇPÇO               PIC S9(1) COMP-3.
000160 01  ()í†ï[ÇPÇP               PIC S9(1) COMP-3.
000170 01  ()í†ï[ÇPÇQ               PIC S9(1) COMP-3.
000180 01  ()í†ï[ÇPÇR               PIC S9(1) COMP-3.
000190 01  ()í†ï[ÇPÇS               PIC S9(1) COMP-3.
000200 01  ()í†ï[ÇPÇT               PIC S9(1) COMP-3.
000210 01  ()í†ï[ÇPÇU               PIC S9(1) COMP-3.
000220 01  ()í†ï[ÇPÇV               PIC S9(1) COMP-3.
000230 01  ()í†ï[ÇPÇW               PIC S9(1) COMP-3.
000240 01  ()í†ï[ÇPÇX               PIC S9(1) COMP-3.
000250 01  ()í†ï[ÇQÇO               PIC S9(1) COMP-3.
000260 01  ()éxï•äJénì˙             PIC  X(8).
000270 01  ()ëÊÇQâÒñ⁄à»ç~éxï•äJénì˙ PIC  X(8).
