000010************************************************
000020* (SWP_CCYMST)
000030************************************************
000040 01  ()BASDAY           PIC  X(8).
000050 01  ()CCYCOD           PIC  X(3).
000060 01  ()SWIFTC           PIC  X(3).
000070 01  ()CCYNAM           PIC  X(8).
000080 01  ()NATION           PIC  X(20).
000090 01  ()BLWCOL           PIC S9(2) COMP-3.
000100 01  ()CNVUNT           PIC S9(3) COMP-3.
000110 01  ()RATTTS           PIC S9(4)V9(2) COMP-3.
000120 01  ()RATTTB           PIC S9(4)V9(2) COMP-3.
000130 01  ()RATTTM           PIC S9(4)V9(2) COMP-3.
