000010************************************************
000020* 与信(明細)(YOSHINMEISAI)
000030************************************************
000040    03  ()管理与信先コード       PIC  X(8).
000050    03  ()管理与信区分           PIC  X(1).
000060    03  ()自動与信区分           PIC  X(1).
000070    03  ()事故日                 PIC  X(8).
000080    03  ()契約ＮＯ               PIC  X(9).
000090    03  ()勘定コード             PIC  X(2).
000100    03  ()事業所コード           PIC  X(4).
000110    03  ()歯抜けフラグ１         PIC  X(2).
000120    03  ()歯抜けフラグ２         PIC  X(2).
000130    03  ()物件名                 PIC  X(60).
000140    03  ()契約日                 PIC  X(8).
000150    03  ()検収日                 PIC  X(8).
000160    03  ()満了日                 PIC  X(8).
000170    03  ()延滞開始日             PIC  X(8).
000180    03  ()貸付金別口             PIC S9(13).
000190    03  ()非稼動資産             PIC S9(13).
000200    03  ()貯蔵品                 PIC S9(13).
000210    03  ()信用保険付保区分       PIC  X(1).
000220    03  ()信用保険求償           PIC S9(13).
000230    03  ()契約金額               PIC S9(13).
000240    03  ()残価額                 PIC S9(13).
000250    03  ()入金日                 PIC  X(2).
000260    03  ()開始回数               PIC  X(1).
000270    03  ()明細支払回数           PIC  X(3).
000280    03  ()計算方式               PIC  X(1).
000290    03  ()請求サイクル           PIC  X(2).
000300    03  ()月割Ｌ料               PIC S9(13).
000310    03  ()ヤクベン区分           PIC  X(1).
000320    03  ()事故債権残             PIC S9(13).
000330    03  ()事故元本残             PIC S9(13).
000340    03  ()当債権残               PIC S9(13).
000350    03  ()当元本残               PIC S9(13).
000360    03  ()Ｎ当債権残             PIC S9(13).
000370    03  ()Ｎ当元本残             PIC S9(13).
000380    03  ()未収元本               PIC S9(13).
000390    03  ()未収利息               PIC S9(13).
000400    03  ()未徴収金               PIC S9(13).
000410    03  ()Ｂ未徴収金             PIC S9(13).
000420    03  ()売却金額               PIC S9(13).
000430    03  ()更新日付               PIC  X(8).
000440    03  ()固定利率               PIC S9(3)V9(8).
000450    03  ()金利変動区分           PIC  X(1).
000460    03  ()スプレッド             PIC S9(3)V9(8).
000470    03  ()連動金利区分           PIC  X(1).
