//SP003W1   JOB ACCT#,
//             SP003,         **JOB STATEMENT GENERA
//             NOTIFY=SP003,
//             MSGLEVEL=(1,1)
//SCAN   EXEC  PGM=WRITE1
//STEPLIB DD DSN=SP003.TEST.LOAD,DISP=SHR
//CUSTMAST DD DSN=SP003.CUSTMAST.TEXT,DISP=SHR
//CUSTRPT  DD DSN=SP003.TEST.OUT1,DISP=OLD
//
//
//CUSTRPT  DD DSN=SP003.TEST.OUT1,DISP=(NEW,CATLG,DELETE),
// SPACE=(TRK,(1,1)),DCB=(RECFM=FB,BLKSIZE=1330,LRECL=133)
