000100 IDENTIFICATION DIVISION.                                         00010000
000200*                                                                 00020000
000300 PROGRAM-ID. RATELKUP.                                            00030000
000400*                                                                 00040000
000500 ENVIRONMENT DIVISION.                                            00050000
000600*                                                                 00060000
000700 INPUT-OUTPUT SECTION.                                            00070000
000800*                                                                 00080000
000900 FILE-CONTROL.                                                    00090000
001000*                                                                 00100000
001100      SELECT TBLFILE ASSIGN TO UT-S-TBLFILE.                      00110000
001110      SELECT EMPFILE ASSIGN TO UT-S-EMPFILE.                      00111000
001120      SELECT PAYLIST ASSIGN TO UT-S-PAYLIST.                      00112000
001130*                                                                 00113000
001140 DATA DIVISION.                                                   00114000
001150*                                                                 00115000
001160 FILE SECTION.                                                    00116000
001170 FD  TBLFILE                                                      00117001
001180*                                                                 00118000
001190     LABEL RECORDS ARE STANDARD                                   00119000
001200     RECORDING MODE IS F                                          00120000
001300     RECORD CONTAINS 80 CHARACTERS                                00130000
001400     BLOCK CONTAINS 0 RECORDS.                                    00140000
001500*                                                                 00150000
001600 01  TABLE-DATA-AREA             PIC X(80).                       00160000
001700*                                                                 00170000
001800 FD  EMPFILE                                                      00180001
001900*                                                                 00190000
002000     LABEL RECORDS ARE STANDARD                                   00200000
002010     RECORDING MODE IS F                                          00201000
002020     RECORD CONTAINS 80 CHARACTERS                                00202000
002030     BLOCK CONTAINS 0 RECORDS.                                    00203000
002040*                                                                 00204000
002050 01  EM-AREA             PIC X(80).                               00205000
002060*                                                                 00206000
002070*                                                                 00207000
002080 FD  PAYLIST                                                      00208001
002090*                                                                 00209000
002091     LABEL RECORDS ARE STANDARD                                   00209100
002092     RECORDING MODE IS F                                          00209200
002093     RECORD CONTAINS 133 CHARACTERS                               00209300
002094     BLOCK CONTAINS 0 RECORDS.                                    00209400
002095*                                                                 00209500
002096 01  PRINT-AREA             PIC X(133).                           00209600
002097*                                                                 00209700
002098 WORKING-STORAGE SECTION.                                         00209800
002099*                                                                 00209900
002100 01  SWITCHES.                                                    00210000
002200     05  TABLE-EOF-SW            PIC X    VALUE "N".              00220000
002300         88  TABLE-EOF                    VALUE "Y".              00230000
002400     05  EMP-EOF-SW              PIC X    VALUE "N".              00240000
002410         88  EMP-EOF                      VALUE "Y".              00241000
002420*                                                                 00242000
002430 01  WORK-FIELDS                COMP-3.                           00243000
002440     05  GROSS-PAY              PIC S999V99.                      00244000
002450 01  COUNT-FIELDS               COMP-3.                           00245000
002460     05  TABLE-ENTRY-COUNT      PIC S999.                         00246000
002470*01  SUBSCRIPTS                 COMP  SYNC.                       00247000
002480*    05  RATE-SUB               PIC 99.                           00248000
002490 01  RATE-TABLE.                                                  00249000
002500     05  PAY-RATE               OCCURS 26 TIMES                   00250000
002600                                INDEXED BY RATE-INDEX             00260000
002610                                PIC S9V99.                        00261000
002620*                                                                 00262000
002700 01  TD-RECORD.                                                   00270000
002800     05  TD-NO-OF-ENTRIES       PIC 99.                           00280000
002900     05  TD-ENTRY               OCCURS 26 TIMES                   00290000
002910                                INDEXED BY TABLE-INDEX            00291000
003000                                PIC 9V99.                         00300000
003100 01  EM-RECORD.                                                   00310000
003110     05  EM-EMP-NO              PIC X(4).                         00311000
003120     05  FILLER                 PIC X(23).                        00312000
003130     05  EM-PAY-CLASS           PIC 99.                           00313000
003140     05  EM-HOURS-WORKED        PIC 99V9.                         00314000
003150     05  FILLER                 PIC X(48).                        00315000
003160 01  EMPLOYEE-LINE.                                               00316000
003170     05  EL-CC                  PIC X.                            00317000
003180     05  EL-EMP-NO              PIC X(4).                         00318000
003190     05  FILLER                 PIC X(3)   VALUE SPACE.           00319000
003191     05  EL-PAY-RATE            PIC Z.99.                         00319100
003192     05  FILER                  PIC X(3)  VALUE SPACE.            00319200
003193     05  EL-HOURS-WORKED        PIC ZZ.9.                         00319300
003194     05  FILLER                 PIC X(3)  VALUE SPACE.            00319400
003195     05  EL-GROSS-PAY           PIC ZZZ.99.                       00319500
003196     05  FILLER                 PIC X(105) VALUE SPACE.           00319601
003197*                                                                 00319700
003198 PROCEDURE DIVISION.                                              00319800
003199*                                                                 00319900
003200 000-PRODUCE-PAYROLL-LISTING.                                     00320000
003300*                                                                 00330000
003400     OPEN INPUT  TBLFILE                                          00340000
003500                 EMPFILE                                          00350000
003600          OUTPUT PAYLIST.                                         00360000
003700     PERFORM 100-LOAD-RATE-TABLE.                                 00370000
003800     PERFORM 200-PRODUCE-EMPLOYEE-LINE                            00380000
003900                UNTIL EMP-EOF.                                    00390000
003910     CLOSE TBLFILE                                                00391000
003920           EMPFILE                                                00392000
003930           PAYLIST.                                               00393000
003940     DISPLAY 'RATELKUP  I  1  NORMAL EOJ'.                        00394000
003950     STOP RUN.                                                    00395000
003960 100-LOAD-RATE-TABLE.                                             00396000
003970     PERFORM 110-READ-TABLE-RECORD.                               00397000
003980     IF NOT TABLE-EOF                                             00398000
003990         MOVE TD-NO-OF-ENTRIES TO TABLE-ENTRY-COUNT               00399000
004000         PERFORM 120-STORE-TABLE-ENTRY                            00400000
004100*            VARYING RATE-SUB FORM 1 BY 1                         00410000
004110             VARYING RATE-INDEX FROM 1 BY 1                       00411001
004200*            UNTIL RATE-SUB GREATER THAN TABLE-ENTRY-COUNT.       00420000
004210             UNTIL RATE-INDEX GREATER THAN TABLE-ENTRY-COUNT.     00421000
004300 110-READ-TABLE-RECORD.                                           00430000
004400     READ TBLFILE INTO TD-RECORD                                  00440002
004500                AT END                                            00450000
004600                    MOVE "Y" TO TABLE-EOF-SW.                     00460000
004700 120-STORE-TABLE-ENTRY.                                           00470000
004800     SET TABLE-INDEX         TO RATE-INDEX.                       00480000
004810     MOVE TD-ENTRY(TABLE-INDEX) TO PAY-RATE (RATE-INDEX).         00481000
004900 200-PRODUCE-EMPLOYEE-LINE.                                       00490000
005000     PERFORM 210-READ-EMPLOYEE-RECORD.                            00500000
005100     IF NOT EMP-EOF                                               00510000
005200         IF        EM-PAY-CLASS LESS  1                           00520000
005210               OR  EM-PAY-CLASS GREATER TABLE-ENTRY-COUNT         00521001
005220            DISPLAY  'RATELKUP  A  2  INVALID PAY CLASS FOR '     00522000
005230                    'EMPLOYEE  NO. ' EM-EMP-NO                    00523000
005240        ELSE                                                      00524000
005250            SET RATE-INDEX   TO EM-PAY-CLASS                      00525001
005260            MULTIPLY EM-HOURS-WORKED BY PAY-RATE (RATE-INDEX)     00526000
005270                GIVING GROSS-PAY ROUNDED                          00527000
005280            PERFORM  220-PRINT-EMPLOYEE-LINE.                     00528000
005290 210-READ-EMPLOYEE-RECORD.                                        00529002
005300     READ EMPFILE INTO EM-RECORD                                  00530000
005400         AT  END                                                  00540000
005500              MOVE 'Y' TO EMP-EOF-SW.                             00550000
005600 220-PRINT-EMPLOYEE-LINE.                                         00560000
005700     MOVE EM-EMP-NO            TO EL-EMP-NO.                      00570000
005800     MOVE PAY-RATE (RATE-INDEX) TO EL-PAY-RATE.                   00580001
005900     MOVE EM-HOURS-WORKED         TO EL-HOURS-WORKED.             00590001
006000     MOVE GROSS-PAY            TO EL-GROSS-PAY.                   00600000
006100     MOVE EMPLOYEE-LINE        TO PRINT-AREA.                     00610000
006200     PERFORM 230-WRITE-REPORT-LINE.                               00620000
006300 230-WRITE-REPORT-LINE.                                           00630000
006400     WRITE PRINT-AREA                                             00640001
006500         AFTER ADVANCING  1  LINES.                               00650000
