000100 IDENTIFICATION DIVISION.                                         00010000
000200*                                                                 00020000
000300 PROGRAM-ID. WRITE1.                                              00030000
000400*                                                                 00040000
000500 ENVIRONMENT DIVISION.                                            00050000
000600*                                                                 00060000
000700 INPUT-OUTPUT SECTION.                                            00070000
000800*                                                                 00080000
000900 FILE-CONTROL.                                                    00090000
001000*                                                                 00100000
001100      SELECT CUSTMAST ASSIGN TO UT-S-CUSTMAST.                    00110000
001110      SELECT CUSTRPT  ASSIGN TO UT-S-CUSTRPT.                     00111000
001200*                                                                 00120000
001300 DATA DIVISION.                                                   00130000
001400*                                                                 00140000
001500 FILE SECTION.                                                    00150000
001600 FD  CUSTMAST.                                                    00160000
001700*                                                                 00170000
001800 01  CUSTOMER-MASTER-RECORD.                                      00180000
001900     05  CM-BRANCH-NUMBER        PIC 9(2).                        00190000
002000     05  CM-SALESREP-NUMBER      PIC 9(2).                        00200000
002100     05  CM-CUSTOMER-NUMBER      PIC 9(5).                        00210000
002200     05  CM-CUSTOMER-NAME        PIC X(20).                       00220000
002300     05  CM-SALES-THIS-YTD       PIC S9(5)V9(2).                  00230000
002400     05  CM-SALES-LAST-YTD       PIC S9(5)V9(2).                  00240000
002500*                                                                 00250000
002510 FD  CUSTRPT.                                                     00251000
002520*                                                                 00252000
002530 01  CUSTRPT-RECORD.                                              00253000
002540          05  CUST-INFO               PIC X(50).                  00254002
002541          05  TEST-AREA               PIC X(83).                  00254102
002542          05  FILLER REDEFINES TEST-AREA.                         00254202
002550          10  TEST-0                  PIC 9(5).                   00255003
002551          10  TEST-1                  PIC 9(5) COMP-3.            00255103
002560          10  TEST-2                  PIC 9(5) COMP.              00256002
002570          10  TEST-3                  PIC S9(5).                  00257002
002580          10  TEST-4                  PIC S9(5) COMP-3.           00258002
002590          10  TEST-5                  PIC S9(5) COMP.  
                10  Label-1                 pic X(4).                   00259002
                10  TEST-6                  pic xx.
                10  LABEL-2                 pic x(4).
                10  TEST-7                  PIC XX.     
002600 WORKING-STORAGE SECTION.                                         00260000
002700*                                                                 00270000
002800 01  SWITCHES.                                                    00280000
002900     05  CUSTMAST-EOF-SWITCH     PIC X    VALUE "N".              00290000
003000*                                                                 00300000
003100 PROCEDURE DIVISION.                                              00310000
003200*                                                                 00320000
003300 000-CONTROL.                                                     00330000
003400*                                                                 00340000
003500     OPEN INPUT  CUSTMAST                                         00350000
003510          OUTPUT CUSTRPT.                                         00351000
003600     PERFORM 100-READ                                             00360000
003700                UNTIL CUSTMAST-EOF-SWITCH = "Y".                  00370000
003710     CLOSE CUSTMAST CUSTRPT.                                      00371000
003720                                                                  00372000
003800     STOP RUN.                                                    00380000
003900 100-READ.                                                        00390000
004000     READ CUSTMAST                                                00400000
004100                AT END                                            00410000
004200                    MOVE "Y" TO CUSTMAST-EOF-SWITCH.              00420000
004300     IF CUSTMAST-EOF-SWITCH = "N"                                 00430000
004310        MOVE CUSTOMER-MASTER-RECORD TO CUST-INFO                  00431002
004311        MOVE -500 TO TEST-0                                       00431103
004312                     TEST-1                                       00431203
004313                     TEST-2                                       00431303
004314                     TEST-3                                       00431403
004315                     TEST-4                                       00431503
004316                     TEST-5 

              MOVE 'HIGH'  TO  LABEL-1
              MOVE 'LOW  ' TO  LABEL-2 
              MOVE HIGH-VALUES To TEST-6
              MOVE LOW-VALUEs  TO TEST-7                         
004320        WRITE CUSTRPT-RECORD                                      00432000
004330                                                                  00433000
004400        DISPLAY ' RECORD : ' CUSTOMER-MASTER-RECORD.              00440000
004500                                                                  00450000
