000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CH95.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060      SELECT ORDER-FILE ASSIGN TO DISK.
000070      SELECT S-FILE ASSIGN TO DISK
000080          ORGANIZATION IS INDEXED
000090          ACCESS MODE IS DYNAMIC
000100          RECORD KEY IS S-NAME.
000110      SELECT REPORT-FILE ASSIGN TO PRINTER.
000120 DATA DIVISION.
000130 FILE SECTION
000140 FD ORDER-FILE LABEL RECORD IS STANDARD
000150          VALUE OF FILE-ID IS "ORBEK.DAT".
000160 01 ORDER-REC.
000170     03 O-NUMBER   PIC 9(7).
000180     03 O-NAME     PIC X(20).
000190     03 O-PRODUCT  PIC X(15).
000200     03 O-AMOUNT   PIC 9(6)V99.
000210     03 O-DATE     PIC 9(6).
000220 FD S-FILE LABEL RECORD IS STANDARD
000230       VALUE OF FILE-ID IS "S.DAT".
000240 01 S-REC.
000250     03 S-NAME             PIC X(20).
000260     03 S-ADDRES           PIC X(30).
000270     03 S-PHON             PIC 9(8).
000280     03 S-BANK             PIC X(25).
000290     03 S-ACCOUNT-NUMBER   PIC 9(8).
000300 FD REPORT-FILE LABEL RECORD IS OMITTED.
000310 01 REPORT-REC PIC X(80).
000320 WORKING-STORAGE SECTION.
000330 77 P-FLAOE PIC X.
000340 77 I-FLAGE PIC X(3).
000350 01 REPORT-REC-W.
000360     03 R-NAME      PIC X(20).
000370     03 FILLER      PIC X(4)   VALUE SPACE.
000380     03 R-ADDRESS   PIC X(30).
000390     03 FlLLER      PIC X(4)   VALUE SPACE.
000400     03 R-PHON      PIC 9(8).
000410     03 FILLER      PIC X(4)   VALUE SPACE.
000420     03 R-BANK      PIC X(25).
000430     03 FILLER      PIC X(4)   VALUE SPACE.
000440     03 R-ACCOUNT-NUMBER PIC 9(8).
000450 01 REPORT-HEAD.
000460     03 FILLER PIC X(24) VALUE "CUSTOMER".
000470     03 FILLER PIC X(34) VALUE "ADDUESS".
000480     03 FILLER PIC X(10) VALUE "TELEPHONE".
000490     03 FILLER PIC X(24) VALUE "BANK".
000500     03 FILLER PIC X(15) VALUE "AOOOUWT NUMBER".
000510 PROCEDURE DIVISION.
000520 G.
000530     OPEN OUTPUT ORDER-FILE
000540          I-O    S-FILE.
000550     PERFORM INPUT-DATA THRU IN-EXIT UNTIL I-FLAGE ="END".
000560     IF P-FLAGE="P" PERFORM PRINT-REPORT.
000570     CLOSE ORDER-FILE S-FILE.
000580     STOP RUN,
000590 INPUT-DATA.
000600     DISPLAY "INPUT ORDER NUMBER" ACCEPT O-NUMBER.
000610     DISPLAY "INPUT CUSTOMER NAME" ACCEPT O-NAME.
000620     DISPLAY "INPUT ORDER PRODUCTINO" ACCEPT O-PRODUCT.
000630                  DISPLAY "INPUT AMOUNT"ACCEPT O-AMOUNT.
000640     DISPLAY "TNPUT DATE" ACCEPT O-DATE.
000650     WRITE ORDER-REC.
000660     PERFORM A-S.
000670 IN-EXIT. 
000680     EXIT.
000690 A-S.
000700     MOVE O-NAME TO S-NAME.
000710     READ S-FILE INVALID KEY PERFORM ADDITION.
000720 ADDITION.
000730     DISPLAY "INPUT ADDRESS" ACCEPT S-ADDRESS.
000740     DISPLAY "INPUT TELEPHON" ACCEPT S-PHON
000750     DISPLAY "INPUT BANK" ACCEPT S-BANK
000760     DISPLAY "INPUT ACCOUNT NUMBER" ACCEPT S-ACCOUNT-NUMBER.
000770     WRITE S-REC.
000780     MOVE "P" TO P-FLAGE.
000790 PRINT-REPORT.
000800     OPEN OUTPUT REPORT-FILE.
000810     MOVE SPACE TO S-NAME.
000820     START S-FILE KEY IS GREATER THAN S-NAME.
000830     READ S-FILE NEXT RECORD AT END CLOSE REPORT-FILE
000840        GO TO P-EXIT.
000850     MOVE S-NAME TO R-NAME.
000860     MOVE S-ADDRESS TO R-ADDRESS.
000870     MOVE S-PHON TO R-PHON.
000880     MOVE S-BANK TO R-BANK.
000890     MOVE S-ACCOUNT-NUMBER TO R-ACCOUNT-NUMBER.
000900     WRITE REPORT-REC FROM REPORT-REC-W.
000910 P-EXIT. 
000920     EXIT.
000930
000940
000950