000010******************************************************************
000020*         ＜東銀リース＞                                         *
000030*      1. プログラム名    ：ＩＮＩ設定獲得サブルーチン           *
000040*      2. コピー句ID      ：CPBCO001                             *
000050*      3. 処理概要        ：1、ＩＮＩファイルより、オラクル接続情報を獲得する  *
000080*      4. 作成者          ：金子 晃                              *
000090*      5. 作成日          ：2004.05.13                           *
000100******************************************************************
000110*     ＜改訂履歴 １．１版＞                                      *
000120******************************************************************
000121       03  PARA-DBSTRING       PIC X(20).
000122       03  PARA-USERNAME       PIC X(10).
000123       03  PARA-PASSWORD       PIC X(10).
