             07  CUSTOMER-KEY                PIC X(256).
             07  CUSTOMER-I000-KEY           REDEFINES CUSTOMER-KEY.
               09  CUSTOMER-I000.
                 11  CUSTOMERNO              PIC X(004).
               09  FILLER                    PIC X(252).
             07  CUSTOMER-S000-KEY           REDEFINES CUSTOMER-KEY.
               09  CUSTOMER-I000.
                 11  CUSTOMERNO              PIC X(004).
               09  FILLER                    PIC X(252).