             07  ORDER-KEY                PIC X(256).
             07  ORDER-I000-KEY           REDEFINES ORDER-KEY.
               09  ORDER-I000.
                 11  ORDERNO              PIC X(004).
               09  FILLER                    PIC X(252).
             07  ORDER-S000-KEY           REDEFINES ORDER-KEY.
               09  ORDER-I000.
                 11  ORDERNO              PIC X(004).
               09  FILLER                    PIC X(252).