//EXT31COB JOB ,EXT31,MSGLEVEL=(1,1),
//    MSGCLASS=A,CLASS=A,NOTIFY=&SYSUID
//IBMLIB   JCLLIB  ORDER='SYS1.ADMIN.PROCLIB'
//JS0010   EXEC  IGYWCL,MEMBER=DSREWR,
//         SRCELIB=EXT31.ALL.COBOLS,
//         LOADLIB=EXT31.ALL.LOADLIB
//
