000010************************************************
000020* (ALM_NONEQU)
000030************************************************
000040 01  ()CTLNUM           PIC  X(6).
000050 01  ()CLTNAM           PIC  N(20).
000060 01  ()BALCAP           PIC S9(13) COMP-3.
000070 01  ()COLAMT           PIC S9(13) COMP-3.
000080 01  ()ISUDAY           PIC  X(8).
000090 01  ()INTBGN           PIC  X(8).
000100 01  ()DUEDAY           PIC  X(8).
000110 01  ()UPDCYC           PIC  X(2).
000120 01  ()AVEBAL           PIC S9(13) COMP-3.
000130 01  ()COLRAT           PIC S9(2)V9(5) COMP-3.
000140 01  ()CHARGE           PIC S9(2)V9(5) COMP-3.
000150 01  ()REFNUM           PIC  N(10).
000160 01  ()FIXFLT           PIC  X(1).
000170 01  ()TRMTYP           PIC  X(1).
000180 01  ()MON001           PIC S9(13) COMP-3.
000190 01  ()MON002           PIC S9(13) COMP-3.
000200 01  ()MON003           PIC S9(13) COMP-3.
000210 01  ()MON004           PIC S9(13) COMP-3.
000220 01  ()MON005           PIC S9(13) COMP-3.
000230 01  ()MON006           PIC S9(13) COMP-3.
000240 01  ()MON007           PIC S9(13) COMP-3.
000250 01  ()MON008           PIC S9(13) COMP-3.
000260 01  ()MON009           PIC S9(13) COMP-3.
000270 01  ()MON010           PIC S9(13) COMP-3.
000280 01  ()MON011           PIC S9(13) COMP-3.
000290 01  ()MON012           PIC S9(13) COMP-3.
000300 01  ()MON013           PIC S9(13) COMP-3.
000310 01  ()MON014           PIC S9(13) COMP-3.
000320 01  ()MON015           PIC S9(13) COMP-3.
000330 01  ()MON016           PIC S9(13) COMP-3.
000340 01  ()MON017           PIC S9(13) COMP-3.
000350 01  ()MON018           PIC S9(13) COMP-3.
000360 01  ()MON019           PIC S9(13) COMP-3.
000370 01  ()MON020           PIC S9(13) COMP-3.
000380 01  ()MON021           PIC S9(13) COMP-3.
000390 01  ()MON022           PIC S9(13) COMP-3.
000400 01  ()MON023           PIC S9(13) COMP-3.
000410 01  ()MON024           PIC S9(13) COMP-3.
000420 01  ()MON025           PIC S9(13) COMP-3.
000430 01  ()MON026           PIC S9(13) COMP-3.
000440 01  ()MON027           PIC S9(13) COMP-3.
000450 01  ()MON028           PIC S9(13) COMP-3.
000460 01  ()MON029           PIC S9(13) COMP-3.
000470 01  ()MON030           PIC S9(13) COMP-3.
000480 01  ()MON031           PIC S9(13) COMP-3.
000490 01  ()MON032           PIC S9(13) COMP-3.
000500 01  ()MON033           PIC S9(13) COMP-3.
000510 01  ()MON034           PIC S9(13) COMP-3.
000520 01  ()MON035           PIC S9(13) COMP-3.
000530 01  ()MON036           PIC S9(13) COMP-3.
000540 01  ()MON037           PIC S9(13) COMP-3.
000550 01  ()MON038           PIC S9(13) COMP-3.
000560 01  ()MON039           PIC S9(13) COMP-3.
000570 01  ()MON040           PIC S9(13) COMP-3.
000580 01  ()MON041           PIC S9(13) COMP-3.
000590 01  ()MON042           PIC S9(13) COMP-3.
000600 01  ()MON043           PIC S9(13) COMP-3.
000610 01  ()MON044           PIC S9(13) COMP-3.
000620 01  ()MON045           PIC S9(13) COMP-3.
000630 01  ()MON046           PIC S9(13) COMP-3.
000640 01  ()MON047           PIC S9(13) COMP-3.
000650 01  ()MON048           PIC S9(13) COMP-3.
000660 01  ()MON049           PIC S9(13) COMP-3.
000670 01  ()MON050           PIC S9(13) COMP-3.
000680 01  ()MON051           PIC S9(13) COMP-3.
000690 01  ()MON052           PIC S9(13) COMP-3.
000700 01  ()MON053           PIC S9(13) COMP-3.
000710 01  ()MON054           PIC S9(13) COMP-3.
000720 01  ()MON055           PIC S9(13) COMP-3.
000730 01  ()MON056           PIC S9(13) COMP-3.
000740 01  ()MON057           PIC S9(13) COMP-3.
000750 01  ()MON058           PIC S9(13) COMP-3.
000760 01  ()MON059           PIC S9(13) COMP-3.
000770 01  ()MON060           PIC S9(13) COMP-3.
000780 01  ()MON061           PIC S9(13) COMP-3.
000790 01  ()MON062           PIC S9(13) COMP-3.
000800 01  ()MON063           PIC S9(13) COMP-3.
000810 01  ()MON064           PIC S9(13) COMP-3.
000820 01  ()MON065           PIC S9(13) COMP-3.
000830 01  ()MON066           PIC S9(13) COMP-3.
000840 01  ()MON067           PIC S9(13) COMP-3.
000850 01  ()MON068           PIC S9(13) COMP-3.
000860 01  ()MON069           PIC S9(13) COMP-3.
000870 01  ()MON070           PIC S9(13) COMP-3.
000880 01  ()MON071           PIC S9(13) COMP-3.
000890 01  ()MON072           PIC S9(13) COMP-3.
000900 01  ()MON073           PIC S9(13) COMP-3.
000910 01  ()MON074           PIC S9(13) COMP-3.
000920 01  ()MON075           PIC S9(13) COMP-3.
000930 01  ()MON076           PIC S9(13) COMP-3.
000940 01  ()MON077           PIC S9(13) COMP-3.
000950 01  ()MON078           PIC S9(13) COMP-3.
000960 01  ()MON079           PIC S9(13) COMP-3.
000970 01  ()MON080           PIC S9(13) COMP-3.
000980 01  ()MON081           PIC S9(13) COMP-3.
000990 01  ()MON082           PIC S9(13) COMP-3.
001000 01  ()MON083           PIC S9(13) COMP-3.
001010 01  ()MON084           PIC S9(13) COMP-3.
001020 01  ()MON085           PIC S9(13) COMP-3.
001030 01  ()MON086           PIC S9(13) COMP-3.
001040 01  ()MON087           PIC S9(13) COMP-3.
001050 01  ()MON088           PIC S9(13) COMP-3.
001060 01  ()MON089           PIC S9(13) COMP-3.
001070 01  ()MON090           PIC S9(13) COMP-3.
001080 01  ()MON091           PIC S9(13) COMP-3.
001090 01  ()MON092           PIC S9(13) COMP-3.
001100 01  ()MON093           PIC S9(13) COMP-3.
001110 01  ()MON094           PIC S9(13) COMP-3.
001120 01  ()MON095           PIC S9(13) COMP-3.
001130 01  ()MON096           PIC S9(13) COMP-3.
001140 01  ()MON097           PIC S9(13) COMP-3.
001150 01  ()MON098           PIC S9(13) COMP-3.
001160 01  ()MON099           PIC S9(13) COMP-3.
001170 01  ()MON100           PIC S9(13) COMP-3.
001180 01  ()MON101           PIC S9(13) COMP-3.
001190 01  ()MON102           PIC S9(13) COMP-3.
001200 01  ()MON103           PIC S9(13) COMP-3.
001210 01  ()MON104           PIC S9(13) COMP-3.
001220 01  ()MON105           PIC S9(13) COMP-3.
001230 01  ()MON106           PIC S9(13) COMP-3.
001240 01  ()MON107           PIC S9(13) COMP-3.
001250 01  ()MON108           PIC S9(13) COMP-3.
001260 01  ()MON109           PIC S9(13) COMP-3.
001270 01  ()MON110           PIC S9(13) COMP-3.
001280 01  ()MON111           PIC S9(13) COMP-3.
001290 01  ()MON112           PIC S9(13) COMP-3.
001300 01  ()MON113           PIC S9(13) COMP-3.
001310 01  ()MON114           PIC S9(13) COMP-3.
001320 01  ()MON115           PIC S9(13) COMP-3.
001330 01  ()MON116           PIC S9(13) COMP-3.
001340 01  ()MON117           PIC S9(13) COMP-3.
001350 01  ()MON118           PIC S9(13) COMP-3.
001360 01  ()MON119           PIC S9(13) COMP-3.
001370 01  ()MON120           PIC S9(13) COMP-3.
