000010************************************************
000020* (ANK_LPWK_KURINOBE)
000030************************************************
000040 01  ()ˆÄŒ”Ô†               PIC  X(10).
000050 01  ()Œ©ÏŽ}”Ô               PIC  X(2).
000060 01  ()ŒJ‰„‚m‚n               PIC S9(2) COMP-3.
000070 01  ()’[––”Ô†               PIC  N(8).
000080 01  ()ŒJ‰„‹àŠz               PIC S9(13) COMP-3.
000090 01  ()ŒJ‰„ŒŽ”               PIC S9(2)V9(2) COMP-3.
