000010************************************************
000020* (ANK_JUCYU_WK)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()作業者                 PIC  X(16).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()担当者コード           PIC  X(4).
000080 01  ()顧客コード             PIC  X(6).
000090 01  ()取引先名               PIC  N(30).
000100 01  ()契約日                 PIC  X(8).
000110 01  ()取引形態コード         PIC  X(2).
000120 01  ()契約金額               PIC S9(13) COMP-3.
000130 01  ()購入金額合計           PIC S9(13) COMP-3.
000140 01  ()粗利益                 PIC S9(13) COMP-3.
000150 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000160 01  ()リース期間             PIC S9(3) COMP-3.
000170 01  ()物件名_漢字           PIC  N(20).
000180 01  ()検収予定日             PIC  X(8).
000190 01  ()ディーラーコード       PIC  X(5).
000200 01  ()購入先名               PIC  N(30).
