000010************************************************
000020* (ANK_KURINOBE)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()繰延ＮＯ               PIC S9(2) COMP-3.
000070 01  ()繰延金額               PIC S9(13) COMP-3.
000080 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000090 01  ()登録日                 PIC  X(8).
000100 01  ()登録時刻               PIC  X(6).
000110 01  ()登録担当者コード       PIC  X(4).
000120 01  ()更新日                 PIC  X(8).
000130 01  ()更新時刻               PIC  X(6).
000140 01  ()更新担当者コード       PIC  X(4).
