000010************************************************
000020* (ANK_KEITAI)
000030************************************************
000040 01  ()取引形態コード         PIC  X(2).
000050 01  ()内容                   PIC  N(25).
000060 01  ()契約番号上１桁         PIC  X(1).
000070 01  ()ソートＫＥＹ           PIC S9(2) COMP-3.
000080 01  ()登録日                 PIC  X(8).
000090 01  ()登録時刻               PIC  X(6).
000100 01  ()登録担当者コード       PIC  X(4).
000110 01  ()更新日                 PIC  X(8).
000120 01  ()更新時刻               PIC  X(6).
000130 01  ()更新担当者コード       PIC  X(4).
