000010************************************************
000020* 契約保証人ファイル(CISUF361)
000030************************************************
000040    03   ()契約番号               PIC  X(10).
000050    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()保証人取引先コード     PIC  X(9).
000070    03   ()保証人関係区分         PIC  X(1).
000080    03   ()更新年月日             PIC  X(8).
000090    03   ()更新時間               PIC  X(8).
000100    03   ()更新者                 PIC  X(8).
000110    03   ()入力担当者コード       PIC  X(8).
000120    03   ()入力順                 PIC S9(2)  SIGN LEADING SEPARATE.
000130    03   ()登録年月日             PIC  X(8).
000140    03   ()登録時間               PIC  X(8).
000150    03   ()登録担当者             PIC  X(8).
