000010************************************************
000020* 管理与信入金情報(CISUF680)
000030************************************************
000040    03   ()与信管理先コード       PIC  X(9).
000050    03   ()契約番号               PIC  X(10).
000060    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000070    03   ()契約種類               PIC  X(3).
000080    03   ()連番                   PIC S9(3)  SIGN LEADING SEPARATE.
000090    03   ()回収予定日             PIC  X(8).
000100    03   ()請求内訳コード         PIC  X(3).
000110    03   ()消込通番               PIC  X(11).
000120    03   ()請求金額               PIC S9(13)  SIGN LEADING SEPARATE.
000130    03   ()登録年月日             PIC  X(8).
000140    03   ()登録時間               PIC  X(8).
000150    03   ()登録担当者             PIC  X(8).
000160    03   ()更新年月日             PIC  X(8).
000170    03   ()更新時間               PIC  X(8).
000180    03   ()更新者                 PIC  X(8).
000190    03   ()入力担当者コード       PIC  X(8).
000200    03   ()請求先コード           PIC  X(5).
000210    03   ()回収方法               PIC  X(1).
000220    03   ()請求金額消費税         PIC S9(13)  SIGN LEADING SEPARATE.
000230    03   ()初回入金日             PIC  X(8).
000240    03   ()回収年月日             PIC  X(8).
000250    03   ()回収額                 PIC S9(13)  SIGN LEADING SEPARATE.
000260    03   ()回収額消費税           PIC S9(13)  SIGN LEADING SEPARATE.
000270    03   ()未回収額               PIC S9(13)  SIGN LEADING SEPARATE.
000280    03   ()消込年月日             PIC  X(8).
