000010************************************************
000020* 取引先コード変換テーブルWK(CISUF901)
000030************************************************
000040    03   ()取引先コード           PIC  X(8).
000050    03   ()名寄せ取引先コード     PIC  X(8).
000060    03   ()ユーザー取引先コード   PIC  X(8).
000070    03   ()識別ＣＤ               PIC  X(1).
000080    03   ()目的ＣＤ               PIC  X(1).
000090    03   ()新取引先コード         PIC  X(7).
000100    03   ()枝番                   PIC  X(3).
