000010************************************************
000020* 解約履歴資産1ファイル（基本）(CISUF97C)
000030************************************************
000040    03   ()解約契約NO           PIC  X(9).
000050    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()契約種類               PIC S9(3)  SIGN LEADING SEPARATE.
000070    03   ()解約履歴資産基本       PIC  X(244).
