000010******************************************************************
000020*         ＜東銀リース＞                                         *
000030*      1. プログラム名    ：チェックデジット計算                 *
000040*      2. コピー句ID      ：CPBCO007                             *
000050*      3. 処理概要        ：1、９桁の契約番号よりチェックデジット*
000060*                              を計算して１０桁の契約番号を算出する*
000070*      4. 作成者          ：金子 晃                              *
000080*      5. 作成日          ：2004.05.13                           *
000090******************************************************************
000100 01    ＨＣ０３－パラメータ.
000110   03  ＨＣＯ３－９桁契約番号                         PIC  X(015).
000120   03  ＨＣＯ３－新契約番号                           PIC  X(015).
000130   03  ＨＣＯ３－リタンコード                         PIC  9(001).
