      *****************************************************************
      *   汎用請求(D40HSQ_TBL)
      *****************************************************************
           03  ()取引先コード        PIC  X(009).
           03  ()請求先コード        PIC  X(005).
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数        PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()連番                PIC S9(006).
           03  ()請求回数            PIC S9(003).
           03  ()請求間隔            PIC S9(002).
           03  ()回収方法            PIC  X(001).
           03  ()請求年月日          PIC  X(008).
           03  ()請求金額            PIC S9(013).
           03  ()請求消費税          PIC S9(013).
           03  ()消込年月日          PIC  X(008).
           03  ()消込通番            PIC  X(011).
           03  ()回収予定日          PIC  X(008).
           03  ()回収年月日          PIC  X(008).
           03  ()回収金額            PIC S9(013).
           03  ()回収消費税          PIC S9(013).
           03  ()未回収金額          PIC S9(013).
           03  ()初回入金日          PIC  X(008).
           03  ()請求内訳コード
                                     PIC  X(003).
           03  ()部課コード          PIC  X(004).
           03  ()長短区分            PIC  X(001).
           03  ()銀行短縮コード
                                     PIC  X(002).
           03  ()消費税コード        PIC  X(002).
           03  ()消費税徴収区分
                                     PIC  X(001).
           03  ()勘定処理コード
                                     PIC  X(002).
           03  ()総請求回数          PIC S9(003).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
