      *****************************************************************
      *   総合採算費用支払(D383SHS_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()契約種類            PIC  X(003).
           03  ()物件番号            PIC  X(003).
           03  ()物件分割連番
                                     PIC S9(003).
           03  ()費用種類            PIC S9(003).
           03  ()支払連番            PIC  X(008).
           03  ()無効フラグ          PIC  X(001).
           03  ()支払年月            PIC  X(006).
           03  ()支払サイト          PIC S9(003).
           03  ()支払金額            PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
