      *****************************************************************
      *   ネットリーシング社員テーブル(D086NLS_TBL)
      *****************************************************************
           03  ()社員ＩＤ            PIC  X(004).
           03  ()名前                PIC  X(072).
           03  ()メールアドレス
                                     PIC  X(050).
           03  ()電話番号            PIC  X(015).
           03  ()支店名称            PIC  X(040).
           03  ()部名称              PIC  X(048).
           03  ()課名称              PIC  X(048).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
