      *****************************************************************
      *   受取口座マスタ(D05GKO_TBL)
      *****************************************************************
           03  ()銀行短縮コード
                                     PIC  X(002).
           03  ()銀行コード          PIC  X(004).
           03  ()支店コード          PIC  X(003).
           03  ()預金種類            PIC  X(001).
           03  ()口座番号            PIC  X(010).
           03  ()銀行名              PIC  X(040).
           03  ()支店名              PIC  X(040).
           03  ()名義人              PIC  X(030).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()部課コード          PIC  X(004).
           03  ()銀行連番            PIC S9(003).
           03  ()請求区分識別        PIC  X(001).
           03  ()適用年月日          PIC  X(008).
           03  ()銀行支店名          PIC  X(040).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
