      *****************************************************************
      *   ジョモ支店コードマスタ(D075JMS_TBL)
      *****************************************************************
           03  ()ジョモ支店コード
                                     PIC  X(004).
           03  ()ジョモ支店名
                                     PIC  X(060).
           03  ()ジョモ支店名カナ
                                     PIC  X(030).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
