      *****************************************************************
      *   勘定科目マスタ(D044KJK_TBL)
      *****************************************************************
           03  ()勘定科目コード
                                     PIC  X(006).
           03  ()主管部店コード
                                     PIC  X(004).
           03  ()勘定科目利用開始日
                                     PIC  X(008).
           03  ()勘定科目利用終了日
                                     PIC  X(008).
           03  ()勘定科目名称
                                     PIC  X(040).
           03  ()勘定科目略称
                                     PIC  X(016).
           03  ()勘定科目カナ名称
                                     PIC  X(012).
           03  ()勘定科目区分
                                     PIC  X(001).
           03  ()勘定科目貸借区分
                                     PIC  X(001).
           03  ()残高計算区分
                                     PIC  X(001).
           03  ()勘定科目分類
                                     PIC  X(001).
           03  ()補助簿区分          PIC  X(002).
           03  ()財務会計用集計先コード
                                     PIC  X(006).
           03  ()財務会計用転送先コード
                                     PIC  X(006).
           03  ()商法用集計先コード
                                     PIC  X(006).
           03  ()商法用転送先コード
                                     PIC  X(006).
           03  ()証取連結用集計先コード
                                     PIC  X(006).
           03  ()証取連結用転送先コード
                                     PIC  X(006).
           03  ()証取単独用集計先コード
                                     PIC  X(006).
           03  ()証取単独用転送先コード
                                     PIC  X(006).
           03  ()口座番号管理区分
                                     PIC  X(001).
           03  ()消費税端数処理区分
                                     PIC  X(001).
           03  ()消費税管理区分
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新フラグ          PIC  X(001).
