      *****************************************************************
      *   権限マスタ(D065KNG_TBL)
      *****************************************************************
           03  ()権限レベル          PIC  X(003).
           03  ()メニューボタンＩＤ
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()更新者              PIC  X(008).
