      *****************************************************************
      *   納付先コード変換マスタ(D082NFH_TBL)
      *****************************************************************
           03  ()転リース提携先コード
                                     PIC  X(003).
           03  ()先方納付先コード
                                     PIC  X(006).
           03  ()適用年月日          PIC  X(008).
           03  ()納付先コード
                                     PIC  X(006).
           03  ()設置場所名          PIC  X(020).
           03  ()設置場所名カナ
                                     PIC  X(020).
           03  ()設置場所郵便番号
                                     PIC  X(007).
           03  ()設置場所住所
                                     PIC  X(040).
           03  ()設置場所住所２
                                     PIC  X(060).
           03  ()設置場所住所３
                                     PIC  X(060).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
