      *****************************************************************
      *   口座番号マスタ(D043KZB_TBL)
      *****************************************************************
           03  ()勘定科目コード
                                     PIC  X(006).
           03  ()口座番号            PIC  X(010).
           03  ()口座名称            PIC  X(040).
           03  ()口座略称            PIC  X(016).
           03  ()口座カナ名称
                                     PIC  X(012).
           03  ()明細管理区分
                                     PIC  X(001).
           03  ()口座主管部店
                                     PIC  X(004).
           03  ()幣種                PIC  X(003).
           03  ()セグメントコード
                                     PIC  X(001).
           03  ()口座番号利用開始日
                                     PIC  X(008).
           03  ()口座番号利用終了日
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新フラグ          PIC  X(001).
