      *****************************************************************
      *   資産種類判定コードマスタ(D121SHK_TBL)
      *****************************************************************
           03  ()資産種類            PIC  X(007).
           03  ()資産種類判定区分
                                     PIC  X(001).
           03  ()資産種類判定コード
                                     PIC  X(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
