      *****************************************************************
      *   三洋割引係数マスタ(D076SYW_TBL)
      *****************************************************************
           03  ()期間                PIC S9(003).
           03  ()適用年月日          PIC  X(008).
           03  ()割引係数            PIC S9(002)V9(005).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
