      *****************************************************************
      *   担当者マスタ(D07TNT_TBL)
      *****************************************************************
           03  ()担当者コード        PIC  X(008).
           03  ()担当者名称          PIC  X(020).
           03  ()最新見積番号        PIC S9(007).
           03  ()部課コード１        PIC  X(004).
           03  ()部課コード２        PIC  X(004).
           03  ()担当者表示区分
                                     PIC  X(001).
           03  ()ランク              PIC S9(002).
           03  ()パスワード          PIC  X(015).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()担当者カナ          PIC  X(030).
           03  ()担当者ランク１
                                     PIC S9(002).
           03  ()担当者ランク２
                                     PIC S9(002).
           03  ()パスワード有効開始日
                                     PIC  X(008).
           03  ()代行入力者コード１
                                     PIC  X(008).
           03  ()代行入力者コード２
                                     PIC  X(008).
           03  ()代行入力者コード３
                                     PIC  X(008).
           03  ()個人番号            PIC  X(007).
           03  ()連動用パスワード
                                     PIC  X(015).
           03  ()担当者利用開始日
                                     PIC  X(008).
           03  ()担当者利用終了日
                                     PIC  X(008).
           03  ()権限レベル１        PIC  X(003).
           03  ()権限レベル２        PIC  X(003).
           03  ()権限レベル３        PIC  X(003).
           03  ()権限レベル４        PIC  X(003).
           03  ()権限レベル５        PIC  X(003).
           03  ()部課コード３        PIC  X(004).
           03  ()部課コード４        PIC  X(004).
           03  ()部課コード５        PIC  X(004).
           03  ()部課コード６        PIC  X(004).
           03  ()企業情報権限レベル
                                     PIC  X(001).
           03  ()ＧＬＯＶＩＡ連動フラグ
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
