      *****************************************************************
      *   ＦＢヘッダーレコードテーブル(D99FBH_TBL)
      *****************************************************************
           03  ()種別コード          PIC  X(002).
           03  ()作成日              PIC  X(006).
           03  ()勘定日－自          PIC  X(006).
           03  ()勘定日－至          PIC  X(006).
           03  ()銀行コード          PIC  X(004).
           03  ()支店コード          PIC  X(003).
           03  ()預金種目            PIC  X(001).
           03  ()口座番号            PIC  X(010).
           03  ()口座名              PIC  X(040).
           03  ()取引前残高          PIC  X(014).
           03  ()支店名              PIC  X(015).
           03  ()銀行名              PIC  X(015).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()照会番号            PIC  X(006).
           03  ()振込依頼人名        PIC  X(048).
           03  ()仕向銀行名          PIC  X(015).
           03  ()仕向支店名          PIC  X(015).
           03  ()取引金額            PIC  X(010).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
