      *****************************************************************
      *   会社住所マスタ(D041STS_TBL)
      *****************************************************************
           03  ()会社コード          PIC  X(010).
           03  ()会社名              PIC  X(080).
           03  ()郵便番号            PIC  X(007).
           03  ()住所コード          PIC  X(011).
           03  ()住所２              PIC  X(060).
           03  ()住所３              PIC  X(060).
           03  ()電話番号            PIC  X(015).
           03  ()ＦＡＸ番号          PIC  X(015).
           03  ()代表者名            PIC  X(020).
           03  ()代表者役職名
                                     PIC  X(030).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()住所１              PIC  X(040).
           03  ()貸金業登録番号
                                     PIC  X(030).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
