      *****************************************************************
      *   担保管理(D100TNP_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()担保番号            PIC S9(005).
           03  ()担保種類大分類
                                     PIC  X(002).
           03  ()担保種類小分類
                                     PIC  X(002).
           03  ()基準担保区分
                                     PIC  X(001).
           03  ()根普通区分          PIC  X(001).
           03  ()共用担保区分
                                     PIC  X(001).
           03  ()鑑定年月日          PIC  X(008).
           03  ()次回鑑定年月日
                                     PIC  X(008).
           03  ()契約番号            PIC  X(010).
           03  ()契約満了日          PIC  X(008).
           03  ()担保期日            PIC  X(008).
           03  ()担保品              PIC  X(040).
           03  ()極度額              PIC S9(013).
           03  ()鑑定時価            PIC S9(013).
           03  ()掛目                PIC S9(013).
           03  ()先順位              PIC S9(013).
           03  ()規定値              PIC S9(013).
           03  ()参考値              PIC S9(013).
           03  ()鑑定機関            PIC  X(040).
           03  ()備考                PIC  X(040).
           03  ()担保種類大分類名称
                                     PIC  X(040).
           03  ()担保種類小分類名称
                                     PIC  X(040).
           03  ()担保保管区分
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
