      *****************************************************************
      *   引合案件(D20HAN_TBL)
      *****************************************************************
           03  ()案件番号－連番
                                     PIC S9(007).
           03  ()案件番号枝番        PIC S9(002).
           03  ()担当者コード        PIC  X(008).
           03  ()担当部課コード
                                     PIC  X(004).
           03  ()契約番号            PIC  X(010).
           03  ()主契約区分          PIC  X(001).
           03  ()案件名              PIC  X(040).
           03  ()案件発生日          PIC  X(008).
           03  ()案件発生理由区分
                                     PIC  X(002).
           03  ()取引先コード        PIC  X(009).
           03  ()契約先コード        PIC  X(005).
           03  ()成約予定日          PIC  X(008).
           03  ()契約期間            PIC S9(003).
           03  ()物件購入金額        PIC S9(013).
           03  ()成約予定額          PIC S9(013).
           03  ()予定粗利            PIC S9(013).
           03  ()優遇金利区分        PIC  X(001).
           03  ()引合状況コメント
                                     PIC  X(120).
           03  ()紹介先区分          PIC  X(001).
           03  ()紹介先取引先コード
                                     PIC  X(009).
           03  ()紹介先枝番コード
                                     PIC  X(005).
           03  ()紹介先ＢＴＭ本支店コード
                                     PIC  X(003).
           03  ()紹介先僚店コード
                                     PIC  X(004).
           03  ()紹介先銀行コード
                                     PIC  X(004).
           03  ()紹介先支店コード
                                     PIC  X(003).
           03  ()引合状態区分        PIC S9(001).
           03  ()基準確度区分        PIC  X(001).
           03  ()入力確度区分        PIC  X(001).
           03  ()引合中止区分        PIC  X(001).
           03  ()引合中止日          PIC  X(008).
           03  ()引合中止理由区分
                                     PIC  X(001).
           03  ()引合中止理由コメント
                                     PIC  X(160).
           03  ()競合社数            PIC S9(002).
           03  ()当社順位            PIC S9(002).
           03  ()競合他社１          PIC  X(040).
           03  ()提示額１            PIC S9(013).
           03  ()料率１              PIC S9(002)V9(008).
           03  ()受注チェック１
                                     PIC  X(001).
           03  ()競合他社２          PIC  X(040).
           03  ()提示額２            PIC S9(013).
           03  ()料率２              PIC S9(002)V9(008).
           03  ()受注チェック２
                                     PIC  X(001).
           03  ()競合他社３          PIC  X(040).
           03  ()提示額３            PIC S9(013).
           03  ()料率３              PIC S9(002)V9(008).
           03  ()受注チェック３
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
