      *****************************************************************
      *   受取手形(D642UTG_TBL)
      *****************************************************************
           03  ()代表契約番号
                                     PIC  X(010).
           03  ()束数                PIC S9(003).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()契約先名称          PIC  X(040).
           03  ()契約先名称カナ
                                     PIC  X(040).
           03  ()部店コード          PIC  X(004).
           03  ()主契約区分          PIC  X(001).
           03  ()手形状態            PIC  X(001).
           03  ()取引日              PIC  X(008).
           03  ()伝票発行日          PIC  X(008).
           03  ()手形種類            PIC  X(001).
           03  ()期日基準日          PIC  X(008).
           03  ()期日サイクル
                                     PIC S9(002).
           03  ()束合計金額          PIC S9(013).
           03  ()手形枚数            PIC S9(004).
           03  ()取立銀行コード
                                     PIC  X(007).
           03  ()支払銀行コード
                                     PIC  X(007).
           03  ()契約番号１          PIC  X(010).
           03  ()契約番号２          PIC  X(010).
           03  ()契約番号３          PIC  X(010).
           03  ()契約番号４          PIC  X(010).
           03  ()契約番号５          PIC  X(010).
           03  ()契約番号６          PIC  X(010).
           03  ()契約番号７          PIC  X(010).
           03  ()契約番号８          PIC  X(010).
           03  ()契約番号９          PIC  X(010).
           03  ()契約番号１０
                                     PIC  X(010).
           03  ()備考欄              PIC  X(040).
           03  ()手形内容種別
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
