      *****************************************************************
      *   契約＿見積書表示(D347KMH_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()見積有効期限
                                     PIC  X(008).
           03  ()見積書表示１
                                     PIC  X(100).
           03  ()見積書表示２
                                     PIC  X(100).
           03  ()見積書表示３
                                     PIC  X(100).
           03  ()見積書表示４
                                     PIC  X(100).
           03  ()見積書表示５
                                     PIC  X(100).
           03  ()見積書表示６
                                     PIC  X(100).
           03  ()見積書表示７
                                     PIC  X(100).
           03  ()見積書表示８
                                     PIC  X(100).
           03  ()見積書表示９
                                     PIC  X(100).
           03  ()見積書表示１０
                                     PIC  X(100).
           03  ()売主見積番号
                                     PIC  X(020).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()取引先コード
                                     PIC  X(007).
           03  ()契約先コード
                                     PIC  X(003).
           03  ()契約件名            PIC  X(040).
           03  ()物件金額表示方法
                                     PIC  X(001).
           03  ()物件明細表示方法
                                     PIC  X(001).
           03  ()代理回収保守料表示方法
                                     PIC  X(001).
           03  ()再リース条件選択
                                     PIC  X(001).
           03  ()物件設置場所
                                     PIC  X(060).
           03  ()連帯保証人          PIC  X(040).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
