      *****************************************************************
      *   上乗せ相殺契約(D469KUS_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()損害金請求方法
                                     PIC  X(001).
           03  ()解約年月日          PIC  X(008).
           03  ()解約区分            PIC  X(001).
           03  ()解約理由            PIC  X(002).
           03  ()新契約番号          PIC  X(010).
           03  ()新見積番号          PIC  X(007).
           03  ()上乗せ相殺金額
                                     PIC S9(013).
           03  ()相殺区分            PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
