      *****************************************************************
      *   請求スケジュール(D751SCH_TBL)
      *****************************************************************
           03  ()処理年月日          PIC  X(008).
           03  ()旬処理フラグ
                                     PIC  X(001).
           03  ()処理済フラグ
                                     PIC  X(001).
           03  ()請求書発行開始日
                                     PIC  X(008).
           03  ()請求書発行終了日
                                     PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
