      *****************************************************************
      *   減価償却率マスタ(D034KSR_TBL)
      *****************************************************************
           03  ()耐用年数            PIC S9(002).
           03  ()適用年月日          PIC  X(008).
           03  ()固定資産償却率
                                     PIC S9(002)V9(008).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()法定定額償却率
                                     PIC S9(002)V9(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
