      *****************************************************************
      *   開示契約先マスタ(D143KJK_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()開示先コード
                                     PIC S9(005).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
