      *****************************************************************
      *   物件処分決裁(D816BSK_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()物件処分区分
                                     PIC  X(001).
           03  ()物件処分連番
                                     PIC S9(003).
           03  ()引取負担区分
                                     PIC  X(001).
           03  ()処理方法            PIC  X(001).
           03  ()第三者業者名
                                     PIC  X(080).
           03  ()第三者査定価格
                                     PIC S9(013).
           03  ()売却先種類          PIC  X(001).
           03  ()売却先詳細          PIC  X(040).
           03  ()承認区分            PIC  X(001).
           03  ()承認日              PIC  X(008).
           03  ()対象項目１          PIC  X(001).
           03  ()対象項目２          PIC  X(001).
           03  ()対象項目３          PIC  X(001).
           03  ()徴収書類１          PIC  X(001).
           03  ()徴収書類２          PIC  X(001).
           03  ()確認事項１          PIC  X(060).
           03  ()確認事項２          PIC  X(060).
           03  ()確認事項３          PIC  X(060).
           03  ()確認事項４          PIC  X(060).
           03  ()確認事項５          PIC  X(060).
           03  ()営業意見欄１
                                     PIC  X(060).
           03  ()営業意見欄２
                                     PIC  X(060).
           03  ()営業意見欄３
                                     PIC  X(060).
           03  ()営業意見欄４
                                     PIC  X(060).
           03  ()営業意見欄５
                                     PIC  X(060).
           03  ()承認意見欄１
                                     PIC  X(060).
           03  ()承認意見欄２
                                     PIC  X(060).
           03  ()承認意見欄３
                                     PIC  X(060).
           03  ()承認意見欄４
                                     PIC  X(060).
           03  ()承認意見欄５
                                     PIC  X(060).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
