      *****************************************************************
      *   代行者マスタ(D067DKO_TBL)
      *****************************************************************
           03  ()担当者コード
                                     PIC  X(008).
           03  ()代行担当者コード
                                     PIC  X(008).
           03  ()履歴番号            PIC S9(003).
           03  ()代行開始年月日
                                     PIC  X(008).
           03  ()代行終了年月日
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()更新者              PIC  X(008).
