      *****************************************************************
      *   管理与信契約(D851KRK_TBL)
      *****************************************************************
           03  ()与信管理先コード
                                     PIC  X(009).
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()勘定処理コード
                                     PIC  X(002).
           03  ()部課コード          PIC  X(004).
           03  ()主契約区分          PIC  X(001).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()契約件名            PIC  X(040).
           03  ()取引年月日          PIC  X(008).
           03  ()契約年月日          PIC  X(008).
           03  ()検収年月日          PIC  X(008).
           03  ()満了年月日          PIC  X(008).
           03  ()対外債権残高
                                     PIC S9(013).
           03  ()対外債権残高消費税
                                     PIC S9(013).
           03  ()前受金残高          PIC S9(013).
           03  ()前受金残高消費税
                                     PIC S9(013).
           03  ()貸付金別口          PIC S9(013).
           03  ()貸付金別口消費税
                                     PIC S9(013).
           03  ()非稼働資産          PIC S9(013).
           03  ()貯蔵品              PIC S9(013).
           03  ()担保残高            PIC S9(013).
           03  ()信用保険区分
                                     PIC  X(001).
           03  ()信用保険求償
                                     PIC S9(013).
           03  ()契約金額            PIC S9(013).
           03  ()入金日              PIC  X(002).
           03  ()開始回数            PIC  X(001).
           03  ()明細支払回数
                                     PIC S9(003).
           03  ()計算方式            PIC  X(001).
           03  ()請求サイクル
                                     PIC  X(002).
           03  ()延滞開始年月日
                                     PIC  X(008).
           03  ()歯抜フラグ１
                                     PIC  X(002).
           03  ()歯抜フラグ２
                                     PIC  X(002).
           03  ()残価額              PIC S9(013).
           03  ()月割Ｌ料            PIC S9(013).
           03  ()約弁区分            PIC  X(001).
           03  ()事故債権残          PIC S9(013).
           03  ()事故債権残消費税
                                     PIC S9(013).
           03  ()事故元本残          PIC S9(013).
           03  ()当月末債権残
                                     PIC S9(013).
           03  ()当月末元本残
                                     PIC S9(013).
           03  ()Ｎ当月末債権残
                                     PIC S9(013).
           03  ()Ｎ当月末元本残
                                     PIC S9(013).
           03  ()未収元本            PIC S9(013).
           03  ()未収利息            PIC S9(013).
           03  ()未徴収金            PIC S9(013).
           03  ()Ｂ未徴収金          PIC S9(013).
           03  ()売却金額            PIC S9(013).
           03  ()固定利率            PIC S9(003)V9(008).
           03  ()金利変動区分
                                     PIC  X(001).
           03  ()スプレッド          PIC S9(003)V9(008).
           03  ()連動金利区分
                                     PIC  X(001).
           03  ()備考                PIC  X(040).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
