      *****************************************************************
      *   信託先マスタ(D133SNT_TBL)
      *****************************************************************
           03  ()信託先コード
                                     PIC  X(007).
           03  ()信託先名            PIC  X(080).
           03  ()信託先名カナ
                                     PIC  X(040).
           03  ()銀行コード          PIC  X(004).
           03  ()支店コード          PIC  X(003).
           03  ()口座種類            PIC  X(001).
           03  ()口座番号            PIC  X(010).
           03  ()名義人              PIC  X(030).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
