      *****************************************************************
      *   システム定数マスタ(D053SYT_TBL)
      *****************************************************************
           03  ()業務内訳コード
                                     PIC  X(002).
           03  ()グループＩＤ
                                     PIC S9(003).
           03  ()連番                PIC S9(003).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()データ部            PIC  X(070).
           03  ()データ長            PIC S9(002).
           03  ()レコード説明
                                     PIC  X(050).
