      *****************************************************************
      *   振替仕訳(D586FRS_TBL)
      *****************************************************************
           03  ()入金日              PIC  X(008).
           03  ()ＳＥＱ番号          PIC S9(006).
           03  ()明細番号            PIC S9(003).
           03  ()借方科目コード
                                     PIC  X(010).
           03  ()借方金額            PIC S9(013).
           03  ()借方課税区分
                                     PIC  X(003).
           03  ()貸方科目コード
                                     PIC  X(010).
           03  ()貸方金額            PIC S9(013).
           03  ()貸方課税区分
                                     PIC  X(003).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
