      *****************************************************************
      *   包括異例申請マスタ(D099HKS_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()承認部署            PIC  X(004).
           03  ()条件連番            PIC S9(002).
           03  ()包括異例条件コード
                                     PIC S9(003).
           03  ()コメント            PIC  X(040).
           03  ()承認日              PIC  X(008).
           03  ()適用期限年月
                                     PIC  X(006).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
