      *****************************************************************
      *   見積契約(D26MKY_TBL)
      *****************************************************************
           03  ()見積番号－連番
                                     PIC S9(007).
           03  ()見積番号枝番        PIC S9(002).
           03  ()取引先コード        PIC  X(009).
           03  ()引渡予定日          PIC  X(008).
           03  ()リース料丸め単位
                                     PIC  X(001).
           03  ()期間                PIC S9(003).
           03  ()代表物件名          PIC  X(040).
           03  ()回収サイト          PIC S9(002).
           03  ()回収日              PIC S9(002).
           03  ()第２回目回収サイト
                                     PIC S9(002).
           03  ()第２回目回収日
                                     PIC S9(002).
           03  ()回収サイクル        PIC S9(002).
           03  ()変則払有無          PIC  X(001).
           03  ()消費税率区分        PIC  X(002).
           03  ()利回り結果          PIC S9(002)V9(008).
           03  ()月指数結果          PIC S9(002)V9(008).
           03  ()ユーザ利回り        PIC S9(002)V9(008).
           03  ()粗利結果            PIC S9(013).
           03  ()月額料金結果        PIC S9(013).
           03  ()月額消費税結果
                                     PIC S9(013).
           03  ()契約総額結果        PIC S9(013).
           03  ()消費税総額結果
                                     PIC S9(013).
           03  ()見積有効期限        PIC S9(003).
           03  ()見積書表示１        PIC  X(100).
           03  ()見積書表示２        PIC  X(100).
           03  ()見積書表示３        PIC  X(100).
           03  ()見積書表示４        PIC  X(100).
           03  ()見積書表示５        PIC  X(100).
           03  ()見積書表示６        PIC  X(100).
           03  ()見積書表示７        PIC  X(100).
           03  ()見積書表示８        PIC  X(100).
           03  ()最終物件番号        PIC S9(004).
           03  ()第１回回収方法
                                     PIC  X(040).
           03  ()第２回以降回収方法
                                     PIC  X(040).
           03  ()取得価額            PIC S9(013).
           03  ()状態フラグ          PIC  X(001).
           03  ()社内金利            PIC S9(002)V9(008).
           03  ()支払メリット        PIC S9(003)V9(002).
           03  ()計算方法            PIC  X(001).
           03  ()見積主契約区分
                                     PIC  X(001).
           03  ()見積書作成日付
                                     PIC  X(008).
           03  ()部署名称            PIC  X(060).
           03  ()担当者              PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()採算計算年月日
                                     PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()協調転区分          PIC  X(001).
           03  ()社内金利区分        PIC  X(002).
           03  ()担当部課コード
                                     PIC  X(004).
           03  ()料金－裏            PIC S9(013).
           03  ()料率－裏            PIC S9(002)V9(008).
           03  ()年利回－裏          PIC S9(002)V9(008).
           03  ()粗利額－裏          PIC S9(013).
           03  ()運用利回－裏        PIC S9(002)V9(008).
           03  ()見積残価現価－全体
                                     PIC S9(013).
           03  ()動総保険料現価－全体
                                     PIC S9(013).
           03  ()固定資産税現価－全体
                                     PIC S9(013).
           03  ()保守料現価－全体
                                     PIC S9(013).
           03  ()雑費現価－全体
                                     PIC S9(013).
           03  ()見積残価－全体
                                     PIC S9(013).
           03  ()動総保険料－全体
                                     PIC S9(013).
           03  ()固定資産税－全体
                                     PIC S9(013).
           03  ()保守料－全体        PIC S9(013).
           03  ()雑費－全体          PIC S9(013).
           03  ()見積残価現価－裏
                                     PIC S9(013).
           03  ()動総保険料現価－裏
                                     PIC S9(013).
           03  ()固定資産税現価－裏
                                     PIC S9(013).
           03  ()保守料現価－裏
                                     PIC S9(013).
           03  ()雑費現価－裏        PIC S9(013).
           03  ()取得価額－裏        PIC S9(013).
           03  ()見積残価－裏        PIC S9(013).
           03  ()動総保険料－裏
                                     PIC S9(013).
           03  ()固定資産税－裏
                                     PIC S9(013).
           03  ()保守料－裏          PIC S9(013).
           03  ()雑費－裏            PIC S9(013).
           03  ()契約先コード        PIC  X(003).
           03  ()契約種類            PIC  X(003).
           03  ()契約予定日          PIC  X(008).
           03  ()一般社内金利        PIC S9(002)V9(008).
           03  ()前受月数            PIC S9(003).
           03  ()前受リース料        PIC S9(013).
           03  ()前渡金有無フラグ
                                     PIC  X(001).
           03  ()委託保守料区分
                                     PIC  X(001).
           03  ()代理回収保守区分
                                     PIC  X(001).
           03  ()以降回収サイト
                                     PIC S9(002)V9(002).
           03  ()前渡金指定区分
                                     PIC  X(001).
           03  ()前渡金金利          PIC S9(002)V9(008).
           03  ()前渡金利息          PIC S9(013).
           03  ()残価回収サイト
                                     PIC S9(002)V9(002).
           03  ()加重耐用年数        PIC S9(002)V9(003).
           03  ()分割回収解約金区分
                                     PIC  X(001).
           03  ()分割回収解約金
                                     PIC S9(013).
           03  ()他社解約金支払サイト
                                     PIC S9(002).
           03  ()他社解約金支払日
                                     PIC S9(002).
           03  ()再リース条件文言
                                     PIC  X(040).
           03  ()再リース料率区分
                                     PIC  X(001).
           03  ()再リース料率分子
                                     PIC S9(002).
           03  ()再リース料率分母
                                     PIC S9(002).
           03  ()再リース利回１
                                     PIC S9(002)V9(008).
           03  ()再リース粗利１
                                     PIC S9(013).
           03  ()再リース利回２
                                     PIC S9(002)V9(008).
           03  ()再リース粗利２
                                     PIC S9(013).
           03  ()再リース利回３
                                     PIC S9(002)V9(008).
           03  ()再リース粗利３
                                     PIC S9(013).
           03  ()物件金額表示区分
                                     PIC  X(001).
           03  ()物件明細表示区分
                                     PIC  X(001).
           03  ()代理回収保守料表示区分
                                     PIC  X(001).
           03  ()保守契約先          PIC  X(060).
           03  ()連帯保証人氏名他
                                     PIC  X(020).
           03  ()物件設置場所文言
                                     PIC  X(040).
           03  ()付随条項自動区分１
                                     PIC  X(001).
           03  ()付随条項自動区分２
                                     PIC  X(001).
           03  ()付随条項自動区分３
                                     PIC  X(001).
           03  ()付随条項自動区分４
                                     PIC  X(001).
           03  ()付随条項自動区分５
                                     PIC  X(001).
           03  ()付随条項自動区分６
                                     PIC  X(001).
           03  ()付随条項自動区分７
                                     PIC  X(001).
           03  ()付随条項自動区分８
                                     PIC  X(001).
           03  ()基本リース料        PIC S9(013).
           03  ()固定資産税月額
                                     PIC S9(013).
           03  ()動総保険月額        PIC S9(013).
           03  ()その他費用月額
                                     PIC S9(013).
           03  ()前受メリット月額
                                     PIC S9(013).
           03  ()繰延メリット月額
                                     PIC S9(013).
           03  ()実質リース料        PIC S9(013).
           03  ()リース料現価        PIC S9(013).
           03  ()初期費用金額        PIC S9(013).
           03  ()消費税徴収区分
                                     PIC  X(001).
           03  ()業務区分            PIC  X(001).
           03  ()買戻義務区分        PIC  X(001).
           03  ()代理回収            PIC  X(001).
           03  ()対抗要件            PIC  X(002).
           03  ()割引料              PIC S9(013).
           03  ()受取手数料          PIC S9(013).
           03  ()受取手数料消費税
                                     PIC S9(013).
           03  ()取立手数料等        PIC S9(013).
           03  ()取立手数料等消費税
                                     PIC S9(013).
           03  ()利率基数区分        PIC  X(001).
           03  ()利息端数区分        PIC  X(001).
           03  ()片端両端区分        PIC  X(001).
           03  ()休日対応区分        PIC  X(001).
           03  ()利息計算区分        PIC  X(001).
           03  ()初回利息区分        PIC  X(001).
           03  ()融資方法            PIC  X(001).
           03  ()新規書替区分        PIC  X(001).
           03  ()期日                PIC  X(008).
           03  ()返済条件            PIC  X(001).
           03  ()金利変動区分        PIC  X(001).
           03  ()連動金利区分        PIC  X(002).
           03  ()スプレッド          PIC S9(002)V9(008).
           03  ()利率確定期限        PIC  X(008).
           03  ()見直しサイクル
                                     PIC S9(003).
           03  ()初回元本回収日
                                     PIC  X(008).
           03  ()元本サイクル        PIC S9(002).
           03  ()元本回数            PIC S9(003).
           03  ()初回利息回収日
                                     PIC  X(008).
           03  ()利息サイクル        PIC S9(002).
           03  ()利息回数            PIC S9(003).
           03  ()回収方法            PIC  X(001).
           03  ()資金使途区分        PIC  X(002).
           03  ()実質年率            PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()引合中止区分        PIC  X(001).
           03  ()裏付取引            PIC  X(060).
           03  ()相殺区分            PIC  X(001).
           03  ()契約番号            PIC  X(015).
           03  ()貸付利率            PIC S9(002)V9(008).
           03  ()一般前渡金金利
                                     PIC S9(002)V9(008).
           03  ()再リース条件選択区分
                                     PIC  X(001).
