      *****************************************************************
      *   文言マスタ(D050MNG_TBL)
      *****************************************************************
           03  ()文言グループコード
                                     PIC  X(002).
           03  ()文言番号            PIC  X(003).
           03  ()連番                PIC S9(003).
           03  ()文言                PIC  X(120).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
