      *****************************************************************
      *   開示先マスタ(D142KJS_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()開示先コード
                                     PIC S9(002).
           03  ()開示先名            PIC  X(060).
           03  ()開示方法区分
                                     PIC  X(001).
           03  ()注記省略取引表示区分
                                     PIC  X(001).
           03  ()協調非幹事対象区分
                                     PIC  X(001).
           03  ()再リース開示対象区分
                                     PIC  X(001).
           03  ()開示帳票利子出力区分
                                     PIC  X(001).
           03  ()定額定率区分
                                     PIC  X(001).
           03  ()内訳明細出力区分
                                     PIC  X(001).
           03  ()本決算月日          PIC  X(004).
           03  ()開示決算月１
                                     PIC  X(002).
           03  ()開示決算月２
                                     PIC  X(002).
           03  ()開示決算月３
                                     PIC  X(002).
           03  ()本決算期間月数
                                     PIC  X(002).
           03  ()対象期間月数１
                                     PIC  X(002).
           03  ()対象期間月数２
                                     PIC  X(002).
           03  ()対象期間月数３
                                     PIC  X(002).
           03  ()最新処理対象開始日
                                     PIC  X(008).
           03  ()最新処理対象終了日
                                     PIC  X(008).
           03  ()ＮｅｔＬｅａｓｉｎｇ利用者コード
                                     PIC  X(008).
           03  ()随時帳票出力区分
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
