      *****************************************************************
      *   入金消込管理＿振替仕訳(D57NKF_TBL)
      *****************************************************************
           03  ()消込通番            PIC  X(011).
           03  ()明細番号            PIC S9(003).
           03  ()借方科目コード
                                     PIC  X(006).
           03  ()借方金額            PIC S9(013).
           03  ()借方課税区分        PIC  X(003).
           03  ()借方ＲＥＦＮＯ
                                     PIC  X(020).
           03  ()貸方科目コード
                                     PIC  X(006).
           03  ()貸方金額            PIC S9(013).
           03  ()貸方課税区分        PIC  X(003).
           03  ()貸方ＲＥＦＮＯ
                                     PIC  X(020).
           03  ()消込取消区分        PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
