      *****************************************************************
      *   保険会社マスタ(D101HKK_TBL)
      *****************************************************************
           03  ()保険会社識別コード
                                     PIC  X(002).
           03  ()保険会社名          PIC  X(080).
           03  ()保険会社名略称
                                     PIC  X(010).
           03  ()保険会社名カナ
                                     PIC  X(050).
           03  ()保険会社名略称カナ
                                     PIC  X(012).
           03  ()保険会社代理店コード
                                     PIC  X(009).
           03  ()保険会社代理店名
                                     PIC  X(080).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
