      *****************************************************************
      *   契約先マスタ(D021KYS_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()契約先名称          PIC  X(080).
           03  ()部門名称            PIC  X(060).
           03  ()客先担当者          PIC  X(020).
           03  ()郵便番号            PIC  X(007).
           03  ()市町村コード
                                     PIC  X(011).
           03  ()住所２              PIC  X(060).
           03  ()住所３              PIC  X(060).
           03  ()電話番号            PIC  X(015).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()部門カナ名称
                                     PIC  X(030).
           03  ()顧客使用不可フラグ
                                     PIC  X(001).
           03  ()コメント欄          PIC  X(060).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()主担当部課コード
                                     PIC  X(004).
           03  ()現担当者            PIC  X(008).
           03  ()ＦＡＸ番号          PIC  X(015).
           03  ()住所１              PIC  X(060).
           03  ()住所カナ名称
                                     PIC  X(060).
           03  ()特定動総保険料率使用区分
                                     PIC  X(001).
           03  ()再リース計算率区分
                                     PIC  X(001).
           03  ()再リース料率分子
                                     PIC S9(004).
           03  ()再リース料率分母
                                     PIC S9(004).
           03  ()再リース計算単位区分
                                     PIC  X(001).
           03  ()再リース計算方式区分
                                     PIC  X(001).
           03  ()満了通知明細書発行区分
                                     PIC  X(001).
           03  ()再リース自動更新フラグ
                                     PIC  X(001).
           03  ()満了条件区分
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()ＮｅｔＬｅａｓｉｎｇ区分
                                     PIC  X(001).
           03  ()売掛金債権手形譲渡基本契約日
                                     PIC  X(008).
           03  ()旧ユーザーコード
                                     PIC  X(008).
           03  ()転リース提携先コード
                                     PIC  X(003).
           03  ()借入先識別区分
                                     PIC  X(001).
           03  ()借入先種別          PIC  X(002).
           03  ()担保差入率          PIC S9(003).
