      *****************************************************************
      *   入金消込管理(D57NKK_TBL)
      *****************************************************************
           03  ()消込通番            PIC  X(011).
           03  ()レコード区分        PIC  X(001).
           03  ()消込年月日          PIC  X(008).
           03  ()消込時刻            PIC  X(008).
           03  ()消込担当者          PIC  X(020).
           03  ()仕訳短縮コード
                                     PIC  X(002).
           03  ()摘要                PIC  X(080).
           03  ()消込取消区分        PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
