      *****************************************************************
      *   管理与信展開(D852KRT_TBL)
      *****************************************************************
           03  ()与信管理先コード
                                     PIC  X(009).
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()連番                PIC S9(003).
           03  ()展開年月            PIC  X(006).
           03  ()展開日付            PIC  X(002).
           03  ()入金フラグ          PIC  X(002).
           03  ()展開支払回数
                                     PIC  X(003).
           03  ()実リース料          PIC S9(013).
           03  ()利息額              PIC S9(013).
           03  ()元本内入            PIC S9(013).
           03  ()元本残              PIC S9(013).
           03  ()債権残              PIC S9(013).
           03  ()諸費用              PIC S9(013).
           03  ()約定利率            PIC S9(003)V9(008).
           03  ()事故後入金          PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
