      *****************************************************************
      *   回収履歴(D41KAI_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数        PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()請求区分            PIC  X(001).
           03  ()請求連番            PIC S9(003).
           03  ()回収連番            PIC S9(003).
           03  ()請求区分枝番        PIC  X(001).
           03  ()消込通番            PIC  X(011).
           03  ()消込回数            PIC S9(003).
           03  ()収入予定日          PIC  X(008).
           03  ()入金日              PIC  X(008).
           03  ()回収方法            PIC  X(001).
           03  ()入金科目            PIC  X(005).
           03  ()入金額              PIC S9(013).
           03  ()入金額消費税        PIC S9(013).
           03  ()振込手数料          PIC S9(013).
           03  ()入金種類            PIC  X(001).
           03  ()仮受金番号          PIC  X(015).
           03  ()エントリ日          PIC  X(008).
           03  ()取引先コード        PIC  X(009).
           03  ()一括入金コード
                                     PIC  X(005).
           03  ()銀行コード          PIC  X(004).
           03  ()支店コード          PIC  X(003).
           03  ()口座種類            PIC  X(001).
           03  ()口座番号            PIC  X(010).
           03  ()入金区分            PIC  X(002).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()督促段階            PIC  X(001).
           03  ()督促処理年月日
                                     PIC  X(008).
           03  ()費目                PIC  X(001).
           03  ()当社他社識別        PIC  X(001).
           03  ()返金経路            PIC  X(001).
           03  ()入返金区分          PIC  X(001).
           03  ()他社入金額          PIC S9(013).
           03  ()協調転区分          PIC  X(001).
           03  ()主契約区分          PIC  X(001).
           03  ()仮受金処理済フラグ
                                     PIC  X(001).
           03  ()主－請求区分        PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()元本入金額          PIC S9(013).
           03  ()利息入金額          PIC S9(013).
           03  ()回収履歴区分        PIC  X(001).
           03  ()消込対象額          PIC S9(013).
           03  ()消込対象額消費税
                                     PIC S9(013).
           03  ()消込取消区分        PIC  X(001).
           03  ()消込時回収年月日
                                     PIC  X(008).
           03  ()消込時入金年月日
                                     PIC  X(008).
