      *****************************************************************
      *   変則払転(D343HTN_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()開始回              PIC S9(003).
           03  ()開始年月            PIC  X(006).
           03  ()終了回              PIC S9(003).
           03  ()終了年月            PIC  X(006).
           03  ()金額                PIC S9(013).
           03  ()消費税              PIC S9(013).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
