      *****************************************************************
      *   納付先一括変更(D805NHN_TBL)
      *****************************************************************
           03  ()ＳＥＱ              PIC S9(004).
           03  ()旧納付先コード
                                     PIC  X(006).
           03  ()旧納付先コード名
                                     PIC  X(040).
           03  ()新納付先コード
                                     PIC  X(006).
           03  ()新納付先コード名
                                     PIC  X(040).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()更新者              PIC  X(008).
