      *****************************************************************
      *   契約関連帳票発行管理テーブル(D631KEC_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC  X(002).
           03  ()徴求管理種類
                                     PIC  X(001).
           03  ()契約関連書類種類
                                     PIC S9(002).
           03  ()購入取引先コード
                                     PIC  X(009).
           03  ()購入先コード
                                     PIC  X(005).
           03  ()書類連番（徴求書類）
                                     PIC S9(003).
           03  ()発行済フラグ
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
