000010************************************************
000020* 支払情報（支払情報）(CPBIS045)
000030************************************************
000040    03  ()ＫＥＹ項目支払通番.
000050     05  ()経理                   PIC  X(9).
000060     05  ()枝番                   PIC S9(1).
000070    03  ()フラグ.
000080     05  ()フラグ－登録削除       PIC  X(1).
000090     05  ()フラグ－支払済         PIC  X(1).
000100     05  FILLER           PIC  X(2).
000110    03  ()システム情報.
000120     05  ()業務コード             PIC  X(3).
000130     05  ()入力非入力             PIC  X(1).
000140     05  ()支払通番               PIC  X(10).
000150     05  ()入力時間               PIC S9(6).
000160     05  ()端末番号               PIC  X(8).
000170     05  ()画面番号               PIC  X(4).
000180     05  ()オペレータ情報.
000190      07  ()担当者コード           PIC  X(4).
000200      07  ()所属事業所             PIC S9(4).
000210      07  ()姓カナ                 PIC  X(10).
000220     05  ()日付.
000230      07  ()入力日.
000240       09  ()入力日世紀             PIC  X(1).
000250       09  ()入力日年月日           PIC S9(6).
000260      07  ()登録日.
000270       09  ()登録日世紀             PIC  X(1).
000280       09  ()登録日年月日           PIC S9(6).
000290      07  ()取消日.
000300       09  ()取消日世紀             PIC  X(1).
000310       09  ()取消日年月日           PIC S9(6).
000320      07  ()取引日.
000330       09  ()取引日世紀             PIC  X(1).
000340       09  ()取引日年月日           PIC S9(6).
000350     05  ()データ区分.
000360      07  ()処理区分               PIC  X(1).
000370      07  ()取消通番               PIC  X(9).
000380     05  FILLER           PIC  X(3).
000390    03  ()事業所                 PIC  X(4).
000400     05  ()支払情報.
000410      07  ()支払方法               PIC  X(1).
000420      07  ()細区分コード           PIC  X(1).
000430      07  ()支払日.
000440       09  ()支払日－世紀           PIC S9(1).
000450       09  ()支払日－年月日         PIC  X(6).
000460      07  ()支払金額               PIC S9(13)  SIGN LEADING SEPARATE.
000470      07  ()仕向情報.
000480       09  ()仕向銀行コード         PIC S9(4).
000490       09  ()仕向支店コード         PIC S9(3).
000500       09  ()仕向預金種目           PIC S9(1).
000510       09  ()仕向口座番号           PIC S9(7).
000520      07  ()被向情報.
000530       09  ()銀行コード             PIC S9(4).
000540       09  ()支店コード             PIC S9(3).
000550       09  ()預金種目               PIC S9(1).
000560       09  ()口座番号               PIC S9(7).
000570       09  ()口座名義人             PIC  X(30).
000580    03  ()手形情報.
000590     05  ()手形期日.
000600      07  ()手形期日－世紀         PIC S9(1).
000610      07  ()手形期日－年月日       PIC  X(6).
000620     05  ()受渡コード             PIC  X(1).
000630     05  ()分割コード             PIC  X(1).
000640     05  ()総合コード             PIC  X(1).
000650     05  ()郵送先コード.
000660      07  ()郵便番号.
000670       09  ()郵便番号－親           PIC S9(3).
000680       09  ()郵便番号－子           PIC S9(4).
000690      07  ()郵送先情報.
000700       09  ()郵送先住所１           PIC  X(34).
000710       09  ()郵送先住所２           PIC  X(32).
000720       09  ()郵送先住所３           PIC  X(32).
000730      07  ()郵送先名.
000740       09  ()郵送先名１             PIC  X(28).
000750       09  ()郵送策名２             PIC  X(28).
000760    03  ()使途明細               PIC  X(46).
000770    03  ()相手先名               PIC  X(56).
000780    03  ()登録番号               PIC  X(4).
000790    03  ()手数料負担             PIC  X(1).
000800    03  ()支払先コード           PIC  X(4).
000810    03  FILLER           PIC  X(83).
000820    03  ()共通情報               PIC  X(35).
