000010************************************************
000020* 入金情報（入金情報）(CPBIS101)
000030************************************************
000040    03  ()ＫＥＹ項目入金通番     PIC S9(9).
000050    03  ()入金区分               PIC S9(1).
000060    03  ()入金元コード           PIC  X(8).
000070    03  ()入金額                 PIC S9(13)  SIGN LEADING SEPARATE.
000080    03  ()入金先名称             PIC  X(48).
000090    03  ()入金日.
000100     05  ()入金日－世紀           PIC S9(1).
000110     05  ()入金日－年月日         PIC  X(6).
000120    03  ()消込金額               PIC S9(13)  SIGN LEADING SEPARATE.
000130    03  ()銀行コード             PIC S9(7).
000140    03  ()口座番号               PIC S9(7).
000150    03  ()契約番号               PIC  X(9).
000160    03  ()再リースコード         PIC S9(1).
000170    03  ()消込日.
000180     05  ()消込日－世紀           PIC S9(1).
000190     05  ()消込日－年月日         PIC  X(6).
000200    03  ()消費税残高             PIC S9(13)  SIGN LEADING SEPARATE.
000210    03  ()ＲＡＴＥ               PIC S9(3)V9(2)  SIGN LEADING SEPARATE.
000220    03  ()外貨金額               PIC S9(11)V9(2)  SIGN LEADING SEPARATE.
000230    03  ()入金銀行短縮コード     PIC S9(2).
000240    03  ()入金仕分短縮コード     PIC S9(2).
000250    03  FILLER           PIC  X(24).
000260    03  ()共通情報               PIC  X(35).
