000010************************************************
000020* 総合振込データ(ヘッダーレコード)(CPBIS197)
000030************************************************
000040    03  ()データ区分             PIC  X(1).
000050    03  ()識別ＣＤ               PIC  X(2).
000060    03  ()計算方式               PIC  X(1).
000070    03  ()振込依頼人ＣＤ         PIC  X(10).
000080    03  ()振込依頼人名           PIC  X(40).
000090    03  ()取組日－月             PIC  X(2).
000100    03  ()取組日－日             PIC  X(2).
000110    03  ()銀行ＣＤ               PIC  X(4).
000120    03  ()銀行名                 PIC  X(15).
000130    03  ()支店ＣＤ               PIC  X(3).
000140    03  ()支店名                 PIC  X(15).
000150    03  ()預金種目               PIC  X(1).
000160    03  ()口座番号               PIC  X(7).
000170    03  FILLER           PIC  X(17).
