000010************************************************
000020* コードマスタ(共通)(CPBIS007)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード.
000060      07  ()タイプ                 PIC  X(1).
000070      07  ()レコード種別           PIC  X(3).
000080     05  ()キー項目部             PIC  X(11).
000090    03  ()適用範囲                          OCCURS 5.
000100     05  ()適用年月日ＦＲＯＭ.
000110      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000120      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000130     05  ()データ項目部           PIC  X(23).
000140    03  ()共通情報               PIC  X(35).
