000010************************************************
000020* 当日取引(ﾘｱﾙ)（当日取引(業務))(CPBIS094)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()処理通番.
000060      07  ()業務識別コード１       PIC  X(4).
000070      07  ()一連番号１             PIC S9(5).
000080      07  ()枝番１                 PIC S9(1).
000090    03  ()フラグ.
000100     05  ()登録削除               PIC  X(1).
000110     05  ()帳票出力               PIC  X(1).
000120     05  FILLER           PIC  X(2).
000130    03  FILLER           PIC  X(2).
000140    03  ()システム情報.
000150     05  ()業務コード             PIC  X(3).
000160     05  ()入力非入力             PIC  X(1).
000170     05  ()処理通番.
000180      07  ()業務識別コード２       PIC  X(4).
000190      07  ()一連番号２             PIC S9(5).
000200      07  ()枝番２                 PIC S9(1).
000210     05  ()入力時間               PIC S9(6)  SIGN LEADING SEPARATE.
000220     05  ()端末番号               PIC  X(8).
000230     05  ()画面番号               PIC  X(4).
000240     05  ()オペレータ情報.
000250      07  ()担当者コード           PIC  X(4).
000260      07  ()所属事業所             PIC S9(4)  SIGN LEADING SEPARATE.
000270      07  ()姓カナ                 PIC  X(10).
000280     05  ()日付.
000290      07  ()入力日                 PIC  X(8).
000300      07  ()取引日                 PIC  X(8).
000310      07  ()バリュー日             PIC  X(8).
000320      07  ()当初取引日             PIC  X(8).
000330     05  ()データ区分.
000340      07  ()処理区分               PIC  X(1).
000350      07  ()取消通番.
000360       09  ()事業所１               PIC  X(4).
000370       09  ()一連番号３             PIC S9(5).
000380     05  FILLER           PIC  X(3).
000390    03  ()事業所２               PIC  X(4).
000400    03  ()科目数.
000410     05  ()借方個数               PIC S9(1).
000420     05  ()貸方個数               PIC S9(1).
000430    03  ()仕訳コード             PIC  X(4).
000440    03  ()科目情報                          OCCURS 9.
000450     05  ()幣種                   PIC  X(3).
000460     05  ()貸借.
000470      07  ()ログタイプ             PIC  X(1).
000480      07  ()ＳＥＱＮＯ             PIC S9(2).
000490     05  ()管販費コード           PIC S9(3).
000500     05  ()外貨金額               PIC S9(12)V9(2)  SIGN LEADING SEPARATE.
000510     05  ()ＥＸ区分               PIC  X(4).
000520     05  ()換算レート             PIC S9(4)V9(2)  SIGN LEADING SEPARATE.
000530     05  ()円貨金額               PIC S9(13)  SIGN LEADING SEPARATE.
000540     05  ()対価ＦＩＸ             PIC  X(1).
000550     05  ()口座番号               PIC  X(8).
000560     05  ()課税コード             PIC S9(3).
000570     05  ()口座主管事業所         PIC  X(4).
000580     05  ()ＲＥＦＮＯ             PIC  X(16).
000590     05  ()摘要                   PIC  X(35).
000600     05  ()始期.
000610      07  ()始期－世紀             PIC S9(1).
000620      07  ()始期－年月日           PIC S9(6).
000630     05  ()終期.
000640      07  ()終期－世紀             PIC S9(1).
000650      07  ()終期－年月日           PIC S9(6).
000660     05  ()利率                   PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
000670     05  ()片端両端区分           PIC  X(1).
000680     05  ()前取後取区分           PIC  X(1).
000690     05  ()利率基数               PIC  X(1).
000700     05  FILLER           PIC  X(7).
000710    03  ()消費税率               PIC S9(3)V9(1).
000720    03  FILLER           PIC  X(31).
000730    03  ()共通情報               PIC  X(35).
