000010************************************************
000020* ‰¼Žó‹àŽc‚Æ‰ïƒtƒ@ƒCƒ‹(Ä’è‹`)(CPBIS143)
000030************************************************
000040    03  ()ƒvƒ‰ƒCƒ}ƒŠ[‚j‚d‚x‚Q.
000050     05  ()“ü‹à’Ê”Ô‚Q             PIC  X(9).
000060    03  ()“ü‹à‹æ•ª‚Q             PIC S9(1).
000070    03  ()“ü‹àæ‚b‚c‚Q           PIC  X(8).
000080    03  ()‚j‚d‚x|‚h‚s‚d‚l|‚q.
000090     05  FILLER           PIC  X(20).
000100     05  ()ƒIƒ‹ƒ^ƒl[ƒg‚j‚d‚x‚R.
000110      07  FILLER           PIC  X(30).
000120      07  ()“ü‹àŠz‚Q               PIC S9(12)  SIGN LEADING SEPARATE.
000130      07  FILLER           PIC  X(8).
000140     05  ()“ü‹à‚RƒGƒŠƒA.
000150      07  FILLER           PIC  X(30).
000160      07  ()“ü‹à“ú‚R               PIC  X(8).
000170      07  ()“ü‹àŠz‚R               PIC  X(12).
000180    03  ()“ü‹àæ–¼|•ÒW‘O‚Q     PIC  X(48).
000190    03  ()Áž‹àŠz‚Q             PIC S9(13)  SIGN LEADING SEPARATE.
000200    03  ()‹âs‚b‚c‚Q             PIC S9(7).
000210    03  ()ŒûÀ”Ô†‚Q             PIC S9(7).
000220    03  ()Œ_–ñ‚m‚n‚Q             PIC  X(9).
000230    03  ()ÄƒŠ[ƒX‚b‚c‚Q         PIC S9(1).
000240    03  ()Áž“ú‚Q               PIC  X(8).
000250    03  ()ÁžŽc‚‚Q             PIC S9(13)  SIGN LEADING SEPARATE.
000260    03  ()‚q‚`‚s‚d‚Q             PIC S9(3)V9(2)  SIGN LEADING SEPARATE.
000270    03  ()ŠO‰Ý‹àŠz‚Q             PIC S9(11)V9(2)  SIGN LEADING SEPARATE.
000280    03  ()“ü‹à‹âs’Zk‚b‚c‚Q     PIC S9(2).
000290    03  ()“ü‹àŽd–ó’Zk‚b‚c‚Q     PIC S9(2).
000300    03  FILLER           PIC  X(52).
