000010************************************************
000020* ˆ—’Ê”Ô(M—p•ÛŒ¯’Ê’m‘”Ô†)(CPBIS073)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()‚j‚d‚x‚P               PIC  X(4).
000060     05  FILLER           PIC  X(6).
000070    03  ()ˆ—’Ê”Ô               PIC S9(5).
000080    03  FILLER           PIC  X(50).
000090    03  ()‹¤’Êî•ñ               PIC  X(35).
