000010************************************************
000020* コントロールデータ再リース付保率(CPBIS132)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別                   PIC  X(7).
000060     05  ()種別                   PIC  X(1).
000070     05  ()ＳＥＱ                 PIC S9(3).
000080     05  FILLER           PIC  X(4).
000090    03  ()データ部.
000100     05  ()請求先コード           PIC  X(8).
000110     05  FILLER           PIC  X(1).
000120     05  ()付保率.
000130      07  ()付保率１               PIC  X(2).
000140      07  FILLER           PIC  X(1).
000150      07  ()付保率２               PIC  X(2).
000160      07  FILLER           PIC  X(1).
000170      07  ()付保率３               PIC  X(2).
000180      07  FILLER           PIC  X(1).
000190      07  ()付保率４               PIC  X(2).
000200      07  FILLER           PIC  X(1).
000210      07  ()付保率５               PIC  X(2).
000220      07  FILLER           PIC  X(1).
000230     05  FILLER           PIC  X(1).
000240     05  ()対象資産情報.
000250      07  ()対象資産コード１       PIC  X(7).
000260      07  FILLER           PIC  X(1).
000270      07  ()対象資産コード２       PIC  X(7).
000280      07  FILLER           PIC  X(1).
000290      07  ()対象資産コード３       PIC  X(7).
000300      07  FILLER           PIC  X(1).
000310     05  FILLER           PIC  X(13).
