000010************************************************
000020* 三洋振分後満了データ(CPBIS180)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()ＢＯＴＬ契約ＮＯ       PIC  X(9).
000060     05  ()ＢＯＴＬ物件ＮＯ       PIC  X(3).
000070    03  ()再リースＣＤ           PIC  X(1).
000080    03  ()リース終了日.
000090     05  ()リース終了日－世紀     PIC  X(1).
000100     05  ()リース終了日－年月日   PIC  X(6).
000110    03  ()数量解約前             PIC S9(4)  SIGN LEADING SEPARATE.
000120    03  ()数量解約分             PIC S9(4)  SIGN LEADING SEPARATE.
000130    03  ()個別リース料解約前     PIC S9(13)  SIGN LEADING SEPARATE.
000140    03  ()購入金額解約前         PIC S9(13)  SIGN LEADING SEPARATE.
000150    03  ()資産処分ＣＤ           PIC  X(1).
000160    03  FILLER           PIC  X(57).
