000010************************************************
000020* シャープ解約（ＢＯＴＬ基本）(CPBIS024)
000030************************************************
000040    03  ()エントリーＫＥＹ.
000050     05  ()ＢＯＴＬ契約ＮＯ       PIC  X(9).
000060    03  ()事業所コード           PIC S9(4).
000070    03  ()ユーザーコード         PIC  X(8).
000080    03  ()請求先コード           PIC  X(8).
000090    03  ()事業所名               PIC  X(20).
000100    03  ()ユーザー名             PIC  X(20).
000110    03  ()契約日.
000120     05  ()契約日－世紀           PIC S9(1).
000130     05  ()契約日－年月日         PIC  X(6).
000140    03  ()リース開始日.
000150     05  ()リース開始日－世紀     PIC S9(1).
000160     05  ()リース開始日－年月日   PIC  X(6).
000170    03  ()リース終了日.
000180     05  ()リース終了日－世紀     PIC S9(1).
000190     05  ()リース終了日－年月日   PIC  X(6).
000200    03  ()リース期間             PIC S9(3).
000210    03  ()契約金額               PIC S9(13)  SIGN LEADING SEPARATE.
000220    03  ()前受リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000230    03  ()前渡金利息額           PIC S9(13)  SIGN LEADING SEPARATE.
000240    03  ()固定資産税月額         PIC S9(13)  SIGN LEADING SEPARATE.
000250    03  ()保険料月額             PIC S9(13)  SIGN LEADING SEPARATE.
000260    03  ()購入金額合計           PIC S9(13)  SIGN LEADING SEPARATE.
000270    03  ()数量合計               PIC S9(5).
000280    03  ()基本利回り             PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000290    03  ()実質利回り             PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000300    03  ()社内金利               PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000310    03  ()設置期間               PIC S9(3).
000320    03  ()ＢＥＧＩＮ回数         PIC S9(1).
000330    03  ()支払回数               PIC S9(3).
000340    03  ()第1回リース料入金日.
000350     05  ()第1回リース料入金日－世紀 PIC S9(1).
000360     05  ()第1回リース料入金日－年月日 PIC  X(6).
000370    03  ()入金日                 PIC S9(2).
000380    03  ()消費税率               PIC S9(3)V9(1).
000390    03  ()残月数                 PIC S9(3).
000400    03  ()前受月数               PIC S9(3).
000410    03  ()前受残月数             PIC S9(3).
000420    03  ()最新入力消費税率       PIC S9(3)V9(1).
000430    03  FILLER           PIC  X(11).
000440    03  ()支払回数番号           PIC S9(4).
000450    03  ()実リース料基本         PIC S9(13)  SIGN LEADING SEPARATE.
000460    03  ()元本内入               PIC S9(13)  SIGN LEADING SEPARATE.
000470    03  ()元本残                 PIC S9(13)  SIGN LEADING SEPARATE.
000480    03  ()債権残基本             PIC S9(13)  SIGN LEADING SEPARATE.
000490    03  ()前受充当表示           PIC S9(1).
000500    03  FILLER           PIC  X(32).
000510    03  ()共通情報               PIC  X(35).
