000010************************************************
000020* ˆ—’Ê”Ô(Žx•¥ŽèŒ`ŠÇ—‡‚)(CPBIS069)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()‚j‚d‚x‚P               PIC  X(2).
000060     05  ()”­s‹æ•ª               PIC  X(1).
000070     05  ()Šúƒtƒ‰ƒO               PIC  X(1).
000080     05  FILLER           PIC  X(6).
000090    03  ()UoŠú                 PIC S9(2).
000100    03  ()ŠÇ—”Ô†               PIC S9(5).
000110    03  FILLER           PIC  X(48).
000120    03  ()‹¤’Êî•ñ               PIC  X(35).
