000010************************************************
000020* 借入金管理（借入金管理№）(CPBIS053)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()管理ＮＯ               PIC  X(7).
000060    03  ()フラグ.
000070     05  ()登録削除               PIC  X(1).
000080     05  FILLER           PIC  X(4).
000090    03  ()最新枝番               PIC S9(2).
000100    03  FILLER           PIC  X(51).
000110    03  ()共通情報               PIC  X(35).
