000010************************************************
000020* 東芝先日付データファイル(CPBIS198)
000030************************************************
000040    03  ()契約ＮＯ               PIC  X(9).
000050    03  ()物件ＮＯ               PIC  X(3).
000060    03  ()リース終了日－世紀     PIC  X(1).
000070    03  ()リース終了日－年月日   PIC  X(6).
000080    03  ()データ区分             PIC  X(2).
000090    03  ()会員番号               PIC  X(16).
000100    03  ()資産番号               PIC  X(9).
000110    03  ()一部部分区分           PIC  X(1).
000120    03  ()再リース－請求金額合計 PIC S9(13)  SIGN LEADING SEPARATE.
000130    03  ()再リース－購入金額解約分 PIC S9(13)  SIGN LEADING SEPARATE.
000140    03  ()再リース－請求消費税額 PIC S9(13)  SIGN LEADING SEPARATE.
000150    03  ()満了－数量解約分       PIC S9(4)  SIGN LEADING SEPARATE.
000160    03  ()満了－個別リース料     PIC S9(13)  SIGN LEADING SEPARATE.
000170    03  ()満了－購入金額解約分   PIC S9(13)  SIGN LEADING SEPARATE.
000180    03  ()満了－資産処分ＣＤ     PIC  X(1).
000190    03  ()満了－売却額           PIC S9(13)  SIGN LEADING SEPARATE.
000200    03  ()満了－売却事務代行手数料 PIC S9(13)  SIGN LEADING SEPARATE.
000210    03  FILLER           PIC  X(11).
000220    03  ()処理日－世紀           PIC  X(1).
000230    03  ()処理日－年月日         PIC  X(6).
