000000******************************************************
000000* ファイル名   ： 取引先マスター（企業レコード）
000000* ファイルＩＤ ： LTRTRK
000000* 種別         ： SUMMIT
000000*
000000* ＣＯＰＹＩＤ ： CPBIS057
000000* 作成日       ： 2004/05/13
000000* 作成者       ： 中間
000000*
000000* 更新日       ： ****/**/**
000000* 更新者       ： ＊＊＊＊
000000*
000000* 備考         ：
000000*
000000******************************************************
          03     ()KEY取引先コード                  PIC X(008).
          03     ()業種レコード                     PIC X(002).
          03     ()大企業コード                     PIC X(001).
          03     ()クラス                           PIC X(002).
          03     ()設立日世紀                       PIC X(001).
          03     ()設立日設立日                     PIC X(006).
          03     ()決算日                           PIC 9(002).
          03     ()上場・非上場区分                 PIC X(001).
          03     ()電話番号                         PIC X(015).
          03     ()資本金符号桁                     PIC X(001).
          03     ()資本金                           PIC 9(013).
          03     ()与信限度単位百万                 PIC 9(006).
          03     ()業績過去３期分前年度業績決算期    PIC 9(003).
          03     ()業績過去３期分前年度業績決算年度世紀   PIC X(001).
          03     ()業績過去３期分前年度業績決算年度  PIC X(004).
          03     ()業績過去３期分前年度業績売上符号桁PIC X(001).
          03     ()業績過去３期分前年度業績売上      PIC 9(013).
          03     ()業績過去３期分前年度業績経常利益符号桁 PIC X(001).
          03     ()業績過去３期分前年度業績経常利益  PIC 9(013).
          03     ()業績過去３期分前年度業績当期利益符号桁 PIC X(001).
          03     ()業績過去３期分前年度業績当期利益  PIC 9(013).
          03     ()業績過去３期分前年度業績申告所得符号桁 PIC X(001).
          03     ()業績過去３期分前年度業績申告所得  PIC 9(013).
          03     ()業績過去３期分前々年度業績決算期  PIC 9(003).
          03     ()業績過去３期分前々年度業績決算年度世紀 PIC X(001).
          03     ()業績過去３期分前々年度業績決算年度PIC X(004).
          03     ()業績過去３期分前々年度業績売上符号桁   PIC X(001).
          03     ()業績過去３期分前々年度業績売上    PIC 9(013).
          03     ()業績過去３期分前々年度業績経常利益符号桁  PIC X(001).
          03     ()業績過去３期分前々年度業績経常利益PIC 9(013).
          03     ()業績過去３期分前々年度業績当期利益符号桁  PIC X(001).
          03     ()業績過去３期分前々年度業績当期利益PIC 9(013).
          03     ()業績過去３期分前々年度業績申告所得符号桁  PIC X(001).
          03     ()業績過去３期分前々年度業績申告所得PIC 9(013).
          03     ()業績過去３期分前々々年度業績決算期PIC 9(003).
          03     ()業績過去３期分前々々年度業績決算年度世紀  PIC X(001).
          03     ()業績過去３期分前々々年度業績決算年度      PIC X(004).
          03     ()業績過去３期分前々々年度業績売上符号桁    PIC X(001).
          03     ()業績過去３期分前々々年度業績売上  PIC 9(013).
          03     ()業績過去３期分前々々年度業績経常利益符号桁  PIC X(001).
          03     ()業績過去３期分前々々年度業績経常利益      PIC 9(013).
          03     ()業績過去３期分前々々年度業績当期利益符号桁  PIC X(001).
          03     ()業績過去３期分前々々年度業績当期利益      PIC 9(013).
          03     ()業績過去３期分前々々年度業績申告所得符号桁  PIC X(001).
          03     ()業績過去３期分前々々年度業績申告所得      PIC 9(013).
          03     ()外部情報帝国データバンクコード   PIC 9(009).
          03     ()外部情報長銀コード               PIC 9(005).
          03     ()外部情報東銀名簿コード           PIC 9(006).
          03     ()外部情報東銀取引先               PIC 9(003).
          03     ()外部情報東銀取引先コード         PIC 9(008).
          03     ()外部情報格付格付け１             PIC X(002).
          03     ()外部情報格付格付け２             PIC X(001).
          03     ()外部情報情報交換通知区分         PIC X(001).
          03     FILLER                             PIC X(079).
          03     ()共通情報                         PIC X(035).
