000010************************************************
000020* 当日取引(経理)（当日取引(会計))(CPBIS096)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()処理通番.
000060      07  ()事業所１               PIC  X(4).
000070      07  ()一連番号１             PIC S9(5).
000080      07  ()枝番１                 PIC S9(1).
000090    03  ()フラグ.
000100     05  ()登録削除               PIC  X(1).
000110     05  ()帳票出力               PIC  X(1).
000120     05  FILLER           PIC  X(2).
000130    03  ()レコード種別           PIC S9(2).
000140    03  ()システム情報.
000150     05  ()業務番号               PIC  X(3).
000160     05  ()入力非入力             PIC  X(1).
000170     05  ()処理通番.
000180      07  ()事業所２               PIC  X(4).
000190      07  ()一連番号２             PIC S9(5).
000200      07  ()枝番２                 PIC S9(1).
000210     05  ()入力時間               PIC S9(6)  SIGN LEADING SEPARATE.
000220     05  ()端末番号               PIC  X(8).
000230     05  ()画面番号               PIC  X(4).
000240     05  ()オペレータ情報.
000250      07  ()担当者コード           PIC  X(4).
000260      07  ()所属事業所             PIC S9(4)  SIGN LEADING SEPARATE.
000270      07  ()姓カナ                 PIC  X(10).
000280     05  ()日付.
000290      07  ()入力日                 PIC  X(8).
000300      07  ()取引日                 PIC  X(8).
000310      07  ()バリュー日             PIC  X(8).
000320      07  ()当初取引日             PIC  X(8).
000330     05  ()データ区分.
000340      07  ()処理区分               PIC  X(1).
000350      07  ()取消通番.
000360       09  ()事業所３               PIC  X(4).
000370       09  ()一連番号３             PIC S9(5).
000380      07  ()自動仕訳               PIC  X(1).
000390     05  FILLER           PIC  X(2).
000400    03  ()事業所                 PIC  X(4).
000410    03  ()科目数.
000420     05  ()借方個数               PIC S9(1).
000430     05  ()貸方個数               PIC S9(1).
000440    03  ()借方科目情報.
000450     05  ()借方科目                          OCCURS 4.
000460      07  ()借方幣種               PIC  X(3).
000470      07  ()借方勘定科目.
000480       09  ()借方科目コード         PIC S9(3).
000490       09  ()借方取引コード         PIC S9(2).
000500      07  ()借方ログタイプ         PIC  X(1).
000510      07  ()借方科目タイプ         PIC  X(1).
000520      07  ()借方外貨金額           PIC S9(12)V9(2)  SIGN LEADING SEPARATE.
000530      07  ()借方ＥＸ区分           PIC  X(4).
000540      07  ()借方換算レート         PIC S9(4)V9(2)  SIGN LEADING SEPARATE.
000550      07  ()借方円貨金額           PIC S9(13)  SIGN LEADING SEPARATE.
000560      07  ()借方対価ＦＩＸ         PIC  X(1).
000570      07  ()借方口座番号           PIC  X(8).
000580      07  ()借方課税コード         PIC S9(3).
000590      07  ()借方ＲＥＦＮＯ         PIC  X(16).
000600      07  ()借方口座主管事業所     PIC S9(4)  SIGN LEADING SEPARATE.
000610      07  ()借方消費税率           PIC S9(3).
000620      07  ()借方ダミー             PIC  X(1).
000630     05  ()借方摘要               PIC  X(35).
000640     05  FILLER           PIC  X(15).
000650    03  ()貸方科目情報.
000660     05  ()貸方科目                          OCCURS 4.
000670      07  ()貸方幣種               PIC  X(3).
000680      07  ()貸方勘定科目.
000690       09  ()貸方科目コード         PIC S9(3).
000700       09  ()貸方取引コード         PIC S9(2).
000710      07  ()貸方ログタイプ         PIC  X(1).
000720      07  ()貸方科目タイプ         PIC  X(1).
000730      07  ()貸方外貨金額           PIC S9(12)V9(2)  SIGN LEADING SEPARATE.
000740      07  ()貸方ＥＸ区分           PIC  X(4).
000750      07  ()貸方換算レート         PIC S9(4)V9(2)  SIGN LEADING SEPARATE.
000760      07  ()貸方円貨金額           PIC S9(13)  SIGN LEADING SEPARATE.
000770      07  ()貸方対価ＦＩＸ         PIC  X(1).
000780      07  ()貸方口座番号           PIC  X(8).
000790      07  ()貸方課税コード         PIC S9(3).
000800      07  ()貸方ＲＥＦＮＯ         PIC  X(16).
000810      07  ()貸方口座主管事業所     PIC S9(4)  SIGN LEADING SEPARATE.
000820      07  ()貸方消費税率           PIC S9(3).
000830      07  ()貸方ダミー             PIC  X(1).
000840     05  ()貸方摘要               PIC  X(34).
000850     05  FILLER           PIC  X(15).
000860    03  ()主取引料.
000870     05  ()幣種                   PIC  X(3).
000880     05  ()勘定科目.
000890      07  ()科目コード             PIC S9(3).
000900      07  ()取引コード             PIC S9(2).
000910     05  ()ログタイプ             PIC  X(1).
000920     05  ()科目タイプ             PIC  X(1).
000930     05  ()外貨金額               PIC S9(12)V9(2)  SIGN LEADING SEPARATE.
000940     05  ()ＥＸ区分               PIC  X(4).
000950     05  ()換算レート             PIC S9(4)V9(2)  SIGN LEADING SEPARATE.
000960     05  ()円貨金額               PIC S9(13)  SIGN LEADING SEPARATE.
000970     05  ()対価ＦＩＸ             PIC  X(1).
000980     05  ()口座番号               PIC  X(8).
000990     05  ()課税コード             PIC S9(3).
001000     05  ()ＲＥＦＮＯ             PIC  X(16).
001010     05  ()口座主管事業所         PIC S9(4)  SIGN LEADING SEPARATE.
001020     05  ()消費税率               PIC S9(3).
001030     05  FILLER           PIC  X(1).
001040     05  ()摘要                   PIC  X(34).
001050     05  ()始期.
001060      07  ()始期－世紀             PIC S9(1).
001070      07  ()始期－年月日           PIC S9(6).
001080     05  ()終期.
001090      07  ()終期－世紀             PIC S9(1).
001100      07  ()終期－年月日           PIC S9(6).
001110     05  ()利率                   PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
001120     05  ()片端両端区分           PIC  X(1).
001130     05  ()前取後取区分           PIC  X(1).
001140     05  ()利率基数               PIC  X(1).
001150    03  FILLER           PIC  X(15).
001160    03  ()共通情報               PIC  X(35).
