000010************************************************
000020* 処理通番(三洋成約)(CPBIS067)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()ＫＥＹ１               PIC  X(4).
000060     05  FILLER           PIC  X(6).
000070    03  ()契約番号               PIC  X(9).
000080    03  ()前月度.
000090     05  ()前月度－世紀           PIC S9(1).
000100     05  ()前月度－年月日         PIC S9(6).
000110    03  FILLER           PIC  X(39).
000120    03  ()共通情報               PIC  X(35).
