000010************************************************
000020* ‚r‚e‚b–ž—¹—\’è(‚r‚e‚bŠî–{)(CPBIS002)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()‚a‚n‚s‚kŒ_–ñ‚m‚n       PIC  X(9).
000060    03  ()‚j‚d‚x.
000070     05  ()‚r‚e‚bŒ_–ñ‚m‚n         PIC  X(12).
000080    03  ()‚r‚e‚bŒ_–ñ‚m‚n‚l‚s     PIC  X(12).
000090    03  ()XV‹æ•ª               PIC S9(1).
000100    03  ()ˆ—‹æ•ª               PIC  X(1).
000110    03  ()ˆ—Œ‹‰Ê.
000120     05  ()ˆ—Œ‹‰ÊÄƒŠ[ƒX       PIC  X(1).
000130     05  ()ˆ—Œ‹‰Ê“]”„           PIC  X(1).
000140     05  ()ˆ—Œ‹‰Ê”pŠü           PIC  X(1).
000150    03  ()V‚r‚e‚bŒ_–ñ‚m‚n       PIC  X(12).
000160    03  FILLER           PIC  X(5).
000170    03  ()‰ïŽÐƒR[ƒh             PIC  X(2).
000180    03  ()‰ïŽÐ–¼                 PIC  X(30).
000190    03  ()Žx“XƒR[ƒh             PIC  X(2).
000200    03  ()Žx“X–¼                 PIC  X(20).
000210    03  ()‚a‚n‚s‚kî•ñ.
000220     05  ()‚a‚n‚s‚kÝ’uêŠ–¼     PIC  X(20).
000230     05  ()‚a‚n‚s‚kÄƒŠ[ƒX—¿‡Œv PIC S9(13)  SIGN LEADING SEPARATE.
000240     05  ()‚a‚n‚s‚kÄƒŠ[ƒXÁ”ïÅ PIC S9(11)  SIGN LEADING SEPARATE.
000250     05  FILLER           PIC  X(17).
000260    03  ()‚r‚e‚bî•ñ.
000270     05  ()‚r‚e‚bÝ’uêŠ–¼       PIC  X(25).
000280     05  ()‚r‚e‚bÄƒŠ[ƒX—¿‡Œv   PIC S9(13)  SIGN LEADING SEPARATE.
000290     05  ()‚r‚e‚bÄƒŠ[ƒXÁ”ïÅ   PIC S9(11)  SIGN LEADING SEPARATE.
000300     05  FILLER           PIC  X(17).
000310    03  FILLER           PIC  X(37).
000320    03  ()w“ü‹àŠz‡Œv           PIC S9(13)  SIGN LEADING SEPARATE.
000330    03  ()”„‹p‹àŠz               PIC S9(13)  SIGN LEADING SEPARATE.
000340    03  ()”„‹p‹àÁ”ïÅ           PIC S9(11)  SIGN LEADING SEPARATE.
000350    03  ()‹¤’Êî•ñ               PIC  X(35).
