000010************************************************
000020* ˆ—’Ê”Ô(“ü‹à’Ê”Ô)(CPBIS076)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()‚j‚d‚x‚P               PIC  X(2).
000060     05  ()‚j‚d‚x‚Q               PIC  X(8).
000070    03  ()Ì”Ô“ú.
000080     05  ()ŒŽ                     PIC S9(2).
000090     05  ()“ú                     PIC S9(2).
000100     05  ()”N                     PIC S9(1).
000110    03  ()ˆê˜A”Ô†               PIC S9(4).
000120    03  FILLER           PIC  X(46).
000130    03  ()‹¤’Êî•ñ               PIC  X(35).
