000010************************************************
000020* 処理通番(支払承認№)(CPBIS070)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()ＫＥＹ１               PIC  X(2).
000060     05  ()ＫＥＹ２.
000070      07  ()サブシステム区分       PIC  X(1).
000080      07  FILLER           PIC  X(7).
000090    03  ()一連番号採番用         PIC S9(5).
000100    03  FILLER           PIC  X(50).
000110    03  ()共通情報               PIC  X(35).
