000010************************************************
000020* Ì§¸ÀØÝ¸Þi”„Š|ÂŒ j(CPBIS029)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()Œ_–ñ”Ô†               PIC  X(9).
000060    03  ()—˜‘§Šú“ú               PIC  X(7).
000070    03  ()‰ñŽû•û–@               PIC S9(1).
000080    03  ()‘ã—‰ñŽû‹æ•ª           PIC S9(1).
000090    03  ()ŠúŠÔ“ú”               PIC S9(4)  SIGN LEADING SEPARATE.
000100    03  ()”ƒŽæ‹àŠz               PIC S9(13)  SIGN LEADING SEPARATE.
000110    03  ()Š„ˆø—¿                 PIC S9(13)  SIGN LEADING SEPARATE.
000120    03  ()Š„ˆø—¦                 PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000130    03  ()ŽóŽæŽè”—¿             PIC S9(13)  SIGN LEADING SEPARATE.
000140    03  ()ŽóŽæŽè”—¿Á”ïÅ“™Šz   PIC S9(13)  SIGN LEADING SEPARATE.
000150    03  ()”ƒ–ß—\’è“ú             PIC  X(7).
000160    03  ()”ƒŽæ‘ã‹àŽx•¥“ú         PIC  X(7).
000170    03  ()ÂŒ •\Ž¦               PIC  X(60).
000180    03  ()ŠúŒÀ‘OŒˆÙî•ñ.
000190     05  ()ŠúŒÀ‘OŒˆÙ“ú           PIC  X(7).
000200     05  ()–ß‚µ—˜‘§Šz             PIC S9(13)  SIGN LEADING SEPARATE.
000210     05  ()–ß‚µ—˜—¦               PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000220     05  ()–ß‚µ“ú”               PIC S9(4)  SIGN LEADING SEPARATE.
000230     05  ()–ß‚µ—˜‘§‘ŠŽE‹æ•ª       PIC S9(1).
000240     05  ()•ÔÏŽè”—¿             PIC S9(13)  SIGN LEADING SEPARATE.
000250     05  ()•ÔÏŽè”—¿Á”ïÅ“™Šz   PIC S9(13)  SIGN LEADING SEPARATE.
000260    03  ()—\”õ                   PIC  X(40).
