000010************************************************
000020* 資産（固定資産申告）(CPBIS047)
000030************************************************
000040    03  ()物件番号.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()物件ＮＯ               PIC S9(3).
000070     05  ()解約区分               PIC  X(1).
000080     05  ()再生区分               PIC  X(1).
000090    03  ()納付先コード           PIC  X(6).
000100    03  ()税区分                 PIC S9(1).
000110    03  ()税負担区分             PIC  X(1).
000120    03  ()耐用年数短縮区分       PIC  X(1).
000130    03  ()移動情報.
000140     05  ()移動情報－移動区分     PIC  X(1).
000150     05  ()移動情報－世紀         PIC S9(1).
000160     05  ()移動情報－年月日       PIC  X(6).
000170    03  FILLER           PIC  X(10).
000180    03  ()償却資産税申告.
000190     05  ()特例.
000200      07  ()特例－期間             PIC S9(2).
000210      07  ()特例－率.
000220       09  ()特例－分子             PIC S9(2).
000230       09  ()特例－分母             PIC S9(3).
000240     05  ()年税額                 PIC S9(13)  SIGN LEADING SEPARATE.
000250     05  ()前年度評価額           PIC S9(13)  SIGN LEADING SEPARATE.
000260     05  ()前年度理論簿価         PIC S9(13)  SIGN LEADING SEPARATE.
000270     05  ()当年度評価額           PIC S9(13)  SIGN LEADING SEPARATE.
000280     05  ()当年度理論簿価         PIC S9(13)  SIGN LEADING SEPARATE.
000290     05  ()特別課税標準額         PIC S9(13)  SIGN LEADING SEPARATE.
000300    03  ()前回申告先             PIC  X(6).
000310    03  ()設置場所名漢字         PIC  X(40).
000320    03  ()設置場所名カナ         PIC  X(20).
000330    03  ()設置場所郵便番号.
000340     05  ()設置場所郵便番号－親   PIC  X(3).
000350     05  ()設置場所郵便番号－子   PIC  X(4).
000360    03  ()設置場所住所漢字       PIC  X(100).
000370    03  FILLER           PIC  X(11).
000380    03  ()処理年月度.
000390     05  ()処理年月度－世紀       PIC S9(1).
000400     05  ()処理年月度－年月       PIC  X(4).
000410    03  ()共通情報               PIC  X(35).
