000010************************************************
000020* ƒVƒƒ[ƒv‰ð–ñi‚r‚e‚bŠî–{j(CPBIS025)
000030************************************************
000040    03  ()ƒGƒ“ƒgƒŠ[‚j‚d‚x.
000050     05  ()‚a‚n‚s‚kŒ_–ñ‚m‚n       PIC  X(9).
000060    03  ()ƒGƒ“ƒgƒŠ[‚j‚d‚x.
000070     05  ()‚r‚e‚bŒ_–ñ‚m‚n         PIC  X(12).
000080    03  ()ƒVƒƒ[ƒvî•ñ.
000090     05  ()‰ïŽÐƒR[ƒh             PIC  X(2).
000100     05  ()‰ïŽÐ–¼                 PIC  X(30).
000110     05  ()Žx“XƒR[ƒh             PIC  X(2).
000120     05  ()Žx“X–¼                 PIC  X(20).
000130     05  ()Œ_–ñŽÒ–¼               PIC  X(25).
000140    03  FILLER           PIC  X(9).
000150    03  ()‰ð–ñî•ñ.
000160     05  ()‘S•”ˆê•”‹æ•ª           PIC  X(1).
000170     05  ()‰ð–ñ——R               PIC  X(1).
000180     05  ()‰ð–ñˆ—               PIC  X(1).
000190     05  ()‰ð–ñ“ú.
000200      07  ()‰ð–ñ“ú|¢‹I           PIC S9(1).
000210      07  ()‰ð–ñ“ú|”NŒŽ“ú         PIC  X(6).
000220     05  ()V‚rŒ_–ñ‚m‚n           PIC  X(12).
000230     05  ()‹K‘¹‹àŽx•¥“ú.
000240      07  ()‹K‘¹‹àŽx•¥“ú|¢‹I     PIC S9(1).
000250      07  ()‹K‘¹‹àŽx•¥“ú|”NŒŽ“ú   PIC  X(6).
000260     05  ()Už’âŽ~“ú.
000270      07  ()Už’âŽ~“ú|¢‹I       PIC S9(1).
000280      07  ()Už’âŽ~“ú|”NŒŽ“ú     PIC  X(6).
000290    03  ()‚l‚s‹æ•ª               PIC  X(1).
000300    03  ()•ÏX‹æ•ª               PIC  X(1).
000310    03  ()‚l‚sXV‹æ•ª           PIC  X(1).
000320    03  FILLER           PIC  X(11).
000330    03  ()‹K‘¹‹àî•ñ.
000340     05  ()‹K’è‘¹ŠQ‹à             PIC S9(13)  SIGN LEADING SEPARATE.
000350     05  ()Å’á‘¹ŠQŠz             PIC S9(13)  SIGN LEADING SEPARATE.
000360     05  ()‹K’è‘¹Ž¸‹àÁ”ïÅ—¦     PIC S9(3)V9(1)  SIGN LEADING SEPARATE.
000370     05  ()‹K’è‘¹Ž¸‹àÁ”ïÅ       PIC S9(13)  SIGN LEADING SEPARATE.
000380     05  FILLER           PIC  X(6).
000390    03  ()·ˆøŽx•¥Šz             PIC S9(13)  SIGN LEADING SEPARATE.
000400    03  ()·ˆøŽx•¥ŠzÁ”ïÅ       PIC S9(13)  SIGN LEADING SEPARATE.
000410    03  FILLER           PIC  X(71).
000420    03  ()‹¤’Êî•ñ               PIC  X(35).
