000010************************************************
000020* “ü‹àÁžŠÇ—‚c‚aiÁžŠî–{î•ñ)(CPBIS098)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()Áž’Ê”Ô               PIC S9(9).
000060    03  ()Áž“ú                 PIC  X(7).
000070    03  ()“ü‹àî•ñ.
000080     05  ()ƒe[ƒuƒ‹                          OCCURS 10.
000090      07  ()“ü‹à’Ê”Ô               PIC S9(9).
000100      07  ()“ü‹àæ–¼Ì             PIC  X(48).
000110      07  ()‹àŠz                   PIC S9(13)  SIGN LEADING SEPARATE.
000120    03  ()’Ç‰ÁŽd–óî•ñ.
000130     05  ()Žd–óƒR[ƒh             PIC S9(4).
000140     05  ()ŽØ•û                              OCCURS 6.
000150      07  ()ŽØ•û|‹àŠz             PIC S9(13)  SIGN LEADING SEPARATE.
000160      07  ()ŽØ•û|‰ÛÅ‚b‚c         PIC S9(3).
000170      07  ()ŽØ•û|‚q‚d‚e‚m‚n       PIC  X(16).
000180     05  ()‘Ý•û                              OCCURS 6.
000190      07  ()‘Ý•û|‹àŠz             PIC S9(13)  SIGN LEADING SEPARATE.
000200      07  ()‘Ý•û|‰ÛÅ‚b‚c         PIC S9(3).
000210      07  ()‘Ý•û|‚q‚d‚e‚m‚n       PIC  X(16).
000220    03  ()“E—v                   PIC  X(34).
000230    03  ()Žd–ó’ZkƒR[ƒh         PIC S9(2).
000240    03  FILLER           PIC  X(57).
000250    03  ()‹¤’Êî•ñ               PIC  X(35).
