000010************************************************
000020* 当日取引(経理)（管販費/支払データ)(CPBIS095)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()処理通番.
000060      07  ()事業所１               PIC  X(4).
000070      07  ()一連番号１             PIC S9(5).
000080      07  ()枝番１                 PIC S9(1).
000090    03  ()フラグ.
000100     05  ()登録削除               PIC  X(1).
000110     05  ()帳票出力               PIC  X(1).
000120     05  FILLER           PIC  X(2).
000130    03  ()レコード種別           PIC S9(2).
000140    03  ()システム情報.
000150     05  ()業務コード             PIC  X(3).
000160     05  ()入力非入力             PIC  X(1).
000170     05  ()処理通番.
000180      07  ()事業所２               PIC  X(4).
000190      07  ()一連番号２             PIC S9(5).
000200      07  ()枝番２                 PIC S9(1).
000210     05  ()入力時間               PIC S9(6)  SIGN LEADING SEPARATE.
000220     05  ()端末番号               PIC  X(8).
000230     05  ()画面番号               PIC  X(4).
000240     05  ()オペレータ情報.
000250      07  ()担当者コード           PIC  X(4).
000260      07  ()所属事業所             PIC S9(4)  SIGN LEADING SEPARATE.
000270      07  ()姓カナ                 PIC  X(10).
000280     05  ()日付.
000290      07  ()入力日                 PIC  X(8).
000300      07  ()取引日                 PIC  X(8).
000310      07  ()バリュー日             PIC  X(8).
000320      07  ()当初取引日             PIC  X(8).
000330     05  ()データ区分.
000340      07  ()処理区分               PIC  X(1).
000350      07  ()取消通番.
000360       09  ()事業所３               PIC  X(4).
000370       09  ()一連番号３             PIC S9(5).
000380     05  FILLER           PIC  X(3).
000390    03  ()事業所                 PIC  X(4).
000400    03  ()科目数.
000410     05  ()借方個数               PIC S9(1).
000420     05  ()貸方個数               PIC S9(1).
000430    03  ()借方科目情報.
000440     05  ()借方科目                          OCCURS 4.
000450      07  ()借方幣種               PIC  X(3).
000460      07  ()借方勘定科目.
000470       09  ()借方科目コード         PIC S9(3).
000480       09  ()借方取引コード         PIC S9(2).
000490      07  ()借方ログタイプ         PIC  X(1).
000500      07  ()借方科目タイプ         PIC  X(1).
000510      07  ()借方管販費コード       PIC S9(3).
000520      07  ()借方円貨金額           PIC S9(13)  SIGN LEADING SEPARATE.
000530      07  ()借方口座番号           PIC  X(8).
000540      07  ()借方課税コード         PIC S9(3).
000550      07  ()借方ＲＥＦＮＯ         PIC  X(16).
000560      07  ()借方整理番号           PIC  X(6).
000570      07  ()借方口座主管事業所     PIC S9(4)  SIGN LEADING SEPARATE.
000580      07  ()借方消費税率           PIC S9(3).
000590      07  ()借方ダミー             PIC  X(1).
000600     05  ()相手先情報.
000610      07  ()相手先コード           PIC S9(4).
000620      07  ()相手先名称             PIC  X(56).
000630     05  ()使途明細               PIC  X(56).
000640     05  FILLER           PIC  X(17).
000650    03  ()貸方科目情報.
000660     05  ()貸方科目                          OCCURS 4.
000670      07  ()貸方幣種               PIC  X(3).
000680      07  ()貸方勘定科目.
000690       09  ()貸方科目コード         PIC S9(3).
000700       09  ()貸方取引コード         PIC S9(2).
000710      07  ()貸方ログタイプ         PIC  X(1).
000720      07  ()貸方科目タイプ         PIC  X(1).
000730      07  ()貸方管販費コード       PIC S9(3).
000740      07  ()貸方円貨金額           PIC S9(13)  SIGN LEADING SEPARATE.
000750      07  ()貸方口座番号           PIC  X(8).
000760      07  ()貸方課税コード         PIC S9(3).
000770      07  ()貸方ＲＥＦＮＯ         PIC  X(16).
000780      07  ()貸方整理番号           PIC  X(6).
000790      07  ()貸方口座主管事業所     PIC S9(4)  SIGN LEADING SEPARATE.
000800      07  ()貸方消費税率           PIC S9(3).
000810      07  ()貸方ダミー             PIC  X(1).
000820    03  FILLER           PIC  X(20).
000830    03  ()代金情報.
000840     05  ()支払情報.
000850      07  ()支払.
000860       09  ()方法コード             PIC  X(1).
000870       09  ()細分コード             PIC  X(1).
000880      07  ()支払日.
000890       09  ()支払日－世紀           PIC S9(1).
000900       09  ()支払日－年月日         PIC S9(6).
000910      07  ()支払金額               PIC S9(13)  SIGN LEADING SEPARATE.
000920      07  ()支払銀行支店コード     PIC  X(7).
000930      07  ()支払預金種目コード     PIC S9(1).
000940      07  ()支払口座番号           PIC S9(7).
000950     05  ()受取先情報.
000960      07  ()受取先コード           PIC S9(4).
000970      07  ()受取先名称             PIC  X(56).
000980      07  ()銀行支店コード         PIC  X(7).
000990      07  ()預金種目コード         PIC S9(1).
001000      07  ()口座番号               PIC S9(7).
001010    03  FILLER           PIC  X(30).
001020    03  ()共通情報               PIC  X(35).
