000010************************************************
000020* 実質与信先(CPBIS052)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()契約番号               PIC  X(9).
000060    03  ()勘定処理コード         PIC S9(2).
000070    03  FILLER           PIC  X(14).
000080    03  ()与信先                            OCCURS 5.
000090     05  ()名寄せコード           PIC  X(8).
000100     05  ()与信先名漢字           PIC  X(60).
000110     05  ()保証担保内容           PIC  X(2).
000120     05  ()保全範囲               PIC  X(2).
000130     05  ()負担割合               PIC S9(3).
000140    03  FILLER           PIC  X(65).
000150    03  ()共通情報               PIC  X(35).
