000010************************************************
000020* 名称マスタ（機種名/コード・割賦）(CPBIS117)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()機械区分               PIC  X(2).
000100      07  ()機種名番号             PIC  X(2).
000110      07  FILLER           PIC  X(7).
000120    03  ()機種名割賦             PIC  X(40).
000130    03  ()機種コードカナ名       PIC  X(10).
000140    03  FILLER           PIC  X(99).
000150    03  ()付保対象区分           PIC  X(1).
000160    03  ()共通情報               PIC  X(35).
