000010************************************************
000020* ‚r‚e‚b–ž—¹—\’è(‚r‚e‚b–ž—¹—\’è(–¾×))(CPBIS003)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()‚a‚n‚s‚kŒ_–ñ‚m‚n       PIC  X(9).
000060    03  ()‚j‚d‚x.
000070     05  ()‚r‚e‚bŒ_–ñ‚m‚n         PIC  X(12).
000080    03  ()¤•i˜A”Ô               PIC  X(3).
000090    03  ()‚j‚d‚x.
000100     05  ()Œ_–ñ‚m‚n               PIC  X(9).
000110     05  ()•¨Œ‚m‚n               PIC S9(3).
000120    03  ()–¾×ˆ—Œ‹‰Ê           PIC  X(1).
000130    03  ()V¤•i˜A”Ô             PIC  X(3).
000140    03  ()ÄƒŠ[ƒXŽü‰ñƒR[ƒh     PIC S9(1).
000150    03  ()ÄƒŠ[ƒXƒR[ƒh         PIC S9(1).
000160    03  ()”—Ê                   PIC S9(4).
000170    03  ()ƒŠ[ƒXŠJŽn“ú           PIC S9(7).
000180    03  ()ƒŠ[ƒXI—¹“ú           PIC S9(7).
000190    03  ()ƒŠ[ƒXŠúŠÔ             PIC S9(3).
000200    03  ()ÄƒŠ[ƒXŠúŠÔ           PIC S9(3).
000210    03  FILLER           PIC  X(1).
000220    03  ()w“ü‹àŠz               PIC S9(13)  SIGN LEADING SEPARATE.
000230    03  ()ŒÂ•ÊƒŠ[ƒX—¿           PIC S9(13)  SIGN LEADING SEPARATE.
000240    03  ()ŒÂ•ÊŒ_–ñ‹àŠz           PIC S9(13)  SIGN LEADING SEPARATE.
000250     05  ()w“ü‹àŠz“à–ó.
000260      07  ()w“ü‹àŠz“à–óÄƒŠ[ƒX   PIC S9(13)  SIGN LEADING SEPARATE.
000270      07  ()w“ü‹àŠz“à–ó“]”„       PIC S9(13)  SIGN LEADING SEPARATE.
000280      07  ()w“ü‹àŠz“à–ó”pŠü       PIC S9(13)  SIGN LEADING SEPARATE.
000290    03  ()”—Ê“à–ó.
000300     05  ()”—Ê“à–óÄƒŠ[ƒX       PIC S9(4).
000310     05  ()”—Ê“à–ó“]”„           PIC S9(4).
000320     05  ()”—Ê“à–ó”pŠü           PIC S9(4).
000330    03  ()‚a‚n‚s‚kî•ñ.
000340     05  ()‚a‚n‚s‚k•¨Œ–¼         PIC  X(20).
000350     05  ()‚a‚n‚s‚kÄƒŠ[ƒX—¿     PIC S9(13)  SIGN LEADING SEPARATE.
000360     05  FILLER           PIC  X(23).
000370    03  ()‚r‚e‚bî•ñ.
000380     05  ()‚r‚e‚b•¨Œ–¼           PIC  X(20).
000390     05  ()‚r‚e‚bÄƒŠ[ƒX—¿       PIC S9(13)  SIGN LEADING SEPARATE.
000400     05  FILLER           PIC  X(23).
000410    03  FILLER           PIC  X(65).
000420    03  ()‹¤’Êî•ñ               PIC  X(35).
