000010************************************************
000020* 提携コードマスタ(ジャックス商品コード)(CPBIS086)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()ＪＡＣＣＳ商品コード   PIC S9(2).
000070     05  FILLER           PIC  X(9).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用日付               PIC  X(7).
000100     05  ()資産コード             PIC S9(7).
000110     05  ()保険料コード           PIC S9(4).
000120     05  ()使用保険コード         PIC S9(6).
000130     05  FILLER           PIC  X(6).
000140    03  ()共通情報               PIC  X(35).
