00010*****************************************************************
000020*   月次債権情報ファイル(CPBZDB00.cbl)
000030*****************************************************************
          03   ()項目情報.
            05  ()レコード区分                       PIC  X(001).
            05  ()契約番号                           PIC  X(010).
            05  ()再リース回数                       PIC S9(002).
            05  ()契約種類                           PIC  X(003).
            05  ()連番                               PIC S9(003).
            05  ()月次年月                           PIC  X(006).
            05  ()期首年月                           PIC  X(006).
            05  ()期末年月                           PIC  X(006).
            05  ()当日年月日                         PIC  X(008).
            05  ()債権残高区分                       PIC  X(002).
            05  ()オープンブラインド区分             PIC  X(001).
            05  ()契約区分                           PIC  X(001).
            05  ()主契約区分                         PIC  X(001).
            05  ()契約先コード                       PIC  X(005).
            05  ()勘定処理コード                     PIC  X(002).
            05  ()担当部課コード                     PIC  X(004).
            05  ()担当者コード                       PIC  X(008).
            05  ()グループコード                     PIC  X(009).
            05  ()請求先コード                       PIC  X(005).
            05  ()支払先コード                       PIC  X(005).
            05  ()請求先取引先コード                 PIC  X(009).
            05  ()契約先取引先コード                 PIC  X(009).
            05  ()支払取引先コード                   PIC  X(009).
            05  ()状態フラグ                         PIC  X(001).
            05  ()債務協調区分                       PIC  X(002).
            05  ()前払区分                           PIC  X(001).
            05  ()前払充当区分                       PIC  X(001).
            05  ()解約フラグ                         PIC  X(001).
            05  ()担保区分                           PIC  X(001).
            05  ()債権流動化区分                     PIC  X(001).
            05  ()請求書作成区分                     PIC  X(001).
            05  ()消費税区分                         PIC  X(002).
            05  ()消費税徴収区分                     PIC  X(001).
            05  ()請求回                             PIC S9(003).
            05  ()当月分請求回                       PIC S9(003).
            05  ()総回収回数                         PIC S9(003).
            05  ()成約日                             PIC  X(008).
            05  ()成約年月                           PIC  X(006).
            05  ()成約取消年月                       PIC  X(006).
            05  ()成約取消エントリ日                 PIC  X(008).
            05  ()検収処理年月                       PIC  X(006).
            05  ()検収エントリ日                     PIC  X(008).
            05  ()検収取消日                         PIC  X(008).
            05  ()検収取消エントリ日                 PIC  X(008).
            05  ()検収取消処理年月                   PIC  X(006).
            05  ()再リース処理年月                   PIC  X(006).
            05  ()再リース取消エントリ日             PIC  X(008).
            05  ()解約年月日                         PIC  X(008).
            05  ()契約日                             PIC  X(008).
            05  ()契約開始日                         PIC  X(008).
            05  ()契約終了日                         PIC  X(008).
            05  ()引渡年月日                         PIC  X(008).
            05  ()前受リース料入金日                 PIC  X(008).
            05  ()入金日                             PIC  X(008).
            05  ()期間                               PIC S9(003).
            05  ()流動化先                           PIC  X(007).
            05  ()否認区分                           PIC  X(001).
            05  ()据置期間                           PIC S9(002).
            05  ()消費税率                           PIC S9(002)V9(008).
            05  ()金利                               PIC S9(002)V9(008).
            05  ()前受充当開始年月                   PIC  X(006).
            05  ()前受充当開始年月日                 PIC  X(008).
            05  ()前受充当月数                       PIC S9(002).
            05  ()前受充当年月日                     PIC  X(008).
            05  ()前受充当済月数                     PIC S9(002).
            05  ()初回回収予定日                     PIC  X(008).
            05  ()最終回収予定日                     PIC  X(008).
            05  ()取得価額                           PIC S9(013).
            05  ()契約金額                           PIC S9(013).
            05  ()契約金額自社分                     PIC S9(013).
            05  ()契約金額消費税                     PIC S9(013).
            05  ()契約金額消費税自社分               PIC S9(013).
            05  ()前払総額                           PIC S9(013).
            05  ()前払金額自社分                     PIC S9(013).
            05  ()前払総額消費税                     PIC S9(013).
            05  ()前払金額消費税自社分               PIC S9(013).
            05  ()元本総額                           PIC S9(013).
            05  ()元本総額自社分                     PIC S9(013).
            05  ()利息総額                           PIC S9(013).
            05  ()利息総額自社分                     PIC S9(013).
            05  ()諸費用総額                         PIC S9(013).
            05  ()諸費用総額自社分                   PIC S9(013).
            05  ()固定資産税総額                     PIC S9(013).
            05  ()動総保険料総額                     PIC S9(013).
            05  ()支払利息適用総額                   PIC S9(013).
            05  ()支払利息一般総額                   PIC S9(013).
            05  ()委託保守料総額                     PIC S9(013).
            05  ()契約済未検収金額                   PIC S9(013).
            05  ()契約済未検収消費税金額             PIC S9(013).
            05  ()決裁済未成約金額                   PIC S9(013).
            05  ()決裁済未成約消費税金額             PIC S9(013).
            05  ()残価区分                           PIC  X(001).
            05  ()残価設定額                         PIC S9(013).
            05  ()自社残価設定額                     PIC S9(013).
            05  ()税込残価設定額                     PIC S9(013).
            05  ()税込残価設定額自社                 PIC S9(013).
            05  ()信用保険料残高金額                 PIC S9(013).
            05  ()信用保険料残高消費税金額           PIC S9(013).
            05  ()月次計上情報.
              07  ()当月計上額                       PIC S9(013).
              07  ()当月計上額自社分                 PIC S9(013).
              07  ()当月計上消費税額                 PIC S9(013).
              07  ()当月計上消費税額自社分           PIC S9(013).
              07  ()当月前受計上額                   PIC S9(013).
              07  ()当月前受計上額自社分             PIC S9(013).
              07  ()当月前受計上額消費税             PIC S9(013).
              07  ()当月前受計上額消費税自社分       PIC S9(013).
              07  ()当月計上元本                     PIC S9(013).
              07  ()当月計上自社元本                 PIC S9(013).
              07  ()当月計上利息                     PIC S9(013).
              07  ()当月計上自社利息                 PIC S9(013).
              07  ()当月計上諸費用総額               PIC S9(013).
              07  ()当月計上諸費用自社分             PIC S9(013).
              07  ()当月計上固定資産税               PIC S9(013).
              07  ()当月計上動総保険料               PIC S9(013).
              07  ()当月計上支払利息適用             PIC S9(013).
              07  ()当月計上支払利息一般             PIC S9(013).
              07  ()当月計上委託保守料               PIC S9(013).
            05   ()前期末残高情報.
              07  ()前期末年月                       PIC  X(006).
              07  ()前期末請求回                     PIC S9(003).
              07  ()前期末債権残高                   PIC S9(013).
              07  ()前期末債権残高自社分             PIC S9(013).
              07  ()前期末消費税債権残高             PIC S9(013).
              07  ()前期末消費税債権残高自社分       PIC S9(013).
              07  ()前期末約定債権残高               PIC S9(013).
              07  ()前期末約定債権残高自社分         PIC S9(013).
              07  ()前期末約定消費税債権残高         PIC S9(013).
              07  ()前期末約定消費税債権残高自社分   PIC S9(013).
              07  ()前期末前受金残高                 PIC S9(013).
              07  ()前期末前受金残高自社分           PIC S9(013).
              07  ()前期末前受金消費税残高           PIC S9(013).
              07  ()前期末前受金消費税残高自社分     PIC S9(013).
              07  ()前期末約定元本残高               PIC S9(013).
              07  ()前期末約定利息残高               PIC S9(013).
              07  ()前期末実質元本残高               PIC S9(013).
              07  ()前期末実質利息残高               PIC S9(013).
              07  ()前期末売上残高                   PIC S9(013).
              07  ()前期末売上残高消費税             PIC S9(013).
              07  ()前期末諸費用残高                 PIC S9(013).
              07  ()前期末諸費用残高自社分           PIC S9(013).
              07  ()前期末割賦原価残高               PIC S9(013).
              07  ()前期末割賦原価残高自社分         PIC S9(013).
              07  ()前期末割賦原価未実現利益         PIC S9(013).
              07  ()前期末割賦原価未実現利益自社分   PIC S9(013).
              07  ()前期末固定資産税残高             PIC S9(013).
              07  ()前期末動総保険料残高             PIC S9(013).
              07  ()前期末支払利息適用残高           PIC S9(013).
              07  ()前期末支払利息一般残高           PIC S9(013).
              07  ()前期末委託保守料残高             PIC S9(013).
              07  ()前期末売上元本残高               PIC S9(013).
              07  ()前期末売上利息残高               PIC S9(013).
            05   ()前期迄情報.
              07  ()前期迄回収額                     PIC S9(013).
              07  ()前期迄回収額自社分               PIC S9(013).
              07  ()前期迄消費税回収額               PIC S9(013).
              07  ()前期迄消費税回収額自社分         PIC S9(013).
              07  ()前期迄回収予定額                 PIC S9(013).
              07  ()前期迄回収予定額自社分           PIC S9(013).
              07  ()前期迄回収予定額消費税           PIC S9(013).
              07  ()前期迄回収予定額消費税自社分     PIC S9(013).
              07  ()前期迄前受回収額                 PIC S9(013).
              07  ()前期迄前受回収額自社分           PIC S9(013).
              07  ()前期迄前受回収額消費税           PIC S9(013).
              07  ()前期迄前受回収額消費税自社分     PIC S9(013).
              07  ()前期迄未徴収金                   PIC S9(013).
              07  ()前期迄未徴収金自社分             PIC S9(013).
              07  ()前期迄未徴収金消費税             PIC S9(013).
              07  ()前期迄未徴収金消費税自社分       PIC S9(013).
              07  ()前期迄約定元本                   PIC S9(013).
              07  ()前期迄約定利息                   PIC S9(013).
              07  ()前期迄実質元本                   PIC S9(013).
              07  ()前期迄実質利息                   PIC S9(013).
              07  ()前期迄未徴収元本                 PIC S9(013).
              07  ()前期迄未徴収利息                 PIC S9(013).
              07  ()前期迄売上額                     PIC S9(013).
              07  ()前期迄売上額消費税               PIC S9(013).
              07  ()前期迄諸費用                     PIC S9(013).
              07  ()前期迄諸費用自社分               PIC S9(013).
              07  ()前期迄金融元本                   PIC S9(013).
              07  ()前期迄金融元本自社分             PIC S9(013).
              07  ()前期迄金融利息                   PIC S9(013).
              07  ()前期迄金融利息自社分             PIC S9(013).
              07  ()前期迄固定資産税                 PIC S9(013).
              07  ()前期迄動総保険料                 PIC S9(013).
              07  ()前期迄支払利息適用               PIC S9(013).
              07  ()前期迄支払利息一般               PIC S9(013).
              07  ()前期迄委託保守料                 PIC S9(013).
              07  ()前期迄売上元本                   PIC S9(013).
              07  ()前期迄売上利息                   PIC S9(013).
            05   ()当期発生情報.
              07  ()当期回収実績額                   PIC S9(013).
              07  ()当期回収実績額自社分             PIC S9(013).
              07  ()当期回収実績額消費税             PIC S9(013).
              07  ()当期回収実績額消費税自社分       PIC S9(013).
              07  ()当期回収予定額                   PIC S9(013).
              07  ()当期回収予定額自社分             PIC S9(013).
              07  ()当期回収予定額消費税             PIC S9(013).
              07  ()当期回収予定額消費税自社分       PIC S9(013).
              07  ()当期前受回収額                   PIC S9(013).
              07  ()当期前受回収額自社分             PIC S9(013).
              07  ()当期前受回収額消費税             PIC S9(013).
              07  ()当期前受回収額消費税自社分       PIC S9(013).
              07  ()当期未徴収金                     PIC S9(013).
              07  ()当期未徴収金自社分               PIC S9(013).
              07  ()当期未徴収金消費税               PIC S9(013).
              07  ()当期未徴収金消費税自社分         PIC S9(013).
              07  ()当期約定元本                     PIC S9(013).
              07  ()当期約定利息                     PIC S9(013).
              07  ()当期実質元本                     PIC S9(013).
              07  ()当期実質利息                     PIC S9(013).
              07  ()当期未徴収元本                   PIC S9(013).
              07  ()当期未徴収利息                   PIC S9(013).
              07  ()当期売上額                       PIC S9(013).
              07  ()当期売上額消費税                 PIC S9(013).
              07  ()当期諸費用                       PIC S9(013).
              07  ()当期諸費用自社分                 PIC S9(013).
              07  ()当期金融元本                     PIC S9(013).
              07  ()当期金融元本自社分               PIC S9(013).
              07  ()当期金融利息                     PIC S9(013).
              07  ()当期金融利息自社分               PIC S9(013).
              07  ()当期固定資産税                   PIC S9(013).
              07  ()当期動総保険料                   PIC S9(013).
              07  ()当期支払利息適用                 PIC S9(013).
              07  ()当期支払利息一般                 PIC S9(013).
              07  ()当期委託保守料                   PIC S9(013).
              07  ()当期売上元本                     PIC S9(013).
              07  ()当期売上利息                     PIC S9(013).
            05   ()前月末残高情報.
              07  ()前月末債権残高                   PIC S9(013).
              07  ()前月末債権残高自社分             PIC S9(013).
              07  ()前月末消費税債権残高             PIC S9(013).
              07  ()前月末消費税債権残高自社分       PIC S9(013).
              07  ()前月末約定債権残高               PIC S9(013).
              07  ()前月末約定債権残高自社分         PIC S9(013).
              07  ()前月末約定消費税債権残高         PIC S9(013).
              07  ()前月末約定消費税債権残高自社分   PIC S9(013).
              07  ()前月末前受金残高                 PIC S9(013).
              07  ()前月末前受金残高自社分           PIC S9(013).
              07  ()前月末前受金消費税残高           PIC S9(013).
              07  ()前月末前受金消費税残高自社分     PIC S9(013).
              07  ()前月末約定元本残高               PIC S9(013).
              07  ()前月末約定利息残高               PIC S9(013).
              07  ()前月末実質元本残高               PIC S9(013).
              07  ()前月末実質利息残高               PIC S9(013).
              07  ()前月末売上残高                   PIC S9(013).
              07  ()前月末売上残高消費税             PIC S9(013).
              07  ()前月末諸費用残高                 PIC S9(013).
              07  ()前月末諸費用残高自社分           PIC S9(013).
              07  ()前月末割賦原価残高               PIC S9(013).
              07  ()前月末割賦原価残高自社分         PIC S9(013).
              07  ()前月末割賦原価未実現利益         PIC S9(013).
              07  ()前月末割賦原価未実現利益自社分   PIC S9(013).
              07  ()前月末固定資産税残高             PIC S9(013).
              07  ()前月末動総保険料残高             PIC S9(013).
              07  ()前月末支払利息適用残高           PIC S9(013).
              07  ()前月末支払利息一般残高           PIC S9(013).
              07  ()前月末委託保守料残高             PIC S9(013).
              07  ()前月末売上元本残高               PIC S9(013).
              07  ()前月末売上利息残高               PIC S9(013).
            05   ()前月迄情報.
              07  ()前月迄回収額                     PIC S9(013).
              07  ()前月迄回収額自社分               PIC S9(013).
              07  ()前月迄消費税回収額               PIC S9(013).
              07  ()前月迄消費税回収額自社分         PIC S9(013).
              07  ()前月迄回収予定額                 PIC S9(013).
              07  ()前月迄回収予定額自社分           PIC S9(013).
              07  ()前月迄回収予定額消費税           PIC S9(013).
              07  ()前月迄回収予定額消費税自社分     PIC S9(013).
              07  ()前月迄前受回収額                 PIC S9(013).
              07  ()前月迄前受回収額自社分           PIC S9(013).
              07  ()前月迄前受回収額消費税           PIC S9(013).
              07  ()前月迄前受回収額消費税自社分     PIC S9(013).
              07  ()前月迄未徴収金                   PIC S9(013).
              07  ()前月迄未徴収金自社分             PIC S9(013).
              07  ()前月迄未徴収金消費税             PIC S9(013).
              07  ()前月迄未徴収金消費税自社分       PIC S9(013).
              07  ()前月迄約定元本                   PIC S9(013).
              07  ()前月迄約定利息                   PIC S9(013).
              07  ()前月迄実質元本                   PIC S9(013).
              07  ()前月迄実質利息                   PIC S9(013).
              07  ()前月迄未徴収元本                 PIC S9(013).
              07  ()前月迄未徴収利息                 PIC S9(013).
              07  ()前月迄売上額                     PIC S9(013).
              07  ()前月迄売上額消費税               PIC S9(013).
              07  ()前月迄諸費用                     PIC S9(013).
              07  ()前月迄諸費用自社分               PIC S9(013).
              07  ()前月迄金融元本                   PIC S9(013).
              07  ()前月迄金融元本自社分             PIC S9(013).
              07  ()前月迄金融利息                   PIC S9(013).
              07  ()前月迄金融利息自社分             PIC S9(013).
              07  ()前月迄固定資産税                 PIC S9(013).
              07  ()前月迄動総保険料                 PIC S9(013).
              07  ()前月迄支払利息適用               PIC S9(013).
              07  ()前月迄支払利息一般               PIC S9(013).
              07  ()前月迄委託保守料                 PIC S9(013).
              07  ()前月迄売上元本                   PIC S9(013).
              07  ()前月迄売上利息                   PIC S9(013).
              07  ()前月迄社内金利利息適用           PIC S9(013).
              07  ()前月迄社内金利利息一般           PIC S9(013).
            05   ()当月末残高情報.
              07  ()当月末債権残高                   PIC S9(013).
              07  ()当月末債権残高自社分             PIC S9(013).
              07  ()当月末消費税債権残高             PIC S9(013).
              07  ()当月末消費税債権残高自社分       PIC S9(013).
              07  ()当月末約定債権残高               PIC S9(013).
              07  ()当月末約定債権残高自社分         PIC S9(013).
              07  ()当月末約定消費税債権残高         PIC S9(013).
              07  ()当月末約定消費税債権残高自社分   PIC S9(013).
              07  ()当月末前受金残高                 PIC S9(013).
              07  ()当月末前受金残高自社分           PIC S9(013).
              07  ()当月末前受金消費税残高           PIC S9(013).
              07  ()当月末前受金消費税残高自社分     PIC S9(013).
              07  ()当月末約定元本残高               PIC S9(013).
              07  ()当月末約定利息残高               PIC S9(013).
              07  ()当月末実質元本残高               PIC S9(013).
              07  ()当月末実質利息残高               PIC S9(013).
              07  ()当月末売上残高                   PIC S9(013).
              07  ()当月末売上残高消費税             PIC S9(013).
              07  ()当月末諸費用残高                 PIC S9(013).
              07  ()当月末諸費用残高自社分           PIC S9(013).
              07  ()当月末割賦原価残高               PIC S9(013).
              07  ()当月末割賦原価残高自社分         PIC S9(013).
              07  ()当月末割賦原価未実現利益         PIC S9(013).
              07  ()当月末割賦原価未実現利益自社分   PIC S9(013).
              07  ()当月末固定資産税残高             PIC S9(013).
              07  ()当月末動総保険料残高             PIC S9(013).
              07  ()当月末支払利息適用残高           PIC S9(013).
              07  ()当月末支払利息一般残高           PIC S9(013).
              07  ()当月末委託保守料残高             PIC S9(013).
              07  ()当月末売上元本残高               PIC S9(013).
              07  ()当月末売上利息残高               PIC S9(013).
              07  ()当月末前受収益                   PIC S9(013).
              07  ()当月末未収収益                   PIC S9(013).
            05   ()当月迄情報.
              07  ()当月迄回収額                     PIC S9(013).
              07  ()当月迄回収額自社分               PIC S9(013).
              07  ()当月迄消費税回収額               PIC S9(013).
              07  ()当月迄消費税回収額自社分         PIC S9(013).
              07  ()当月迄回収予定額                 PIC S9(013).
              07  ()当月迄回収予定額自社分           PIC S9(013).
              07  ()当月迄回収予定額消費税           PIC S9(013).
              07  ()当月迄回収予定額消費税自社分     PIC S9(013).
              07  ()当月迄前受回収額                 PIC S9(013).
              07  ()当月迄前受回収額自社分           PIC S9(013).
              07  ()当月迄前受回収額消費税           PIC S9(013).
              07  ()当月迄前受回収額消費税自社分     PIC S9(013).
              07  ()当月迄未徴収金                   PIC S9(013).
              07  ()当月迄未徴収金自社分             PIC S9(013).
              07  ()当月迄未徴収金消費税             PIC S9(013).
              07  ()当月迄未徴収金消費税自社分       PIC S9(013).
              07  ()当月迄約定元本                   PIC S9(013).
              07  ()当月迄約定利息                   PIC S9(013).
              07  ()当月迄実質元本                   PIC S9(013).
              07  ()当月迄実質利息                   PIC S9(013).
              07  ()当月迄未徴収元本                 PIC S9(013).
              07  ()当月迄未徴収利息                 PIC S9(013).
              07  ()当月迄売上額                     PIC S9(013).
              07  ()当月迄売上額消費税               PIC S9(013).
              07  ()当月迄諸費用                     PIC S9(013).
              07  ()当月迄諸費用自社分               PIC S9(013).
              07  ()当月迄金融元本                   PIC S9(013).
              07  ()当月迄金融元本自社分             PIC S9(013).
              07  ()当月迄金融利息                   PIC S9(013).
              07  ()当月迄金融利息自社分             PIC S9(013).
              07  ()当月迄固定資産税                 PIC S9(013).
              07  ()当月迄動総保険料                 PIC S9(013).
              07  ()当月迄支払利息適用               PIC S9(013).
              07  ()当月迄支払利息一般               PIC S9(013).
              07  ()当月迄委託保守料                 PIC S9(013).
              07  ()当月迄売上元本                   PIC S9(013).
              07  ()当月迄売上利息                   PIC S9(013).
              07  ()当月迄社内金利利息適用           PIC S9(013).
              07  ()当月迄社内金利利息一般           PIC S9(013).
            05   ()当月発生情報.
              07  ()当月回収実績額                   PIC S9(013).
              07  ()当月回収実績額自社分             PIC S9(013).
              07  ()当月回収実績額消費税             PIC S9(013).
              07  ()当月回収実績額消費税自社分       PIC S9(013).
              07  ()当月回収予定額                   PIC S9(013).
              07  ()当月回収予定額自社分             PIC S9(013).
              07  ()当月回収予定額消費税             PIC S9(013).
              07  ()当月回収予定額消費税自社分       PIC S9(013).
              07  ()当月前受回収額                   PIC S9(013).
              07  ()当月前受回収額自社分             PIC S9(013).
              07  ()当月前受回収額消費税             PIC S9(013).
              07  ()当月前受回収額消費税自社分       PIC S9(013).
              07  ()当月未徴収金                     PIC S9(013).
              07  ()当月未徴収金自社分               PIC S9(013).
              07  ()当月未徴収金消費税               PIC S9(013).
              07  ()当月未徴収金消費税自社分         PIC S9(013).
              07  ()当月約定元本                     PIC S9(013).
              07  ()当月約定利息                     PIC S9(013).
              07  ()当月実質元本                     PIC S9(013).
              07  ()当月実質利息                     PIC S9(013).
              07  ()当月未徴収元本                   PIC S9(013).
              07  ()当月未徴収利息                   PIC S9(013).
              07  ()当月売上額                       PIC S9(013).
              07  ()当月売上額消費税                 PIC S9(013).
              07  ()当月諸費用                       PIC S9(013).
              07  ()当月諸費用自社分                 PIC S9(013).
              07  ()当月金融元本                     PIC S9(013).
              07  ()当月金融元本自社分               PIC S9(013).
              07  ()当月金融利息                     PIC S9(013).
              07  ()当月金融利息自社分               PIC S9(013).
              07  ()当月固定資産税                   PIC S9(013).
              07  ()当月動総保険料                   PIC S9(013).
              07  ()当月支払利息適用                 PIC S9(013).
              07  ()当月支払利息一般                 PIC S9(013).
              07  ()当月委託保守料                   PIC S9(013).
              07  ()当月売上元本                     PIC S9(013).
              07  ()当月売上利息                     PIC S9(013).
              07  ()当月社内金利利息適用             PIC S9(013).
              07  ()当月社内金利利息一般             PIC S9(013).
            05   ()当月調整情報.
              07  ()当月調整額                       PIC S9(013).
              07  ()当月調整額自社分                 PIC S9(013).
              07  ()当月消費税調整額                 PIC S9(013).
              07  ()当月消費税調整額自社分           PIC S9(013).
              07  ()当月約定調整額                   PIC S9(013).
              07  ()当月約定調整額自社分             PIC S9(013).
              07  ()当月約定調整額消費税             PIC S9(013).
              07  ()当月約定調整額消費税自社分       PIC S9(013).
              07  ()当月前受調整額                   PIC S9(013).
              07  ()当月前受調整額自社分             PIC S9(013).
              07  ()当月前受調整額消費税             PIC S9(013).
              07  ()当月前受調整額消費税自社分       PIC S9(013).
              07  ()当月約定元本調整額               PIC S9(013).
              07  ()当月約定利息調整額               PIC S9(013).
              07  ()当月実質元本調整額               PIC S9(013).
              07  ()当月実質利息調整額               PIC S9(013).
              07  ()当月売上調整額                   PIC S9(013).
              07  ()当月売上調整額消費税             PIC S9(013).
              07  ()当月諸費用調整額                 PIC S9(013).
              07  ()当月諸費用調整額自社分           PIC S9(013).
              07  ()当月金融元本調整額               PIC S9(013).
              07  ()当月金融元本調整額自社分         PIC S9(013).
              07  ()当月金融利息調整額               PIC S9(013).
              07  ()当月金融利息調整額自社分         PIC S9(013).
              07  ()当月固定資産税調整額             PIC S9(013).
              07  ()当月動総保険料調整額             PIC S9(013).
              07  ()当月支払利息調整額適用           PIC S9(013).
              07  ()当月支払利息調整額一般           PIC S9(013).
              07  ()当月委託保守料調整額             PIC S9(013).
              07  ()当月売上元本調整額               PIC S9(013).
              07  ()当月売上利息調整額               PIC S9(013).
          03   ()登録情報.
            05  ()登録年月日                         PIC  X(008).
            05  ()登録時間                           PIC  X(008).
            05  ()登録担当者                         PIC  X(008).
          03   ()更新情報.
            05  ()更新年月日                         PIC  X(008).
            05  ()更新時間                           PIC  X(008).
            05  ()更新者                             PIC  X(008).
