000010************************************************
000020* ‰ð–ñ—ÝÏƒtƒ@ƒCƒ‹(“WŠJ)(CPFBUP03)
000030************************************************
000040    03  ()‚r‚n‚q‚s‚j‚d‚x.
000050     05  ()‚j‚d‚x|“ü—ÍŽ–‹ÆŠ‚b‚c PIC S9(4).
000060     05  ()‚j‚d‚x|ƒf[ƒ^Ž¯•Ê     PIC S9(2).
000070     05  ()‚j‚d‚x|Ž–‹ÆŠ‚b‚c     PIC S9(4).
000080     05  ()‚j‚d‚x|ƒŒƒR[ƒh‹æ•ª   PIC  X(1).
000090     05  ()‚j‚d‚x|Œ_–ñ‚m‚n       PIC  X(9).
000100     05  ()‚j‚d‚x|•¨Œ‚m‚n       PIC S9(3).
000110     05  ()‚j‚d‚x|Š¨’èˆ—‚b‚c   PIC S9(2).
000120     05  ()‚j‚d‚x|ƒ_ƒ~[         PIC  X(4).
000130     05  ()‚j‚d‚x|ÄƒŠ[ƒX‚b‚c   PIC S9(1).
000140    03  ()“WŠJƒe[ƒuƒ‹.
000150     05  ()“WŠJ‹àŠz               PIC S9(13)  SIGN LEADING SEPARATE.
000160     05  ()‰ñ”                   PIC S9(3).
