      *****         文字変換サブルーチン           ******************
      *
       01  WS450-AREA.
           03  WS450-G.
               05  WS450-G-NAME                    PIC  N(40).
           03  WS450-P.
               05  WS450-P-NAME                    PIC  X(80).
               05  WS450-P-RTNCD                   PIC  9(02).

