000010************************************************
000020* (DFS_GENREC)
000030************************************************
000040 01  ()GENREC           PIC  X(120).
