000010************************************************
000020* (ELP_LONPAY)
000030************************************************
000040 01  ()LONNUM           PIC  X(5).
000050 01  ()LONTYP           PIC  X(1).
000060 01  ()DIVCOD           PIC  X(4).
000070 01  ()PSNCOD           PIC  X(7).
000080 01  ()RECNUM           PIC  X(4).
000090 01  ()PAYDAY           PIC  X(8).
000100 01  ()SALAMT           PIC S9(13) COMP-3.
000110 01  ()SALINT           PIC S9(13) COMP-3.
000120 01  ()SALCAP           PIC S9(13) COMP-3.
000130 01  ()SALBAL           PIC S9(13) COMP-3.
000140 01  ()BNSAMT           PIC S9(13) COMP-3.
000150 01  ()BNSINT           PIC S9(13) COMP-3.
000160 01  ()BNSCAP           PIC S9(13) COMP-3.
000170 01  ()BNSBAL           PIC S9(13) COMP-3.
000180 01  ()TOTBAL           PIC S9(13) COMP-3.
