000010************************************************
000020* (ELP_MODLST)
000030************************************************
000040 01  ()JOBTYP           PIC  X(1).
000050 01  ()REGTIM           PIC  X(6).
000060 01  ()LONNUM           PIC  X(5).
000070 01  ()LONTYP           PIC  X(1).
000080 01  ()DIVCOD           PIC  X(4).
000090 01  ()PSNCOD           PIC  X(7).
000100 01  ()PSNNAM           PIC  N(9).
000110 01  ()LONDAY           PIC  X(8).
000120 01  ()REPDAY           PIC  X(8).
000130 01  ()OBJCOD           PIC  X(1).
000140 01  ()LONTRM           PIC S9(3) COMP-3.
000150 01  ()FRZTRM           PIC S9(3) COMP-3.
000160 01  ()LONAMT           PIC S9(13) COMP-3.
000170 01  ()INTRAT           PIC S9(2)V9(6) COMP-3.
000180 01  ()SALAMT           PIC S9(13) COMP-3.
000190 01  ()SALINT           PIC S9(13) COMP-3.
000200 01  ()SALCAP           PIC S9(13) COMP-3.
000210 01  ()SALBAL           PIC S9(13) COMP-3.
000220 01  ()SALREP           PIC S9(13) COMP-3.
000230 01  ()BNSAMT           PIC S9(13) COMP-3.
000240 01  ()BNSINT           PIC S9(13) COMP-3.
000250 01  ()BNSCAP           PIC S9(13) COMP-3.
000260 01  ()BNSBAL           PIC S9(13) COMP-3.
000270 01  ()BNSREP           PIC S9(13) COMP-3.
000280 01  ()DLYINT           PIC S9(13) COMP-3.
000290 01  ()REMARK           PIC  N(20).
000300 01  ()DIVCOD_O       PIC  X(4).
000310 01  ()PSNCOD_O       PIC  X(7).
000320 01  ()PSNNAM_O       PIC  N(9).
000330 01  ()LONDAY_O       PIC  X(8).
000340 01  ()REPDAY_O       PIC  X(8).
000350 01  ()OBJCOD_O       PIC  X(1).
000360 01  ()LONTRM_O       PIC S9(3) COMP-3.
000370 01  ()FRZTRM_O       PIC S9(3) COMP-3.
000380 01  ()LONAMT_O       PIC S9(13) COMP-3.
000390 01  ()INTRAT_O       PIC S9(2)V9(6) COMP-3.
000400 01  ()SALAMT_O       PIC S9(13) COMP-3.
000410 01  ()BNSAMT_O       PIC S9(13) COMP-3.
000420 01  ()REMARK_O       PIC  N(20).
000430 01  ()DIVCOD_M       PIC  X(1).
000440 01  ()PSNCOD_M       PIC  X(1).
000450 01  ()PSNNAM_M       PIC  X(1).
000460 01  ()LONDAY_M       PIC  X(1).
000470 01  ()REPDAY_M       PIC  X(1).
000480 01  ()OBJCOD_M       PIC  X(1).
000490 01  ()LONTRM_M       PIC  X(1).
000500 01  ()FRZTRM_M       PIC  X(1).
000510 01  ()LONAMT_M       PIC  X(1).
000520 01  ()INTRAT_M       PIC  X(1).
000530 01  ()SALAMT_M       PIC  X(1).
000540 01  ()BNSAMT_M       PIC  X(1).
000550 01  ()REMARK_M       PIC  X(1).
