000010************************************************
000020* (EMC_WK_GIMEN)
000030************************************************
000040 01  ()銀行短縮コード         PIC  X(2).
000050 01  ()銀行コード             PIC  X(4).
000060 01  ()支店コード             PIC  X(3).
000070 01  ()銀行名                 PIC  N(15).
000080 01  ()支店名                 PIC  N(15).
000090 01  ()預金種類               PIC  X(1).
000100 01  ()口座番号               PIC  X(7).
000110 01  ()口座名                 PIC  N(20).
000120 01  ()区分                   PIC  X(1).
000130 01  ()チェック１             PIC  X(1).
000140 01  ()チェック２             PIC  X(1).
000150 01  ()チェック３             PIC  X(1).
000160 01  ()チェック４             PIC  X(1).
000170 01  ()チェック５             PIC  X(1).
000180 01  ()チェック６             PIC  X(1).
000190 01  ()チェック７             PIC  X(1).
