000010************************************************
000020* (EXP_ACCMST)
000030************************************************
000040 01  ()ACCCOD           PIC  X(5).
000050 01  ()ACCNAM           PIC  N(10).
