000010************************************************
000020* (FCT_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(7).
000050 01  ()データ区分             PIC  X(1).
000060 01  ()契約日                 PIC  X(8).
000070 01  ()取引形態コード         PIC  X(2).
000080 01  ()勘定処理コード         PIC  X(2).
000090 01  ()業務区分               PIC  X(1).
000100 01  ()顧客コード             PIC  X(6).
000110 01  ()顧客名称               PIC  N(30).
000120 01  ()ユーザーコード         PIC  X(8).
000130 01  ()取引先区分             PIC  X(1).
000140 01  ()担当者コード           PIC  X(4).
000150 01  ()担当者名               PIC  N(10).
000160 01  ()事業所コード           PIC  X(4).
000170 01  ()買取予定日             PIC  X(8).
000180 01  ()買取代金支払日         PIC  X(8).
000190 01  ()額面金額合計           PIC S9(13) COMP-3.
000200 01  ()買取金額合計           PIC S9(13) COMP-3.
000210 01  ()支払保証金額合計       PIC S9(13) COMP-3.
000220 01  ()割引料合計             PIC S9(13) COMP-3.
000230 01  ()受取手数料合計         PIC S9(13) COMP-3.
000240 01  ()受取手数料消費税等額合計 PIC S9(13) COMP-3.
000250 01  ()戻し利息額合計         PIC S9(13) COMP-3.
000260 01  ()粗利益合計             PIC S9(13) COMP-3.
000270 01  ()割引率                 PIC S9(2)V9(8) COMP-3.
000280 01  ()新規書替区分           PIC  X(1).
000290 01  ()案件発生区分           PIC  X(1).
000300 01  ()ローンコミ付議NO     PIC  X(7).
000310 01  ()稟議区分               PIC  X(1).
000320 01  ()稟議NO               PIC  X(10).
000330 01  ()決裁区分               PIC  X(1).
000340 01  ()担保区分               PIC  X(1).
000350 01  ()連動金利区分           PIC  X(2).
000360 01  ()連動金利名             PIC  N(10).
000370 01  ()スプレッド             PIC S9(2)V9(8) COMP-3.
000380 01  ()確定日                 PIC  X(8).
000390 01  ()片端両端区分           PIC  X(1).
000400 01  ()金利変動区分           PIC  X(1).
000410 01  ()前取後取区分           PIC  X(1).
000420 01  ()利息端数処理コード     PIC  X(1).
000430 01  ()利率基数コード         PIC  X(1).
000440 01  ()休日対応区分           PIC  X(1).
000450 01  ()社内金利               PIC S9(2)V9(8) COMP-3.
000460 01  ()銀行短縮コード         PIC  X(2).
000470 01  ()銀行コード             PIC  X(7).
000480 01  ()口座名称               PIC  N(30).
000490 01  ()口座番号               PIC  X(7).
000500 01  ()償還請求権有無区分     PIC  X(1).
000510 01  ()対抗要件               PIC  X(1).
000520 01  ()債務者通知区分         PIC  X(1).
000530 01  ()代理回収有無区分       PIC  X(1).
000540 01  ()請求先コード           PIC  X(8).
000550 01  ()原債務者コード         PIC  X(8).
000560 01  ()原債務者情報１         PIC  N(20).
000570 01  ()原債務者情報２         PIC  N(20).
000580 01  ()原債務者情報３         PIC  N(20).
000590 01  ()登録日                 PIC  X(8).
000600 01  ()登録時刻               PIC  X(6).
000610 01  ()登録担当者コード       PIC  X(4).
000620 01  ()更新日                 PIC  X(8).
000630 01  ()更新時刻               PIC  X(6).
000640 01  ()更新担当者コード       PIC  X(4).
000650 01  ()預金種類               PIC  X(1).
