000010************************************************
000020* (FCT_WORK)
000030************************************************
000040 01  ()契約番号               PIC  X(7).
000050 01  ()種類                   PIC  X(1).
000060 01  ()新事業所コード         PIC  X(4).
