000010************************************************
000020* (FCT_TEGATA)
000030************************************************
000040 01  ()契約番号               PIC  X(7).
000050 01  ()契約番号枝番           PIC  X(2).
000060 01  ()実行日                 PIC  X(8).
000070 01  ()手形期日               PIC  X(8).
000080 01  ()利息期日               PIC  X(8).
000090 01  ()期間日数               PIC S9(4) COMP-3.
000100 01  ()買戻予定日             PIC  X(8).
000110 01  ()買取代金支払日         PIC  X(8).
000120 01  ()額面金額               PIC S9(13) COMP-3.
000130 01  ()買取金額               PIC S9(13) COMP-3.
000140 01  ()割引料                 PIC S9(13) COMP-3.
000150 01  ()回収方式               PIC  X(1).
000160 01  ()粗利益                 PIC S9(13) COMP-3.
000170 01  ()手形種類               PIC  X(1).
000180 01  ()取引銀行コード         PIC  X(7).
000190 01  ()支払人名               PIC  N(30).
000200 01  ()支払場所               PIC  N(30).
000210 01  ()手形NO               PIC  X(10).
000220 01  ()受取手数料             PIC S9(13) COMP-3.
000230 01  ()受取手数料消費税等額   PIC S9(13) COMP-3.
000240 01  ()戻し利息額             PIC S9(13) COMP-3.
000250 01  ()割引率                 PIC S9(2)V9(8) COMP-3.
000260 01  ()社内金利               PIC S9(2)V9(8) COMP-3.
000270 01  ()手形の裏書方法         PIC  X(1).
000280 01  ()裏付取引               PIC  N(20).
000290 01  ()徴収書類               PIC  N(15).
000300 01  ()請求書送付先           PIC  N(30).
000310 01  ()請求先コード           PIC  X(8).
000320 01  ()手形債権の表示         PIC  N(30).
000330 01  ()代理回収区分           PIC  X(1).
000340 01  ()原債務者コード         PIC  X(8).
000350 01  ()原債務者情報１         PIC  N(20).
000360 01  ()原債務者情報２         PIC  N(20).
000370 01  ()原債務者情報３         PIC  N(20).
000380 01  ()登録日                 PIC  X(8).
000390 01  ()登録時刻               PIC  X(6).
000400 01  ()登録担当者コード       PIC  X(4).
000410 01  ()更新日                 PIC  X(8).
000420 01  ()更新時刻               PIC  X(6).
000430 01  ()更新担当者コード       PIC  X(4).
000440 01  ()期限前決済日           PIC  X(8).
000450 01  ()戻し利率               PIC S9(2)V9(8) COMP-3.
000460 01  ()戻し日数               PIC S9(4) COMP-3.
000470 01  ()戻し利息相殺コード     PIC  X(1).
000480 01  ()返済手数料             PIC S9(13) COMP-3.
000490 01  ()返済手数料消費税等額   PIC S9(13) COMP-3.
