000010************************************************
000020* 否認(基本)(HSNINK)
000030************************************************
000040    03  ()契約番号               PIC  X(9).
000050    03  ()債権更新区分           PIC  X(1).
000060    03  ()ユーザーコード         PIC  X(8).
000070    03  ()計算方式               PIC  X(1).
000080    03  ()サイクル               PIC  X(2).
000090    03  ()ＢＥＧＩＮ回数         PIC  X(1).
000100    03  ()据置                   PIC  X(3).
000110    03  ()検収日                 PIC  X(8).
000120    03  ()リース期間             PIC  X(3).
000130    03  ()支払回数計             PIC  X(3).
000140    03  ()リースＥＮＤ           PIC  X(8).
000150    03  ()ファイナンスＥＮＤ     PIC  X(8).
000160    03  ()契約金合計             PIC S9(13).
000170    03  ()購入合計               PIC S9(13).
000180    03  ()残価額                 PIC S9(13).
000190    03  ()残価保証               PIC  X(1).
000200    03  ()入金日                 PIC  X(2).
000210    03  ()消費税率               PIC S9(3)V9(1).
000220    03  ()利息合計               PIC S9(13).
000230    03  ()費用合計               PIC S9(13).
000240    03  ()計上ＥＮＤ             PIC  X(6).
000250    03  ()リースＳＴＡＲＴ       PIC  X(8).
000260    03  ()ファイナンスＳＴＡＲＴ PIC  X(6).
000270    03  ()入金１回目             PIC  X(8).
