000010************************************************
000020* (IBS_DATE)
000030************************************************
000040 01  ()業務年                 PIC  X(4).
000050 01  ()業務月                 PIC  X(2).
000060 01  ()業務日                 PIC  X(2).
000070 01  ()登録日                 PIC  X(8).
000080 01  ()登録時刻               PIC  X(6).
000090 01  ()登録担当者コード       PIC  X(4).
000100 01  ()更新日                 PIC  X(8).
000110 01  ()更新時刻               PIC  X(6).
000120 01  ()更新担当者コード       PIC  X(4).
