000010************************************************
000020* (IBS_TRANS_CITY)
000030************************************************
000040 01  ()案件№                 PIC  X(12).
000050 01  ()関連都市コード         PIC  X(3).
