000010************************************************
000020* (IBS_BRANCH)
000030************************************************
000040 01  ()部店コード             PIC  X(4).
000050 01  ()契約部店コード         PIC  X(1).
000060 01  ()略称コード             PIC  X(3).
000070 01  ()都市コード             PIC  X(3).
000080 01  ()名称＿日本語           PIC  N(25).
000090 01  ()名称＿英語             PIC  N(25).
000100 01  ()略称                   PIC  N(9).
000110 01  ()登録日                 PIC  X(8).
000120 01  ()登録時刻               PIC  X(6).
000130 01  ()登録担当者コード       PIC  X(4).
000140 01  ()更新日                 PIC  X(8).
000150 01  ()更新時刻               PIC  X(6).
000160 01  ()更新担当者コード       PIC  X(4).
