000010************************************************
000020* (IBS_ACCOUNT)
000030************************************************
000040 01  ()勘定科目コード         PIC  X(2).
000050 01  ()使用区分               PIC  X(1).
000060 01  ()大分類コード           PIC  X(1).
000070 01  ()科目コード             PIC  X(3).
000080 01  ()取引コード             PIC  X(2).
000090 01  ()口座番号               PIC  X(8).
000100 01  ()大分類名               PIC  N(5).
000110 01  ()勘定科目名             PIC  N(12).
000120 01  ()取引名                 PIC  N(5).
000130 01  ()口座名                 PIC  N(16).
000140 01  ()集計コード１           PIC  X(4).
000150 01  ()集計コード２           PIC  X(4).
000160 01  ()集計コード３           PIC  X(4).
000170 01  ()登録日                 PIC  X(8).
000180 01  ()登録時刻               PIC  X(6).
000190 01  ()登録担当者コード       PIC  X(4).
000200 01  ()更新日                 PIC  X(8).
000210 01  ()更新時刻               PIC  X(6).
000220 01  ()更新担当者コード       PIC  X(4).
