000010************************************************
000020* (IBS_CUSTOMER)
000030************************************************
000040 01  ()取引先コード           PIC  X(8).
000050 01  ()名寄せコード           PIC  X(8).
000060 01  ()グループコード         PIC  X(8).
000070 01  ()部店コード             PIC  X(4).
000080 01  ()国際国内区分           PIC  X(1).
000090 01  ()名称                   PIC  N(30).
000100 01  ()取引先名称＿漢字       PIC  N(20).
000110 01  ()取引先名称＿カナ       PIC  N(30).
000120 01  ()フリガナ               PIC  X(10).
000130 01  ()ＭＴＦＧ関連会社区分   PIC  X(1).
000140 01  ()ＢＯＴＬ関連会社区分   PIC  X(1).
000150 01  ()会社区分               PIC  X(2).
000160 01  ()ソブリン区分           PIC  X(1).
000170 01  ()国コード               PIC  X(3).
000180 01  ()業種コード             PIC  X(2).
000190 01  ()格付け                 PIC  X(3).
000200 01  ()情報交換通知区分       PIC  X(1).
000210 01  ()請求情報１             PIC  N(20).
000220 01  ()請求情報２             PIC  N(20).
000230 01  ()請求情報３             PIC  N(20).
000240 01  ()請求情報４             PIC  N(20).
000250 01  ()請求情報５             PIC  N(20).
000260 01  ()請求情報６             PIC  N(20).
000270 01  ()請求情報７             PIC  N(20).
000280 01  ()請求情報８             PIC  N(20).
000290 01  ()電話番号               PIC  X(20).
000300 01  ()ＦＡＸ番号             PIC  X(20).
000310 01  ()備考１                 PIC  N(25).
000320 01  ()備考２                 PIC  N(25).
000330 01  ()登録日                 PIC  X(8).
000340 01  ()登録時刻               PIC  X(6).
000350 01  ()登録担当者コード       PIC  X(4).
000360 01  ()更新日                 PIC  X(8).
000370 01  ()更新時刻               PIC  X(6).
000380 01  ()更新担当者コード       PIC  X(4).
