000010************************************************
000020* (IBS_SUMMARY)
000030************************************************
000040 01  ()案件№                 PIC  X(12).
000050 01  ()契約№                 PIC  X(9).
000060 01  ()貸借区分               PIC  X(1).
000070 01  ()契約状態区分           PIC  X(1).
000080 01  ()取引先コード           PIC  X(8).
000090 01  ()会社区分               PIC  X(2).
000100 01  ()勘定科目コード         PIC  X(2).
000110 01  ()貸主借主区分名         PIC  X(4).
000120 01  ()貸主借主コード         PIC  X(8).
000130 01  ()貸主借主名             PIC  N(30).
000140 01  ()稟議№                 PIC  X(10).
000150 01  ()契約形態               PIC  X(1).
000160 01  ()案件成約日             PIC  X(8).
000170 01  ()案件名                 PIC  N(30).
000180 01  ()協調形態               PIC  X(2).
000190 01  ()幹事会社コード         PIC  X(8).
000200 01  ()案件全体幣種           PIC  X(3).
000210 01  ()案件全体額             PIC S9(14)V9(2) COMP-3.
000220 01  ()当社持分額幣種         PIC  X(3).
000230 01  ()当社持分額             PIC S9(14)V9(2) COMP-3.
000240 01  ()主導店コード           PIC  X(4).
000250 01  ()記帳店コード           PIC  X(4).
000260 01  ()営業担当者             PIC  X(4).
000270 01  ()事務担当者             PIC  X(1).
000280 01  ()与信先コード           PIC  X(8).
000290 01  ()被保証形態             PIC  X(1).
000300 01  ()保険書類徴求           PIC  X(1).
000310 01  ()保険更新月１           PIC  X(4).
000320 01  ()保険更新月２           PIC  X(4).
000330 01  ()保険更新月３           PIC  X(4).
000340 01  ()資金使途コード         PIC  X(4).
000350 01  ()担保種類               PIC  X(2).
000360 01  ()担保評価額幣種         PIC  X(3).
000370 01  ()担保評価額             PIC S9(14)V9(2) COMP-3.
000380 01  ()担保名称               PIC  N(20).
000390 01  ()与信対象区分           PIC  X(1).
000400 01  ()貸主コード             PIC  X(8).
000410 01  ()借主コード             PIC  X(8).
000420 01  ()契約識別名             PIC  N(15).
000430 01  ()元本元利区分           PIC  X(1).
000440 01  ()元本幣種               PIC  X(3).
000450 01  ()元本                   PIC S9(14)V9(2) COMP-3.
000460 01  ()ユニット価格           PIC S9(14)V9(2) COMP-3.
000470 01  ()残価額                 PIC S9(14)V9(2) COMP-3.
000480 01  ()元利合計               PIC S9(14)V9(2) COMP-3.
000490 01  ()利息幣種               PIC  X(3).
000500 01  ()契約成約日             PIC  X(8).
000510 01  ()実行日                 PIC  X(8).
000520 01  ()終了日                 PIC  X(8).
000530 01  ()契約期間               PIC S9(3) COMP-3.
000540 01  ()据置期間               PIC S9(2) COMP-3.
000550 01  ()サイクル               PIC S9(2) COMP-3.
000560 01  ()支払回数               PIC S9(4) COMP-3.
000570 01  ()実行日ＴＴＭ           PIC S9(4)V9(2) COMP-3.
000580 01  ()貸主＿勘定科目コード   PIC  X(2).
000590 01  ()借主＿勘定科目コード   PIC  X(2).
000600 01  ()前取後取区分           PIC  X(1).
000610 01  ()利率基数コード         PIC  X(1).
000620 01  ()片端両端区分           PIC  X(1).
000630 01  ()利息単位               PIC S9(2) COMP-3.
000640 01  ()端数処理コード         PIC  X(1).
000650 01  ()利息基準日             PIC  X(2).
000660 01  ()基準日休日区分         PIC  X(2).
000670 01  ()基準日変動区分         PIC  X(1).
000680 01  ()回収日日数差           PIC S9(2) COMP-3.
000690 01  ()運用金利区分           PIC  X(1).
000700 01  ()運用金利メモ           PIC  N(20).
000710 01  ()調達金利区分           PIC  X(1).
000720 01  ()調達金利メモ           PIC  N(20).
000730 01  ()調達先名称             PIC  N(20).
000740 01  ()利率確定限度日         PIC  X(8).
000750 01  ()洗替対象区分           PIC  X(1).
000760 01  ()外税控除コード         PIC  X(1).
000770 01  ()消費税コード           PIC  X(3).
000780 01  ()書類名１               PIC  N(15).
000790 01  ()期日管理１             PIC S9(2) COMP-3.
000800 01  ()営業日判定１           PIC  X(1).
000810 01  ()書類名２               PIC  N(15).
000820 01  ()期日管理２             PIC S9(2) COMP-3.
000830 01  ()営業日判定２           PIC  X(1).
000840 01  ()書類名３               PIC  N(15).
000850 01  ()期日管理３             PIC S9(2) COMP-3.
000860 01  ()営業日判定３           PIC  X(1).
000870 01  ()書類名４               PIC  N(15).
000880 01  ()期日管理４             PIC S9(2) COMP-3.
000890 01  ()営業日判定４           PIC  X(1).
000900 01  ()書類名５               PIC  N(15).
000910 01  ()期日管理５             PIC S9(2) COMP-3.
000920 01  ()営業日判定５           PIC  X(1).
000930 01  ()書類名６               PIC  N(15).
000940 01  ()期日管理６             PIC S9(2) COMP-3.
000950 01  ()営業日判定６           PIC  X(1).
000960 01  ()書類名７               PIC  N(15).
000970 01  ()期日管理７             PIC S9(2) COMP-3.
000980 01  ()営業日判定７           PIC  X(1).
000990 01  ()書類名８               PIC  N(15).
001000 01  ()期日管理８             PIC S9(2) COMP-3.
001010 01  ()営業日判定８           PIC  X(1).
001020 01  ()書類名９               PIC  N(15).
001030 01  ()期日管理９             PIC S9(2) COMP-3.
001040 01  ()営業日判定９           PIC  X(1).
001050 01  ()書類名１０             PIC  N(15).
001060 01  ()期日管理１０           PIC S9(2) COMP-3.
001070 01  ()営業日判定１０         PIC  X(1).
001080 01  ()汎用区分１             PIC  X(2).
001090 01  ()汎用区分２             PIC  X(2).
001100 01  ()汎用区分３             PIC  X(2).
001110 01  ()計算日                 PIC  X(8).
001120 01  ()日数                   PIC S9(4) COMP-3.
001130 01  ()回収日                 PIC  X(8).
001140 01  ()ＴＴＭ                 PIC S9(4)V9(2) COMP-3.
001150 01  ()調達金利               PIC S9(4)V9(8) COMP-3.
001160 01  ()運用金利               PIC S9(4)V9(8) COMP-3.
001170 01  ()利息                   PIC S9(14)V9(2) COMP-3.
001180 01  ()その他                 PIC S9(14)V9(2) COMP-3.
001190 01  ()回収額                 PIC S9(14)V9(2) COMP-3.
001200 01  ()未実現利益差額累計     PIC S9(14)V9(2) COMP-3.
001210 01  ()備考                   PIC  N(10).
001220 01  ()前回今回期日           PIC  X(8).
001230 01  ()次回期日               PIC  X(8).
001240 01  ()未成約残高＿元本＿幣種 PIC  X(3).
001250 01  ()未成約残高＿元本＿金額 PIC S9(14)V9(2) COMP-3.
001260 01  ()未成約残高＿元本＿換算相場 PIC S9(4)V9(2) COMP-3.
001270 01  ()未成約残高＿元本＿円換算額 PIC S9(14) COMP-3.
001280 01  ()未成約残高＿元本＿＄相場 PIC S9(4)V9(2) COMP-3.
001290 01  ()未成約残高＿元本＿＄換算額 PIC S9(14)V9(2) COMP-3.
001300 01  ()前月末残高＿元本＿幣種 PIC  X(3).
001310 01  ()前月末残高＿元本＿金額 PIC S9(14)V9(2) COMP-3.
001320 01  ()前月末残高＿元本＿換算相場 PIC S9(4)V9(2) COMP-3.
001330 01  ()前月末残高＿元本＿円換算額 PIC S9(14) COMP-3.
001340 01  ()前月末残高＿利息＿幣種 PIC  X(3).
001350 01  ()前月末残高＿利息＿金額 PIC S9(14)V9(2) COMP-3.
001360 01  ()前月末残高＿利息＿換算相場 PIC S9(4)V9(2) COMP-3.
001370 01  ()前月末残高＿利息＿円換算額 PIC S9(14) COMP-3.
001380 01  ()前月末残高＿元利合計＿幣種 PIC  X(3).
001390 01  ()前月末残高＿元利合計＿金額 PIC S9(14)V9(2) COMP-3.
001400 01  ()前月末残高＿元利合計＿換算相場 PIC S9(4)V9(2) COMP-3.
001410 01  ()前月末残高＿元利合計＿円換算額 PIC S9(14) COMP-3.
001420 01  ()当月実行高＿元本＿幣種 PIC  X(3).
001430 01  ()当月実行高＿元本＿金額 PIC S9(14)V9(2) COMP-3.
001440 01  ()当月実行高＿元本＿換算相場 PIC S9(4)V9(2) COMP-3.
001450 01  ()当月実行高＿元本＿円換算額 PIC S9(14) COMP-3.
001460 01  ()当月実行高＿利息＿幣種 PIC  X(3).
001470 01  ()当月実行高＿利息＿金額 PIC S9(14)V9(2) COMP-3.
001480 01  ()当月実行高＿利息＿換算相場 PIC S9(4)V9(2) COMP-3.
001490 01  ()当月実行高＿利息＿円換算額 PIC S9(14) COMP-3.
001500 01  ()当月実行高＿元利合計＿幣種 PIC  X(3).
001510 01  ()当月実行高＿元利合計＿金額 PIC S9(14)V9(2) COMP-3.
001520 01  ()当月実行高＿元利合計＿換算相場 PIC S9(4)V9(2) COMP-3.
001530 01  ()当月実行高＿元利合計＿円換算額 PIC S9(14) COMP-3.
001540 01  ()当月回収高＿元本＿幣種 PIC  X(3).
001550 01  ()当月回収高＿元本＿金額 PIC S9(14)V9(2) COMP-3.
001560 01  ()当月回収高＿元本＿換算相場 PIC S9(4)V9(2) COMP-3.
001570 01  ()当月回収高＿元本＿円換算額 PIC S9(14) COMP-3.
001580 01  ()当月回収高＿利息＿幣種 PIC  X(3).
001590 01  ()当月回収高＿利息＿金額 PIC S9(14)V9(2) COMP-3.
001600 01  ()当月回収高＿利息＿換算相場 PIC S9(4)V9(2) COMP-3.
001610 01  ()当月回収高＿利息＿円換算額 PIC S9(14) COMP-3.
001620 01  ()当月回収高＿元利合計＿幣種 PIC  X(3).
001630 01  ()当月回収高＿元利合計＿金額 PIC S9(14)V9(2) COMP-3.
001640 01  ()当月回収高＿元利合計＿換算相場 PIC S9(4)V9(2) COMP-3.
001650 01  ()当月回収高＿元利合計＿円換算額 PIC S9(14) COMP-3.
001660 01  ()当月末残高＿元本＿幣種 PIC  X(3).
001670 01  ()当月末残高＿元本＿金額 PIC S9(14)V9(2) COMP-3.
001680 01  ()当月末残高＿元本＿換算相場 PIC S9(4)V9(2) COMP-3.
001690 01  ()当月末残高＿元本＿円換算額 PIC S9(14) COMP-3.
001700 01  ()当月末残高＿元本＿＄相場 PIC S9(4)V9(2) COMP-3.
001710 01  ()当月末残高＿元本＿＄換算額 PIC S9(14)V9(2) COMP-3.
001720 01  ()当月末残高＿利息＿幣種 PIC  X(3).
001730 01  ()当月末残高＿利息＿金額 PIC S9(14)V9(2) COMP-3.
001740 01  ()当月末残高＿利息＿換算相場 PIC S9(4)V9(2) COMP-3.
001750 01  ()当月末残高＿利息＿円換算額 PIC S9(14) COMP-3.
001760 01  ()当月末残高＿利息＿＄相場 PIC S9(4)V9(2) COMP-3.
001770 01  ()当月末残高＿利息＿＄換算額 PIC S9(14)V9(2) COMP-3.
001780 01  ()当月末残高＿元利合計＿幣種 PIC  X(3).
001790 01  ()当月末残高＿元利合計＿金額 PIC S9(14)V9(2) COMP-3.
001800 01  ()当月末残高＿元利合計＿換算相場 PIC S9(4)V9(2) COMP-3.
001810 01  ()当月末残高＿元利合計＿円換算額 PIC S9(14) COMP-3.
001820 01  ()当月末残高＿元利合計＿＄相場 PIC S9(4)V9(2) COMP-3.
001830 01  ()当月末残高＿元利合計＿＄換算額 PIC S9(14)V9(2) COMP-3.
001840 01  ()為替差損益＿元本       PIC S9(14) COMP-3.
001850 01  ()為替差損益＿利息       PIC S9(14) COMP-3.
001860 01  ()為替差損益＿元利合計   PIC S9(14) COMP-3.
001870 01  ()当月＿幣種             PIC  X(3).
001880 01  ()当月＿換算相場         PIC S9(4)V9(2) COMP-3.
001890 01  ()当月平均残高＿金額     PIC S9(14)V9(2) COMP-3.
001900 01  ()当月平均残高＿円換算額 PIC S9(14) COMP-3.
001910 01  ()運用月中利息＿金額     PIC S9(14)V9(2) COMP-3.
001920 01  ()運用月中利息＿円換算額 PIC S9(14) COMP-3.
001930 01  ()調達月中利息＿金額     PIC S9(14)V9(2) COMP-3.
001940 01  ()調達月中利息＿円換算額 PIC S9(14) COMP-3.
001950 01  ()当月粗利＿金額         PIC S9(14)V9(2) COMP-3.
001960 01  ()当月粗利＿円換算額     PIC S9(14) COMP-3.
001970 01  ()運用利回り             PIC S9(4)V9(8) COMP-3.
001980 01  ()見越繰延区分           PIC  X(1).
001990 01  ()未収収益＿金額         PIC S9(14)V9(2) COMP-3.
002000 01  ()未収収益＿円換算額     PIC S9(14) COMP-3.
002010 01  ()未収収益＿期間日数     PIC S9(4) COMP-3.
002020 01  ()未収収益＿未収日数     PIC S9(4) COMP-3.
002030 01  ()未経過収益＿金額       PIC S9(14)V9(2) COMP-3.
002040 01  ()未経過収益＿円換算額   PIC S9(14) COMP-3.
002050 01  ()未経過収益＿期間日数   PIC S9(4) COMP-3.
002060 01  ()未経過収益＿未経過日数 PIC S9(4) COMP-3.
002070 01  ()前払費用＿金額         PIC S9(14)V9(2) COMP-3.
002080 01  ()前払費用＿円換算額     PIC S9(14) COMP-3.
002090 01  ()前払費用＿期間日数     PIC S9(4) COMP-3.
002100 01  ()前払費用＿前払日数     PIC S9(4) COMP-3.
002110 01  ()未払費用＿金額         PIC S9(14)V9(2) COMP-3.
002120 01  ()未払費用＿円換算額     PIC S9(14) COMP-3.
002130 01  ()未払費用＿期間日数     PIC S9(4) COMP-3.
002140 01  ()未払費用＿未払日数     PIC S9(4) COMP-3.
002150 01  ()基準日                 PIC  X(8).
002160 01  ()作成日                 PIC  X(8).
002170 01  ()作成時刻               PIC  X(6).
002180 01  ()作成担当者コード       PIC  X(4).
