000010************************************************
000020* (JOM_FORM_0009_H)
000030************************************************
000040 01  ()éxìXÇP                 PIC  N(10).
000050 01  ()éxìXÇQ                 PIC  N(10).
000060 01  ()éxìXÇR                 PIC  N(10).
000070 01  ()éxìXÇS                 PIC  N(10).
000080 01  ()éxìXÇT                 PIC  N(10).
000090 01  ()éxìXÇU                 PIC  N(10).
000100 01  ()éxìXÇV                 PIC  N(10).
000110 01  ()éxìXÇW                 PIC  N(10).
000120 01  ()éxìXÇX                 PIC  N(10).
000130 01  ()éxìXÇPÇO               PIC  N(10).
000140 01  ()éxìXÇPÇP               PIC  N(10).
000150 01  ()éxìXÇPÇQ               PIC  N(10).
000160 01  ()éxìXÇPÇR               PIC  N(10).
000170 01  ()éxìXÇPÇS               PIC  N(10).
000180 01  ()çáåv                   PIC  N(10).
