000010************************************************
000020* (JOM_SEIKYU_EXCEL)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()支店                   PIC  X(2).
000070 01  ()ジョモ契約番号         PIC  X(6).
000080 01  ()ジョモ商品コード       PIC  X(4).
000090 01  ()再リースコード         PIC  X(1).
000100 01  ()検収日                 PIC  X(8).
000110 01  ()購入金額合計           PIC S9(13) COMP-3.
000120 01  ()期間                   PIC S9(3) COMP-3.
000130 01  ()物件名                 PIC  N(15).
000140 01  ()設置場所名             PIC  N(10).
000150 01  ()個別リース料           PIC S9(13) COMP-3.
