000010************************************************
000020* (JOM_FORM_0018)
000030************************************************
000040 01  ()ジョモ支店コード       PIC  X(2).
000050 01  ()支店名漢字             PIC  N(30).
000060 01  ()ジョモ契約番号         PIC  X(9).
000070 01  ()購入金額合計           PIC S9(13) COMP-3.
000080 01  ()仕入消費税等額合計     PIC S9(13) COMP-3.
000090 01  ()リース期間             PIC S9(3) COMP-3.
000100 01  ()リース料               PIC S9(13) COMP-3.
000110 01  ()消費税等額             PIC S9(13) COMP-3.
000120 01  ()リース料率             PIC S9(2)V9(6) COMP-3.
000130 01  ()契約金額               PIC S9(13) COMP-3.
000140 01  ()前受月数               PIC S9(2) COMP-3.
000150 01  ()前受リース料           PIC S9(13) COMP-3.
000160 01  ()繰延金額               PIC S9(13) COMP-3.
000170 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000180 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000190 01  ()売主名                 PIC  N(30).
000200 01  ()購入先コード           PIC  X(8).
000210 01  ()受取手数料             PIC S9(13) COMP-3.
000220 01  ()物件ＮＯ               PIC  X(3).
000230 01  ()ジョモ商品コード       PIC  X(4).
000240 01  ()ジョモ商品分類名       PIC  N(15).
000250 01  ()資産コード             PIC  X(7).
000260 01  ()耐用年数               PIC  X(2).
000270 01  ()動総保険コード         PIC  X(4).
000280 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000290 01  ()物件名漢字             PIC  N(20).
000300 01  ()物件名カナ             PIC  N(10).
000310 01  ()数量                   PIC S9(4) COMP-3.
000320 01  ()納付先コード           PIC  X(6).
000330 01  ()設置場所名漢字         PIC  N(20).
000340 01  ()設置場所住所           PIC  N(50).
000350 01  ()信用保険コード         PIC  X(6).
