000010************************************************
000020* (JOM_KIHON)
000030************************************************
000040 01  ()ジョモ支店コード       PIC  X(2).
000050 01  ()ジョモ契約番号         PIC  X(9).
000060 01  ()契約番号               PIC  X(9).
000070 01  ()事業所コード           PIC  X(4).
000080 01  ()ユーザーコード         PIC  X(8).
000090 01  ()顧客コード             PIC  X(6).
000100 01  ()取引先名               PIC  N(30).
000110 01  ()担当者コード           PIC  X(4).
000120 01  ()稟議ＮＯ               PIC  X(10).
000130 01  ()契約日                 PIC  X(8).
000140 01  ()検収日                 PIC  X(8).
000150 01  ()第１回入金日           PIC  X(8).
000160 01  ()入金基準日             PIC  X(2).
000170 01  ()リース期間             PIC S9(3) COMP-3.
000180 01  ()支払回数               PIC S9(3) COMP-3.
000190 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000200 01  ()前受月数               PIC S9(2) COMP-3.
000210 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000220 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000230 01  ()初回リース料           PIC S9(13) COMP-3.
000240 01  ()リース料               PIC S9(13) COMP-3.
000250 01  ()終回リース料           PIC S9(13) COMP-3.
000260 01  ()前受リース料           PIC S9(13) COMP-3.
000270 01  ()転リース提携先コード   PIC  X(2).
000280 01  ()充当相殺区分           PIC  X(1).
000290 01  ()購入金額合計           PIC S9(13) COMP-3.
000300 01  ()仕入消費税等額合計     PIC S9(13) COMP-3.
000310 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000320 01  ()繰延金額               PIC S9(13) COMP-3.
000330 01  ()契約金額               PIC S9(13) COMP-3.
000340 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000350 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000360 01  ()粗利益                 PIC S9(13) COMP-3.
000370 01  ()受取手数料             PIC S9(13) COMP-3.
000380 01  ()受取手数料現在価値     PIC S9(13) COMP-3.
000390 01  ()基本リース料           PIC S9(13) COMP-3.
000400 01  ()月額固定資産税総額     PIC S9(13) COMP-3.
000410 01  ()月額動総保険料総額     PIC S9(13) COMP-3.
000420 01  ()月額前受メリット       PIC S9(13) COMP-3.
000430 01  ()月額繰延メリット       PIC S9(13) COMP-3.
000440 01  ()実質リース料ＰＶ       PIC S9(13) COMP-3.
000450 01  ()ディーラーコード       PIC  X(5).
000460 01  ()売主名                 PIC  N(30).
000470 01  ()売主住所               PIC  N(50).
000480 01  ()ジョモ支払条件コード   PIC  X(2).
000490 01  ()購入先コード           PIC  X(8).
000500 01  ()エラー有無区分         PIC  X(1).
000510 01  ()登録日                 PIC  X(8).
000520 01  ()登録時刻               PIC  X(6).
000530 01  ()登録担当者コード       PIC  X(4).
000540 01  ()更新日                 PIC  X(8).
000550 01  ()更新時刻               PIC  X(6).
000560 01  ()更新担当者コード       PIC  X(4).
000570 01  ()斡旋手数料             PIC S9(13) COMP-3.
000580 01  ()斡旋手数料現在価値     PIC S9(13) COMP-3.
