000010************************************************
000020* (JOM_FORM_0004_G)
000030************************************************
000040 01  ()Žx•¥ðŒ‚P             PIC  X(2).
000050 01  ()Žx•¥ðŒ‚Q             PIC  X(2).
000060 01  ()Žx•¥ðŒ‚R             PIC  X(2).
000070 01  ()Žx•¥ðŒ‚S             PIC  X(2).
000080 01  ()Žx•¥ðŒ‚T             PIC  X(2).
000090 01  ()Žx•¥ðŒ•¶Œ¾‚P         PIC  N(20).
000100 01  ()Žx•¥ðŒ•¶Œ¾‚Q         PIC  N(20).
000110 01  ()Žx•¥ðŒ•¶Œ¾‚R         PIC  N(20).
000120 01  ()Žx•¥ðŒ•¶Œ¾‚S         PIC  N(20).
000130 01  ()Žx•¥ðŒ•¶Œ¾‚T         PIC  N(20).
000140 01  ()w“ü‹àŠz‚P             PIC S9(13) COMP-3.
000150 01  ()w“ü‹àŠz‚Q             PIC S9(13) COMP-3.
000160 01  ()w“ü‹àŠz‚R             PIC S9(13) COMP-3.
000170 01  ()w“ü‹àŠz‚S             PIC S9(13) COMP-3.
000180 01  ()w“ü‹àŠz‚T             PIC S9(13) COMP-3.
000190 01  ()Á”ïÅ‚P               PIC S9(13) COMP-3.
000200 01  ()Á”ïÅ‚Q               PIC S9(13) COMP-3.
000210 01  ()Á”ïÅ‚R               PIC S9(13) COMP-3.
000220 01  ()Á”ïÅ‚S               PIC S9(13) COMP-3.
000230 01  ()Á”ïÅ‚T               PIC S9(13) COMP-3.
