000010************************************************
000020* (JOM_PARA)
000030************************************************
000040 01  ()ＫＥＹ                 PIC  X(3).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()顧客コード             PIC  X(6).
000080 01  ()取引先名               PIC  N(30).
000090 01  ()担当者コード           PIC  X(4).
000100 01  ()契約日                 PIC  X(8).
000110 01  ()検収日                 PIC  X(8).
000120 01  ()第１回入金日           PIC  X(8).
000130 01  ()入金基準日             PIC  X(2).
000140 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000150 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000160 01  ()転リース提携先コード   PIC  X(2).
000170 01  ()充当相殺区分           PIC  X(1).
000180 01  ()ディーラーコード       PIC  X(5).
000190 01  ()売主名                 PIC  N(30).
000200 01  ()売主住所               PIC  N(50).
000210 01  ()購入先コード           PIC  X(8).
000220 01  ()支払先コード           PIC  X(4).
000230 01  ()斡旋手数料             PIC S9(13) COMP-3.
000240 01  ()斡旋手数料支払日       PIC  N(30).
000250 01  ()登録日                 PIC  X(8).
000260 01  ()登録時刻               PIC  X(6).
000270 01  ()登録担当者コード       PIC  X(4).
000280 01  ()更新日                 PIC  X(8).
000290 01  ()更新時刻               PIC  X(6).
000300 01  ()更新担当者コード       PIC  X(4).
