000010************************************************
000020* (JYO_GENREC)
000030************************************************
000040 01  ()GENREC           PIC  N(50).
