000010************************************************
000020* (KAI_WK_HOUTABLE)
000030************************************************
000040 01  ()NO                   PIC S9(3) COMP-3.
000050 01  ()担当部店               PIC  N(10).
000060 01  ()解約日                 PIC  X(8).
000070 01  ()契約番号               PIC  X(9).
000080 01  ()名寄せコード           PIC  X(8).
000090 01  ()契約先名               PIC  N(30).
000100 01  ()直転区分               PIC  X(1).
000110 01  ()解約理由               PIC  X(1).
000120 01  ()解約対象区分           PIC S9(1) COMP-3.
000130 01  ()解約物件名漢字         PIC  N(20).
000140 01  ()原物件金額             PIC S9(13) COMP-3.
000150 01  ()原残価金額             PIC S9(13) COMP-3.
000160 01  ()原契約金額             PIC S9(13) COMP-3.
000170 01  ()解約物件金額           PIC S9(13) COMP-3.
000180 01  ()リース期間             PIC S9(13) COMP-3.
000190 01  ()解約月額リース料       PIC S9(13) COMP-3.
000200 01  ()耐用年数               PIC S9(2)V9(3) COMP-3.
000210 01  ()保険料率               PIC S9(2)V9(3) COMP-3.
000220 01  ()解約残価               PIC S9(13) COMP-3.
000230 01  ()解約初期費用           PIC S9(13) COMP-3.
000240 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000250 01  ()社内金利               PIC S9(2)V9(3) COMP-3.
000260 01  ()検収日                 PIC  X(8).
000270 01  ()初回リース料入金日     PIC  X(8).
000280 01  ()据置月数               PIC S9(3) COMP-3.
000290 01  ()第２回リース料入金日   PIC  X(8).
000300 01  ()経過月数               PIC S9(3) COMP-3.
000310 01  ()合意解約金             PIC S9(13) COMP-3.
000320 01  ()処分方法               PIC  X(1).
000330 01  ()売却代金               PIC S9(13) COMP-3.
000340 01  ()入金予定日             PIC  X(8).
000350 01  ()支払者                 PIC  X(1).
000360 01  ()支払方法               PIC  X(1).
000370 01  ()回収予定日             PIC  X(8).
000380 01  ()第３者名               PIC  X(30).
000390 01  ()支払金額               PIC S9(13) COMP-3.
000400 01  ()売却充当               PIC S9(13) COMP-3.
000410 01  ()物件相殺               PIC  X(1).
000420 01  ()前受けリース料処理     PIC  X(1).
000430 01  ()営業戦略部             PIC  X(1).
000440 01  ()総合企画部             PIC  X(1).
000450 01  ()事務管理部             PIC  X(1).
000460 01  ()包括異例               PIC  X(1).
000470 01  ()物件NO               PIC  X(3).
