000010************************************************
000020* (KAI_SAIKHN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()対象区分               PIC  X(1).
000060 01  ()解約日                 PIC  X(8).
000070 01  ()ＳＦＣ判定区分         PIC  X(1).
000080 01  ()規定損害金消費税率     PIC S9(2)V9(1) COMP-3.
000090 01  ()勘定処理コード         PIC  X(2).
000100 01  ()手数料請求コード       PIC  X(2).
000110 01  ()規定損害金合計         PIC S9(13) COMP-3.
000120 01  ()解約仕訳コード         PIC  X(3).
000130 01  ()規定損害金入金フラグ   PIC  X(1).
000140 01  ()解約入金日             PIC  X(8).
000150 01  ()前受分内訳             PIC  X(1).
000160 01  ()計算方式               PIC  X(1).
000170 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000180 01  ()規損金_売却代金充当金額 PIC S9(13) COMP-3.
000190 01  ()規損金第三者支払先名カナ PIC  X(30).
000200 01  ()第三者規損金額         PIC S9(13) COMP-3.
000210 01  ()規損金回収方法         PIC  X(1).
000220 01  ()物件代金相殺区分       PIC  X(1).
000230 01  ()登録日                 PIC  X(8).
000240 01  ()登録時刻               PIC  X(6).
000250 01  ()登録担当者コード       PIC  X(4).
000260 01  ()更新日                 PIC  X(8).
000270 01  ()更新時刻               PIC  X(6).
000280 01  ()更新担当者コード       PIC  X(4).
000290 01  ()支払回数               PIC S9(3) COMP-3.
