000010************************************************
000020* (KAI_WK_KISONGMN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()契約先名               PIC  N(30).
000060 01  ()解約日                 PIC  X(8).
000070 01  ()解約区分               PIC  N(10).
000080 01  ()解約物件金額           PIC S9(13) COMP-3.
000090 01  ()解約残価額             PIC S9(13) COMP-3.
000100 01  ()契約期間               PIC  X(3).
000110 01  ()据置月数               PIC  X(3).
000120 01  ()解約月額リース料       PIC S9(13) COMP-3.
000130 01  ()耐用年数               PIC S9(2)V9(3) COMP-3.
000140 01  ()保険料率               PIC S9(2)V9(3) COMP-3.
000150 01  ()解約初期費用           PIC S9(13) COMP-3.
000160 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000170 01  ()社内金利               PIC S9(2)V9(8) COMP-3.
000180 01  ()検収日                 PIC  X(8).
000190 01  ()第１回入金日           PIC  X(8).
000200 01  ()第２回入金日           PIC  X(8).
000210 01  ()経過月数               PIC  X(3).
000220 01  ()減額法１１０           PIC S9(13) COMP-3.
000230 01  ()保険価格１１０         PIC S9(13) COMP-3.
000240 01  ()実質元本残１０５       PIC S9(13) COMP-3.
000250 01  ()残存リース料           PIC S9(13) COMP-3.
000260 01  ()実質未回収元本         PIC S9(13) COMP-3.
000270 01  ()未徴収固定資産税       PIC S9(13) COMP-3.
000280 01  ()未徴収保険料           PIC S9(13) COMP-3.
000290 01  ()未回収合計             PIC S9(13) COMP-3.
000300 01  ()法定定額償却額残高     PIC S9(13) COMP-3.
000310 01  ()減額法１０５           PIC S9(13) COMP-3.
000320 01  ()物件番号               PIC  X(3).
000330 01  ()割賦FLG             PIC  X(1).
000340 01  ()法定定率償却額残高     PIC S9(13) COMP-3.
