000010************************************************
000020* (KAI_SAITENK)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件NO               PIC  X(3).
000060 01  ()展開番号               PIC  X(3).
000070 01  ()不均等リース料         PIC S9(13) COMP-3.
000080 01  ()月数                   PIC S9(3) COMP-3.
000090 01  ()登録日                 PIC  X(8).
000100 01  ()登録時刻               PIC  X(6).
000110 01  ()登録担当者コード       PIC  X(4).
000120 01  ()更新日                 PIC  X(8).
000130 01  ()更新時刻               PIC  X(6).
000140 01  ()更新担当者コード       PIC  X(4).
