000010************************************************
000020* (KAI_WK_HOUKISON)
000030************************************************
000040 01  ()NO                   PIC S9(3) COMP-3.
000050 01  ()実質未回収元本         PIC S9(13) COMP-3.
000060 01  ()未徴収TAX           PIC S9(13) COMP-3.
000070 01  ()未徴収保険料           PIC S9(13) COMP-3.
000080 01  ()合計                   PIC S9(13) COMP-3.
000090 01  ()減額法１１０           PIC S9(13) COMP-3.
000100 01  ()減額法１０５           PIC S9(13) COMP-3.
000110 01  ()実質元本残１０５       PIC S9(13) COMP-3.
000120 01  ()残リース料             PIC S9(13) COMP-3.
000130 01  ()未償却残高             PIC S9(13) COMP-3.
000140 01  ()契約番号               PIC  X(9).
000150 01  ()保険価格１１０         PIC S9(13) COMP-3.
000160 01  ()物件NO               PIC  X(3).
000170 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000180 01  ()割賦FLG             PIC  X(1).
000190 01  ()法定定率未償却残高     PIC S9(13) COMP-3.
