000010************************************************
000020* (KAI_WK_KEIYAKU2)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()契約先名               PIC  X(60).
000060 01  ()解約日年               PIC  X(4).
000070 01  ()解約日月               PIC  X(2).
000080 01  ()解約日日               PIC  X(2).
000090 01  ()契約金額               PIC S9(13) COMP-3.
000100 01  ()リース料               PIC S9(13) COMP-3.
000110 01  ()消費税等１             PIC S9(13) COMP-3.
000120 01  ()合計１                 PIC S9(13) COMP-3.
000130 01  ()前払リース料           PIC S9(13) COMP-3.
000140 01  ()前払リース料残高       PIC S9(13) COMP-3.
000150 01  ()消費税等２             PIC S9(13) COMP-3.
000160 01  ()合計２                 PIC S9(13) COMP-3.
000170 01  ()旧消費税率             PIC S9(2)V9(1) COMP-3.
000180 01  ()新消費税率             PIC S9(2)V9(1) COMP-3.
000190 01  ()解約前払リース料       PIC S9(13) COMP-3.
000200 01  ()同預り消費税等         PIC S9(13) COMP-3.
000210 01  ()解約後前払リース料     PIC S9(13) COMP-3.
000220 01  ()返却前払リース料       PIC S9(13) COMP-3.
