000010************************************************
000020* (KAI_WK_HOUGAMEN)
000030************************************************
000040 01  ()NO                   PIC S9(3) COMP-3.
000050 01  ()未徴収金残高           PIC S9(13) COMP-3.
000060 01  ()未徴収金回収方法       PIC  X(20).
000070 01  ()回収予定日             PIC  X(8).
000080 01  ()処分先                 PIC  N(40).
000090 01  ()売却決済条件           PIC  N(2).
000100 01  ()新契約NO             PIC  X(9).
000110 01  ()その他                 PIC  N(40).
000120 01  ()消費税調整             PIC  N(1).
000130 01  ()過剰リース料回収方法   PIC  N(4).
000140 01  ()指示                   PIC  N(40).
000150 01  ()返金先                 PIC  N(4).
000160 01  ()銀行                   PIC  N(15).
000170 01  ()支店                   PIC  N(15).
000180 01  ()預金種類               PIC  N(2).
000190 01  ()口座NO               PIC  X(7).
000200 01  ()預金名義               PIC  N(40).
000210 01  ()期日未到来手形         PIC  N(50).
000220 01  ()営業部店意見           PIC  N(200).
000230 01  ()契約番号               PIC  X(9).
000240 01  ()報告NO               PIC  X(8).
000250 01  ()取引先区分             PIC  X(1).
