000010************************************************
000020* (KEI_LPWK_KEISANSYO_1)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()端末番号               PIC  N(8).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()ユーザーコード         PIC  X(8).
000080 01  ()取引先名               PIC  N(30).
000090 01  ()勘定処理コード         PIC  X(2).
000100 01  ()取引形態コード         PIC  X(2).
000110 01  ()契約日                 PIC  X(8).
000120 01  ()検収予定日             PIC  X(8).
000130 01  ()検収日                 PIC  X(8).
000140 01  ()計算方式               PIC  X(1).
000150 01  ()リース期間             PIC S9(3) COMP-3.
000160 01  ()請求サイクル           PIC S9(2) COMP-3.
000170 01  ()支払回数               PIC S9(3) COMP-3.
000180 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000190 01  ()前受月数               PIC S9(2) COMP-3.
000200 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000210 01  ()月額平均保守料         PIC S9(13) COMP-3.
000220 01  ()その他諸費用総額       PIC S9(13) COMP-3.
000230 01  ()前渡金利息             PIC S9(13) COMP-3.
000240 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000250 01  ()消費税徴収区分         PIC  X(1).
000260 01  ()リース料               PIC S9(13) COMP-3.
000270 01  ()前受リース料           PIC S9(13) COMP-3.
000280 01  ()前渡金区分             PIC  X(1).
000290 01  ()再リース料表示区分     PIC  X(1).
000300 01  ()再リース料             PIC S9(13) COMP-3.
000310 01  ()損害賠償金文言         PIC  N(68).
000320 01  ()購入金額合計           PIC S9(13) COMP-3.
000330 01  ()残価額合計             PIC S9(13) COMP-3.
000340 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000350 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000360 01  ()粗利益                 PIC S9(13) COMP-3.
000370 01  ()契約金額               PIC S9(13) COMP-3.
000380 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000390 01  ()基本リース料率         PIC S9(2)V9(8) COMP-3.
000400 01  ()固定資産税総額         PIC S9(13) COMP-3.
000410 01  ()動総保険料総額         PIC S9(13) COMP-3.
000420 01  ()規定損失金物件金額     PIC S9(13) COMP-3.
000430 01  ()計算方法_規定損失金   PIC  X(2).
000440 01  ()初回リース料           PIC S9(13) COMP-3.
000450 01  ()終回リース料           PIC S9(13) COMP-3.
000460 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000470 01  ()加重耐用年数           PIC S9(2)V9(8) COMP-3.
000480 01  ()加重保険料率           PIC S9(2)V9(8) COMP-3.
000490 01  ()基本リース料総額       PIC S9(13) COMP-3.
000500 01  ()基本リース料月額       PIC S9(13) COMP-3.
000510 01  ()固定資産税月額         PIC S9(13) COMP-3.
000520 01  ()動総保険料月額         PIC S9(13) COMP-3.
000530 01  ()前受リース料総額       PIC S9(13) COMP-3.
000540 01  ()繰延リース料総額       PIC S9(13) COMP-3.
000550 01  ()保守料総額             PIC S9(13) COMP-3.
000560 01  ()月額前受メリット       PIC S9(13) COMP-3.
000570 01  ()月額繰延メリット       PIC S9(13) COMP-3.
000580 01  ()実質ＰＶ               PIC S9(13) COMP-3.
000590 01  ()残価ＰＶ               PIC S9(13) COMP-3.
000600 01  ()定額リース消費税額     PIC S9(13) COMP-3.
000610 01  ()初回リース消費税額     PIC S9(13) COMP-3.
000620 01  ()終回リース消費税額     PIC S9(13) COMP-3.
000630 01  ()リース消費税合計       PIC S9(13) COMP-3.
