000010************************************************
000020* (KEI_BUNKATU_WK_LIST)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()V•¨Œ‚m‚n             PIC  X(3).
000060 01  ()•¨Œ‚m‚n               PIC  X(3).
000070 01  ()Œ³•¨Œ”               PIC S9(4) COMP-3.
000080 01  ()’[––‚h‚c               PIC  X(16).
