000010************************************************
000020* (KEI_KYOTYO_CHECK)
000030************************************************
000040 01  ()幹事＿非幹事区分       PIC  X(1).
000050 01  ()ＯＰＥＮ＿ＣＬＯＳＥ区分 PIC  X(1).
000060 01  ()協調回収手順           PIC  X(1).
000070 01  ()勘定処理コード         PIC  X(2).
000080 01  ()債務協調コード         PIC  X(2).
000090 01  ()登録日                 PIC  X(8).
000100 01  ()登録時刻               PIC  X(6).
000110 01  ()登録担当者コード       PIC  X(4).
000120 01  ()更新日                 PIC  X(8).
000130 01  ()更新時刻               PIC  X(6).
000140 01  ()更新担当者コード       PIC  X(4).
