000010************************************************
000020* (KEI_LPWK_RINGI_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()端末番号               PIC  N(8).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()稟議ＮＯ               PIC  X(10).
000080 01  ()稟議区分               PIC  X(1).
000090 01  ()取引先区分             PIC  X(1).
000100 01  ()ユーザーコード         PIC  X(8).
000110 01  ()顧客コード             PIC  X(6).
000120 01  ()取引先名               PIC  N(30).
000130 01  ()担当者コード           PIC  X(4).
000140 01  ()取引形態コード         PIC  X(2).
000150 01  ()案件発生区分           PIC  X(1).
000160 01  ()物件確認基準           PIC  X(1).
000170 01  ()物件数                 PIC S9(4) COMP-3.
000180 01  ()購入先数               PIC S9(2) COMP-3.
000190 01  ()契約日                 PIC  X(8).
000200 01  ()検収予定日             PIC  X(8).
000210 01  ()検収日                 PIC  X(8).
000220 01  ()計算方式               PIC  X(1).
000230 01  ()リース期間             PIC S9(3) COMP-3.
000240 01  ()請求サイクル           PIC S9(2) COMP-3.
000250 01  ()支払回数               PIC S9(3) COMP-3.
000260 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000270 01  ()前受月数               PIC S9(2) COMP-3.
000280 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000290 01  ()月額平均保守料         PIC S9(13) COMP-3.
000300 01  ()その他諸費用総額       PIC S9(13) COMP-3.
000310 01  ()前渡金利息             PIC S9(13) COMP-3.
000320 01  ()リース料               PIC S9(13) COMP-3.
000330 01  ()前受リース料           PIC S9(13) COMP-3.
000340 01  ()前渡金区分             PIC  X(1).
000350 01  ()購入金額合計           PIC S9(13) COMP-3.
000360 01  ()残価額合計             PIC S9(13) COMP-3.
000370 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000380 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000390 01  ()粗利益                 PIC S9(13) COMP-3.
000400 01  ()契約金額               PIC S9(13) COMP-3.
000410 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000420 01  ()基本リース料率         PIC S9(2)V9(8) COMP-3.
000430 01  ()固定資産税総額         PIC S9(13) COMP-3.
000440 01  ()動総保険料総額         PIC S9(13) COMP-3.
000450 01  ()規定損失金物件金額     PIC S9(13) COMP-3.
000460 01  ()計算方法_規定損失金   PIC  X(2).
000470 01  ()ロンコミ付議ＮＯ       PIC  X(7).
000480 01  ()決済区分               PIC  X(1).
000490 01  ()初回リース料           PIC S9(13) COMP-3.
000500 01  ()終回リース料           PIC S9(13) COMP-3.
000510 01  ()請求区分１             PIC  X(1).
000520 01  ()請求区分２             PIC  X(1).
000530 01  ()第１回リース料受取り条件 PIC  N(10).
000540 01  ()２回目以降リース料受取り条件 PIC  N(10).
000550 01  ()手形枚数               PIC S9(3) COMP-3.
000560 01  ()銀行コード             PIC  X(7).
000570 01  ()口座番号               PIC  X(7).
000580 01  ()親会社名               PIC  N(30).
000590 01  ()取引先部署名           PIC  N(20).
000600 01  ()郵便番号３桁           PIC  X(3).
000610 01  ()郵便番号４桁           PIC  X(4).
000620 01  ()都道府県               PIC  N(5).
000630 01  ()住所１                 PIC  N(20).
000640 01  ()住所２                 PIC  N(20).
000650 01  ()上場区分               PIC  X(1).
000660 01  ()大企業コード           PIC  X(1).
000670 01  ()従業員数               PIC S9(6) COMP-3.
000680 01  ()ＢＴＭ取引区分         PIC  X(1).
000690 01  ()ＢＴＭ担当部店         PIC  N(15).
000700 01  ()利用リース会社         PIC  N(35).
000710 01  ()業種                   PIC  N(15).
000720 01  ()資本金                 PIC S9(6) COMP-3.
000730 01  ()取引開始日             PIC  X(8).
000740 01  ()取引種類               PIC  N(15).
000750 01  ()設立年月日             PIC  X(8).
000760 01  ()決算月                 PIC  X(2).
000770 01  ()クレライン期限年月     PIC  X(2).
000780 01  ()決算年月               PIC  X(6).
000790 01  ()売上高                 PIC S9(13) COMP-3.
000800 01  ()経常利益               PIC S9(13) COMP-3.
000810 01  ()当期利益               PIC S9(13) COMP-3.
000820 01  ()申告所得               PIC S9(13) COMP-3.
000830 01  ()自己資本               PIC S9(13) COMP-3.
000840 01  ()総資産                 PIC S9(13) COMP-3.
000850 01  ()リース残高ユーザー     PIC S9(13) COMP-3.
000860 01  ()割賦残高ユーザー       PIC S9(13) COMP-3.
000870 01  ()貸付残高ユーザー       PIC S9(13) COMP-3.
000880 01  ()ファク残高ユーザー     PIC S9(13) COMP-3.
000890 01  ()未検収残高ユーザー     PIC S9(13) COMP-3.
000900 01  ()未徴収残高ユーザー     PIC S9(13) COMP-3.
000910 01  ()保証残価ユーザー       PIC S9(13) COMP-3.
000920 01  ()リース残高名寄せ       PIC S9(13) COMP-3.
000930 01  ()割賦残高名寄せ         PIC S9(13) COMP-3.
000940 01  ()貸付残高名寄せ         PIC S9(13) COMP-3.
000950 01  ()ファク残高名寄せ       PIC S9(13) COMP-3.
000960 01  ()未検収残高名寄せ       PIC S9(13) COMP-3.
000970 01  ()未徴収残高名寄せ       PIC S9(13) COMP-3.
000980 01  ()保証残価名寄せ         PIC S9(13) COMP-3.
000990 01  ()リース残高グループ     PIC S9(13) COMP-3.
001000 01  ()割賦残高グループ       PIC S9(13) COMP-3.
001010 01  ()貸付残高グループ       PIC S9(13) COMP-3.
001020 01  ()ファク残高グループ     PIC S9(13) COMP-3.
001030 01  ()未検収残高グループ     PIC S9(13) COMP-3.
001040 01  ()未徴収残高グループ     PIC S9(13) COMP-3.
001050 01  ()保証残価グループ       PIC S9(13) COMP-3.
001060 01  ()先方担当者名１         PIC  N(7).
001070 01  ()直通電話１             PIC  N(7.5).
001080 01  ()取引形態名             PIC  N(15).
001090 01  ()案件発生内容           PIC  N(10).
001100 01  ()事業所名               PIC  N(10).
001110 01  ()担当者名               PIC  N(10).
001120 01  ()ＷＫ購入印刷有無       PIC  X(1).
001130 01  ()連動金利               PIC S9(2)V9(8) COMP-3.
001140 01  ()営業部意見             PIC  N(170).
001150 01  ()格付                   PIC  X(3).
001160 01  ()帝国点数               PIC  X(3).
