000010************************************************
000020* (KEI_MIZUHO_ERROR)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()請求先コード           PIC  X(8).
000070 01  ()取引先名               PIC  N(30).
000080 01  ()検収済_削除区分       PIC  X(1).
000090 01  ()契約銀行コード         PIC  X(7).
000100 01  ()顧客銀行コード         PIC  X(7).
