000010************************************************
000020* (KEI_EDA_WK_THUMON2)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()ƒfƒB[ƒ‰[ƒR[ƒh       PIC  X(5).
000060 01  ()’[––”Ô†               PIC  N(8).
000070 01  ()Žx•¥ŒJ‰„‹àŠz1         PIC S9(13) COMP-3.
000080 01  ()Žx•¥ðŒ•¶Œ¾1         PIC  N(20).
000090 01  ()Žx•¥ŒJ‰„‹àŠz2         PIC S9(13) COMP-3.
000100 01  ()Žx•¥ðŒ•¶Œ¾2         PIC  N(20).
000110 01  ()Žx•¥ŒJ‰„‹àŠz3         PIC S9(13) COMP-3.
000120 01  ()Žx•¥ðŒ•¶Œ¾3         PIC  N(20).
000130 01  ()Žx•¥ŒJ‰„‹àŠz4         PIC S9(13) COMP-3.
000140 01  ()Žx•¥ðŒ•¶Œ¾4         PIC  N(20).
000150 01  ()Žx•¥ŒJ‰„‹àŠz5         PIC S9(13) COMP-3.
000160 01  ()Žx•¥ðŒ•¶Œ¾5         PIC  N(20).
