000010************************************************
000020* (KEI_MIZUHO_20020719)
000030************************************************
000040 01  ()顧客番号               PIC  X(20).
000050 01  ()ﾃﾞｰﾀ区分           PIC  X(1).
000060 01  ()旧銀行CD             PIC  X(4).
000070 01  ()旧支店CD             PIC  X(3).
000080 01  ()旧預金種目             PIC  X(1).
000090 01  ()旧口座番号             PIC  X(7).
000100 01  ()新支店CD             PIC  X(3).
000110 01  ()新支店名               PIC  N(7.5).
000120 01  ()新預金種目             PIC  X(1).
000130 01  ()新口座番号             PIC  X(7).
000140 01  ()新銀行CD             PIC  X(4).
000150 01  ()新銀行名               PIC  N(10).
000160 01  ()結果ＣＤ               PIC  X(1).
