000010************************************************
000020* (KEI_LPWK_SEIKYUSYO_TEGATA)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()連番                   PIC  X(3).
000060 01  ()端末番号               PIC  N(8).
000070 01  ()リース料               PIC S9(13) COMP-3.
000080 01  ()回数                   PIC S9(3) COMP-3.
000090 01  ()消費税徴収区分         PIC  X(1).
000100 01  ()勘定処理コード         PIC  X(2).
000110 01  ()購入金額合計           PIC S9(13) COMP-3.
000120 01  ()動総保険料合計         PIC S9(13) COMP-3.
000130 01  ()契約金額               PIC S9(13) COMP-3.
000140 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000150 01  ()請求区分１             PIC  X(1).
000160 01  ()請求区分２             PIC  X(1).
000170 01  ()手形枚数               PIC S9(3) COMP-3.
