000010************************************************
000020* (KEI_PATTERN_MST)
000030************************************************
000040 01  ()ŒÚ‹qƒR[ƒh             PIC  X(6).
000050 01  ()Žæˆøæ–¼               PIC  N(30).
