000010************************************************
000020* (KOK_SOUKI_WKLIST)
000030************************************************
000040 01  ()顧客コード             PIC  X(8).
000050 01  ()取引先名カナ           PIC  N(35).
000060 01  ()取引先名漢字           PIC  N(50).
000070 01  ()住所                   PIC  N(50).
000080 01  ()生年月日               PIC  X(7).
000090 01  ()代表者氏名             PIC  N(15).
000100 01  ()チェック１             PIC  X(2).
000110 01  ()チェック２             PIC  X(2).
000120 01  ()チェック３             PIC  X(2).
000130 01  ()チェック４             PIC  X(2).
000140 01  ()チェック５             PIC  X(2).
000150 01  ()メッセージ             PIC  N(40).
