000010************************************************
000020* (KSL_KEI_MITUMO)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()取引先名               PIC  N(30).
000060 01  ()代表物件名             PIC  N(20).
000070 01  ()物件金額合計           PIC S9(13) COMP-3.
000080 01  ()物件金額消費税         PIC S9(10) COMP-3.
000090 01  ()数量                   PIC S9(4) COMP-3.
000100 01  ()加重耐用年数           PIC S9(2)V9(2) COMP-3.
000110 01  ()加重繰延月数           PIC S9(2)V9(2) COMP-3.
000120 01  ()リース期間             PIC S9(3) COMP-3.
000130 01  ()前受月数               PIC S9(2) COMP-3.
000140 01  ()金庫支店コード         PIC  X(5).
000150 01  ()金庫名                 PIC  N(10).
000160 01  ()支店名                 PIC  N(10).
000170 01  ()東銀リース料           PIC S9(13) COMP-3.
000180 01  ()東銀前受リース料       PIC S9(13) COMP-3.
000190 01  ()備考                   PIC  N(50).
000200 01  ()出力区分               PIC  X(1).
000210 01  ()登録日                 PIC  X(8).
000220 01  ()登録時刻               PIC  X(6).
000230 01  ()登録担当者コード       PIC  X(4).
000240 01  ()更新日                 PIC  X(8).
000250 01  ()更新時刻               PIC  X(6).
000260 01  ()更新担当者コード       PIC  X(4).
