000010************************************************
000020* (KSL_KEI_KEY)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()処理ステータス         PIC  X(1).
000070 01  ()申請書作成済区分       PIC  X(1).
000080 01  ()検収済_削除区分       PIC  X(1).
000090 01  ()送信区分               PIC  X(1).
000100 01  ()契約番号採番日         PIC  X(8).
000110 01  ()契約番号採番時刻       PIC  X(6).
000120 01  ()契約番号採番担当者コード PIC  X(4).
000130 01  ()登録日                 PIC  X(8).
000140 01  ()登録時刻               PIC  X(6).
000150 01  ()登録担当者コード       PIC  X(4).
000160 01  ()更新日                 PIC  X(8).
000170 01  ()更新時刻               PIC  X(6).
000180 01  ()更新担当者コード       PIC  X(4).
