000010************************************************
000020* (KSL_WK_UTIWAKE)
000030************************************************
000040 01  ()月数リース             PIC  N(10).
000050 01  ()金額リース             PIC S9(13) COMP-3.
000060 01  ()月数割賦               PIC  N(10).
000070 01  ()金額割賦               PIC S9(13) COMP-3.
000080 01  ()月数合計               PIC  N(10).
000090 01  ()金額合計               PIC S9(13) COMP-3.
