000010************************************************
000020* (KTK_TENKAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()データ区分             PIC  X(1).
000060 01  ()展開番号               PIC S9(3) COMP-3.
000070 01  ()約定返済日             PIC  X(8).
000080 01  ()休日区分               PIC  X(1).
000090 01  ()利息基準日             PIC  X(8).
000100 01  ()元本内入額             PIC S9(13) COMP-3.
000110 01  ()利息額                 PIC S9(13) COMP-3.
000120 01  ()元利合計               PIC S9(13) COMP-3.
000130 01  ()元本残高               PIC S9(13) COMP-3.
000140 01  ()月数                   PIC S9(3) COMP-3.
000150 01  ()日数                   PIC S9(4) COMP-3.
000160 01  ()適用利率               PIC S9(2)V9(8) COMP-3.
000170 01  ()適用社内金利           PIC S9(2)V9(8) COMP-3.
000180 01  ()回収方式＿元本         PIC  X(1).
000190 01  ()回収方式＿利息         PIC  X(1).
000200 01  ()利率確定区分           PIC  X(1).
000210 01  ()回収済区分＿元本       PIC  X(1).
000220 01  ()回収済区分＿利息       PIC  X(1).
000230 01  ()登録日                 PIC  X(8).
000240 01  ()登録時刻               PIC  X(6).
000250 01  ()登録担当者コード       PIC  X(4).
000260 01  ()更新日                 PIC  X(8).
000270 01  ()更新時刻               PIC  X(6).
000280 01  ()更新担当者コード       PIC  X(4).
