000010************************************************
000020* —š—ðƒAƒ“ƒ}ƒbƒ`Ž‘ŽYž‹p(LTRSIS_U)
000030************************************************
000040    03  ()‰ð–ñ—š—ð‚j‚d‚x.
000050     05  ()‚j‚d‚x|‰ð–ñ“ú         PIC  X(7).
000060    03  ()‚j‚d‚x€–Ú.
000070     05  ()Œ_–ñ‚m‚n               PIC  X(9).
000080     05  ()•¨Œ‚m‚n               PIC S9(3).
000090     05  ()‰ð–ñ‹æ•ª               PIC  X(1).
000100     05  ()Ä¶‹æ•ª               PIC  X(1).
000110    03  ()ž‹pŒvŽZ‰ïŽÐ.
000120     05  ()‘OŠú––•ë‰¿‰ïŽÐ         PIC S9(13)
000125                                  SIGN LEADING SEPARATE.
000130     05  ()“–ŒŽž‹p‚             PIC S9(13)
000135                                  SIGN LEADING SEPARATE.
000140     05  ()“–Šúž‹p‚             PIC S9(13)
000145                                  SIGN LEADING SEPARATE.
000150     05  ()Œ»Ý•ë‰¿               PIC S9(13)
000155                                  SIGN LEADING SEPARATE.
000160    03  FILLER           PIC  X(10).
000170    03  ()ž‹pŒvŽZ–@’è.
000180     05  ()ž‹p‹æ•ª               PIC S9(2).
000190     05  ()Š„‘‹æ•ª               PIC S9(2).
000200     05  ()“Á•Êž‹p—¦.
000210      07  ()“Á•Êž‹p—¦|•ªŽq       PIC S9(2).
000220      07  ()“Á•Êž‹p—¦|•ª•ê       PIC S9(3).
000230     05  ()‘OŠú––•ë‰¿–@’è         PIC S9(13)
000235                                  SIGN LEADING SEPARATE.
000240     05  ()•’Êž‹p”ï             PIC S9(13)
000245                                  SIGN LEADING SEPARATE.
000250     05  ()Š„‘ž‹p”ï             PIC S9(13)
000255                                  SIGN LEADING SEPARATE.
000260     05  ()“Á•Êž‹p”ï             PIC S9(13)
000265                                  SIGN LEADING SEPARATE.
000270     05  ()“–Šú––•ë‰¿             PIC S9(13)
000275                                  SIGN LEADING SEPARATE.
000280     05  ()ŒJ‰z’´‰ßŠz             PIC S9(13)
000285                                  SIGN LEADING SEPARATE.
000290     05  ()ž‹pŒÀ“xŠz             PIC S9(13)
000295                                  SIGN LEADING SEPARATE.
000300    03  FILLER           PIC  X(15).
000310    03  ()—˜_•ë‰¿î•ñ.
000320     05  ()‰ïŽÐ—˜_‘OŠú––•ë‰¿     PIC S9(13)
000325                                  SIGN LEADING SEPARATE.
000330     05  ()‰ïŽÐ—˜_“–Šú––•ë‰¿     PIC S9(13)
000335                                  SIGN LEADING SEPARATE.
000340    03  ()“–Šúž‹p‰ß•s‘«Šz       PIC S9(13)
000345                                  SIGN LEADING SEPARATE.
000350    03  FILLER           PIC  X(28).
000360    03  ()ˆ—”NŒŽ“x.
000370     05  ()ˆ—”NŒŽ“x|¢‹I       PIC S9(1).
000380     05  ()ˆ—”NŒŽ“x|”NŒŽ       PIC  X(4).
000390    03  ()‹¤’Êî•ñ               PIC  X(35).
