000010************************************************
000020* (MAN_WK_KALPIS_KAISHI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()リース終了日           PIC  X(8).
000070 01  ()再リース開始日         PIC  X(8).
