000010************************************************
000020* (MAN_WK_DOSO)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()処理区分               PIC  X(1).
000060 01  ()修正区分               PIC  X(1).
000070 01  ()請求先コード           PIC  X(8).
000080 01  ()対象資産コード         PIC  X(7).
000090 01  ()付保率１               PIC S9(2) COMP-3.
000100 01  ()付保率２               PIC S9(2) COMP-3.
000110 01  ()付保率３               PIC S9(2) COMP-3.
000120 01  ()付保率４               PIC S9(2) COMP-3.
000130 01  ()付保率５               PIC S9(2) COMP-3.
000140 01  ()付保率６               PIC S9(2) COMP-3.
000150 01  ()付保率７               PIC S9(2) COMP-3.
000160 01  ()付保率８               PIC S9(2) COMP-3.
000170 01  ()付保率９               PIC S9(2) COMP-3.
