000010************************************************
000020* (MAN_PATCH_WK_MEISAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()請求先コード           PIC  X(8).
000070 01  ()回収方式１             PIC  X(1).
000080 01  ()回収方式２             PIC  X(1).
000090 01  ()銀行コード             PIC  X(7).
000100 01  ()口座番号               PIC  X(7).
000110 01  ()預金種類               PIC  X(1).
000120 01  ()更新回収方式１         PIC  X(1).
000130 01  ()更新回収方式２         PIC  X(1).
000140 01  ()更新銀行コード         PIC  X(7).
000150 01  ()更新口座番号           PIC  X(7).
000160 01  ()更新預金種類           PIC  X(1).
