000010************************************************
000020* (MAN_JUSIN_CHK)
000030************************************************
000040 01  ()データ区分             PIC  X(1).
000050 01  ()契約番号               PIC  X(9).
000060 01  ()物件ＮＯ               PIC  X(3).
000070 01  ()再リースコード         PIC  X(1).
000080 01  ()再リース周回コード     PIC  X(1).
000090 01  ()リース開始日           PIC  X(8).
000100 01  ()リース終了日           PIC  X(8).
000110 01  ()リース期間             PIC S9(3) COMP-3.
000120 01  ()勘定処理コード         PIC  X(2).
000130 01  ()資産コード             PIC  X(7).
000140 01  ()残価額                 PIC S9(13) COMP-3.
000150 01  ()物件名_漢字           PIC  N(20).
000160 01  ()物件名_カナ           PIC  N(10).
000170 01  ()数量                   PIC S9(4) COMP-3.
000180 01  ()個別リース料           PIC S9(13) COMP-3.
000190 01  ()購入金額               PIC S9(13) COMP-3.
000200 01  ()受信購入金額           PIC S9(13) COMP-3.
000210 01  ()資産処分コード         PIC  X(1).
000220 01  ()展開削除区分           PIC  X(1).
000230 01  ()保守削除区分           PIC  X(1).
000240 01  ()登録日                 PIC  X(8).
000250 01  ()登録時刻               PIC  X(6).
