000010************************************************
000020* (MAN_JIGYO_MISYORI)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()当月以前区分           PIC  X(8).
000080 01  ()未処理件数             PIC S9(13) COMP-3.
