000010************************************************
000020* (MAN_MISYORI)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()契約番号               PIC  X(9).
000060 01  ()枝番                   PIC  X(3).
000070 01  ()事業所コード           PIC  X(4).
000080 01  ()事業所名               PIC  N(10).
000090 01  ()ユーザーコード         PIC  X(8).
000100 01  ()契約先名               PIC  N(30).
000110 01  ()リース期間             PIC S9(3) COMP-3.
000120 01  ()満了日                 PIC  X(8).
000130 01  ()再リース開始日         PIC  X(8).
000140 01  ()物件金額               PIC S9(13) COMP-3.
000150 01  ()残価額                 PIC S9(13) COMP-3.
000160 01  ()契約金額               PIC S9(13) COMP-3.
000170 01  ()物件名                 PIC  N(20).
