000010************************************************
000020* (MAN_SAILEA)
000030************************************************
000040 01  ()ä«óùÇmÇn               PIC  X(6).
000050 01  ()ó\îıÇP                 PIC  X(2).
000060 01  ()ã@éÌ                   PIC  X(17).
000070 01  ()ã@î‘                   PIC  X(10).
000080 01  ()ó\îıÇQ                 PIC  X(36).
