000010************************************************
000020* (MFS_HEADER)
000030************************************************
000040 01  ()データ区分             PIC  X(1).
000050 01  ()種別コード             PIC  X(2).
000060 01  ()コード区分             PIC  X(1).
000070 01  ()ＭＦＳ使用欄           PIC  X(2).
000080 01  ()委託者コード           PIC  X(8).
000090 01  ()委託者名               PIC  X(40).
000100 01  ()引落日                 PIC  X(4).
000110 01  ()取引銀行番号           PIC  X(4).
000120 01  ()取引銀行名             PIC  X(15).
000130 01  ()取引支店番号           PIC  X(3).
000140 01  ()取引支店名             PIC  X(15).
000150 01  ()預金種類               PIC  X(1).
000160 01  ()口座番号               PIC  X(7).
000170 01  ()ダミー                 PIC  X(17).
