000010************************************************
000020* (MFS_FUJITU)
000030************************************************
000040 01  ()処理通番               PIC  X(4).
000050 01  ()請求先コード           PIC  X(8).
000060 01  ()銀行名                 PIC  X(15).
000070 01  ()支店名                 PIC  X(15).
000080 01  ()銀行コード             PIC  X(4).
000090 01  ()支店コード             PIC  X(3).
000100 01  ()預金種類               PIC  X(1).
000110 01  ()口座番号               PIC  X(7).
000120 01  ()口座名義人名           PIC  X(30).
000130 01  ()請求金額               PIC S9(10) COMP-3.
000140 01  ()契約番号               PIC  X(9).
000150 01  ()台数                   PIC S9(4) COMP-3.
000160 01  ()ダミー１               PIC  X(4).
000170 01  ()ダミー２               PIC  X(4).
