000010************************************************
000020* (MST_NOFU_TYOSA2)
000030************************************************
000040 01  ()郵便番号               PIC  X(7).
000050 01  ()住所                   PIC  N(50).
000060 01  ()誤＿納付先コード       PIC  X(6).
000070 01  ()正＿納付先コード       PIC  X(6).
