000010************************************************
000020* (MST_RENDO)
000030************************************************
000040 01  ()連動金利コード         PIC  X(2).
000050 01  ()適用日                 PIC  X(8).
000060 01  ()連動金利名             PIC  N(10).
000070 01  ()利率１                 PIC S9(2)V9(8) COMP-3.
000080 01  ()適用日１               PIC  X(8).
000090 01  ()利率２                 PIC S9(2)V9(8) COMP-3.
000100 01  ()適用日２               PIC  X(8).
000110 01  ()利率３                 PIC S9(2)V9(8) COMP-3.
000120 01  ()適用日３               PIC  X(8).
000130 01  ()利率４                 PIC S9(2)V9(8) COMP-3.
000140 01  ()適用日４               PIC  X(8).
000150 01  ()利率５                 PIC S9(2)V9(8) COMP-3.
000160 01  ()適用日５               PIC  X(8).
000170 01  ()利率６                 PIC S9(2)V9(8) COMP-3.
000180 01  ()適用日６               PIC  X(8).
000190 01  ()利率７                 PIC S9(2)V9(8) COMP-3.
000200 01  ()適用日７               PIC  X(8).
000210 01  ()利率８                 PIC S9(2)V9(8) COMP-3.
000220 01  ()適用日８               PIC  X(8).
000230 01  ()利率９                 PIC S9(2)V9(8) COMP-3.
000240 01  ()適用日９               PIC  X(8).
000250 01  ()利率１０               PIC S9(2)V9(8) COMP-3.
000260 01  ()適用日１０             PIC  X(8).
000270 01  ()利率１１               PIC S9(2)V9(8) COMP-3.
000280 01  ()適用日１１             PIC  X(8).
000290 01  ()利率１２               PIC S9(2)V9(8) COMP-3.
000300 01  ()適用日１２             PIC  X(8).
000310 01  ()利率１３               PIC S9(2)V9(8) COMP-3.
000320 01  ()適用日１３             PIC  X(8).
000330 01  ()利率１４               PIC S9(2)V9(8) COMP-3.
000340 01  ()適用日１４             PIC  X(8).
000350 01  ()利率１５               PIC S9(2)V9(8) COMP-3.
000360 01  ()適用日１５             PIC  X(8).
000370 01  ()登録日                 PIC  X(8).
000380 01  ()登録時刻               PIC  X(6).
000390 01  ()登録担当者コード       PIC  X(4).
000400 01  ()更新日                 PIC  X(8).
000410 01  ()更新時刻               PIC  X(6).
000420 01  ()更新担当者コード       PIC  X(4).
