000010************************************************
000020* (MST_JIKOU200304)
000030************************************************
000040 01  ()取引先コード           PIC  X(8).
000050 01  ()新事業所コード         PIC  X(4).
