000010************************************************
000020* (MST_KINRI)
000030************************************************
000040 01  ()リース期間             PIC  X(3).
000050 01  ()リース期間別社内金利_１ PIC S9(2)V9(8) COMP-3.
000060 01  ()適用日_１             PIC  X(8).
000070 01  ()リース期間別社内金利_２ PIC S9(2)V9(8) COMP-3.
000080 01  ()適用日_２             PIC  X(8).
000090 01  ()リース期間別社内金利_３ PIC S9(2)V9(8) COMP-3.
000100 01  ()適用日_３             PIC  X(8).
000110 01  ()リース期間別社内金利_４ PIC S9(2)V9(8) COMP-3.
000120 01  ()適用日_４             PIC  X(8).
000130 01  ()リース期間別社内金利_５ PIC S9(2)V9(8) COMP-3.
000140 01  ()適用日_５             PIC  X(8).
000150 01  ()登録日                 PIC  X(8).
000160 01  ()登録時刻               PIC  X(6).
000170 01  ()登録担当者コード       PIC  X(4).
000180 01  ()更新日                 PIC  X(8).
000190 01  ()更新時刻               PIC  X(6).
000200 01  ()更新担当者コード       PIC  X(4).
