000010************************************************
000020* (NTL_SUPPLIER)
000030************************************************
000040 01  ()レコード種別           PIC  X(1).
000050 01  ()リース会社ＩＤ         PIC  X(6).
000060 01  ()ＳＰ顧客ＩＤ           PIC  X(12).
000070 01  ()サプライヤー名         PIC  X(64).
000080 01  ()作成ＩＤ               PIC  X(10).
000090 01  ()作成日                 PIC  X(10).
000100 01  ()更新ＩＤ               PIC  X(10).
000110 01  ()更新日                 PIC  X(10).
