000010************************************************
000020* (NTL_LEASE)
000030************************************************
000040 01  ()レコード種別           PIC  X(1).
000050 01  ()リース会社ＩＤ         PIC  X(6).
000060 01  ()取引区分               PIC  X(1).
000070 01  ()重要性区分             PIC  X(1).
000080 01  ()非表示フラグ           PIC  X(1).
000090 01  ()顧客名                 PIC  X(96).
000100 01  ()契約ＩＤ               PIC  X(22).
000110 01  ()契約額                 PIC S9(13) COMP-3.
000120 01  ()リース期間             PIC S9(4) COMP-3.
000130 01  ()検収日                 PIC  X(10).
000140 01  ()取得価額相当額         PIC S9(13) COMP-3.
000150 01  ()減価償却累計額相当額   PIC S9(13) COMP-3.
000160 01  ()期末残高相当額         PIC S9(13) COMP-3.
000170 01  ()リース債務期末残高１年以内 PIC S9(13) COMP-3.
000180 01  ()リース債務期末残高１年超 PIC S9(13) COMP-3.
000190 01  ()リース債務期末残高     PIC S9(13) COMP-3.
000200 01  ()当期支払リース料       PIC S9(13) COMP-3.
000210 01  ()当期減価償却費相当額   PIC S9(13) COMP-3.
000220 01  ()当期支払利息相当額     PIC S9(13) COMP-3.
000230 01  ()決算年月＿ＦＲＯＭ     PIC  X(10).
000240 01  ()決算年月＿ＴＯ         PIC  X(10).
000250 01  ()担当店名               PIC  X(20).
000260 01  ()担当部署名             PIC  X(64).
000270 01  ()担当者名               PIC  X(34).
000280 01  ()顧客ＩＤ               PIC  X(12).
000290 01  ()リース満了日           PIC  X(10).
000300 01  ()解約日                 PIC  X(10).
000310 01  ()資産科目               PIC  X(2).
000320 01  ()資産科目名             PIC  X(30).
000330 01  ()代表物件名             PIC  X(64).
000340 01  ()平均月額リース料       PIC S9(13) COMP-3.
000350 01  ()前払リース料           PIC S9(13) COMP-3.
000360 01  ()償却方法区分           PIC  X(1).
000370 01  ()償却方法区分名         PIC  X(16).
000380 01  ()処理基準1             PIC  X(1).
000390 01  ()処理基準名1           PIC  X(16).
000400 01  ()処理基準2             PIC  X(1).
000410 01  ()処理基準名2           PIC  X(16).
000420 01  ()作成ＩＤ               PIC  X(10).
000430 01  ()作成日                 PIC  X(10).
000440 01  ()更新ＩＤ               PIC  X(10).
000450 01  ()更新日                 PIC  X(10).
