000010************************************************
000020* (NTT_MASTER)
000030************************************************
000040 01  ()登録番号               PIC  X(4).
000050 01  ()先方参照番号           PIC  X(10).
000060 01  ()請求先コード           PIC  X(8).
000070 01  ()部門名称１             PIC  N(20).
000080 01  ()部門名称２             PIC  N(20).
000090 01  ()登録                   PIC  X(1).
