000010************************************************
000020* (NYU_HOLDAY)
000030************************************************
000040 01  ()NATCOD           PIC  X(3).
000050 01  ()HOLDAY           PIC  X(10).
000060 01  ()HOLNAM           PIC  X(20).
000070 01  ()HOLSW1           PIC  X(1).
