000010************************************************
000020* (OBA_MODLST)
000030************************************************
000040 01  ()JOBTYP           PIC  X(1).
000050 01  ()REGTIM           PIC  X(6).
000060 01  ()CNTNUM           PIC  X(9).
000070 01  ()TRNTYP           PIC  X(1).
000080 01  ()DIVCOD           PIC  X(4).
000090 01  ()DIVNAM           PIC  N(10).
000100 01  ()USRCOD           PIC  X(8).
000110 01  ()USRNAM           PIC  N(30).
000120 01  ()OBJNAM           PIC  N(20).
000130 01  ()TRNDAY           PIC  X(8).
000140 01  ()BGNDAY           PIC  X(8).
000150 01  ()BASDAY           PIC  X(8).
000160 01  ()CRERNK           PIC  X(4).
000170 01  ()CNTAMT           PIC S9(13) COMP-3.
000180 01  ()RCVAMT           PIC S9(13) COMP-3.
000190 01  ()BALAMT           PIC S9(13) COMP-3.
000200 01  ()DIVCOD_O       PIC  X(4).
000210 01  ()DIVNAM_O       PIC  N(10).
000220 01  ()USRCOD_O       PIC  X(8).
000230 01  ()USRNAM_O       PIC  N(30).
000240 01  ()OBJNAM_O       PIC  N(20).
000250 01  ()TRNDAY_O       PIC  X(8).
000260 01  ()CRERNK_O       PIC  X(4).
000270 01  ()CNTAMT_O       PIC S9(13) COMP-3.
000280 01  ()BALAMT_O       PIC S9(13) COMP-3.
000290 01  ()DIVCOD_M       PIC  X(1).
000300 01  ()DIVNAM_M       PIC  X(1).
000310 01  ()USRCOD_M       PIC  X(1).
000320 01  ()USRNAM_M       PIC  X(1).
000330 01  ()OBJNAM_M       PIC  X(1).
000340 01  ()TRNDAY_M       PIC  X(1).
000350 01  ()CRERNK_M       PIC  X(1).
000360 01  ()CNTAMT_M       PIC  X(1).
000370 01  ()BALAMT_M       PIC  X(1).
