000010************************************************
000020* (PAY_GENREC)
000030************************************************
000040 01  ()GENREC           PIC  X(120).
