000010************************************************
000020* (PAY_CNVMST)
000030************************************************
000040 01  ()BNKCOD           PIC  X(4).
000050 01  ()BRCCOD           PIC  X(3).
000060 01  ()DEPKND           PIC  X(1).
000070 01  ()DEPNUM           PIC  X(7).
000080 01  ()CSTNAM           PIC  X(30).
