000010************************************************
000020* (PAY_GAFGEN)
000030************************************************
000040 01  ()GAFGEN           PIC  X(200).
