000010************************************************
000020* (PAY_KOKMOD)
000030************************************************
000040 01  ()JOBTYP           PIC  X(4).
000050 01  ()REGTIM           PIC  X(6).
000060 01  ()DIVCOD           PIC  X(4).
000070 01  ()PAYCLT           PIC  X(4).
000080 01  ()PAYNAM           PIC  N(28).
000090 01  ()DEPNAM           PIC  N(28).
000100 01  ()BNKCOD           PIC  X(4).
000110 01  ()BRCCOD           PIC  X(3).
000120 01  ()DEPKND           PIC  X(1).
000130 01  ()DEPNUM           PIC  X(7).
000140 01  ()REGNUM           PIC  X(4).
000150 01  ()BILNAM           PIC  N(28).
000160 01  ()ZIPCOD           PIC  X(7).
000170 01  ()ADDRS1           PIC  N(17).
000180 01  ()ADDRS2           PIC  N(16).
000190 01  ()ADDRS3           PIC  N(16).
000200 01  ()MALNM1           PIC  N(14).
000210 01  ()MALNM2           PIC  N(14).
000220 01  ()HOLSFT           PIC  X(1).
000230 01  ()CHAGYN           PIC  X(1).
000240 01  ()CHGFLG           PIC  X(1).
000250 01  ()PAYNAM_O       PIC  N(28).
000260 01  ()DEPNAM_O       PIC  N(28).
000270 01  ()BNKCOD_O       PIC  X(4).
000280 01  ()BRCCOD_O       PIC  X(3).
000290 01  ()DEPKND_O       PIC  X(1).
000300 01  ()DEPNUM_O       PIC  X(7).
000310 01  ()REGNUM_O       PIC  X(4).
000320 01  ()BILNAM_O       PIC  N(28).
000330 01  ()ZIPCOD_O       PIC  X(7).
000340 01  ()ADDRS1_O       PIC  N(17).
000350 01  ()ADDRS2_O       PIC  N(16).
000360 01  ()ADDRS3_O       PIC  N(16).
000370 01  ()MALNM1_O       PIC  N(14).
000380 01  ()MALNM2_O       PIC  N(14).
000390 01  ()HOLSFT_O       PIC  X(1).
000400 01  ()CHAGYN_O       PIC  X(1).
000410 01  ()PAYNAM_M       PIC  X(1).
000420 01  ()DEPNAM_M       PIC  X(1).
000430 01  ()BNKCOD_M       PIC  X(1).
000440 01  ()BRCCOD_M       PIC  X(1).
000450 01  ()DEPKND_M       PIC  X(1).
000460 01  ()DEPNUM_M       PIC  X(1).
000470 01  ()REGNUM_M       PIC  X(1).
000480 01  ()BILNAM_M       PIC  X(1).
000490 01  ()ZIPCOD_M       PIC  X(1).
000500 01  ()ADDRS1_M       PIC  X(1).
000510 01  ()ADDRS2_M       PIC  X(1).
000520 01  ()ADDRS3_M       PIC  X(1).
000530 01  ()MALNM1_M       PIC  X(1).
000540 01  ()MALNM2_M       PIC  X(1).
000550 01  ()HOLSFT_M       PIC  X(1).
000560 01  ()CHAGYN_M       PIC  X(1).
