000010************************************************
000020* (POK_LPWK_SEIKYU)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()回数                   PIC S9(1) COMP-3.
000060 01  ()リース期間             PIC S9(3) COMP-3.
000070 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000080 01  ()リース料               PIC S9(13) COMP-3.
000090 01  ()物件名_漢字           PIC  N(20).
