000010************************************************
000020* (SEC_WK_ITIRAN)
000030************************************************
000040 01  ()連番                   PIC S9(5) COMP-3.
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()事業所名称             PIC  X(20).
000070 01  ()担当者コード           PIC  X(4).
000080 01  ()担当者名称             PIC  X(20).
000090 01  ()兼務事業所コード       PIC  X(4).
000100 01  ()兼務事業所名称         PIC  X(20).
000110 01  ()ステータス             PIC  X(2).
000120 01  ()有効期限               PIC  X(10).
000130 01  ()端末番号               PIC  N(8).
