000010************************************************
000020* (SFC_KIHON_SOSIN)
000030************************************************
000040 01  ()データ識別コード       PIC  X(2).
000050 01  ()送信事業所コード       PIC  X(4).
000060 01  ()作成日付               PIC  X(8).
000070 01  ()作成時刻               PIC  X(6).
000080 01  ()契約番号               PIC  X(9).
000090 01  ()レコード区分           PIC  X(1).
000100 01  ()事業所コード           PIC  X(4).
000110 01  ()ユーザーコード         PIC  X(8).
000120 01  ()契約日                 PIC  X(8).
000130 01  ()検収予定日             PIC  X(8).
000140 01  ()検収日                 PIC  X(8).
000150 01  ()リース期間             PIC S9(3) COMP-3.
000160 01  ()勘定処理コード         PIC  X(2).
000170 01  ()リース料               PIC S9(13) COMP-3.
000180 01  ()消費税率               PIC S9(3) COMP-3.
000190 01  ()消費税徴収区分         PIC  X(1).
000200 01  ()初回リース料           PIC S9(13) COMP-3.
000210 01  ()終回リース料           PIC S9(13) COMP-3.
000220 01  ()固定資産税             PIC S9(13) COMP-3.
000230 01  ()保険料                 PIC S9(13) COMP-3.
000240 01  ()その他諸費用１         PIC S9(13) COMP-3.
000250 01  ()その他諸費用２         PIC S9(13) COMP-3.
000260 01  ()月額平均保守料         PIC S9(13) COMP-3.
000270 01  ()前受リース料           PIC S9(13) COMP-3.
000280 01  ()前受リース料入金日     PIC  X(8).
000290 01  ()単年度契約             PIC  X(2).
000300 01  ()契約金額               PIC S9(13) COMP-3.
000310 01  ()担当者コード           PIC  X(4).
000320 01  ()債務協調コード         PIC  X(2).
000330 01  ()基本利回りサイン領域   PIC  X(1).
000340 01  ()基本利回り             PIC S9(10) COMP-3.
000350 01  ()実質利回りサイン領域   PIC  X(1).
000360 01  ()実質利回り             PIC S9(10) COMP-3.
000370 01  ()前渡金利息サイン領域   PIC  X(1).
000380 01  ()前渡金利息初期費用     PIC S9(13) COMP-3.
000390 01  ()請求先コード           PIC  X(8).
000400 01  ()請求区分１             PIC  X(1).
000410 01  ()請求区分２             PIC  X(1).
000420 01  ()請求サイクル           PIC S9(2) COMP-3.
000430 01  ()支払回数               PIC S9(3) COMP-3.
000440 01  ()据置期間               PIC S9(3) COMP-3.
000450 01  ()ＢＥＧＩＮ回数         PIC S9(1) COMP-3.
000460 01  ()計算方式               PIC  X(1).
000470 01  ()銀行コード             PIC  X(7).
000480 01  ()転リース提携先コード   PIC  X(2).
000490 01  ()第１回リース料入金日   PIC  X(8).
000500 01  ()第２回リース料入金日   PIC  X(8).
000510 01  ()粗利益サイン領域       PIC  X(1).
000520 01  ()粗利益                 PIC S9(13) COMP-3.
000530 01  ()口座番号               PIC  X(7).
000540 01  ()預金種類               PIC  X(1).
000550 01  ()入金日                 PIC  X(2).
000560 01  ()残価回収日             PIC  X(8).
000570 01  ()繰延月数               PIC S9(4) COMP-3.
000580 01  ()基準金利               PIC S9(4) COMP-3.
000590 01  ()前渡金区分             PIC  X(1).
000600 01  ()充当相殺区分           PIC  X(1).
000610 01  ()案件発生区分           PIC  X(1).
000620 01  ()稟議区分               PIC  X(1).
000630 01  ()名寄せコード１         PIC  X(8).
000640 01  ()与信先名１             PIC  X(60).
000650 01  ()保証担保内容１         PIC  X(2).
000660 01  ()保全範囲１             PIC  X(2).
000670 01  ()負担割合１             PIC S9(3) COMP-3.
000680 01  ()名寄せコード２         PIC  X(8).
000690 01  ()与信先名２             PIC  X(60).
000700 01  ()保証担保内容２         PIC  X(2).
000710 01  ()保全範囲２             PIC  X(2).
000720 01  ()負担割合２             PIC S9(3) COMP-3.
000730 01  ()名寄せコード３         PIC  X(8).
000740 01  ()与信先名３             PIC  X(60).
000750 01  ()保証担保内容３         PIC  X(2).
000760 01  ()保全範囲３             PIC  X(2).
000770 01  ()負担割合３             PIC S9(3) COMP-3.
000780 01  ()名寄せコード４         PIC  X(8).
000790 01  ()与信先名４             PIC  X(60).
000800 01  ()保証担保内容４         PIC  X(2).
000810 01  ()保全範囲４             PIC  X(2).
000820 01  ()負担割合４             PIC S9(3) COMP-3.
000830 01  ()名寄せコード５         PIC  X(8).
000840 01  ()与信先名５             PIC  X(60).
000850 01  ()保証担保内容５         PIC  X(2).
000860 01  ()保全範囲５             PIC  X(2).
000870 01  ()負担割合５             PIC S9(3) COMP-3.
000880 01  ()データ区分             PIC  X(1).
