000010************************************************
000020* (SIN_KIHON)
000030************************************************
000040 01  ()稟議ＮＯ               PIC  X(10).
000050 01  ()稟議区分               PIC  X(1).
000060 01  ()申請日                 PIC  X(8).
000070 01  ()契約予定日             PIC  X(8).
000080 01  ()ロンコミ付議ＮＯ       PIC  X(7).
000090 01  ()取引先区分             PIC  X(1).
000100 01  ()取引形態コード         PIC  X(2).
000110 01  ()案件発生区分           PIC  X(1).
000120 01  ()物件確認基準           PIC  X(1).
000130 01  ()検収予定日             PIC  X(8).
000140 01  ()リース期間             PIC S9(3) COMP-3.
000150 01  ()計算方式               PIC  X(1).
000160 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000170 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000180 01  ()購入金額合計           PIC S9(13) COMP-3.
000190 01  ()請求サイクル           PIC S9(2) COMP-3.
000200 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000210 01  ()契約金額               PIC S9(13) COMP-3.
000220 01  ()リース料               PIC S9(13) COMP-3.
000230 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000240 01  ()粗利益                 PIC S9(13) COMP-3.
000250 01  ()前受月数               PIC S9(2) COMP-3.
000260 01  ()月額平均保守料         PIC S9(13) COMP-3.
000270 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000280 01  ()登録日                 PIC  X(8).
000290 01  ()登録時刻               PIC  X(6).
000300 01  ()登録担当者コード       PIC  X(4).
000310 01  ()更新日                 PIC  X(8).
000320 01  ()更新時刻               PIC  X(6).
000330 01  ()更新担当者コード       PIC  X(4).
