000010************************************************
000020* (SIN_KOUNYU)
000030************************************************
000040 01  ()âg‹c‚m‚n               PIC  X(10).
000050 01  ()w“üæŽ¯•Ê‚m‚n         PIC  X(1).
000060 01  ()w“üæƒR[ƒh           PIC  X(8).
000070 01  ()w“üæ–¼               PIC  N(30).
000080 01  ()w“üæ’S“–ŽÒ           PIC  N(10).
000090 01  ()w“üæZŠ             PIC  N(50).
000100 01  ()“d˜b”Ô†               PIC  N(7.5).
000110 01  ()w“ü‹àŠz               PIC S9(13) COMP-3.
000120 01  ()Žx•¥ŒJ‰„‹àŠz‚P         PIC S9(13) COMP-3.
000130 01  ()Žx•¥ŒJ‰„ŒŽ”‚P         PIC S9(2)V9(2) COMP-3.
000140 01  ()Žx•¥ðŒ•¶Œ¾‚P         PIC  N(20).
000150 01  ()Žx•¥ŒJ‰„‹àŠz‚Q         PIC S9(13) COMP-3.
000160 01  ()Žx•¥ŒJ‰„ŒŽ”‚Q         PIC S9(2)V9(2) COMP-3.
000170 01  ()Žx•¥ðŒ•¶Œ¾‚Q         PIC  N(20).
000180 01  ()Žx•¥ŒJ‰„‹àŠz‚R         PIC S9(13) COMP-3.
000190 01  ()Žx•¥ŒJ‰„ŒŽ”‚R         PIC S9(2)V9(2) COMP-3.
000200 01  ()Žx•¥ðŒ•¶Œ¾‚R         PIC  N(20).
000210 01  ()Žx•¥ŒJ‰„‹àŠz‚S         PIC S9(13) COMP-3.
000220 01  ()Žx•¥ŒJ‰„ŒŽ”‚S         PIC S9(2)V9(2) COMP-3.
000230 01  ()Žx•¥ðŒ•¶Œ¾‚S         PIC  N(20).
000240 01  ()Žx•¥ŒJ‰„‹àŠz‚T         PIC S9(13) COMP-3.
000250 01  ()Žx•¥ŒJ‰„ŒŽ”‚T         PIC S9(2)V9(2) COMP-3.
000260 01  ()Žx•¥ðŒ•¶Œ¾‚T         PIC  N(20).
000270 01  ()ŽèŒ`Žó“n•û–@‚P         PIC  X(1).
000280 01  ()ŽèŒ`Žó“n•û–@‚Q         PIC  X(1).
000290 01  ()ŽèŒ`Žó“n•û–@‚R         PIC  X(1).
000300 01  ()ŽèŒ`Žó“n•û–@‚S         PIC  X(1).
000310 01  ()ŽèŒ`Žó“n•û–@‚T         PIC  X(1).
000320 01  ()ƒfƒB[ƒ‰[ƒR[ƒh       PIC  X(5).
000330 01  ()“o˜^“ú                 PIC  X(8).
000340 01  ()“o˜^Žž               PIC  X(6).
000350 01  ()“o˜^’S“–ŽÒƒR[ƒh       PIC  X(4).
000360 01  ()XV“ú                 PIC  X(8).
000370 01  ()XVŽž               PIC  X(6).
000380 01  ()XV’S“–ŽÒƒR[ƒh       PIC  X(4).
