000010************************************************
000020* (SSF_WK_SEIKYUSYO)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()検収日                 PIC  X(8).
000060 01  ()契約金額リース         PIC S9(13) COMP-3.
000070 01  ()契約金額割賦           PIC S9(13) COMP-3.
000080 01  ()割賦一括消費税         PIC S9(13) COMP-3.
000090 01  ()定額リース             PIC S9(13) COMP-3.
000100 01  ()定額割賦               PIC S9(13) COMP-3.
000110 01  ()定額消費税リース       PIC S9(13) COMP-3.
000120 01  ()定額消費税割賦         PIC S9(13) COMP-3.
000130 01  ()初回リース             PIC S9(13) COMP-3.
000140 01  ()初回割賦               PIC S9(13) COMP-3.
000150 01  ()初回消費税リース       PIC S9(13) COMP-3.
000160 01  ()初回消費税割賦         PIC S9(13) COMP-3.
000170 01  ()前受リース             PIC S9(13) COMP-3.
000180 01  ()前受割賦               PIC S9(13) COMP-3.
000190 01  ()前受消費税リース       PIC S9(13) COMP-3.
000200 01  ()前受消費税割賦         PIC S9(13) COMP-3.
000210 01  ()請求額リース           PIC S9(13) COMP-3.
000220 01  ()請求額割賦             PIC S9(13) COMP-3.
000230 01  ()物件金額               PIC S9(13) COMP-3.
000240 01  ()仕入れ消費税           PIC S9(13) COMP-3.
000250 01  ()リース現金             PIC S9(13) COMP-3.
000260 01  ()リース１               PIC S9(13) COMP-3.
000270 01  ()リース２               PIC S9(13) COMP-3.
000280 01  ()リース３               PIC S9(13) COMP-3.
000290 01  ()リース４               PIC S9(13) COMP-3.
000300 01  ()リース５               PIC S9(13) COMP-3.
000310 01  ()割賦現金               PIC S9(13) COMP-3.
000320 01  ()割賦１                 PIC S9(13) COMP-3.
000330 01  ()割賦２                 PIC S9(13) COMP-3.
000340 01  ()割賦３                 PIC S9(13) COMP-3.
000350 01  ()割賦４                 PIC S9(13) COMP-3.
000360 01  ()割賦５                 PIC S9(13) COMP-3.
000370 01  ()平均利回リース         PIC S9(2)V9(8) COMP-3.
000380 01  ()平均利回割賦           PIC S9(2)V9(8) COMP-3.
000390 01  ()粗利益リース           PIC S9(13) COMP-3.
000400 01  ()粗利益割賦             PIC S9(13) COMP-3.
000410 01  ()物件ハードリース       PIC S9(13) COMP-3.
000420 01  ()物件ハード割賦         PIC S9(13) COMP-3.
000430 01  ()物件ソフト             PIC S9(13) COMP-3.
000440 01  ()仕入消費税ソフト       PIC S9(13) COMP-3.
000450 01  ()平均利回合計           PIC S9(2)V9(8) COMP-3.
