000010************************************************
000020* (SSF_KEI_MEISAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()購入先識別ＮＯ         PIC  X(1).
000070 01  ()物件名_漢字           PIC  N(20).
000080 01  ()物件名_カナ           PIC  N(10).
000090 01  ()仕様製造番号           PIC  N(10).
000100 01  ()製造業者               PIC  N(30).
000110 01  ()単価                   PIC S9(13) COMP-3.
000120 01  ()数量                   PIC S9(4) COMP-3.
000130 01  ()購入金額               PIC S9(13) COMP-3.
000140 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000150 01  ()個別リース料           PIC S9(13) COMP-3.
000160 01  ()中古品コード           PIC  X(1).
000170 01  ()動総付保区分           PIC  X(1).
000180 01  ()動総保険コード         PIC  X(4).
000190 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000200 01  ()資産コード             PIC  X(7).
000210 01  ()耐用年数               PIC S9(2) COMP-3.
000220 01  ()信用保険コード         PIC  X(6).
000230 01  ()型式番号               PIC  N(7.5).
000240 01  ()残価保証区分           PIC  X(1).
000250 01  ()残価額                 PIC S9(13) COMP-3.
000260 01  ()残価保証先コード       PIC  X(8).
000270 01  ()残価保証先名           PIC  N(30).
000280 01  ()税区分                 PIC  X(1).
000290 01  ()税負担コード           PIC  X(1).
000300 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000310 01  ()特例率_分子           PIC S9(2) COMP-3.
000320 01  ()特例率_分母           PIC S9(2) COMP-3.
000330 01  ()特例期間               PIC S9(2) COMP-3.
000340 01  ()設置場所名_漢字       PIC  N(20).
000350 01  ()設置場所名_カナ       PIC  N(10).
000360 01  ()設置場所郵便番号       PIC  X(7).
000370 01  ()納付先コード           PIC  X(6).
000380 01  ()設置場所住所           PIC  N(50).
000390 01  ()ユーザーリファレンス１ PIC  N(6).
000400 01  ()ユーザーリファレンス２ PIC  N(6).
000410 01  ()ユーザーリファレンス３ PIC  N(6).
000420 01  ()ユーザーリファレンス４ PIC  N(6).
000430 01  ()指定電子計算機         PIC  N(20).
000440 01  ()使用権設定者           PIC  N(30).
000450 01  ()ディーラーコード       PIC  X(5).
000460 01  ()登録日                 PIC  X(8).
000470 01  ()登録時刻               PIC  X(6).
000480 01  ()登録担当者コード       PIC  X(4).
000490 01  ()更新日                 PIC  X(8).
000500 01  ()更新時刻               PIC  X(6).
000510 01  ()更新担当者コード       PIC  X(4).
