000010************************************************
000020* (SSF_LPWK_KEI_MEISAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()物件名_漢字           PIC  N(20).
000070 01  ()仕様製造番号           PIC  N(10).
000080 01  ()製造業者               PIC  N(30).
000090 01  ()単価                   PIC S9(13) COMP-3.
000100 01  ()数量                   PIC S9(4) COMP-3.
000110 01  ()購入金額               PIC S9(13) COMP-3.
000120 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000130 01  ()個別リース料           PIC S9(13) COMP-3.
000140 01  ()資産コード             PIC  X(7).
000150 01  ()型式番号               PIC  N(7.5).
000160 01  ()税区分                 PIC  X(1).
000170 01  ()税負担コード           PIC  X(1).
000180 01  ()設置場所名_漢字       PIC  N(20).
000190 01  ()納付先コード           PIC  X(6).
000200 01  ()設置場所住所           PIC  N(50).
000210 01  ()指定電子計算機         PIC  N(20).
000220 01  ()使用権設定者           PIC  N(30).
000230 01  ()計算方式               PIC  X(1).
000240 01  ()取引先名               PIC  N(30).
000250 01  ()購入先名               PIC  N(30).
000260 01  ()購入先住所             PIC  N(50).
000270 01  ()購入先購入金額合計     PIC S9(13) COMP-3.
000280 01  ()購入先仕入消費税等額   PIC S9(13) COMP-3.
000290 01  ()物件明細数             PIC S9(3) COMP-3.
000300 01  ()契約日                 PIC  X(8).
000310 01  ()検収予定日             PIC  X(8).
000320 01  ()ディーラーコード       PIC  X(5).
000330 01  ()ＷＫ連番               PIC S9(3) COMP-3.
000340 01  ()端末番号               PIC  N(8).
