000010************************************************
000020* 与信(展開)(YOSHINTENKAI)
000030************************************************
000040    03  ()管理与信先コード       PIC  X(8).
000050    03  ()管理与信区分           PIC  X(1).
000060    03  ()自動与信区分           PIC  X(1).
000070    03  ()事故日                 PIC  X(8).
000080    03  ()契約ＮＯ               PIC  X(9).
000090    03  ()勘定コード             PIC  X(2).
000100    03  ()展開年月               PIC  X(6).
000110    03  ()展開日付               PIC  X(2).
000120    03  ()入金フラグ             PIC  X(2).
000130    03  ()展開支払回数           PIC  X(3).
000140    03  ()実リース料             PIC S9(13).
000150    03  ()利息額                 PIC S9(13).
000160    03  ()元本内入               PIC S9(13).
000170    03  ()元本残                 PIC S9(13).
000180    03  ()債権残                 PIC S9(13).
000190    03  ()諸費用                 PIC S9(13).
000200    03  ()約定利率               PIC S9(11).
000210    03  ()事故後入金             PIC S9(13).
