

	01  TIME-RECORD.
	  
	  03  NAME  PIC  X(20).

	  03  WORKER-NUMBER  PIC  9(6).

	  03  WEEKS-END-DATE.

            05  MONTH  PIC 99.

	    05  DAY-NUMBER  PIC  99.

	    05  YEAR  PIC  99.

	  03  HOURS-WORKED.

	    06  REGULAR  PIC  99.

	    06  OVERTIME  PIC  99.