000010************************************************
000020* (ALM_ALMTR4)
000030************************************************
000040 01  ALM_ALMTR4-DATTYP PIC  X(001).
000050 01  ALM_ALMTR4-CNTNUM PIC  X(010).
000060 01  ALM_ALMTR4-CNTDET PIC  X(002).
000070 01  ALM_ALMTR4-COLDAY PIC  X(008).
000080 01  ALM_ALMTR4-COLAMT PIC S9(013) COMP-3.
000090 01  ALM_ALMTR4-BALCAP PIC S9(013) COMP-3.
000100 01  ALM_ALMTR4-INTAMT PIC S9(013) COMP-3.
000110 01  ALM_ALMTR4-ERRFLG PIC  X(005).
