000010************************************************
000020* (ALM_LIADET)
000030************************************************
000040 01  ALM_LIADET-ALMDET PIC  X(002).
000050 01  ALM_LIADET-DETNAM PIC  X(032).
