000010************************************************
000020* (ALM_FORM_0006)
000030************************************************
000040 01  ALM_FORM_0006-ACCCOD PIC  X(005).
000050 01  ALM_FORM_0006-ACCNAM PIC  X(032).
000060 01  ALM_FORM_0006-MONCNT PIC S9(003) COMP-3.
000070 01  ALM_FORM_0006-BASYER PIC  X(004).
000080 01  ALM_FORM_0006-BASMON PIC  X(002).
000090 01  ALM_FORM_0006-COLAMT PIC S9(013) COMP-3.
000100 01  ALM_FORM_0006-BALCAP PIC S9(013) COMP-3.
