000010************************************************
000020* (ALM_ACCTRN)
000030************************************************
000040 01  ALM_ACCTRN-ACCCOD PIC  X(005).
000050 01  ALM_ACCTRN-ACCNAM PIC  X(032).
000060 01  ALM_ACCTRN-ASTLIA PIC  X(001).
000070 01  ALM_ACCTRN-ALMDET PIC  X(002).
000080 01  ALM_ACCTRN-DUECOD PIC  X(002).
000090 01  ALM_ACCTRN-ALMTYP PIC  X(001).
000100 01  ALM_ACCTRN-OPEDAY PIC  X(008).
000110 01  ALM_ACCTRN-BALCAP PIC S9(013) COMP-3.
000120 01  ALM_ACCTRN-OPEFLG PIC  X(001).
