000010************************************************
000020* (ALM_ALMTRN)
000030************************************************
000040 01  ALM_ALMTRN-ASTLIA PIC  X(001).
000050 01  ALM_ALMTRN-ALMDET PIC  X(002).
000060 01  ALM_ALMTRN-FIXFLT PIC  X(001).
000070 01  ALM_ALMTRN-ACCCOD PIC  X(005).
000080 01  ALM_ALMTRN-DUECOD PIC  X(002).
000090 01  ALM_ALMTRN-MONCNT PIC S9(003) COMP-3.
000100 01  ALM_ALMTRN-BASYER PIC  X(004).
000110 01  ALM_ALMTRN-BASMON PIC  X(002).
000120 01  ALM_ALMTRN-COLAMT PIC S9(013) COMP-3.
000130 01  ALM_ALMTRN-COLRAT PIC S9(002)V9(2) COMP-3.
000140 01  ALM_ALMTRN-BALCAP PIC S9(013) COMP-3.
000150 01  ALM_ALMTRN-AVEBAL PIC S9(013) COMP-3.
000160 01  ALM_ALMTRN-AVEINT PIC S9(013) COMP-3.
000170 01  ALM_ALMTRN-AVERAT PIC S9(002)V9(2) COMP-3.
000180 01  ALM_ALMTRN-DIVCOD PIC  X(001).
000190 01  ALM_ALMTRN-GAPFLG PIC  X(001).
000200 01  ALM_ALMTRN-ACCTYP PIC  X(001).
000210 01  ALM_ALMTRN-COLINT PIC S9(013) COMP-3.
000220 01  ALM_ALMTRN-BALAST PIC S9(013) COMP-3.
000230 01  ALM_ALMTRN-BALPRE PIC S9(013) COMP-3.
000240 01  ALM_ALMTRN-WKRAT1 PIC S9(002)V9(2) COMP-3.
000250 01  ALM_ALMTRN-WKRAT2 PIC S9(002)V9(2) COMP-3.
000260 01  ALM_ALMTRN-WKAMT1 PIC S9(013) COMP-3.
000270 01  ALM_ALMTRN-WKAMT2 PIC S9(013) COMP-3.
000280 01  ALM_ALMTRN-ERRFLG PIC  X(005).
