000010************************************************
000020* (ALM_CSHMST)
000030************************************************
000040 01  ALM_CSHMST-REGNUM PIC  X(004).
000050 01  ALM_CSHMST-ASTLIA PIC  X(001).
000060 01  ALM_CSHMST-ALMDET PIC  X(002).
000070 01  ALM_CSHMST-FIXFLT PIC  X(001).
000080 01  ALM_CSHMST-ACCCOD PIC  X(005).
000090 01  ALM_CSHMST-DUECOD PIC  X(002).
000100 01  ALM_CSHMST-MONCNT PIC S9(003) COMP-3.
000110 01  ALM_CSHMST-FISYER PIC  X(004).
000120 01  ALM_CSHMST-BASYER PIC  X(004).
000130 01  ALM_CSHMST-BASMON PIC  X(002).
000140 01  ALM_CSHMST-COLAMT PIC S9(013) COMP-3.
000150 01  ALM_CSHMST-COLRAT PIC S9(002)V9(2) COMP-3.
000160 01  ALM_CSHMST-BALCAP PIC S9(013) COMP-3.
000170 01  ALM_CSHMST-AVEBAL PIC S9(013) COMP-3.
000180 01  ALM_CSHMST-AVEINT PIC S9(013) COMP-3.
000190 01  ALM_CSHMST-AVERAT PIC S9(002)V9(2) COMP-3.
000200 01  ALM_CSHMST-DIVCOD PIC  X(001).
000210 01  ALM_CSHMST-GAPFLG PIC  X(001).
000220 01  ALM_CSHMST-JOBTYP PIC  X(003).
