000010************************************************
000020* (ANK_WORK004)
000030************************************************
000040 01  ANK_WORK004-KEY PIC S9(001) COMP-3.
000050 01  ANK_WORK004-ŒJ‰„NO PIC S9(003) COMP-3.
000060 01  ANK_WORK004-ŒJ‰„‹àŠz PIC S9(013) COMP-3.
000070 01  ANK_WORK004-ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000080 01  ANK_WORK004-‰ÁdŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000090 01  ANK_WORK004-ŒJ‰„” PIC S9(003) COMP-3.
000100 01  ANK_WORK004-“o˜^“ú PIC  X(008).
000110 01  ANK_WORK004-“o˜^Žž PIC  X(006).
000120 01  ANK_WORK004-“o˜^’S“–ŽÒº°ÄÞ PIC  X(004).
000130 01  ANK_WORK004-XV“ú PIC  X(008).
000140 01  ANK_WORK004-XVŽž PIC  X(006).
000150 01  ANK_WORK004-XV’S“–ŽÒº°ÄÞ PIC  X(004).
