000010************************************************
000020* (ANK_JOKYO_HYOJI)
000030************************************************
000040 01  ‚`‚m‚j|‚i‚n‚j‚x‚n|‚g‚x‚n‚i‚h|ˆÄŒó‹µ‹æ•ª PIC  X(002).
000050 01  ‚`‚m‚j|‚i‚n‚j‚x‚n|‚g‚x‚n‚i‚h|ˆÄŒó‹µ PIC  X(020).
000060 01  ‚`‚m‚j|‚i‚n‚j‚x‚n|‚g‚x‚n‚i‚h|“o˜^“ú PIC  X(008).
000070 01  ‚`‚m‚j|‚i‚n‚j‚x‚n|‚g‚x‚n‚i‚h|“o˜^Žž PIC  X(006).
000080 01  ‚`‚m‚j|‚i‚n‚j‚x‚n|‚g‚x‚n‚i‚h|“o˜^’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000090 01  ‚`‚m‚j|‚i‚n‚j‚x‚n|‚g‚x‚n‚i‚h|XV“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚i‚n‚j‚x‚n|‚g‚x‚n‚i‚h|XVŽž PIC  X(006).
000110 01  ‚`‚m‚j|‚i‚n‚j‚x‚n|‚g‚x‚n‚i‚h|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
