000010************************************************
000020* (ANK_BUKKEN)
000030************************************************
000040 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|•¨Œ–¼|Š¿Žš PIC  X(040).
000080 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|”—Ê PIC S9(004) COMP-3.
000090 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|’PˆÊ PIC  X(004).
000100 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|w“ü‹àŠz PIC S9(013) COMP-3.
000110 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|Žc‰¿Šz PIC S9(013) COMP-3.
000120 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|‘Ï—p”N” PIC S9(002) COMP-3.
000130 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|“®‘•ÛŒ¯—¿—¦ PIC S9(002)V9(3) COMP-3.
000140 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|ŒÅ’èŽ‘ŽYÅ—¦ PIC S9(002)V9(2) COMP-3.
000150 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000160 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|ŒŽŠz“®‘•ÛŒ¯—¿ PIC S9(013) COMP-3.
000170 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|ŒŽŠzŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000180 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|“o˜^“ú PIC  X(008).
000190 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|“o˜^Žž PIC  X(006).
000200 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000210 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|XV“ú PIC  X(008).
000220 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|XVŽž PIC  X(006).
000230 01  ‚`‚m‚j|‚a‚t‚j‚j‚d‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
