000010************************************************
000020* (ANK_LPWK_KURINOBE)
000030************************************************
000040 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚t‚q‚h‚m‚n‚a‚d|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚t‚q‚h‚m‚n‚a‚d|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚t‚q‚h‚m‚n‚a‚d|ŒJ‰„‚m‚n 
                                             PIC S9(002) COMP-3.
000070 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚t‚q‚h‚m‚n‚a‚d|’[––”Ô† PIC  X(016).
000080 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚t‚q‚h‚m‚n‚a‚d|ŒJ‰„‹àŠz 
                                             PIC S9(013) COMP-3.
000090 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚t‚q‚h‚m‚n‚a‚d|ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
