000010************************************************
000020* (ANK_HASSEI)
000030************************************************
000040 01  ‚`‚m‚j|‚g‚`‚r‚r‚d‚h|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000050 01  ‚`‚m‚j|‚g‚`‚r‚r‚d‚h|“à—e PIC  X(020).
000060 01  ‚`‚m‚j|‚g‚`‚r‚r‚d‚h|“o˜^“ú PIC  X(008).
000070 01  ‚`‚m‚j|‚g‚`‚r‚r‚d‚h|“o˜^Žž PIC  X(006).
000080 01  ‚`‚m‚j|‚g‚`‚r‚r‚d‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚`‚m‚j|‚g‚`‚r‚r‚d‚h|XV“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚g‚`‚r‚r‚d‚h|XVŽž PIC  X(006).
000110 01  ‚`‚m‚j|‚g‚`‚r‚r‚d‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
