000010************************************************
000020* (ANK_JUCYU_WK)
000030************************************************
000040 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|ì‹ÆŽÒ PIC  X(016).
000060 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|’S“–ŽÒƒR[ƒh PIC  X(004).
000080 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|ŒÚ‹qƒR[ƒh PIC  X(006).
000090 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|Žæˆøæ–¼ PIC  X(060).
000100 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|Œ_–ñ“ú PIC  X(008).
000110 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000120 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000130 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000140 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|‘e—˜‰v PIC S9(013) COMP-3.
000150 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000160 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000170 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|•¨Œ–¼|Š¿Žš PIC  X(040).
000180 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|ŒŸŽû—\’è“ú PIC  X(008).
000190 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000200 01  ‚`‚m‚j|‚i‚t‚b‚x‚t|‚v‚j|w“üæ–¼ PIC  X(060).
