000010************************************************
000020* (APR_SJYOKEN_MST)
000030************************************************
000040 01  ‚`‚o‚q|‚r‚i‚x‚n‚j‚d‚m|‚l‚r‚s|Žx•¥ðŒƒR[ƒh PIC  X(002).
000050 01  ‚`‚o‚q|‚r‚i‚x‚n‚j‚d‚m|‚l‚r‚s|Œ_–ñ”Ô†ã‚PŒ… PIC  X(001).
000060 01  ‚`‚o‚q|‚r‚i‚x‚n‚j‚d‚m|‚l‚r‚s|ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000070 01  ‚`‚o‚q|‚r‚i‚x‚n‚j‚d‚m|‚l‚r‚s|Žx•¥ðŒ•¶Œ¾ PIC  X(040).
