000010************************************************
000020* (APR_KIHON)
000030************************************************
000040 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ƒAƒ|ƒŒ_–ñ”Ô† PIC  X(007).
000050 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ƒy[ƒW PIC S9(002) COMP-3.
000060 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|•¨Œ‚m‚n PIC  X(003).
000080 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000090 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000100 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000110 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000120 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Žæˆøæ–¼ PIC  X(060).
000130 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000140 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|âg‹c‚m‚n PIC  X(010).
000150 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000160 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000170 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‘æ‚P‰ñ“ü‹à“ú PIC  X(008).
000180 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|“ü‹àŠî€“ú PIC  X(002).
000190 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000200 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
000210 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|˜’uŒŽ” PIC S9(002)V9(2) COMP-3.
000220 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‘OŽóŒŽ” PIC S9(002) COMP-3.
000230 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(2) COMP-3.
000240 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000250 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‰‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000260 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000270 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|I‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000280 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000290 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000300 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|[“–‘ŠŽE‹æ•ª PIC  X(001).
000310 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|w“ü‹àŠz PIC S9(013) COMP-3.
000320 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Žd“üÁ”ïÅ“™Šz PIC S9(013) COMP-3.
000330 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000340 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000350 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000360 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000370 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‘e—˜‰v PIC S9(013) COMP-3.
000380 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000390 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŽóŽæŽè”—¿Œ»Ý‰¿’l PIC S9(013) COMP-3.
000400 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000410 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŒŽŠzŒÅ’èŽ‘ŽYÅ‘Šz PIC S9(013) COMP-3.
000420 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŒŽŠz“®‘•ÛŒ¯—¿‘Šz PIC S9(013) COMP-3.
000430 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŒŽŠz‘OŽóƒƒŠƒbƒg PIC S9(013) COMP-3.
000440 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŒŽŠzŒJ‰„ƒƒŠƒbƒg PIC S9(013) COMP-3.
000450 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŽÀŽ¿ƒŠ[ƒX—¿‚o‚u PIC S9(013) COMP-3.
000460 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000470 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|”„Žå–¼ PIC  X(060).
000480 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|”„ŽåZŠ PIC  X(100).
000490 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Žx•¥ðŒƒR[ƒh PIC  X(002).
000500 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Žx•¥•û–@ PIC  X(001).
000510 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Žx•¥ðŒ PIC  X(040).
000520 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|w“üæƒR[ƒh PIC  X(008).
000530 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ƒAƒ|ƒ¤•iƒR[ƒh PIC  X(004).
000540 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|•¨Œ–¼|Š¿Žš PIC  X(040).
000550 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|•¨Œ–¼ PIC  X(020).
000560 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‹@Ží–¼ PIC  X(020).
000570 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|»‘¢‹ÆŽÒ–¼ PIC  X(040).
000580 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|”—Ê PIC S9(004) COMP-3.
000590 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|’†ŒÃ•iƒR[ƒh PIC  X(001).
000600 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000610 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯—¿—¦ PIC S9(002)V9(3) COMP-3.
000620 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Ž‘ŽYƒR[ƒh PIC  X(007).
000630 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‘Ï—p”N” PIC  X(002).
000640 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|M—p•ÛŒ¯ƒR[ƒh PIC  X(006).
000650 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Å‹æ•ª PIC  X(001).
000660 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅ—¦ PIC S9(002)V9(2) COMP-3.
000670 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000680 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Ý’uêŠZŠ PIC  X(100).
000690 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000700 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|Ý’uêŠ–¼|ƒJƒi PIC  X(020).
000710 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|”[•tæƒR[ƒh PIC  X(006).
000720 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000730 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000740 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000750 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000760 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000770 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
