000010************************************************
000020* (BANK_CHANGE)
000030************************************************
000040 01  ‚a‚`‚m‚j|‚b‚g‚`‚m‚f‚d|‹Œ‹âsƒR[ƒh PIC  X(004).
000050 01  ‚a‚`‚m‚j|‚b‚g‚`‚m‚f‚d|‹ŒŽx“XƒR[ƒh PIC  X(003).
000060 01  ‚a‚`‚m‚j|‚b‚g‚`‚m‚f‚d|V‹âsƒR[ƒh PIC  X(004).
000070 01  ‚a‚`‚m‚j|‚b‚g‚`‚m‚f‚d|VŽx“XƒR[ƒh PIC  X(003).
000080 01  ‚a‚`‚m‚j|‚b‚g‚`‚m‚f‚d|V‹âs–¼|Š¿Žš PIC  X(020).
000090 01  ‚a‚`‚m‚j|‚b‚g‚`‚m‚f‚d|V‹âs–¼|ƒJƒi PIC  X(015).
000100 01  ‚a‚`‚m‚j|‚b‚g‚`‚m‚f‚d|VŽx“X–¼|Š¿Žš PIC  X(020).
000110 01  ‚a‚`‚m‚j|‚b‚g‚`‚m‚f‚d|VŽx“X–¼|ƒJƒi PIC  X(015).
