      *****************************************************************
      *   バッチ起動サーバ管理テーブル(T02KSV_TBL)
      *****************************************************************
       01  バッチ起動サーバ管理テーブル.
           03  Ｔ０２－サーバグループ番号
                                     PIC  X(001).
           03  Ｔ０２－サーバ番号    PIC  X(002).
           03  Ｔ０２－アドレス      PIC  X(020).
           03  Ｔ０２－更新年月日    PIC  X(008).
           03  Ｔ０２－更新時間      PIC  X(008).
           03  Ｔ０２－更新者        PIC  X(008).
           03  Ｔ０２－登録年月日    PIC  X(008).
           03  Ｔ０２－登録時間      PIC  X(008).
           03  Ｔ０２－登録担当者    PIC  X(008).
           03  Ｔ０２－入力担当者コード
                                     PIC  X(008).
