000010************************************************
000020* ‰ð–ñ—š—ðÂŒ ƒtƒ@ƒCƒ‹i–¾×j(CPFKAIRD02)
000030************************************************
000040 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚j‚d‚x|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚j‚d‚x|•¨Œ”Ô† PIC S9(003) COMP-3.
000060 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚j‚d‚x|‰ð–ñ‹æ•ª PIC  X(001).
000070 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚j‚d‚x|‰ð–ñ“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000080 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚j‚d‚x|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000090 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚j‚d‚x|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000100 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚j‚d‚x|ÄƒŠ[ƒXƒR[ƒh 
                                             PIC S9(001) COMP-3.
000110 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚j‚d‚x|ƒŒƒR[ƒh‹æ•ª PIC  X(002).
000120 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Œ_–ñ”Ô† PIC  X(009).
000130 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000140 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|•¨Œ‚m‚n PIC S9(003) COMP-3.
000150 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000160 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000170 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰ð–ñ‹æ•ª PIC  X(001).
000180 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000190 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000200 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰ð–ñ‘ÎÛƒR[ƒh PIC  X(001).
000210 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰ð–ñˆ—ƒR[ƒh PIC  X(001).
000220 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000230 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000240 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000250 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000260 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000270 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000280 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000290 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000300 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒŠ[ƒXŠúŠÔ•„†Œ… PIC  X(001).
000310 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000320 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|¿‹æƒR[ƒh PIC  X(008).
000330 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žx•¥‰ñ” PIC S9(003) COMP-3.
000340 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŒvŽZ•ûŽ® PIC  X(001).
000350 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000360 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|˜’uŠúŠÔ PIC S9(003) COMP-3.
000370 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000380 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000390 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú 
                                             PIC  X(006).
000400 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000410 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú 
                                             PIC  X(006).
000420 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000430 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽó[“–ŠJŽn“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000440 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽó[“–ŠJŽn“ú|”NŒŽ PIC  X(004).
000450 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽó[“–I—¹“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000460 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽó[“–I—¹“ú|”NŒŽ PIC  X(004).
000470 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽó[“–ŒŽ” PIC S9(003) COMP-3.
000480 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ˆê•”[“–Šz PIC S9(013) COMP-3.
000490 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‹âsƒR[ƒh PIC  X(007).
000500 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŒûÀ”Ô† PIC  X(007).
000510 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|—a‹àŽí—Þ PIC  X(001).
000520 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|“ü‹à“ú PIC S9(002) COMP-3.
000530 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|¿‹‘”­sÏ‰ñ” PIC S9(003) COMP-3.
000540 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒ_ƒ~[‚O‚O‚P PIC  X(014).
000550 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|’S•Û‹âsƒR[ƒh PIC  X(007).
000560 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|’S•Û·“ü“ú|¢‹I PIC S9(001) COMP-3.
000570 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|’S•Û·“ü“ú|”NŒŽ“ú PIC  X(006).
000580 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|’S•Ûˆ—ŒŽ“x|¢‹I PIC S9(001) COMP-3.
000590 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|’S•Ûˆ—ŒŽ“x|”NŒŽ PIC  X(004).
000600 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒ_ƒ~[‚O‚O‚Q PIC  X(002).
000610 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|’P”N“xŒ_–ñ PIC  X(002).
000620 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Â‹¦ƒR[ƒh PIC  X(002).
000630 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žx•¥ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000640 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰Šú”ï—p PIC S9(013) COMP-3.
000650 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘O“n‹à—˜‘§Šz PIC S9(013) COMP-3.
000660 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Šî€‹à—˜ PIC S9(002)V9(8) COMP-3.
000670 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000680 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000690 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|’¥Žû‹æ•ª PIC S9(001) COMP-3.
000700 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Å—¦ PIC S9(002)V9(1) COMP-3.
000710 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Á”ïÅƒR[ƒh PIC S9(002) COMP-3.
000720 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000730 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŠJŽn“ú|”NŒŽ PIC  X(004).
000740 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|I—¹“ú|¢‹I PIC S9(001) COMP-3.
000750 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|I—¹“ú|”NŒŽ PIC  X(004).
000760 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŠúŠÔ PIC S9(003) COMP-3.
000770 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘e—˜ PIC S9(013) COMP-3.
000780 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Œ_–ñ‹àŠzŠî–{ PIC S9(013) COMP-3.
000790 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Œ_–ñ‹àŠzŽÀŽ¿ PIC S9(013) COMP-3.
000800 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|—˜‘§‡ŒvŠî–{ PIC S9(013) COMP-3.
000810 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|—˜‘§‡ŒvŽÀŽ¿ PIC S9(013) COMP-3.
000820 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000830 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|•ÛŒ¯—¿ PIC S9(013) COMP-3.
000840 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|•ÛŽç—¿ PIC S9(013) COMP-3.
000850 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000860 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000870 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|”Œo”ï‡Œv PIC S9(013) COMP-3.
000880 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000890 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒ_ƒ~[‚O‚O‚R PIC  X(007).
000900 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žc‰¿•ÛØ‹æ•ª PIC S9(001) COMP-3.
000910 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000920 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000930 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žc‰¿Šz‡Œv PIC S9(011) COMP-3.
000940 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|•¨ŒŽ}”Ô” PIC S9(003) COMP-3.
000950 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ÂŒ Žc‚‘OŒŽ–– PIC S9(013) COMP-3.
000960 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰‰ñ”NŒŽ|¢‹I PIC S9(001) COMP-3.
000970 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰‰ñ”NŒŽ|”NŒŽ PIC  X(004).
000980 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000990 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŽÀƒŠ[ƒX—¿|Šî–{ PIC S9(013) COMP-3.
001000 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ŽÀƒŠ[ƒX—¿|ŽÀŽ¿ PIC S9(013) COMP-3.
001010 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚m‚d‚s|ƒŠ[ƒX—¿|Šî–{ 
                                             PIC S9(013) COMP-3.
001020 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‚m‚d‚s|ƒŠ[ƒX—¿|ŽÀŽ¿ 
                                             PIC S9(013) COMP-3.
001030 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|—˜‘§|Šî–{ PIC S9(013) COMP-3.
001040 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|—˜‘§|ŽÀŽ¿ PIC S9(013) COMP-3.
001050 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Œ³–{“à“ü PIC S9(013) COMP-3.
001060 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Œ³–{Žc‚ PIC S9(013) COMP-3.
001070 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ÂŒ Žc‚|Šî–{ PIC S9(013) COMP-3.
001080 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ÂŒ Žc‚|ŽÀŽ¿ PIC S9(013) COMP-3.
001090 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Á”ïÅŠz PIC S9(011) COMP-3.
001100 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Á”ïÅ|‰ñŽû•ûŽ®ƒR[ƒh 
                                             PIC S9(001) COMP-3.
001110 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|””ï—p PIC S9(013) COMP-3.
001120 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
001130 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒ_ƒ~[‚O‚O‚S PIC  X(004).
001140 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
001150 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‰ñŽûÏ•\Ž¦ PIC S9(001) COMP-3.
001160 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‘OŽó[“–•\Ž¦ PIC S9(001) COMP-3.
001170 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žc‰¿‰ñŽû•\Ž¦ PIC S9(001) COMP-3.
001180 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|Žè”—¿¿‹–¼ÌƒJƒi PIC  X(030).
001190 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|[“–^‘ŠŽE‹æ•ª PIC  X(001).
001200 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ƒ_ƒ~[‚O‚O‚T PIC  X(028).
001210 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|³Œp“ú PIC  X(007).
001220 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ÅV“ü—ÍÁ”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
001230 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ˆ—”NŒŽ“x|¢‹I PIC  X(001).
001240 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
001250 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚Q|‹¤’Êî•ñ PIC  X(035).
