000010************************************************
000020* ‰ð–ñ—š—ðÂŒ ƒtƒ@ƒCƒ‹(ÄƒŠ[ƒX“WŠJ)(CPFKAIRD04)
000030************************************************
000040 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‚j‚d‚x|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‚j‚d‚x|•¨Œ”Ô† PIC  X(003).
000060 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‚j‚d‚x|‰ð–ñ‹æ•ª PIC  X(001).
000070 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‚j‚d‚x|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000080 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‚j‚d‚x|‰ð–ñ“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000090 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‚j‚d‚x|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000100 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‚j‚d‚x|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000110 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‚j‚d‚x|ƒŒƒR[ƒh‹æ•ª PIC  X(002).
000120 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|Œ_–ñ”Ô† PIC  X(009).
000130 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000140 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|•¨Œ”Ô† PIC S9(003) COMP-3.
000150 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000160 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000170 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‰ð–ñ‹æ•ª PIC  X(001).
000180 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|”N“x|¢‹I PIC  X(001).
000190 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|”N“x|”NŒŽ PIC  X(004).
000200 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000210 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|¿‹‹àŠz PIC  X(013).
000220 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|ÂŒ Žc‚ PIC S9(013) COMP-3.
000230 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|Á”ïÅ|Šz PIC S9(011) COMP-3.
000240 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|Á”ïÅ|‰ñŽû•ûŽ®ƒR[ƒh PIC  X(001).
000250 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‰ñŽû•ûŽ®ƒR[ƒh PIC  X(001).
000260 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‰ñŽûÏ•\Ž¦ PIC S9(001) COMP-3.
000270 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|‘OŽó[“–•\Ž¦ PIC  X(001).
000280 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000290 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚S|ƒ_ƒ~[‚O‚O‚P PIC  X(024).
