000010************************************************
000020* ‰ð–ñ—š—ðŽ‘ŽYƒtƒ@ƒCƒ‹iŠî–{j(CPFKAIRC)
000030************************************************
000040 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‚j‚d‚x|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‚j‚d‚x|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000060 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‚j‚d‚x|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000070 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‚j‚d‚x|‰ð–ñˆ—ƒR[ƒh PIC  X(001).
000080 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‚j‚d‚x|•¨Œ‚m‚n PIC S9(003) COMP-3.
000090 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‚j‚d‚x|‰ð–ñ‹æ•ª PIC  X(001).
000100 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œ_–ñ‚m‚n PIC  X(009).
000110 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000120 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ƒ†[ƒUƒR[ƒh PIC  X(008).
000130 01  ‚b‚o‚e‚j‚`‚h‚q‚b|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000140 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œ´Œ_–ñ PIC  X(001).
000150 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œp‘± PIC  X(001).
000160 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ÄƒŠ[ƒX PIC  X(001).
000170 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Š„•Š PIC  X(001).
000180 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Žè”—¿ PIC  X(001).
000190 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ƒtƒ@ƒNƒ^ƒŠƒ“ƒO PIC  X(001).
000200 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‹àÁ PIC  X(001).
000210 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Žx•¥•ÛØ PIC  X(001).
000220 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ƒ_ƒ~[‚O‚O‚P PIC  X(005).
000230 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000240 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000250 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000260 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000270 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000280 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000290 01  ‚b‚o‚e‚j‚`‚h‚q‚b|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000300 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Žc‰¿Šz‡ŒvŠz PIC S9(013) COMP-3.
000310 01  ‚b‚o‚e‚j‚`‚h‚q‚b|•¨ŒŽ}”Ô” PIC S9(003) COMP-3.
000320 01  ‚b‚o‚e‚j‚`‚h‚q‚b|”—Ê‡Œv PIC S9(005) COMP-3.
000330 01  ‚b‚o‚e‚j‚`‚h‚q‚b|’P”N“xŒ_–ñ PIC  X(002).
000340 01  ‚b‚o‚e‚j‚`‚h‚q‚b|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000350 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ÂŒ ‹¦’²ƒR[ƒh PIC  X(002).
000360 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Žd“üÁ”ïÅŠz‡Œv PIC S9(013) COMP-3.
000370 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000380 01  ‚b‚o‚e‚j‚`‚h‚q‚b|âg‹c‹æ•ª PIC  X(001).
000390 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ÅI•¨Œ‚m‚n PIC S9(003) COMP-3.
000400 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Š²Ž–”ñŠ²Ž–‹æ•ª PIC  X(001).
000410 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‚n‚o‚d‚m‚b‚k‚n‚r‚d‹æ•ª PIC  X(001).
000420 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‰ñŽûŽè‡ PIC  X(001).
000430 01  ‚b‚o‚e‚j‚`‚h‚q‚b|”Û”F‹æ•ª PIC  X(001).
000440 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ƒ_ƒ~[‚O‚O‚Q PIC  X(033).
000450 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œ³Œ_–ñ‚m‚n PIC  X(009).
000460 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œ³ÅI•¨Œ‚m‚n PIC S9(003) COMP-3.
000470 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œ³Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000480 01  ‚b‚o‚e‚j‚`‚h‚q‚b|Œ³ƒ†[ƒUƒR[ƒh PIC  X(008).
000490 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000500 01  ‚b‚o‚e‚j‚`‚h‚q‚b|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000510 01  ‚b‚o‚e‚j‚`‚h‚q‚b|‹¤’Êî•ñ PIC  X(035).
