000010************************************************
000020* ‰ð–ñ—š—ðŽ‘ŽYƒtƒ@ƒCƒ‹i–¾×{•ÛŒ¯{ŒÅ’èŽ‘ŽYÅ{ž‹pj(CPFKAIRC02)
000030************************************************
000040 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‚j‚d‚x|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‚j‚d‚x|‰ð–ñ“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000060 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‚j‚d‚x|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000070 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‚j‚d‚x|‰ð–ñˆ—ƒR[ƒh PIC  X(001).
000080 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‚j‚d‚x|•¨Œ‚m‚n PIC S9(003) COMP-3.
000090 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‚j‚d‚x|‰ð–ñ‹æ•ª PIC  X(001).
000100 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Œ_–ñ‚m‚n PIC  X(009).
000110 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•¨Œ‚m‚n PIC S9(003) COMP-3.
000120 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ð–ñ‹æ•ª PIC  X(001).
000130 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ä¶‹æ•ª PIC  X(001).
000140 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000150 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000170 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000180 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000190 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000200 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|”NŒŽ“ú 
                                             PIC  X(006).
000210 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000220 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000230 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ž‘ŽYƒR[ƒh PIC S9(007) COMP-3.
000240 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|’†ŒÃŽ‘ŽYƒR[ƒh PIC S9(001) COMP-3.
000250 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ž‘ŽYˆ•ªƒR[ƒh PIC  X(001).
000260 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‘Ï—p”N” PIC S9(002) COMP-3.
000270 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•t•Û‹æ•ª|“®ŽY‘‡ PIC  X(001).
000280 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•t•Û‹æ•ª|M—p•ÛŒ¯ PIC  X(001).
000290 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|”—Ê PIC S9(004) COMP-3.
000300 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000310 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ŒÂ•ÊŒ_–ñ‹àŠz PIC S9(013) COMP-3.
000320 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Žc‰¿î•ñ|Žc‰¿•ÛØ‹æ•ª 
                                             PIC S9(001) COMP-3.
000330 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Žc‰¿î•ñ|Žc‰¿•ÛØæƒR[ƒh 
                                             PIC  X(008).
000340 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Žc‰¿î•ñ|Žc‰¿•ÛØæ–¼ PIC  X(060).
000350 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Žc‰¿î•ñ|Žc‰¿Šz‚P•ÛØ 
                                             PIC S9(013) COMP-3.
000360 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Žc‰¿î•ñ|Žc‰¿Šz‚QŒ©Ï 
                                             PIC S9(013) COMP-3.
000370 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Žc‰¿î•ñ|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz 
                                             PIC S9(013) COMP-3.
000380 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000390 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•¨Œ–¼Š¿Žš PIC  X(060).
000400 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•¨Œ–¼ƒJƒi PIC  X(030).
000410 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Žd—l»‘¢”Ô† PIC  X(020).
000420 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ð–ñ‘ÎÛƒR[ƒh PIC  X(001).
000430 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ð–ñˆ—ƒR[ƒh PIC  X(001).
000440 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000450 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000460 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ˆ—“úÄƒŠ[ƒXŒp‘±ƒŠ[ƒX¢‹I 
                                             PIC S9(001) COMP-3.
000470 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ˆ—“úÄƒŠ[ƒXŒp‘±ƒŠ[ƒX”NŒŽ“ú 
                                             PIC  X(006).
000480 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ÄƒŠ[ƒXŽü‰ñƒR[ƒh PIC S9(001) COMP-3.
000490 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚Q PIC  X(003).
000500 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|w“üæƒR[ƒh PIC  X(008).
000510 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|w“üæ‹àŠz PIC S9(013) COMP-3.
000520 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Žd“üÁ”ïÅ PIC S9(013) COMP-3.
000530 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000540 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚R PIC  X(013).
000550 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P PIC  X(012).
000560 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚Q PIC  X(012).
000570 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚R PIC  X(012).
000580 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚S PIC  X(012).
000590 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚S PIC  X(057).
000600 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|’nˆÊ³Œpî•ñ|³Œp‹æ•ª PIC  X(001).
000610 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|’nˆÊ³Œpî•ñ|Œ³•¨Œ‚m‚n 
                                             PIC S9(003) COMP-3.
000620 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|’nˆÊ³Œpî•ñ|³Œp“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000630 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|’nˆÊ³Œpî•ñ|³Œp“ú|”NŒŽ“ú 
                                             PIC  X(006).
000640 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚T PIC  X(008).
000650 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000660 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000670 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‹¤’Êî•ñ PIC  X(035).
000680 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•ÛŒ¯î•ñ|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000690 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•ÛŒ¯î•ñ|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000700 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•ÛŒ¯V‹KŒp‘±‹æ•ª PIC  X(001).
000710 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ž–ŒÌ—L–³‹æ•ª PIC  X(001).
000720 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•t•Û“ú|¢‹I PIC S9(001) COMP-3.
000730 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•t•Û“ú|”NŒŽ“ú PIC  X(006).
000740 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ž–ŒÌ“ú|¢‹I PIC S9(001) COMP-3.
000750 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ž–ŒÌ“ú|”NŒŽ“ú PIC  X(006).
000760 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–³Ž–ŒÌ–ß‚µ“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000770 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–³Ž–ŒÌ–ß‚µ“ú|”NŒŽ“ú PIC  X(006).
000780 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‹K’è‘¹ŠQ‹à‚t‚o—¦ 
                                             PIC S9(002)V9(7) COMP-3.
000790 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘•ÛŒ¯‰¿Ši PIC S9(013) COMP-3.
000800 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘•ÛŒ¯—¿ PIC S9(013) COMP-3.
000810 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘•¥–ß‚µ•ÛŒ¯—¿ PIC S9(013) COMP-3.
000820 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘–³Ž–ŒÌ–ß‚µ—¿ PIC S9(013) COMP-3.
000830 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘\ž–¾×î•ñ|“–”N“xƒy[ƒW 
                                             PIC S9(005) COMP-3.
000840 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘\ž–¾×î•ñ|“–”N“xŒ…” 
                                             PIC S9(002) COMP-3.
000850 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘\ž–¾×î•ñ|‘O”N“xƒy[ƒW 
                                             PIC S9(005) COMP-3.
000860 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘\ž–¾×î•ñ|‘O”N“xŒ…” 
                                             PIC S9(002) COMP-3.
000870 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚U PIC  X(008).
000880 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ÄƒŠ[ƒX•t•Û—¦ PIC S9(002) COMP-3.
000890 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘•ÛŒ¯—¿—¦ PIC S9(003)V9(6) COMP-3.
000900 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚V PIC  X(010).
000910 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|M—p•ÛŒ¯ƒR[ƒh|ƒŠ[ƒXŠ„•Š‹æ•ª 
                                             PIC  X(001).
000920 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|M—p•ÛŒ¯ƒR[ƒh|‹@ŠB‹æ•ª PIC  X(002).
000930 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|M—p•ÛŒ¯ƒR[ƒh|‹@Ží–¼”Ô† 
                                             PIC  X(002).
000940 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Œ^Ž®”Ô† PIC  X(015).
000950 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|’Ê’m‘”­‘—“ú|¢‹I PIC S9(001) COMP-3.
000960 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|’Ê’m‘”­‘—“ú|”NŒŽ“ú PIC  X(006).
000970 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•„†ˆê˜A”Ô† PIC  X(005).
000980 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|M—p•ÛŒ¯—¿ PIC S9(013) COMP-3.
000990 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“®‘•ÛŒ¯ØŒ””Ô† PIC  X(011).
001000 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚W PIC  X(015).
001010 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•ÛŒ¯î•ñ|ˆ—”NŒŽ“x|¢‹I 
                                             PIC S9(001) COMP-3.
001020 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|•ÛŒ¯î•ñ|ˆ—”NŒŽ“x|”NŒŽ 
                                             PIC  X(004).
001030 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|”[•tæƒR[ƒh PIC  X(006).
001040 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Å‹æ•ª PIC S9(001) COMP-3.
001050 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Å•‰’S‹æ•ª PIC  X(001).
001060 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‘Ï—p”N”’Zk‹æ•ª PIC  X(001).
001070 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ˆÚ“®î•ñ|ˆÚ“®‹æ•ª PIC  X(001).
001080 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ˆÚ“®î•ñ|¢‹I PIC S9(001) COMP-3.
001090 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ˆÚ“®î•ñ|”NŒŽ“ú PIC  X(006).
001100 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚X PIC  X(010).
001110 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“Á—á|ŠúŠÔ PIC S9(002) COMP-3.
001120 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“Á—á|•ªŽq PIC S9(002) COMP-3.
001130 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“Á—á|•ª•ê PIC S9(003) COMP-3.
001140 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|”NÅŠz PIC S9(013) COMP-3.
001150 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‘O”N“x•]‰¿Šz PIC S9(013) COMP-3.
001160 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‘O”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
001170 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“–”N“x•]‰¿Šz PIC S9(013) COMP-3.
001180 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“–”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
001190 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“Á•Ê‰ÛÅ•W€Šz PIC S9(013) COMP-3.
001200 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‘O‰ñ\æ PIC  X(006).
001210 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ý’uêŠ–¼Š¿Žš PIC  X(040).
001220 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ý’uêŠ–¼ƒJƒi PIC  X(020).
001230 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ý’uêŠ—X•Ö”Ô†|e PIC  X(003).
001240 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ý’uêŠ—X•Ö”Ô†|Žq PIC  X(004).
001250 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|Ý’uêŠZŠŠ¿Žš PIC  X(100).
001260 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚P‚O PIC  X(011).
001270 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ŒÅ’èŽ‘ŽY\î•ñˆ—”NŒŽ“x¢‹I 
                                             PIC S9(001) COMP-3.
001280 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ŒÅ’èŽ‘ŽY\î•ñˆ—”NŒŽ“x”NŒŽ 
                                             PIC  X(004).
001290 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ïŽÐ‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
001300 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ïŽÐ“–ŒŽž‹p‚ PIC S9(013) COMP-3.
001310 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ïŽÐ“–Šúž‹p‚ PIC S9(013) COMP-3.
001320 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ïŽÐŒ»Ý•ë‰¿ PIC S9(013) COMP-3.
001330 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚P‚P PIC  X(010).
001340 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’èž‹p‹æ•ª PIC S9(002) COMP-3.
001350 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’èŠ„‘‹æ•ª PIC S9(002) COMP-3.
001360 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’è“Á•Êž‹p—¦|•ªŽq 
                                             PIC S9(002) COMP-3.
001370 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’è“Á•Êž‹p—¦|•ª•ê 
                                             PIC S9(003) COMP-3.
001380 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’è‘OŠú––•ë‰¿–@’è PIC S9(013) COMP-3.
001390 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’è•’Êž‹p”ï PIC S9(013) COMP-3.
001400 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’èŠ„‘ž‹p”ï PIC S9(013) COMP-3.
001410 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’è“Á•Êž‹p”ï PIC S9(013) COMP-3.
001420 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’è“–Šú––•ë‰¿ PIC S9(013) COMP-3.
001430 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’èŒJ‰z’´‰ßŠz PIC S9(013) COMP-3.
001440 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|–@’èž‹pŒÀ“xŠz PIC S9(013) COMP-3.
001450 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚P‚Q PIC  X(015).
001460 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ïŽÐ—˜_‘OŠú––•ë‰¿ PIC S9(013) COMP-3.
001470 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|‰ïŽÐ—˜_“–Šú––•ë‰¿ PIC S9(013) COMP-3.
001480 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|“–Šúž‹p‰ß•s‘«Šz PIC S9(013) COMP-3.
001490 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ƒ_ƒ~[‚O‚O‚P‚R PIC  X(028).
001500 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ž‹pŒvŽZî•ñˆ—”NŒŽ“x¢‹I 
                                             PIC S9(001) COMP-3.
001510 01  ‚b‚o‚e‚j‚`‚h‚q‚b‚O‚Q|ž‹pŒvŽZî•ñˆ—”NŒŽ“x”NŒŽ PIC  X(004).
