000010************************************************
000020* ‰¼Žó‹àŽc‚Æ‰ïƒtƒ@ƒCƒ‹(Ä’è‹`)(CPFKSZA2)
000030************************************************
000040 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹à’Ê”Ô‚Q PIC  X(009).
000050 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹à‹æ•ª‚Q PIC S9(001) COMP-3.
000060 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹àæ‚b‚c‚Q PIC  X(008).
000070 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ƒ_ƒ~[‚O‚O‚P PIC  X(020).
000080 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ƒ_ƒ~[‚O‚O‚Q PIC  X(030).
000090 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹àŠz‚Q PIC S9(012) COMP-3.
000100 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ƒ_ƒ~[‚O‚O‚R PIC  X(008).
000110 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ƒ_ƒ~[‚O‚O‚S PIC  X(030).
000120 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹à“ú‚R PIC  X(008).
000130 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹àŠz‚R PIC  X(012).
000140 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹àæ–¼|•ÒW‘O‚Q PIC  X(048).
000150 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|Áž‹àŠz‚Q PIC S9(013) COMP-3.
000160 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|‹âs‚b‚c‚Q PIC S9(007) COMP-3.
000170 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ŒûÀ”Ô†‚Q PIC S9(007) COMP-3.
000180 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|Œ_–ñ‚m‚n‚Q PIC  X(009).
000190 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ÄƒŠ[ƒX‚b‚c‚Q PIC S9(001) COMP-3.
000200 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|Áž“ú‚Q PIC  X(008).
000210 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ÁžŽc‚‚Q PIC S9(013) COMP-3.
000220 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|‚q‚`‚s‚d‚Q PIC S9(003)V9(2) COMP-3.
000230 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ŠO‰Ý‹àŠz‚Q PIC S9(011)V9(2) COMP-3.
000240 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹à‹âs’Zk‚b‚c‚Q PIC S9(002) COMP-3.
000250 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|“ü‹àŽd–ó’Zk‚b‚c‚Q PIC S9(002) COMP-3.
000260 01  ‚b‚o‚e‚j‚r‚y‚`‚Q|ƒ_ƒ~[‚O‚O‚T PIC  X(052).
