000010************************************************
000020* ‰¼Žó‹àŽc‚Æ‰ïƒtƒ@ƒCƒ‹(CPFKSZAN)
000030************************************************
000040 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹à’Ê”Ô PIC  X(009).
000050 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹à‹æ•ª PIC S9(001) COMP-3.
000060 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àæ‚b‚c PIC  X(008).
000070 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹à“ú‚P|¢‹I PIC  X(001).
000080 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹à“ú‚P|”NŒŽ“ú PIC  X(006).
000090 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àŠz‚P PIC S9(012) COMP-3.
000100 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àæ–¼‚P PIC  X(030).
000110 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àŠz‚Q•„‡Œ… PIC  X(001).
000120 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àŠz‚Q PIC  X(012).
000130 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹à“ú‚Q|¢‹I PIC  X(001).
000140 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹à“ú‚Q|”NŒŽ“ú PIC  X(006).
000150 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àæ–¼‚Q PIC  X(030).
000160 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹à“ú‚R|¢‹I PIC  X(001).
000170 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹à“ú‚R|”NŒŽ“ú PIC  X(006).
000180 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àŠz‚R•„‡Œ… PIC  X(001).
000190 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àŠz‚R PIC S9(012) COMP-3.
000200 01  ‚b‚o‚e‚j‚r‚y‚`‚m|“ü‹àæ–¼|•ÒW‘O PIC  X(048).
000210 01  ‚b‚o‚e‚j‚r‚y‚`‚m|Áž‹àŠz PIC S9(013) COMP-3.
000220 01  ‚b‚o‚e‚j‚r‚y‚`‚m|‹âs‚b‚c PIC S9(007) COMP-3.
000230 01  ‚b‚o‚e‚j‚r‚y‚`‚m|ŒûÀ”Ô† PIC S9(007) COMP-3.
000240 01  ‚b‚o‚e‚j‚r‚y‚`‚m|Œ_–ñ‚m‚n PIC  X(009).
000250 01  ‚b‚o‚e‚j‚r‚y‚`‚m|ÄƒŠ[ƒX‚b‚c PIC S9(001) COMP-3.
