      *****************************************************************
      *   ŽæˆøæÂ–±Žc‚î•ñƒ}ƒXƒ^(D013TSZ_TBL)
      *****************************************************************
       01  ŽæˆøæÂ–±Žc‚î•ñƒ}ƒXƒ^.
           03  ‚c‚O‚P‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚R|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚P‚R|Â–±Žc‚‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚P‚R|Â–±ŽcŒ”  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚P‚R|Â–±Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚R|Â–±Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚R|Â–±–¢•¥Œ”
                                     PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚P‚R|Â–±–¢•¥Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚R|Â–±–¢•¥Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚R|Â–±ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚P‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚P‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚P‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
