      *****************************************************************
      *   ŽæˆøæÂ–±Žc‚î•ñ—š—ðƒ}ƒXƒ^(D014TSR_TBL)
      *****************************************************************
       01  ŽæˆøæÂ–±Žc‚î•ñ—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚P‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚S|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚P‚S|Â–±Žc‚‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚P‚S|Â–±ŽcŒ”  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚P‚S|Â–±Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚S|Â–±Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚S|Â–±–¢•¥Œ”
                                     PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚P‚S|Â–±–¢•¥Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚S|Â–±–¢•¥Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚S|Â–±ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚P‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚P‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚P‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
