      *****************************************************************
      *   ŽæˆøæŽc‚î•ñƒ}ƒXƒ^(D015TRZ_TBL)
      *****************************************************************
       01  ŽæˆøæŽc‚î•ñƒ}ƒXƒ^.
           03  ‚c‚O‚P‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚T|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚P‚T|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚T|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|•ÛØŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|–¢ÁžŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚P‚T|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚P‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚P‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
