      *****************************************************************
      *   Œ_–ñæƒ}ƒXƒ^(D021KYS_TBL)
      *****************************************************************
       01  Œ_–ñæƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚P|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚Q‚P|Œ_–ñæ–¼Ì  PIC  X(080).
           03  ‚c‚O‚Q‚P|•”–å–¼Ì    PIC  X(060).
           03  ‚c‚O‚Q‚P|‹qæ’S“–ŽÒ  PIC  X(020).
           03  ‚c‚O‚Q‚P|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚O‚Q‚P|Žs’¬‘ºƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚O‚Q‚P|ZŠ‚Q      PIC  X(060).
           03  ‚c‚O‚Q‚P|ZŠ‚R      PIC  X(060).
           03  ‚c‚O‚Q‚P|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚O‚Q‚P|XV“úŽž    PIC  X(016).
           03  ‚c‚O‚Q‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚P|•”–åƒJƒi–¼Ì
                                     PIC  X(030).
           03  ‚c‚O‚Q‚P|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|ƒRƒƒ“ƒg—“  PIC  X(060).
           03  ‚c‚O‚Q‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚Q‚P|Žå’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚Q‚P|Œ»’S“–ŽÒ    PIC  X(008).
           03  ‚c‚O‚Q‚P|‚e‚`‚w”Ô†  PIC  X(015).
           03  ‚c‚O‚Q‚P|ZŠ‚P      PIC  X(060).
           03  ‚c‚O‚Q‚P|ZŠƒJƒi–¼Ì
                                     PIC  X(060).
           03  ‚c‚O‚Q‚P|“Á’è“®‘•ÛŒ¯—¿—¦Žg—p‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|ÄƒŠ[ƒXŒvŽZ—¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|ÄƒŠ[ƒX—¿—¦•ªŽq
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚P|ÄƒŠ[ƒX—¿—¦•ª•ê
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚P|ÄƒŠ[ƒXŒvŽZ’PˆÊ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|ÄƒŠ[ƒXŒvŽZ•ûŽ®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|–ž—¹’Ê’m–¾×‘”­s‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|ÄƒŠ[ƒXŽ©“®XVƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|–ž—¹ðŒ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚P|‚m‚d‚s‚k‚d‚`‚r‚h‚m‚f‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|”„Š|‹àÂŒ ŽèŒ`÷“nŠî–{Œ_–ñ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚P|‹Œƒ†[ƒU[ƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚Q‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚O‚Q‚P|ŽØ“üæŽ¯•Ê‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚Q‚P|ŽØ“üæŽí•Ê  PIC  X(002).
           03  ‚c‚O‚Q‚P|’S•Û·“ü—¦  PIC S9(003) PACKED-DECIMAL.
