      *****************************************************************
      *   Œ_–ñæŽc‚î•ñƒ}ƒXƒ^(D022KRZ_TBL)
      *****************************************************************
       01  Œ_–ñæŽc‚î•ñƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚Q|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚Q‚Q|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚Q‚Q|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚Q|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚Q|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
