      *****************************************************************
      *   ƒOƒ‹[ƒvŽc‚î•ñƒ}ƒXƒ^(D026GRZ_TBL)
      *****************************************************************
       01  ƒOƒ‹[ƒvŽc‚î•ñƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚U|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚U|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚Q‚U|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|•ÛØŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|–¢ÁžŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚U|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
