      *****************************************************************
      *   ŒˆÙðŒƒ}ƒXƒ^(D040KSJ_TBL)
      *****************************************************************
       01  ŒˆÙðŒƒ}ƒXƒ^.
           03  ‚c‚O‚S‚O|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚O|ŒˆÙƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚S‚O|ŒˆÙ‹æ•ª    PIC  X(002).
           03  ‚c‚O‚S‚O|•”Š’·ŒˆÙŒÀ“xŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚S‚O|XV“úŽž    PIC  X(016).
           03  ‚c‚O‚S‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚S‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚S‚O|Šî€ƒŒ[ƒg  PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚O‚S‚O|Ši•t        PIC  X(003).
           03  ‚c‚O‚S‚O|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚S‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚S‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚O|XVŽžŠÔ    PIC  X(008).
