      *****************************************************************
      *   ‰ïŽÐZŠƒ}ƒXƒ^(D041STS_TBL)
      *****************************************************************
       01  ‰ïŽÐZŠƒ}ƒXƒ^.
           03  ‚c‚O‚S‚P|‰ïŽÐƒR[ƒh  PIC  X(010).
           03  ‚c‚O‚S‚P|‰ïŽÐ–¼      PIC  X(080).
           03  ‚c‚O‚S‚P|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚O‚S‚P|ZŠƒR[ƒh  PIC  X(011).
           03  ‚c‚O‚S‚P|ZŠ‚Q      PIC  X(060).
           03  ‚c‚O‚S‚P|ZŠ‚R      PIC  X(060).
           03  ‚c‚O‚S‚P|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚O‚S‚P|‚e‚`‚w”Ô†  PIC  X(015).
           03  ‚c‚O‚S‚P|‘ã•\ŽÒ–¼    PIC  X(020).
           03  ‚c‚O‚S‚P|‘ã•\ŽÒ–ðE–¼
                                     PIC  X(030).
           03  ‚c‚O‚S‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚S‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚S‚P|ZŠ‚P      PIC  X(040).
           03  ‚c‚O‚S‚P|‘Ý‹à‹Æ“o˜^”Ô†
                                     PIC  X(040).
           03  ‚c‚O‚S‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚P|“o˜^’S“–ŽÒ  PIC  X(008).
