      *****************************************************************
      *   Žd–óƒpƒ^[ƒ“ƒ}ƒXƒ^(D045SWP_TBL)
      *****************************************************************
       01  Žd–óƒpƒ^[ƒ“ƒ}ƒXƒ^.
           03  ‚c‚O‚S‚T|Žd–óƒR[ƒh  PIC  X(004).
           03  ‚c‚O‚S‚T|‘ÝŽØ‹æ•ª    PIC  X(001).
           03  ‚c‚O‚S‚T|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚S‚T|“ü‹àÁž’Zk‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚S‚T|Žd–ó’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚S‚T|Žd–ó–¼Ì    PIC  X(040).
           03  ‚c‚O‚S‚T|Š¨’è‰È–Ú    PIC  X(006).
           03  ‚c‚O‚S‚T|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚O‚S‚T|‰ÛÅ‹æ•ªƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚O‚S‚T|ŽåŠÇ•”“X    PIC  X(004).
           03  ‚c‚O‚S‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚S‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚S‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
