      *****************************************************************
      *   ƒVƒXƒeƒ€’è”ƒ}ƒXƒ^(D053SYT_TBL)
      *****************************************************************
       01  ƒVƒXƒeƒ€’è”ƒ}ƒXƒ^.
           03  ‚c‚O‚T‚R|‹Æ–±“à–óƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚T‚R|ƒOƒ‹[ƒv‚h‚c
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚T‚R|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚T‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚T‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚T‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚T‚R|ƒf[ƒ^•”    PIC  X(070).
           03  ‚c‚O‚T‚R|ƒf[ƒ^’·    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚T‚R|ƒŒƒR[ƒhà–¾
                                     PIC  X(050).
