      *****************************************************************
      *   ‹@ŠB—ÞƒR[ƒhƒ}ƒXƒ^(D055KCM_TBL)
      *****************************************************************
       01  ‹@ŠB—ÞƒR[ƒhƒ}ƒXƒ^.
           03  ‚c‚O‚T‚T|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚O‚T‚T|“K—p”NŒŽ    PIC  X(006).
           03  ‚c‚O‚T‚T|‹@ŠB—ÞƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚T‚T|M—p•ÛŒ¯‰ïŽÐƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚O‚T‚T|‹@ŠB—Þ–¼    PIC  X(060).
           03  ‚c‚O‚T‚T|Å’·•ÛŒ¯ŠúŠÔ
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚T‚T|ˆê‘ä“–‚½‚è‚ÌŒÀ“xŠzãŒÀ
                                     PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚O‚T‚T|ˆê‘ä“–‚½‚è‚ÌŒÀ“xŠz‰ºŒÀ
                                     PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚O‚T‚T|M—p•ÛŒ¯—¿—¦ƒpƒ^[ƒ“
                                     PIC  X(001).
           03  ‚c‚O‚T‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚T‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚T‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚T|“o˜^’S“–ŽÒ  PIC  X(008).
