      *****************************************************************
      *   GLOVIAƒZƒLƒ…ƒŠƒeƒBƒ}ƒXƒ^(D061GLS_TBL)
      *****************************************************************
       01  ‚f‚k‚n‚u‚h‚`ƒZƒLƒ…ƒŠƒeƒBƒ}ƒXƒ^.
           03  ‚c‚O‚U‚P|ƒ†[ƒU‚h‚c  PIC  X(010).
           03  ‚c‚O‚U‚P|‰ïŽÐƒR[ƒh  PIC  X(002).
           03  ‚c‚O‚U‚P|ƒAƒNƒZƒXŒ ŒÀ
                                     PIC  X(012).
           03  ‚c‚O‚U‚P|Ž©•”–åƒR[ƒh‚P
                                     PIC  X(005).
           03  ‚c‚O‚U‚P|Ž©•”–åƒR[ƒh‚Q
                                     PIC  X(005).
           03  ‚c‚O‚U‚P|Ž©•”–åƒR[ƒh‚R
                                     PIC  X(005).
           03  ‚c‚O‚U‚P|Ž©•”–åƒR[ƒh‚S
                                     PIC  X(005).
           03  ‚c‚O‚U‚P|Ž©•”–åƒR[ƒh‚T
                                     PIC  X(005).
           03  ‚c‚O‚U‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚U‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚P|XVŽÒ      PIC  X(008).
