      *****************************************************************
      *   ŽO—mŠ„ˆøŒW”ƒ}ƒXƒ^(D076SYW_TBL)
      *****************************************************************
       01  ŽO—mŠ„ˆøŒW”ƒ}ƒXƒ^.
           03  ‚c‚O‚V‚U|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚V‚U|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚U|Š„ˆøŒW”    PIC S9(002)V9(005) PACKED-DECIMAL.
           03  ‚c‚O‚V‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚V‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚V‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
