      *****************************************************************
      *   Ž‘ŽYƒR[ƒh•ÏŠ·ƒ}ƒXƒ^(D077SSH_TBL)
      *****************************************************************
       01  Ž‘ŽYƒR[ƒh•ÏŠ·ƒ}ƒXƒ^.
           03  ‚c‚O‚V‚V|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚O‚V‚V|æ•û¤•iƒR[ƒh
                                     PIC  X(010).
           03  ‚c‚O‚V‚V|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚V|Ž‘ŽYƒR[ƒh  PIC  X(007).
           03  ‚c‚O‚V‚V|“®‘•ÛŒ¯ƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚V‚V|M—p•ÛŒ¯ƒR[ƒh|ƒŠ[ƒX
                                     PIC  X(006).
           03  ‚c‚O‚V‚V|M—p•ÛŒ¯ƒR[ƒh|Š„•Š
                                     PIC  X(006).
           03  ‚c‚O‚V‚V|Å•‰’S‹æ•ª  PIC  X(001).
           03  ‚c‚O‚V‚V|¤•i•ª—Þ–¼  PIC  X(030).
           03  ‚c‚O‚V‚V|•¨Œ–¼Š¿Žš  PIC  X(040).
           03  ‚c‚O‚V‚V|•¨Œ–¼      PIC  X(020).
           03  ‚c‚O‚V‚V|‹@Ží–¼      PIC  X(020).
           03  ‚c‚O‚V‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚V‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚V‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
