      *****************************************************************
      *   “Œ‹žŽO•H‹âsÝ’u•”“Xƒ}ƒXƒ^(D079TMT_TBL)
      *****************************************************************
       01  “Œ‹žŽO•H‹âsÝ’u•”“Xƒ}ƒXƒ^.
           03  ‚c‚O‚V‚X|Ý’u•”“XƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚V‚X|Ý’u•”“X–¼  PIC  X(042).
           03  ‚c‚O‚V‚X|Ý’u•”“X–¼ƒJƒi
                                     PIC  X(030).
           03  ‚c‚O‚V‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚V‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚V‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
