      *****************************************************************
      *   ƒOƒ‹[ƒvƒ}ƒXƒ^(D084GRP_TBL)
      *****************************************************************
       01  ƒOƒ‹[ƒvƒ}ƒXƒ^.
           03  ‚c‚O‚W‚S|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚W‚S|ƒOƒ‹[ƒv–¼  PIC  X(080).
           03  ‚c‚O‚W‚S|ƒOƒ‹[ƒv–¼ƒJƒi
                                     PIC  X(040).
           03  ‚c‚O‚W‚S|•”‰ÛƒR[ƒh  PIC  X(004).
           03  ‚c‚O‚W‚S|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚W‚S|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚O‚W‚S|ZŠƒR[ƒh  PIC  X(011).
           03  ‚c‚O‚W‚S|ZŠ‚P      PIC  X(060).
           03  ‚c‚O‚W‚S|ZŠ‚Q      PIC  X(060).
           03  ‚c‚O‚W‚S|ZŠ‚R      PIC  X(060).
           03  ‚c‚O‚W‚S|Žg—p•s‰Âƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚W‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
