      *****************************************************************
      *   ƒlƒbƒgƒŠ[ƒVƒ“ƒOŽÐˆõƒe[ƒuƒ‹(D086NLS_TBL)
      *****************************************************************
       01  ƒlƒbƒgƒŠ[ƒVƒ“ƒOŽÐˆõƒe[ƒuƒ‹.
           03  ‚c‚O‚W‚U|ŽÐˆõ‚h‚c    PIC  X(004).
           03  ‚c‚O‚W‚U|–¼‘O        PIC  X(072).
           03  ‚c‚O‚W‚U|ƒ[ƒ‹ƒAƒhƒŒƒX
                                     PIC  X(050).
           03  ‚c‚O‚W‚U|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚O‚W‚U|Žx“X–¼Ì    PIC  X(040).
           03  ‚c‚O‚W‚U|•”–¼Ì      PIC  X(048).
           03  ‚c‚O‚W‚U|‰Û–¼Ì      PIC  X(048).
           03  ‚c‚O‚W‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
