      *****************************************************************
      *   ŽæˆøæŠi•t—š—ðƒ}ƒXƒ^(D089TRK_TBL)
      *****************************************************************
       01  ŽæˆøæŠi•t—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚W‚X|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚W‚X|Ši•t³”F“ú  PIC  X(008).
           03  ‚c‚O‚W‚X|Ši•tƒ‰ƒ“ƒN  PIC  X(003).
           03  ‚c‚O‚W‚X|ƒXƒRƒAƒŠƒ“ƒO•]“_
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚W‚X|’é‘•]“_    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚W‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
