      *****************************************************************
      *   ’¥‹‘—Þƒ}ƒXƒ^(D096TKS_TBL)
      *****************************************************************
       01  ’¥‹‘—Þƒ}ƒXƒ^.
           03  ‚c‚O‚X‚U|’¥‹ŠÇ—Ží—Þ
                                     PIC  X(002).
           03  ‚c‚O‚X‚U|‘—Þ”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚U|‘—Þ–¼Ì    PIC  X(080).
           03  ‚c‚O‚X‚U|ƒ\[ƒg‡    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚U|’ •[“à–ó‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X‚U|Œ_–ñŠÖ˜A‘—ÞŽí—Þ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚X‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
