      *****************************************************************
      *   ZŠƒ}ƒXƒ^(D09ADD_TBL)
      *****************************************************************
       01  ZŠƒ}ƒXƒ^.
           03  ‚c‚O‚X|ZŠƒR[ƒh    PIC  X(011).
           03  ‚c‚O‚X|˜A”Ô          PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚X|VZŠƒR[ƒh  PIC  X(011).
           03  ‚c‚O‚X|—X•Ö”Ô†      PIC  X(007).
           03  ‚c‚O‚X|—X•Ö”Ô†ŒÂ”  PIC  X(001).
           03  ‚c‚O‚X|­—ßŽw’è“sŽsƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚X|“s“¹•{Œ§–¼ƒJƒi
                                     PIC  X(008).
           03  ‚c‚O‚X|Žs‹æŒS’¬‘º–¼ƒJƒi
                                     PIC  X(024).
           03  ‚c‚O‚X|’¬–¼ƒJƒi      PIC  X(032).
           03  ‚c‚O‚X|’š–ÚƒJƒi      PIC  X(032).
           03  ‚c‚O‚X|“s“¹•{Œ§–¼    PIC  X(008).
           03  ‚c‚O‚X|Žs‹æŒS’¬‘º–¼  PIC  X(024).
           03  ‚c‚O‚X|’¬–¼          PIC  X(036).
           03  ‚c‚O‚X|’š–Ú          PIC  X(036).
           03  ‚c‚O‚X|“s“¹•{Œ§–¼ŠOŽš‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X|Žs‹æŒS’¬‘º–¼ŠOŽš‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚X|’¬–¼ŠOŽš‹æ•ª  PIC  X(001).
           03  ‚c‚O‚X|’š–ÚŠOŽš‹æ•ª  PIC  X(001).
           03  ‚c‚O‚X|“o˜^”NŒŽ      PIC  X(006).
           03  ‚c‚O‚X|”pŽ~”NŒŽ      PIC  X(006).
           03  ‚c‚O‚X|’¬–¼•ÏX”NŒŽ  PIC  X(006).
           03  ‚c‚O‚X|—X•Ö”Ô†•ÏX”NŒŽ
                                     PIC  X(006).
           03  ‚c‚O‚X|ZŠ•\Ž¦ŽÀŽ{”NŒŽ
                                     PIC  X(006).
           03  ‚c‚O‚X|ZŠ•\Ž¦ŽÀŽ{ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚X|ƒŒƒR[ƒh‹æ•ª  PIC  X(001).
           03  ‚c‚O‚X|’ÊÌ–¼ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚O‚X|’Ê‚è–¼ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚O‚X|‘åŽšŽšƒtƒ‰ƒO‚P
                                     PIC  X(001).
           03  ‚c‚O‚X|‘åŽšŽšƒtƒ‰ƒO‚Q
                                     PIC  X(001).
           03  ‚c‚O‚X|‹Œ—X•Ö”Ô†    PIC  X(008).
           03  ‚c‚O‚X|C³ƒR[ƒh    PIC  X(001).
           03  ‚c‚O‚X|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚X|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚X|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚O‚X|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚X|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚X|XVŽÒ        PIC  X(008).
           03  ‚c‚O‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
