      *****************************************************************
      *   •ÛŒ¯—¿—¦ƒ}ƒXƒ^(D10HKR_TBL)
      *****************************************************************
       01  •ÛŒ¯—¿—¦ƒ}ƒXƒ^.
           03  ‚c‚P‚O|•ÛŒ¯‰ïŽÐ‹æ•ª  PIC  X(004).
           03  ‚c‚P‚O|“K—pŠJŽn“ú    PIC  X(008).
           03  ‚c‚P‚O|•ÛŒ¯—¿—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚P‚O|•ÛŒ¯‰ïŽÐ‹æ•ª–¼Ì
                                     PIC  X(080).
           03  ‚c‚P‚O|XV“úŽž      PIC  X(016).
           03  ‚c‚P‚O|XVŽÒ        PIC  X(008).
           03  ‚c‚P‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚O|Œ—“à‹æ•ª      PIC  X(001).
           03  ‚c‚P‚O|•¶Œ¾˜A”Ô      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚P‚O|•ÛŒ¯‰ïŽÐŽ¯•ÊƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚P‚O|“Á’èŽæˆøæƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚P‚O|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚O|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚P‚O|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚P‚O|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚O|XVŽžŠÔ      PIC  X(008).
