      *****************************************************************
      *   ƒXƒPƒWƒ…[ƒ‹ŠÇ—ƒ}ƒXƒ^(D115SCH_TBL)
      *****************************************************************
       01  ƒXƒPƒWƒ…[ƒ‹ŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚P‚P‚T|‹Æ–±”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚T|Æ‰ïXV‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚P‚T|ƒƒjƒ…[ƒ{ƒ^ƒ“‚h‚c
                                     PIC  X(008).
           03  ‚c‚P‚P‚T|ŠJŽnŽžŠÔ    PIC  X(004).
           03  ‚c‚P‚P‚T|I—¹ŽžŠÔ    PIC  X(004).
           03  ‚c‚P‚P‚T|XV“úŽž    PIC  X(016).
           03  ‚c‚P‚P‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚P‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚P‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚P‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚P‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚P‚T|XVŽžŠÔ    PIC  X(008).
