      *****************************************************************
      *   ‹à—Z‹@ŠÖƒ}ƒXƒ^(D13KGK_TBL)
      *****************************************************************
       01  ‹à—Z‹@ŠÖƒ}ƒXƒ^.
           03  ‚c‚P‚R|‹âsƒR[ƒh    PIC  X(004).
           03  ‚c‚P‚R|Žx“XƒR[ƒh    PIC  X(003).
           03  ‚c‚P‚R|‹âs–¼        PIC  X(030).
           03  ‚c‚P‚R|Žx“X–¼        PIC  X(030).
           03  ‚c‚P‚R|‚»‚Ì‘¼        PIC  X(033).
           03  ‚c‚P‚R|XV“úŽž      PIC  X(016).
           03  ‚c‚P‚R|XVŽÒ        PIC  X(008).
           03  ‚c‚P‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚P‚R|‹âs–¼Š¿Žš    PIC  X(030).
           03  ‚c‚P‚R|Žx“X–¼Š¿Žš    PIC  X(030).
           03  ‚c‚P‚R|ZŠƒR[ƒh    PIC  X(011).
           03  ‚c‚P‚R|—X•Ö”Ô†      PIC  X(007).
           03  ‚c‚P‚R|ZŠ‚Q        PIC  X(060).
           03  ‚c‚P‚R|ZŠ‚R        PIC  X(060).
           03  ‚c‚P‚R|“d˜b”Ô†      PIC  X(015).
           03  ‚c‚P‚R|U‘Ö“ú        PIC  X(002).
           03  ‚c‚P‚R|Ž©ŽÐ—a‹àŽí•Ê  PIC  X(001).
           03  ‚c‚P‚R|–{Žx“X–¼—ªÌ  PIC  X(030).
           03  ‚c‚P‚R|–{Žx“X–¼Š¿Žš—ªÌ
                                     PIC  X(040).
           03  ‚c‚P‚R|ŽèŒ`ŒðŠ·Š”Ô†
                                     PIC  X(004).
           03  ‚c‚P‚R|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚R|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚P‚R|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚P‚R|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚P‚R|XVŽžŠÔ      PIC  X(008).
