      *****************************************************************
      *   ŽèŒ`ˆóŽ†Åƒ}ƒXƒ^(D183TIZ_TBL)
      *****************************************************************
       01  ŽèŒ`ˆóŽ†Åƒ}ƒXƒ^.
           03  ‚c‚P‚W‚R|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚R|˜A”Ô        PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚P‚W‚R|”ÍˆÍ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚W‚R|ˆóŽ†Å      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚P‚W‚R|•¶‘Ží—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚P‚W‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚W‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚W‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
