      *****************************************************************
      *   Œ©ÏŒ_–ñ(D26MKY_TBL)
      *****************************************************************
       01  Œ©ÏŒ_–ñ.
           03  ‚c‚Q‚U|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ©Ï”Ô†Ž}”Ô  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚Q‚U|ˆø“n—\’è“ú    PIC  X(008).
           03  ‚c‚Q‚U|ƒŠ[ƒX—¿ŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚Q‚U|ŠúŠÔ          PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘ã•\•¨Œ–¼    PIC  X(040).
           03  ‚c‚Q‚U|‰ñŽûƒTƒCƒg    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰ñŽû“ú        PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘æ‚Q‰ñ–Ú‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘æ‚Q‰ñ–Ú‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰ñŽûƒTƒCƒNƒ‹  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|•Ï‘¥•¥—L–³    PIC  X(001).
           03  ‚c‚Q‚U|Á”ïÅ—¦‹æ•ª  PIC  X(002).
           03  ‚c‚Q‚U|—˜‰ñ‚èŒ‹‰Ê    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒŽŽw”Œ‹‰Ê    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ƒ†[ƒU—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘e—˜Œ‹‰Ê      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒŽŠz—¿‹àŒ‹‰Ê  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒŽŠzÁ”ïÅŒ‹‰Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ_–ñ‘ŠzŒ‹‰Ê  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Á”ïÅ‘ŠzŒ‹‰Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ©Ï—LŒøŠúŒÀ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ©Ï‘•\Ž¦‚P  PIC  X(100).
           03  ‚c‚Q‚U|Œ©Ï‘•\Ž¦‚Q  PIC  X(100).
           03  ‚c‚Q‚U|Œ©Ï‘•\Ž¦‚R  PIC  X(100).
           03  ‚c‚Q‚U|Œ©Ï‘•\Ž¦‚S  PIC  X(100).
           03  ‚c‚Q‚U|Œ©Ï‘•\Ž¦‚T  PIC  X(100).
           03  ‚c‚Q‚U|Œ©Ï‘•\Ž¦‚U  PIC  X(100).
           03  ‚c‚Q‚U|Œ©Ï‘•\Ž¦‚V  PIC  X(100).
           03  ‚c‚Q‚U|Œ©Ï‘•\Ž¦‚W  PIC  X(100).
           03  ‚c‚Q‚U|ÅI•¨Œ”Ô†  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘æ‚P‰ñ‰ñŽû•û–@
                                     PIC  X(040).
           03  ‚c‚Q‚U|‘æ‚Q‰ñˆÈ~‰ñŽû•û–@
                                     PIC  X(040).
           03  ‚c‚Q‚U|Žæ“¾‰¿Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ó‘Ôƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚Q‚U|ŽÐ“à‹à—˜      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Žx•¥ƒƒŠƒbƒg  PIC S9(003)V9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒvŽZ•û–@      PIC  X(001).
           03  ‚c‚Q‚U|Œ©ÏŽåŒ_–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|Œ©Ï‘ì¬“ú•t
                                     PIC  X(008).
           03  ‚c‚Q‚U|•”–¼Ì      PIC  X(060).
           03  ‚c‚Q‚U|’S“–ŽÒ        PIC  X(008).
           03  ‚c‚Q‚U|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚U|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚U|XVŽÒ        PIC  X(008).
           03  ‚c‚Q‚U|ÌŽZŒvŽZ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚Q‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚U|‹¦’²“]‹æ•ª    PIC  X(001).
           03  ‚c‚Q‚U|ŽÐ“à‹à—˜‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚Q‚U|—¿‹à|—       PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|—¿—¦|—       PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|”N—˜‰ñ|—     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘e—˜Šz|—     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰^—p—˜‰ñ|—   PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ©ÏŽc‰¿Œ»‰¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|“®‘•ÛŒ¯—¿Œ»‰¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒÅ’èŽ‘ŽYÅŒ»‰¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|•ÛŽç—¿Œ»‰¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽG”ïŒ»‰¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ©ÏŽc‰¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|“®‘•ÛŒ¯—¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒÅ’èŽ‘ŽYÅ|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|•ÛŽç—¿|‘S‘Ì  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽG”ï|‘S‘Ì    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ©ÏŽc‰¿Œ»‰¿|— 
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|“®‘•ÛŒ¯—¿Œ»‰¿|— 
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒÅ’èŽ‘ŽYÅŒ»‰¿|— 
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|•ÛŽç—¿Œ»‰¿|— 
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽG”ïŒ»‰¿|—   PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Žæ“¾‰¿Šz|—   PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ©ÏŽc‰¿|—   PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|“®‘•ÛŒ¯—¿|— 
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒÅ’èŽ‘ŽYÅ|— 
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|•ÛŽç—¿|—     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽG”ï|—       PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ_–ñæƒR[ƒh  PIC  X(005).
           03  ‚c‚Q‚U|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚Q‚U|Œ_–ñ—\’è“ú    PIC  X(008).
           03  ‚c‚Q‚U|ˆê”ÊŽÐ“à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘OŽóŒŽ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘OŽóƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘O“n‹à—L–³ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚Q‚U|ˆÏ‘õ•ÛŽç—¿‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|‘ã—‰ñŽû•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|ˆÈ~‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘O“n‹àŽw’è‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|‘O“n‹à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘O“n‹à—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰Ád‘Ï—p”N”  PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U|•ªŠ„‰ñŽû‰ð–ñ‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|•ªŠ„‰ñŽû‰ð–ñ‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘¼ŽÐ‰ð–ñ‹àŽx•¥ƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘¼ŽÐ‰ð–ñ‹àŽx•¥“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒXðŒ•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚Q‚U|ÄƒŠ[ƒX—¿—¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|ÄƒŠ[ƒX—¿—¦•ªŽq
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒX—¿—¦•ª•ê
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒX—˜‰ñ‚P
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒX‘e—˜‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒX—˜‰ñ‚Q
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒX‘e—˜‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒX—˜‰ñ‚R
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒX‘e—˜‚R
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|•¨Œ‹àŠz•\Ž¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|•¨Œ–¾×•\Ž¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|‘ã—‰ñŽû•ÛŽç—¿•\Ž¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|•ÛŽçŒ_–ñæ    PIC  X(060).
           03  ‚c‚Q‚U|˜A‘Ñ•ÛØlŽ–¼‘¼
                                     PIC  X(040).
           03  ‚c‚Q‚U|•¨ŒÝ’uêŠ•¶Œ¾
                                     PIC  X(060).
           03  ‚c‚Q‚U|•tð€Ž©“®‹æ•ª‚P
                                     PIC  X(001).
           03  ‚c‚Q‚U|•tð€Ž©“®‹æ•ª‚Q
                                     PIC  X(001).
           03  ‚c‚Q‚U|•tð€Ž©“®‹æ•ª‚R
                                     PIC  X(001).
           03  ‚c‚Q‚U|•tð€Ž©“®‹æ•ª‚S
                                     PIC  X(001).
           03  ‚c‚Q‚U|•tð€Ž©“®‹æ•ª‚T
                                     PIC  X(001).
           03  ‚c‚Q‚U|•tð€Ž©“®‹æ•ª‚U
                                     PIC  X(001).
           03  ‚c‚Q‚U|•tð€Ž©“®‹æ•ª‚V
                                     PIC  X(001).
           03  ‚c‚Q‚U|•tð€Ž©“®‹æ•ª‚W
                                     PIC  X(001).
           03  ‚c‚Q‚U|Šî–{ƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒÅ’èŽ‘ŽYÅŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|“®‘•ÛŒ¯ŒŽŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‚»‚Ì‘¼”ï—pŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘OŽóƒƒŠƒbƒgŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒJ‰„ƒƒŠƒbƒgŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽÀŽ¿ƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ƒŠ[ƒX—¿Œ»‰¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰Šú”ï—p‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|‹Æ–±‹æ•ª      PIC  X(001).
           03  ‚c‚Q‚U|”ƒ–ß‹`–±‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|‘ã—‰ñŽû      PIC  X(001).
           03  ‚c‚Q‚U|‘ÎR—vŒ      PIC  X(002).
           03  ‚c‚Q‚U|Š„ˆø—¿        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽóŽæŽè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Žæ—§Žè”—¿“™  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Žæ—§Žè”—¿“™Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|—˜—¦Šî”‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|—˜‘§’[”‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|•Ð’[—¼’[‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|‹x“ú‘Î‰ž‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|—˜‘§ŒvŽZ‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|‰‰ñ—˜‘§‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|—ZŽ‘•û–@      PIC  X(001).
           03  ‚c‚Q‚U|V‹K‘‘Ö‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|Šú“ú          PIC  X(008).
           03  ‚c‚Q‚U|•ÔÏðŒ      PIC  X(001).
           03  ‚c‚Q‚U|‹à—˜•Ï“®‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|˜A“®‹à—˜‹æ•ª  PIC  X(002).
           03  ‚c‚Q‚U|ƒXƒvƒŒƒbƒh    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|—˜—¦Šm’èŠúŒÀ  PIC  X(008).
           03  ‚c‚Q‚U|Œ©’¼‚µƒTƒCƒNƒ‹
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰‰ñŒ³–{‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚Q‚U|Œ³–{ƒTƒCƒNƒ‹  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Œ³–{‰ñ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰‰ñ—˜‘§‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚Q‚U|—˜‘§ƒTƒCƒNƒ‹  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U|—˜‘§‰ñ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰ñŽû•û–@      PIC  X(001).
           03  ‚c‚Q‚U|Ž‘‹àŽg“r‹æ•ª  PIC  X(002).
           03  ‚c‚Q‚U|ŽÀŽ¿”N—¦      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚U|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚U|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚Q‚U|ˆø‡’†Ž~‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚U|— •tŽæˆø      PIC  X(060).
           03  ‚c‚Q‚U|‘ŠŽE‹æ•ª      PIC  X(001).
           03  ‚c‚Q‚U|Œ_–ñ”Ô†      PIC  X(015).
           03  ‚c‚Q‚U|‘Ý•t—˜—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”Ê‘O“n‹à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒXðŒ‘I‘ð‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U|ŒJ‰„ðŒ      PIC  X(001).
           03  ‚c‚Q‚U|ÄƒŠ[ƒX—¿‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŠî–{—˜‰ñ‚è|‘S‘Ì
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŽÀŽ¿—˜‰ñ‚è|‘S‘Ì
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊƒŠ[ƒX—¿Œ»‰¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŒ©ÏŽc‰¿Œ»‰¿|‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŠú’†”ï—pŒ»‰¿‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒXŠî–{—˜‰ñ‚è‚P
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒXŠî–{—˜‰ñ‚è‚Q
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ÄƒŠ[ƒXŠî–{—˜‰ñ‚è‚R
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŠî–{—˜‰ñ‚è|“–ŽÐ
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŽÀŽ¿—˜‰ñ‚è|“–ŽÐ
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‰Šú”ï—p‹àŠz|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŒ©ÏŽc‰¿Œ»‰¿|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ˆê”ÊŠú’†”ï—pŒ»‰¿|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|Šî–{ƒŠ[ƒX—¿|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŽÀŽ¿ƒŠ[ƒX—¿|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒÅ’èŽ‘ŽYÅŒŽŠz|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|“®‘•ÛŒ¯ŒŽŠz|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|‘OŽóƒƒŠƒbƒgŒŽŠz|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|ŒJ‰„ƒƒŠƒbƒgŒŽŠz|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U|“K—pƒŠ[ƒX—¿Œ»‰¿|“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
