      *****************************************************************
      *   Œ©Ï”ƒŠ|(D276MKI_TBL)
      *****************************************************************
       01  Œ©Ï”ƒŠ|.
           03  ‚c‚Q‚V‚U|Œ©Ï”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚U|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚U|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚Q‚V‚U|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚U|ŒJ‰„ŠúŠÔ    PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚U|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚V‚U|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚U|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚U|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚V‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚Q‚V‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
