      *****************************************************************
      *   Œ_–ñŽ}”ÔŠÇ—ƒe[ƒuƒ‹(D318KED_TBL)
      *****************************************************************
       01  Œ_–ñŽ}”ÔŠÇ—ƒe[ƒuƒ‹.
           03  ‚c‚R‚P‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚P‚W|ÅIŽ}”Ô    PIC  X(002).
           03  ‚c‚R‚P‚W|•ïŠ‡\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚P‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚P‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
