      *****************************************************************
      *   ‹¦’²“]•¨Œ‘ã‹à”„‹p(D346KTB_TBL)
      *****************************************************************
       01  ‹¦’²“]•¨Œ‘ã‹à”„‹p.
           03  ‚c‚R‚S‚U|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚S‚U|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚S‚U|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚S‚U|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚S‚U|‰ñŽûƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|‰ñŽû“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚R‚S‚U|”„‹p‘ã‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|”„‹p‘ã‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|”„‹p‘ãŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|”„‹p‘ã‘Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|”„‹p‘ã‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚U|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚S‚U|ŽæÁ¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚S‚U|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚S‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚S‚U|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚R‚S‚U|ƒ\ƒtƒg”„‹p‘ã‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|ƒ\ƒtƒg”„‹p‘ã‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚S‚U|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚S‚U|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚R‚S‚U|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚R‚S‚U|Áž”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚U|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚S‚U|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
