      *****************************************************************
      *   Â–±Š„•Š“WŠJ(D353SKT_TBL)
      *****************************************************************
       01  Â–±Š„•Š“WŠJ.
           03  ‚c‚R‚T‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚T‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚T‚R|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚T‚R|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚T‚R|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚R‚T‚R|Žx•¥”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚T‚R|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|—˜‘§ŒŽ”    PIC S9(001)V9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|—˜‘§        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|“–ŒŽ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚R‚T‚R|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|“WŠJ‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|•ÏXŒ³–{Žc‚’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚T‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚T‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚T‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚T‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚T‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚T‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
