      *****************************************************************
      *   •ÏX—š—ð_”ƒŠ|(D377HIK_TBL)
      *****************************************************************
       01  •ÏX—š—ð|”ƒŠ|.
           03  ‚c‚R‚V‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚V|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚V‚V|”ƒŠ|˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚V‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚V|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚V|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚V|Žx•¥Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚V|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚R‚V‚V|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚R‚V‚V|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|ŽÀŽx•¥“ú    PIC  X(008).
           03  ‚c‚R‚V‚V|ŽèŒ`UoƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|ŽèŒ`Uo“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|ŽèŒ`Žó“n•û–@
                                     PIC  X(001).
           03  ‚c‚R‚V‚V|’è‰¿        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|ƒ†[ƒUŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Ž©ŽÐŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|ƒ†[ƒUŒüw“üŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Ž©ŽÐŒüw“üŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Ž©ŽÐŒüw“üŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|‘ŠŽEŽí—Þ    PIC  X(001).
           03  ‚c‚R‚V‚V|‘ŠŽE‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚V|‘ŠŽEŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚V‚V|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Žx•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Žx•¥‹àŠzÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|‘O“n‹à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|w“ü‹æ•ª    PIC  X(001).
           03  ‚c‚R‚V‚V|Œ©Ï•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|‹MŽÐŒ©Ï”Ô†
                                     PIC  X(020).
           03  ‚c‚R‚V‚V|’•¶‘”Ô†  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Žx•¥ðŒ    PIC  X(060).
           03  ‚c‚R‚V‚V|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|ƒ\ƒtƒg“–ŽÐŒüw“üŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|ƒ\ƒtƒg“–ŽÐŒüw“üŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚V‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚V‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚V‚V|Žè”—¿‘ŠŽE‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚V|Žè”—¿‘ŠŽE‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚V|Žè”—¿‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
