      *****************************************************************
      *   ‘‡ÌŽZÂŒ “WŠJ(D382SSS_TBL)
      *****************************************************************
       01  ‘‡ÌŽZÂŒ “WŠJ.
           03  ‚c‚R‚W‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚W‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚W‚Q|‰ñŽûŽí—Þ    PIC  X(003).
           03  ‚c‚R‚W‚Q|‰ñŽû˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚W‚Q|•R•tŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚W‚Q|•R•tÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚W‚Q|•R•tŒ_–ñŽí—Þ
                                     PIC  X(003).
           03  ‚c‚R‚W‚Q|•R•t˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚W‚Q|–ñ’è‰ñŽû”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚W‚Q|‰ñŽûƒTƒCƒg  PIC S9(003)V9(002) PACKED-DECIMAL.
           03  ‚c‚R‚W‚Q|–ñ’è‰ñŽû‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚W‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚W‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚W‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚W‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚W‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚W‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚W‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
