      *****************************************************************
      *   Œ_–ñ”Ô†ŠÖ˜A‚c‚a(D395KBD_TBL)
      *****************************************************************
       01  Œ_–ñ”Ô†ŠÖ˜A‚c‚a.
           03  ‚c‚R‚X‚T|æŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚R‚X‚T|æÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚T|Œ³Œ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚R‚X‚T|Œ³ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚X‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚X‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚T|“o˜^’S“–ŽÒ  PIC  X(008).
