      *****************************************************************
      *   ÂŒ “WŠJ(D411STK_TBL)
      *****************************************************************
       01  ÂŒ “WŠJ.
           03  ‚c‚S‚P‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚P‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚P‚P|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚P‚P|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚S‚P‚P|”„ãŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|”„ãÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|”„ãÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚P‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚P‚P|¿‹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚P|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹Á”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚S‚P‚P|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚P|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚P‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚P‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚P‚P|¿‹‘”­s“ú
                                     PIC  X(008).
           03  ‚c‚S‚P‚P|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚P‚P|ˆÏ‘õ•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|ˆÏ‘õ•ÛŽçÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹Œ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚S‚P‚P|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚S‚P‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚P‚P|ŽèŒ`ŽóŽæƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚P‚P|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ¿‹Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚P‚P|—˜‘§¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚P‚P|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚S‚P‚P|—š—ð˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|”„ãÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|”„ãÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹ÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹ÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ¿‹ÂŒ Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ¿‹ÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹Œ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|¿‹Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Œ³–{‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|—˜‘§‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Žû‰v“WŠJ—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ”„ãŒ³–{’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ•ªŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ•ªŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|•ÔÏ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚P|ŠúŠÔŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|ŠúŠÔ“ú”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|—˜‘§ŒvŽZŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚S‚P‚P|—˜‘§ŒvŽZI—¹“ú
                                     PIC  X(008).
           03  ‚c‚S‚P‚P|Ž©ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ‰ñŽûÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚P‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚P‚P|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚S‚P‚P|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚P‚P|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Áž”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚P|‘¼ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|‘¼ŽÐ¿‹ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚P|Ž©ŽÐ‚»‚Ì‘¼””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
