      *****************************************************************
      *   ”ƒŠ|(D412KIK_TBL)
      *****************************************************************
       01  ”ƒŠ|.
           03  ‚c‚S‚P‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚P‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚P‚Q|”ƒŠ|˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚P‚Q|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚P‚Q|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚P‚Q|Žx•¥Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚P‚Q|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚S‚P‚Q|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚S‚P‚Q|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|ŽÀŽx•¥“ú    PIC  X(008).
           03  ‚c‚S‚P‚Q|ŽèŒ`UoƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|ŽèŒ`Uo“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|ŽèŒ`Žó“n•û–@
                                     PIC  X(001).
           03  ‚c‚S‚P‚Q|’è‰¿        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|ƒ†[ƒUŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Ž©ŽÐŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|ƒ†[ƒUŒüw“üŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Ž©ŽÐŒüw“üŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Ž©ŽÐŒüw“üŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|‘ŠŽEŽí—Þ    PIC  X(001).
           03  ‚c‚S‚P‚Q|‘ŠŽE‹æ•ª    PIC  X(001).
           03  ‚c‚S‚P‚Q|‘ŠŽEŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚P‚Q|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Žx•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Žx•¥‹àŠzÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|‘O“n‹à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|w“ü‹æ•ª    PIC  X(001).
           03  ‚c‚S‚P‚Q|Œ©Ï•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|‹MŽÐŒ©Ï”Ô†
                                     PIC  X(020).
           03  ‚c‚S‚P‚Q|’•¶‘”Ô†  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Žx•¥ðŒ    PIC  X(060).
           03  ‚c‚S‚P‚Q|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|ƒ\ƒtƒg“–ŽÐŒüw“üŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|ƒ\ƒtƒg“–ŽÐŒüw“üŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚P‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚P‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚P‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚P‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚P‚Q|Žè”—¿‘ŠŽE‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚P‚Q|Žè”—¿‘ŠŽE‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚Q|Žè”—¿‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
