      *****************************************************************
      *   Œ_–ñ”„Š|ÂŒ –¾×(D414USM_TBL)
      *****************************************************************
       01  Œ_–ñ”„Š|ÂŒ –¾×.
           03  ‚c‚S‚P‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚P‚S|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚P‚S|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚P‚S|Šz–Ê‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|Šú“ú        PIC  X(008).
           03  ‚c‚S‚P‚S|—˜‘§Šú“ú    PIC  X(008).
           03  ‚c‚S‚P‚S|“ú”        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|Š„ˆø—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|Š„ˆø—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|Žæ—§Žè”—¿“™
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|Žæ—§Žè”—¿“™Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|”ƒŽæ‘ã‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|ŽÐ“à‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚P‚S|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|ŽÀŽ¿”N—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|‘e—˜        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚P‚S|ŽÐ“à‹à—˜|ˆê”Ê
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|‘e—˜|ˆê”Ê  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P‚S|ŠúŒÀ‘OŒˆÏ“ú
                                     PIC  X(008).
           03  ‚c‚S‚P‚S|—¬“®‰»æ    PIC  X(010).
           03  ‚c‚S‚P‚S|ÂŒ —¬“®‰»æ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚P‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚P‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚P‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚P‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚P‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚P‚S|“o˜^’S“–ŽÒ  PIC  X(008).
