      *****************************************************************
      *   ‰ñŽû—š—ð(D41KAI_TBL)
      *****************************************************************
       01  ‰ñŽû—š—ð.
           03  ‚c‚S‚P|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚S‚P|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚S‚P|¿‹‹æ•ª      PIC  X(001).
           03  ‚c‚S‚P|˜A”Ô          PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚S‚P|\¿˜A”Ô      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚P|‘¹ŠQ‹à¿‹•û–@
                                     PIC  X(001).
           03  ‚c‚S‚P|Áž’Ê”Ô      PIC  X(011).
           03  ‚c‚S‚P|Áž‰ñ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚P|Žû“ü—\’è“ú    PIC  X(008).
           03  ‚c‚S‚P|“ü‹à“ú        PIC  X(008).
           03  ‚c‚S‚P|‰ñŽû•û–@      PIC  X(001).
           03  ‚c‚S‚P|“ü‹à‰È–Ú      PIC  X(005).
           03  ‚c‚S‚P|“ü‹àŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|“ü‹àŠzÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|UžŽè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|“ü‹àŽí—Þ      PIC  X(001).
           03  ‚c‚S‚P|‰¼Žó‹à”Ô†    PIC  X(015).
           03  ‚c‚S‚P|ƒGƒ“ƒgƒŠ“ú    PIC  X(008).
           03  ‚c‚S‚P|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚S‚P|¿‹æƒR[ƒh  PIC  X(005).
           03  ‚c‚S‚P|‹âsƒR[ƒh    PIC  X(004).
           03  ‚c‚S‚P|Žx“XƒR[ƒh    PIC  X(003).
           03  ‚c‚S‚P|ŒûÀŽí—Þ      PIC  X(001).
           03  ‚c‚S‚P|ŒûÀ”Ô†      PIC  X(010).
           03  ‚c‚S‚P|“ü‹à‹æ•ª      PIC  X(002).
           03  ‚c‚S‚P|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚P|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚S‚P|XVŽÒ        PIC  X(008).
           03  ‚c‚S‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚P|“Â‘£’iŠK      PIC  X(001).
           03  ‚c‚S‚P|“Â‘£ˆ—”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚P|”ï–Ú          PIC  X(001).
           03  ‚c‚S‚P|“–ŽÐ‘¼ŽÐŽ¯•Ê  PIC  X(001).
           03  ‚c‚S‚P|•Ô‹àŒo˜H      PIC  X(001).
           03  ‚c‚S‚P|“ü•Ô‹à‹æ•ª    PIC  X(001).
           03  ‚c‚S‚P|‘¼ŽÐ“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|‹¦’²“]‹æ•ª    PIC  X(001).
           03  ‚c‚S‚P|ŽåŒ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚S‚P|‰¼Žó‹àˆ—Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚P|Žå|¿‹‹æ•ª  PIC  X(001).
           03  ‚c‚S‚P|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚P|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚S‚P|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚S‚P|Œ³–{“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|—˜‘§“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|‰ñŽû—š—ð‹æ•ª  PIC  X(001).
           03  ‚c‚S‚P|Áž‘ÎÛŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|Áž‘ÎÛŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|ÁžŽæÁ‹æ•ª  PIC  X(001).
           03  ‚c‚S‚P|ÁžŽž‰ñŽû”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚P|ÁžŽž“ü‹à”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚P|‘¼ŽÐ“ü‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|Ž©ŽÐ“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚P|Ž©ŽÐ“ü‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
