      *****************************************************************
      *   ‘O•¥‹àŽx•¥(D421MBS_TBL)
      *****************************************************************
       01  ‘O•¥‹àŽx•¥.
           03  ‚c‚S‚Q‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚Q‚P|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚Q‚P|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚S‚Q‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚Q‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|˜A”Ô        PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚Q‚P|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚S‚Q‚P|Žx•¥—\’è“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Žx•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚Q‚P|‘ŠŽE‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Žè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚Q‚P|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚S‚Q‚P|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥ˆË—Š“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥ŽwŽ¦“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥³”F“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚S‚Q‚P|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚S‚Q‚P|ŒûÀŽí•ÊƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚S‚Q‚P|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚S‚Q‚P|–¼‹`l      PIC  X(030).
           03  ‚c‚S‚Q‚P|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚Q‚P|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚S‚Q‚P|UžŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|ŽÀÛŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|ŽÀÛŽx•¥ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Žx•¥‘‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|ˆË—Šˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|ŽwŽ¦ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|Žx•¥ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|Žx•¥ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|ˆø“nˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|ŒÚ‹qƒR[ƒh  PIC  X(009).
           03  ‚c‚S‚Q‚P|•ªŠ„Œ³˜A”Ô  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Žx•¥—\’è“ú‚Q
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|Uo“ú      PIC  X(008).
           03  ‚c‚S‚Q‚P|ŽóŽæ•û–@    PIC  X(001).
           03  ‚c‚S‚Q‚P|˜A—æ      PIC  X(060).
           03  ‚c‚S‚Q‚P|ˆË—Š”Ô†    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|”ƒŠ|˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Œo—’÷ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|Œo—’÷Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|•â³ŠzŒvãˆ—”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|“Á•Êˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚Q‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚Q‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚Q‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|“–‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚Q‚P|“–‰Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚Q‚P|“–‰Žx•¥Ží—Þ
                                     PIC  X(002).
           03  ‚c‚S‚Q‚P|“–‰Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚Q‚P|“–‰ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|“–‰˜A”Ô    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|–ñ’èŽx•¥“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|˜A—æ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚S‚Q‚P|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚Q‚P|Žx•¥ŠzŒŽŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Žx•¥‹àŠzÁ”ïÅŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Ž©“®³”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚Q‚P|Žx•¥ˆË—ŠƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|ŽèŒ`•ªŠ„˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|ŽèŒ`•ªŠ„‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|ŽèŒ`•ªŠ„—}Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚Q‚P|ƒRƒƒ“ƒg    PIC  X(040).
           03  ‚c‚S‚Q‚P|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚Q‚P|Žx•¥ˆË—Š³”F“ú
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥ˆË—ŠŠm’è“ú
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|ˆË—Š³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|ˆË—ŠŠm’èˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚Q‚P|“ü‹àŠm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚Q‚P|¿‹‘Šm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚Q‚P|Žx•¥ˆË—ŠŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥ŽwŽ¦ŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥³”FŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚S‚Q‚P|Žx•¥ŽæÁ“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚Q‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚Q‚P|“o˜^’S“–ŽÒ  PIC  X(008).
