      *****************************************************************
      *   ‰ð–ñ—š—ðQÂŒ “WŠJ(D465KRS_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|ÂŒ “WŠJ.
           03  ‚c‚S‚U‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚U‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚U‚T|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚T|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚S‚U‚T|”„ãŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|”„ãÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|”„ãÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚U‚T|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚U‚T|¿‹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚T|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹Á”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚S‚U‚T|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚T|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚U‚T|¿‹‘”­s“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚T|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚T|ˆÏ‘õ•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|ˆÏ‘õ•ÛŽçÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹Œ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚S‚U‚T|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚S‚U‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚U‚T|ŽèŒ`ŽóŽæƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚T|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ¿‹Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚U‚T|—˜‘§¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚U‚T|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚S‚U‚T|—š—ð˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|”„ãÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|”„ãÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹ÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹ÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ¿‹ÂŒ Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ¿‹ÂŒ Žc’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹Œ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|¿‹Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Œ³–{‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|—˜‘§‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Žû‰v“WŠJ—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ”„ãŒ³–{’²®
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ•ªŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ•ªŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|•ÔÏ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚T|ŠúŠÔŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|ŠúŠÔ“ú”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|—˜‘§ŒvŽZŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚T|—˜‘§ŒvŽZI—¹“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚T|Ž©ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ‰ñŽûÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚U‚T|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚S‚U‚T|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚T|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Áž”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚T|‘¼ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|‘¼ŽÐ¿‹ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚T|Ž©ŽÐ‚»‚Ì‘¼””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
