      *****************************************************************
      *   ãæ‚¹‘ŠŽEŒ_–ñ(D469KUS_TBL)
      *****************************************************************
       01  ãæ‚¹‘ŠŽEŒ_–ñ.
           03  ‚c‚S‚U‚X|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚U‚X|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚X|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚X|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚U‚X|‘¹ŠQ‹à¿‹•û–@
                                     PIC  X(001).
           03  ‚c‚S‚U‚X|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚X|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚X|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚S‚U‚X|VŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚S‚U‚X|VŒ©Ï”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚S‚U‚X|ãæ‚¹‘ŠŽE‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚X|‘ŠŽE‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚U‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚U‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
