      *****************************************************************
      *   ‰ð–ñ—š—ð(D46KYR_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð.
           03  ‚c‚S‚U|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚S‚U|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U|\¿˜A”Ô      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U|‰ð–ñ³Œp‹æ•ª  PIC  X(001).
           03  ‚c‚S‚U|‰ð–ñ˜A”Ô      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U|‰ð–ñ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚U|‰ð–ñ‹æ•ª      PIC  X(001).
           03  ‚c‚S‚U|‰ð–ñ——R      PIC  X(002).
           03  ‚c‚S‚U|³ŒpŽí—Þ      PIC  X(001).
           03  ‚c‚S‚U|‹¦’²“]‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U|Â–±‹¦’²ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚S‚U|Œo‰ßŒŽ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U|Œ_–ñŒ–¼      PIC  X(060).
           03  ‚c‚S‚U|‘ã•\‰ð–ñ•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚S‚U|Œp‘±””ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|ŽcƒŠ[ƒX—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|Œ¸Šz–@‚P‚P‚O  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|Œ¸Šz–@‚P‚O‚T  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|•ÛŒ¯‰¿Ši‚P‚P‚O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|ŽÀŽ¿Œ³–{Žc‚P‚O‚T
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|ŽÀŽ¿–¢‰ñŽûŒ³–{Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|–¢’¥ŽûŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|–¢’¥Žû•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|–¢’¥Žû‡ŒvŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|ŽÀŽ¿Œ³–{Žc‚P‚O‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|‰ð–ñŒvã‘e—˜  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|–@’è’èŠzž‹pŠzŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|–@’è’è—¦ž‹pŠzŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|‰ð–ñ•¨Œ‘Ï—p”N”
                                     PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U|‰ð–ñ•¨Œ•ÛŒ¯—¿—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U|\¿”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚U|‰ð–ñˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚S‚U|ŽæÁ‹æ•ª      PIC  X(001).
           03  ‚c‚S‚U|‰ð–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U|‰c‹ÆˆÓŒ©      PIC  X(160).
           03  ‚c‚S‚U|‰ð–ñˆÈ~’²’B—˜‘§–ñ’è
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|‰ð–ñˆÈ~’²’B—˜‘§”„ã
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U|‘ã•\Œ_–ñŽí—Þ  PIC  X(003).
           03  ‚c‚S‚U|³Œp‹æ•ª      PIC  X(001).
           03  ‚c‚S‚U|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚U|Œ_–ñŒ–¼Ž©“®“o˜^‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚S‚U|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚S‚U|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚S‚U|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚S‚U|XVŽÒ        PIC  X(008).
           03  ‚c‚S‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
