      *****************************************************************
      *   ‰ð–ñ—š—ðQ‘‡ÌŽZ”ï—pŽx•¥(D483KSH_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|‘‡ÌŽZ”ï—pŽx•¥.
           03  ‚c‚S‚W‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚W‚R|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚W‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚W‚R|•¨Œ”Ô†    PIC  X(003).
           03  ‚c‚S‚W‚R|•¨Œ•ªŠ„˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚W‚R|”ï—pŽí—Þ    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚W‚R|Žx•¥˜A”Ô    PIC  X(008).
           03  ‚c‚S‚W‚R|–³Œøƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚W‚R|Žx•¥”NŒŽ    PIC  X(006).
           03  ‚c‚S‚W‚R|Žx•¥ƒTƒCƒg  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚W‚R|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚W‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚W‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚W‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚W‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚W‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚W‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
