      *****************************************************************
      *   ‰ð–ñ\¿Qƒtƒ@ƒNƒ^ƒŠƒ“ƒOŠúŒÀ‘OŒˆÙ(D512KFK_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿|ƒtƒ@ƒNƒ^ƒŠƒ“ƒOŠúŒÀ‘OŒˆÙ.
           03  ‚c‚T‚P‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚Q|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚Q|ŠúŒÀ‘OŒˆÏ—\’è“ú
                                     PIC  X(008).
           03  ‚c‚T‚P‚Q|ˆá–ñ‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚Q|ÂŒ ”ƒŽæ–¾×‘I‘ð”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚Q|Šz–Ê‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚Q|–ß‚µ—˜‘§‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚Q|•Ô–ß‹æ•ª    PIC  X(001).
           03  ‚c‚T‚P‚Q|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚Q|Ážƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚T‚P‚Q|Šm’èƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚T‚P‚Q|ŒˆÙƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚T‚P‚Q|ŒˆÙ“ú      PIC  X(008).
           03  ‚c‚T‚P‚Q|Šm’è“ú      PIC  X(008).
           03  ‚c‚T‚P‚Q|—¬“®‰»æ    PIC  X(010).
           03  ‚c‚T‚P‚Q|ÂŒ —¬“®‰»æ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚Q|”„‹p‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚P‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚P‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
