      *****************************************************************
      *   ‰ð–ñ\¿Q‹à—Z“WŠJ(D519KKT_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿|‹à—Z“WŠJ.
           03  ‚c‚T‚P‚X|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚X|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚T‚P‚X|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚T‚P‚X|“WŠJ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚X|—˜‘§ŒŽ”    PIC S9(001)V9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|—˜‘§        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Œ³–{’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐŒ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐ””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|“–ŒŽ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐ—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|Ž©ŽÐŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚P‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚T‚P‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚X|XVŽÒ      PIC  X(008).
