      *****************************************************************
      *   ‰ð–ñ\¿QÂŒ ÌŽZ(D520KSS_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿|ÂŒ ÌŽZ.
           03  ‚c‚T‚Q‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚Q‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚T‚Q‚O|‰ñŽûƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‰ñŽû“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚T‚Q‚O|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‘e—˜Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Šî–{—˜‰ñ‚è‘Šz
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|”„ãŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”Ê‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒÅ’èŽ‘ŽYÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|“®‘•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆÏ‘õ•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆÏ‘õ•ÛŽç—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŒÅ’èŽ‘ŽYÅŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”Ê“®‘•ÛŒ¯—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊˆÏ‘õ•ÛŽç—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‘OŽóƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”Ê‘OŽóƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒJ‰„ƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŒJ‰„ƒƒŠƒbƒg
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Šî–{ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Šî–{ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒÅ’èŽ‘ŽYÅ”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒÅ’èŽ‘ŽYÅ”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|“®‘•ÛŒ¯—¿”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|“®‘•ÛŒ¯—¿”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‘OŽóƒƒŠƒbƒg‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‘OŽóƒƒŠƒbƒg‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒJ‰„ƒƒŠƒbƒg‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒJ‰„ƒƒŠƒbƒg‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŽÀŽ¿ƒŠ[ƒX—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŽÀŽ¿ƒŠ[ƒX—¿‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‰Šú”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Šú’†”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Šî–{ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Šî–{ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒÅ’èŽ‘ŽYÅ”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒÅ’èŽ‘ŽYÅ”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|“®‘•ÛŒ¯—¿”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|“®‘•ÛŒ¯—¿”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‘OŽóƒƒŠƒbƒg‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‘OŽóƒƒŠƒbƒg‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒJ‰„ƒƒŠƒbƒg‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŒJ‰„ƒƒŠƒbƒg‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŽÀŽ¿ƒŠ[ƒX—¿‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŽÀŽ¿ƒŠ[ƒX—¿‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Žc‰¿‰ñŽûŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‰Šú”ï—p“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Šú’†”ï—pŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Žc‰¿‰ñŽûŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‘e—˜‰v‘S‘Ì  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŽc‰¿‰ñŽûŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŠú’†”ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”Ê‘e—˜Šz‘S‘Ì
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŽÀŽ¿ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŽc‰¿‰ñŽûŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”ÊŠú’†”ï—pŒ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|“–ŽÐŽ•ª”ä—¦
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|Šî–{Œ³–{‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ƒŠ[ƒX—¿Œ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ƒŠ[ƒX—¿Œ»‰¿“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‚»‚Ì‘¼””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‚»‚Ì‘¼””ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆê”Ê‚»‚Ì‘¼””ï—pŒ»‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆÏ‘õ•ÛŒ¯—¿”ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆÏ‘õ•ÛŒ¯—¿”ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‚»‚Ì‘¼””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‚»‚Ì‘¼””ï—p‚P‰ñ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆÏ‘õ•ÛŒ¯—¿”ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|ˆÏ‘õ•ÛŒ¯—¿”ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‚»‚Ì‘¼””ï—p‘Šz“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|‚»‚Ì‘¼””ï—p‚P‰ñ•ª“–ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚Q‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚Q‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚Q‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚Q‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚Q‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚Q‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
