      *****************************************************************
      *   ”pŠü—š—ð(D555HKR_TBL)
      *****************************************************************
       01  ”pŠü—š—ð.
           03  ‚c‚T‚T‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚T‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚T‚T|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚T‚T|”pŠü˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚T‚T|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚T‚T‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚T‚T‚T|ˆ•ªæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚T‚T‚T|”pŠü“ú      PIC  X(008).
           03  ‚c‚T‚T‚T|”pŠü——R    PIC  X(002).
           03  ‚c‚T‚T‚T|”pŠü‹æ•ª    PIC  X(001).
           03  ‚c‚T‚T‚T|”pŠüŒo”ï    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T‚T|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚T‚T‚T|ˆ•ªƒ‹[ƒg  PIC  X(001).
           03  ‚c‚T‚T‚T|”pŠüƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|”pŠüˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T‚T|\¿ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|\¿ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T‚T|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|\¿ŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚T‚T|\¿ŽæÁ“ú  PIC  X(008).
           03  ‚c‚T‚T‚T|\¿ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|\¿ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T‚T|ŒˆÙƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|ŒˆÙˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T‚T|ŒˆÙƒ‰ƒ“ƒN  PIC  X(001).
           03  ‚c‚T‚T‚T|ŒˆÙ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚T‚T|ŒˆÙŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|³”F‹æ•ª    PIC  X(001).
           03  ‚c‚T‚T‚T|ŒˆÙŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚T‚T|ŒˆÙŽæÁ“ú  PIC  X(008).
           03  ‚c‚T‚T‚T|ŒˆÙŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|ŒˆÙŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T‚T|Šm’èƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|Šm’èˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T‚T|Šm’èŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚T‚T|Šm’èŽæÁ“ú  PIC  X(008).
           03  ‚c‚T‚T‚T|Šm’èŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|Šm’èŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚T‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚T‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚T‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚T‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚T‚T‚T|ˆø“næ‹æ•ª  PIC  X(001).
           03  ‚c‚T‚T‚T|ˆøŽæ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚T‚T|ˆøŽæ”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T‚T|””ï—pÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚T‚T|•¨Œˆ•ª\¿ðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚T‚T‚T|ˆø“næ–¼Ì  PIC  X(040).
           03  ‚c‚T‚T‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚T‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚T‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚T‚T|‰ð–ñ\¿˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚T‚T|‘ã•\•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
