      *****************************************************************
      *   “ü‹à(D57KUK_TBL)
      *****************************************************************
       01  “ü‹à.
           03  ‚c‚T‚V|“ü‹à’Ê”Ô      PIC  X(011).
           03  ‚c‚T‚V|“ü‹à“ú        PIC  X(008).
           03  ‚c‚T‚V|‚r‚d‚p”Ô†    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚T‚V|¿‹’S“–ŽÒ    PIC  X(008).
           03  ‚c‚T‚V|Æ‰ï”Ô†      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚T‚V|Š¨’è“ú        PIC  X(008).
           03  ‚c‚T‚V|—a“ü|•¥o“ú  PIC  X(008).
           03  ‚c‚T‚V|¿‹‘”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚T‚V|“ü•¥‹æ•ª      PIC  X(001).
           03  ‚c‚T‚V|Žæˆø‹æ•ª      PIC  X(002).
           03  ‚c‚T‚V|Žæˆø‹àŠz      PIC S9(012) PACKED-DECIMAL.
           03  ‚c‚T‚V|ŽèŒ`|¬ØŽè‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚V|ŽèŒ`|¬ØŽè”Ô†
                                     PIC  X(007).
           03  ‚c‚T‚V|—»“X”Ô†      PIC  X(003).
           03  ‚c‚T‚V|UžˆË—ŠlƒR[ƒh
                                     PIC  X(010).
           03  ‚c‚T‚V|UžˆË—Šl–¼  PIC  X(048).
           03  ‚c‚T‚V|ŽdŒü‹âs–¼    PIC  X(040).
           03  ‚c‚T‚V|ŽdŒüŽx“X–¼    PIC  X(040).
           03  ‚c‚T‚V|“K—p“à—e      PIC  X(030).
           03  ‚c‚T‚V|“ü‹à‹æ•ª      PIC  X(002).
           03  ‚c‚T‚V|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚T‚V|ˆêŠ‡“ü‹àƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚T‚V|–¼Šñ‚¹ƒR[ƒh  PIC  X(040).
           03  ‚c‚T‚V|“ü‹àæ–¼Ì    PIC  X(080).
           03  ‚c‚T‚V|ŽæÁ‹æ•ª      PIC  X(001).
           03  ‚c‚T‚V|ŽæÁ“ú        PIC  X(008).
           03  ‚c‚T‚V|Áž‹æ•ª      PIC  X(001).
           03  ‚c‚T‚V|Áž‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V|Áž“ú        PIC  X(008).
           03  ‚c‚T‚V|Áž’Ê”Ô      PIC  X(011).
           03  ‚c‚T‚V|U‘Ö——R      PIC  X(080).
           03  ‚c‚T‚V|U‘Ö‹æ•ª      PIC  X(001).
           03  ‚c‚T‚V|U‘ÖæƒR[ƒh  PIC  X(001).
           03  ‚c‚T‚V|U‘Ö“ú        PIC  X(008).
           03  ‚c‚T‚V|U‘Ö‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V|‹âsƒR[ƒh    PIC  X(004).
           03  ‚c‚T‚V|‹âs–¼        PIC  X(015).
           03  ‚c‚T‚V|Žx“XƒR[ƒh    PIC  X(003).
           03  ‚c‚T‚V|Žx“X–¼        PIC  X(015).
           03  ‚c‚T‚V|—a‹àŽí–Ú      PIC  X(001).
           03  ‚c‚T‚V|ŒûÀ”Ô†      PIC  X(010).
           03  ‚c‚T‚V|ŒûÀ–¼        PIC  X(040).
           03  ‚c‚T‚V|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚V|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚V|XVŽÒ        PIC  X(008).
           03  ‚c‚T‚V|ÁžŽc‚      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V|“–ŒŽ”NŒŽ      PIC  X(006).
           03  ‚c‚T‚V|“–ŒŽÁž‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V|“–ŒŽU‘Ö‹àŠz|—a‚è‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V|“–ŒŽU‘Ö‹àŠz|‚»‚Ì‘¼
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V|UžŽè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚T‚V|ˆ—‰ñ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚V|“ü‹àŽd–ó’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚T‚V|‹âs’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚T‚V|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†
                                     PIC  X(016).
           03  ‚c‚T‚V|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚V|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚V|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚T‚V|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚T‚V|×–ÚƒR[ƒh    PIC  X(010).
