      *****************************************************************
      *   “ü‹àÁžŠÇ—|U‘ÖŽd–ó(D57NKF_TBL)
      *****************************************************************
       01  “ü‹àÁžŠÇ—|U‘ÖŽd–ó.
           03  ‚c‚T‚V‚m‚j‚e|Áž’Ê”Ô      PIC  X(011).
           03  ‚c‚T‚V‚m‚j‚e|–¾×”Ô†      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚V‚m‚j‚e|ŽØ•û‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚T‚V‚m‚j‚e|ŽØ•û‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V‚m‚j‚e|ŽØ•û‰ÛÅ‹æ•ª  PIC  X(003).
           03  ‚c‚T‚V‚m‚j‚e|ŽØ•û‚q‚d‚e‚m‚n
                                     PIC  X(020).
           03  ‚c‚T‚V‚m‚j‚e|‘Ý•û‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚T‚V‚m‚j‚e|‘Ý•û‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚V‚m‚j‚e|‘Ý•û‰ÛÅ‹æ•ª  PIC  X(003).
           03  ‚c‚T‚V‚m‚j‚e|‘Ý•û‚q‚d‚e‚m‚n
                                     PIC  X(020).
           03  ‚c‚T‚V‚m‚j‚e|ÁžŽæÁ‹æ•ª  PIC  X(001).
           03  ‚c‚T‚V‚m‚j‚e|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚e|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚e|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚e|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚e|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚e|XVŽÒ        PIC  X(008).
           03  ‚c‚T‚V‚m‚j‚e|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
