      *****************************************************************
      *   ‘‡Už(D601SFR_TBL)
      *****************************************************************
       01  ‘‡Už.
           03  ‚c‚U‚O‚P|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚U‚O‚P|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚U‚O‚P|—a‹àŽí•Ê    PIC  X(001).
           03  ‚c‚U‚O‚P|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚U‚O‚P|Užæ–¼    PIC  X(030).
           03  ‚c‚U‚O‚P|Už‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O‚P|UžŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O‚P|ƒGƒ‰[ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚O‚P|ŒÚ‹qƒR[ƒh‚P
                                     PIC  X(010).
           03  ‚c‚U‚O‚P|ŒÚ‹qƒR[ƒh‚Q
                                     PIC  X(010).
           03  ‚c‚U‚O‚P|UžˆË—ŠlƒR[ƒh
                                     PIC  X(010).
           03  ‚c‚U‚O‚P|Už“ú      PIC  X(008).
           03  ‚c‚U‚O‚P|•”“XƒR[ƒh  PIC  X(004).
           03  ‚c‚U‚O‚P|ŽdŒü‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚O‚P|ŽdŒüŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚O‚P|ŽdŒü—a‹àŽí•Ê
                                     PIC  X(001).
           03  ‚c‚U‚O‚P|ŽdŒüŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚U‚O‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚O‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚O‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚O‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚O‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚O‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚O‚P|“o˜^’S“–ŽÒ  PIC  X(008).
