      *****************************************************************
      *   Œ_–ñ•¶Œ¾ƒe[ƒuƒ‹(D640KYM_TBL)
      *****************************************************************
       01  Œ_–ñ•¶Œ¾ƒe[ƒuƒ‹.
           03  ‚c‚U‚S‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚S‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚S‚O|•¶Œ¾”Ô†    PIC  X(003).
           03  ‚c‚U‚S‚O|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚S‚O|Œ_–ñ•¶Œ¾    PIC  X(120).
           03  ‚c‚U‚S‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚S‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚S‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚S‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚S‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚S‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚S‚O|“o˜^’S“–ŽÒ  PIC  X(008).
