      *****************************************************************
      *   ’ñŒgƒŠ[ƒX–ž—¹Šî–{ƒe[ƒuƒ‹(D661MKH_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX–ž—¹Šî–{ƒe[ƒuƒ‹.
           03  ‚c‚U‚U‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚U‚P|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚U‚U‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚P|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚U‚U‚P|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚U‚U‚P|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚P|’ñŒgæ—ªÌ  PIC  X(003).
           03  ‚c‚U‚U‚P|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚U‚P|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚U‚P|Œ_–ñƒŒƒR[ƒhŒ”
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚U‚P|ÅI•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚U‚P|–ž—¹—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚U‚P|ˆê”Ê”½‰f‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚P|“o˜^ŽÒ      PIC  X(008).
           03  ‚c‚U‚U‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚P|XVŽÒ      PIC  X(008).
