      *****************************************************************
      *   ’ñŒgƒŠ[ƒX–ž—¹‚r‚e‚b•¨Œ–¾×(D663MSB_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX–ž—¹‚r‚e‚b•¨Œ–¾×.
           03  ‚c‚U‚U‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚U‚R|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚P
                                     PIC  X(016).
           03  ‚c‚U‚U‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚Q
                                     PIC  X(016).
           03  ‚c‚U‚U‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚R
                                     PIC  X(016).
           03  ‚c‚U‚U‚R|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚S
                                     PIC  X(016).
           03  ‚c‚U‚U‚R|–ž—¹ˆ—Œ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚U‚U‚R|•¨Œ–¼      PIC  X(060).
           03  ‚c‚U‚U‚R|”—Ê        PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|’PˆÊ        PIC  X(001).
           03  ‚c‚U‚U‚R|w“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|•¨ŒƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|ÄƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|‚r‚e‚bÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|V¤•i˜A”Ô  PIC  X(003).
           03  ‚c‚U‚U‚R|w“ü‹àŠz“à–ó|ÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|w“ü‹àŠz“à–ó|”„‹p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|w“ü‹àŠz“à–ó|”pŠü
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|”—Ê“à–ó|ÄƒŠ[ƒX
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|”—Ê“à–ó|”„‹p
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚R|”—Ê“à–ó|”pŠü
                                     PIC S9(005) PACKED-DECIMAL.
