      *****************************************************************
      *   ’ñŒgƒŠ[ƒX–ž—¹‰¼Žó‹à’²®Šz(D666MKC_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX–ž—¹‰¼Žó‹à’²®Šz.
           03  ‚c‚U‚U‚U|”NŒŽ        PIC  X(006).
           03  ‚c‚U‚U‚U|‰¼Žó‹à’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚U|“o˜^Žž    PIC  X(008).
           03  ‚c‚U‚U‚U|“o˜^ŽÒ      PIC  X(008).
           03  ‚c‚U‚U‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚U|XVŽž    PIC  X(008).
           03  ‚c‚U‚U‚U|XVŽÒ      PIC  X(008).
