      *****************************************************************
      *   ’ñŒgƒŠ[ƒXŒ_–ñ‚l‚sƒf[ƒ^(D680TKM_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒXŒ_–ñ‚l‚sƒf[ƒ^.
           03  ‚c‚U‚W‚O|’ñŒgæŒ_–ñ”Ô†
                                     PIC  X(012).
           03  ‚c‚U‚W‚O|¤•iƒR[ƒh  PIC  X(004).
           03  ‚c‚U‚W‚O|Œ_–ñ”Ô†    PIC  X(009).
           03  ‚c‚U‚W‚O|Ž–‹ÆŠƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚O|•ïŠ‡ƒGƒŠƒAƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚U‚W‚O|•ïŠ‡ƒGƒŠƒA–¼
                                     PIC  X(060).
           03  ‚c‚U‚W‚O|ƒGƒŠƒAƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚U‚W‚O|Žx“XƒR[ƒh  PIC  X(002).
           03  ‚c‚U‚W‚O|ƒ†[ƒU[ƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚W‚O|ŒÚ‹qƒR[ƒh  PIC  X(006).
           03  ‚c‚U‚W‚O|Žæˆøæ–¼    PIC  X(060).
           03  ‚c‚U‚W‚O|’S“–ŽÒƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚O|âg‹c‚m‚n    PIC  X(010).
           03  ‚c‚U‚W‚O|Œ_–ñ“ú      PIC  X(008).
           03  ‚c‚U‚W‚O|ŒŸŽû“ú      PIC  X(008).
           03  ‚c‚U‚W‚O|‘æ‚P‰ñ“ü‹à“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚O|“ü‹àŠî€“ú  PIC  X(002).
           03  ‚c‚U‚W‚O|ƒŠ[ƒXŠúŠÔ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|‘OŽóŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|ŽÐ“à‹à—˜    PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|Á”ïÅ—¦    PIC S9(002)V9(001) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|ƒŠ[ƒX—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|‘OŽóƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚U‚W‚O|w“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|Žd“üÁ”ïÅ“™Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|ŒJ‰„ŒŽ”    PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|‘e—˜‰v      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|Œ_–ñŽÒ–¼    PIC  X(025).
           03  ‚c‚U‚W‚O|Œ_–ñŽÒZŠ  PIC  X(050).
           03  ‚c‚U‚W‚O|ƒWƒ‡ƒ‚Žx“X–¼
                                     PIC  X(010).
           03  ‚c‚U‚W‚O|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|Žx•¥ðŒƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚U‚W‚O|’ñŒgæ¤•i˜A”Ô
                                     PIC  X(003).
           03  ‚c‚U‚W‚O|•¨Œ‚m‚n    PIC  X(003).
           03  ‚c‚U‚W‚O|ƒVƒƒ[ƒv¤•iƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚O|•¨Œ–¼      PIC  X(015).
           03  ‚c‚U‚W‚O|‹@Ží–¼      PIC  X(015).
           03  ‚c‚U‚W‚O|”—Ê        PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|ŒÂ•ÊƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|“®‘•ÛŒ¯ƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚O|“®‘•ÛŒ¯—¿—¦
                                     PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|Ž‘ŽYƒR[ƒh  PIC  X(007).
           03  ‚c‚U‚W‚O|‘Ï—p”N”    PIC  X(002).
           03  ‚c‚U‚W‚O|M—p•ÛŒ¯ƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚U‚W‚O|Å‹æ•ª      PIC  X(001).
           03  ‚c‚U‚W‚O|ŒÅ’èŽ‘ŽYÅ—¦
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚O|”[•tæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚U‚W‚O|•¨Œ–¼ÌƒJƒi
                                     PIC  X(040).
           03  ‚c‚U‚W‚O|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚U‚W‚O|Ý’uêŠZŠ‚P
                                     PIC  X(060).
           03  ‚c‚U‚W‚O|Ý’uêŠZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚U‚W‚O|Ý’uêŠZŠ‚R
                                     PIC  X(060).
           03  ‚c‚U‚W‚O|ZŠƒR[ƒh  PIC  X(011).
           03  ‚c‚U‚W‚O|Ý’uêŠ–¼Š¿Žš
                                     PIC  X(060).
           03  ‚c‚U‚W‚O|Ý’uêŠ–¼ƒJƒi
                                     PIC  X(060).
           03  ‚c‚U‚W‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚O|“o˜^ŽžŠÔ    PIC  X(006).
           03  ‚c‚U‚W‚O|“o˜^’S“–ŽÒ  PIC  X(004).
           03  ‚c‚U‚W‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚O|XVŽžŠÔ    PIC  X(006).
           03  ‚c‚U‚W‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚O|XVŽÒ      PIC  X(008).
