      *****************************************************************
      *   ’ñŒgƒŠ[ƒXŒ_–ñŠî–{(D681TKK_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒXŒ_–ñŠî–{.
           03  ‚c‚U‚W‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚P|Šî–{˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚W‚P|‘ŠŽèæŒ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚U‚W‚P|Œ_–ñŒ–¼    PIC  X(080).
           03  ‚c‚U‚W‚P|Ý’uêŠ–¼  PIC  X(080).
           03  ‚c‚U‚W‚P|Ý’uêŠ–¼ƒJƒi
                                     PIC  X(080).
           03  ‚c‚U‚W‚P|“r’†•Û‘¶ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|ƒGƒ‰[ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚P|Œ_–ñŽí•Ê    PIC  X(001).
           03  ‚c‚U‚W‚P|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚P|ƒNƒŒƒ‰ƒCƒ“Žæˆøæ
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|Ð‰îæ‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚P|Œ_–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚P|ŒŸŽû—\’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚P|ŒŸŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚P|‹¦’²“]‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚P|ƒŠ[ƒXŠúŠÔ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‹K‘¹‹àŒvŽZ•ûŽ®
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|ƒŠ[ƒX—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|w“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‘e—˜‰v      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|—D‹ö‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‘OŽóƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‘OŽóƒŠ[ƒX—¿“ü‹à“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚P|[“–ŠJŽn‰ñ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|[“–ŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‰‰ñ‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‰‰ñ‰ñŽûƒTƒCƒg
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‰‰ñ¿‹’÷Ø“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|‰‰ñ˜’uŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‰‰ñ‰ñŽû“ú•¶Œ¾
                                     PIC  X(030).
           03  ‚c‚U‚W‚P|ˆÈ~‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|ˆÈ~‰ñŽûƒTƒCƒg
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|ˆÈ~¿‹’÷Ø“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|ˆÈ~‰ñŽû“ú•¶Œ¾
                                     PIC  X(030).
           03  ‚c‚U‚W‚P|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚P|¿‹”­sƒTƒCƒg
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|¿‹‘”­s“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|¿‹ŠÔŠu    PIC  X(002).
           03  ‚c‚U‚W‚P|¿‹Šî€ŒŽ  PIC  X(002).
           03  ‚c‚U‚W‚P|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|ŒÅ’èŽ‘ŽYÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|•ÛŒ¯—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‚»‚Ì‘¼””ï—p‚P
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‚»‚Ì‘¼””ï—p‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|’P”N“xŒ_–ñ  PIC  X(002).
           03  ‚c‚U‚W‚P|’S“–ŽÒƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚P|Â–±‹¦’²‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|‘O“n‹à—˜‘§‰Šú”ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|˜’uŠúŠÔ    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ŒvŽZ•ûŽ®    PIC  X(001).
           03  ‚c‚U‚W‚P|‹âsƒR[ƒh  PIC  X(007).
           03  ‚c‚U‚W‚P|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|ŒûÀ”Ô†    PIC  X(007).
           03  ‚c‚U‚W‚P|—a‹àŽí—Þ    PIC  X(001).
           03  ‚c‚U‚W‚P|ŒJ‰„ŒŽ”    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚U‚W‚P|ˆÄŒ”­¶‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‘OŽóŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ŒJ‰„‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‰c‹Æ•”ˆÓŒ©  PIC  X(340).
           03  ‚c‚U‚W‚P|ƒGƒ‰[ƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚U‚W‚P|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|•¨ŒŠm”FŠî€
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‹¦’²‰ñŽû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‘¹ŠQ”…ž‹àŒvŽZ•û–@
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‘¹ŠQ”…ž‹à•¶Œ¾
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|ƒŠ[ƒX—¿|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|Œ_–ñ‹àŠz|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|w“ü‹àŠz|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|Šî–{—˜‰ñ‚è|Ž©ŽÐ
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ŽÀŽ¿—˜‰ñ‚è|Ž©ŽÐ
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‘e—˜‰v|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ÄƒŠ[ƒX—¿—¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|ÄƒŠ[ƒX—¿—¦•ª•ê
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ÄƒŠ[ƒX—¿—¦•ªŽq
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|–ž—¹ˆÄ“à’ •[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‘OŽóƒŠ[ƒXÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|“Á–ñð€    PIC  X(340).
           03  ‚c‚U‚W‚P|ƒŠ[ƒXŠúŠÔŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚P|ƒŠ[ƒXŠúŠÔI—¹”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚W‚P|‘OŽóƒŠ[ƒX—¿|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‘OŽóƒŠ[ƒXÁ”ïÅ|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|Ð‰îŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚P|Ð‰îŒ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚W‚P|Ð‰î‚a‚s‚l–{Žx“XƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚U‚W‚P|Ð‰î‹âsƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚U‚W‚P|Ð‰î•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚W‚P|ÄƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|–ž—¹’Ê’m–¾×‘”­s‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|‘OŽó‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‘OŽó‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‘OŽó‹àŠz|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|‘OŽó‹àŠzÁ”ïÅ|Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|[“–        PIC  X(012).
           03  ‚c‚U‚W‚P|ˆÈ~˜’uŒŽ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|ˆÈ~‰ñŽûŠÔŠu
                                     PIC  X(002).
           03  ‚c‚U‚W‚P|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚U‚W‚P|XVƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚U‚W‚P|•ïŠ‡ƒGƒŠƒAƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚U‚W‚P|ˆ´ùŽè”—¿Žx•¥“ú
                                     PIC  X(030).
           03  ‚c‚U‚W‚P|ˆ´ùŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚W‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚W‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚W‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
