      *****************************************************************
      *   ŽO—mU•ªƒe[ƒuƒ‹iÄƒŠ[ƒXƒf[ƒ^j(D692SFS_TBL)
      *****************************************************************
       01  ŽO—mU•ªƒe[ƒuƒ‹|ÄƒŠ[ƒXƒf[ƒ^.
           03  ‚c‚U‚X‚Q|‚a‚n‚s‚kŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚U‚X‚Q|‚a‚n‚s‚k•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚X‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚X‚Q|¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚X‚Q|•¨Œ–¼      PIC  X(030).
           03  ‚c‚U‚X‚Q|ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P
                                     PIC  X(010).
           03  ‚c‚U‚X‚Q|ƒŠ[ƒXI—¹“ú
                                     PIC  X(008).
           03  ‚c‚U‚X‚Q|”—Ê        PIC S9(004) PACKED-DECIMAL.
