      *****************************************************************
      *   î•ñŒn’Šo“úŽŸŠÇ—ƒ}ƒXƒ^(D710DWH_TBL)
      *****************************************************************
       01  î•ñŒn’Šo“úŽŸŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚V‚P‚O|’¼‹ß‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚O|“ú•t        PIC  X(008).
           03  ‚c‚V‚P‚O|Žž        PIC  X(006).
