      *****************************************************************
      *   ‰ïŒv“ú•tŠÇ—ƒtƒ@ƒCƒ‹(D711KHK_TBL)
      *****************************************************************
       01  ‰ïŒv“ú•tŠÇ—ƒtƒ@ƒCƒ‹.
           03  ‚c‚V‚P‚P|‰ïŒv”N“x    PIC  X(004).
           03  ‚c‚V‚P‚P|‰ïŒv”N|¼—ï
                                     PIC  X(004).
           03  ‚c‚V‚P‚P|ŒŽ          PIC  X(002).
           03  ‚c‚V‚P‚P|‰ïŒvŠú      PIC  X(002).
           03  ‚c‚V‚P‚P|‰ïŒvŠúŠÔ    PIC  X(002).
           03  ‚c‚V‚P‚P|“ú          PIC  X(002).
           03  ‚c‚V‚P‚P|—‚‰c‹Æ“ú    PIC  X(008).
           03  ‚c‚V‚P‚P|‘OŒŽ––“ú    PIC  X(008).
           03  ‚c‚V‚P‚P|ˆêŽŸŠm’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚P‚P|ˆêŽŸ’÷‘ÎÛŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚P‚P|Á”ïÅ‰¼’÷ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚P‚P|Á”ïÅ‰¼’÷‘ÎÛŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚P‚P|“ñŽŸŠm’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚P‚P|“ñŽŸ’÷‘ÎÛŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚P‚P|Á”ïÅŠm’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚P‚P|Á”ïÅŠm’è‘ÎÛŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚P‚P|Šú––Šm’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚P‚P|Šú––Šm’è‘ÎÛŒŽ
                                     PIC  X(006).
           03  ‚c‚V‚P‚P|‰“ú        PIC  X(008).
           03  ‚c‚V‚P‚P|––“ú        PIC  X(008).
           03  ‚c‚V‚P‚P|ˆêŽŸ’÷“ú    PIC  X(008).
           03  ‚c‚V‚P‚P|“ñŽŸ’÷“ú    PIC  X(008).
           03  ‚c‚V‚P‚P|Á”ïÅ‰¼’÷“ú
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Á”ïÅŠm’è“ú
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Šú––Šm’è“ú  PIC  X(008).
           03  ‚c‚V‚P‚P|Šú‰“ú‚P|‚P
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Šú––“ú‚Q|‚P
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Šú‰“ú‚P|‚Q
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Šú––“ú‚Q|‚Q
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Šú‰“ú‚P|‚R
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Šú––“ú‚Q|‚R
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Šú‰“ú‚P|‚S
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|Šú––“ú‚Q|‚S
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚P|Š‘®•”“X    PIC  X(004).
           03  ‚c‚V‚P‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚P‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚P|XVŽÒ      PIC  X(008).
