      *****************************************************************
      *   W–ñ”Ô†Ì”Ôƒe[ƒuƒ‹(D717SSK_TBL)
      *****************************************************************
       01  W–ñ”Ô†Ì”Ôƒe[ƒuƒ‹.
           03  ‚c‚V‚P‚V|Œo˜H‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚V|ŠJŽnW–ñ”Ô†
                                     PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚V|I—¹W–ñ”Ô†
                                     PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚V|ÅIW–ñ”Ô†
                                     PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚P‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚V|XVŽÒ      PIC  X(008).
