      *****************************************************************
      *   Ž©“®Žd–óQƒŠƒAƒ‹(D718JSR_TBL)
      *****************************************************************
       01  Ž©“®Žd–ó|ƒŠƒAƒ‹.
           03  ‚c‚V‚P‚W|Žd–óƒCƒxƒ“ƒg‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚W|Žd–óƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚P‚W|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚P‚W|“ü‹àŽd–ó’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚P‚W|ÁžŽd–ó’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚P‚W|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚P‚W|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚V‚P‚W|o—ÍŒ³ƒvƒƒOƒ‰ƒ€‚h‚c
                                     PIC  X(008).
           03  ‚c‚V‚P‚W|‹N•[•”–åƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚P‚W|‹N•[ŽÐˆõƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚W|³”FŽÐˆõƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚W|³”F“ú•t    PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|“ü—Í“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|Žæˆø“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‚u‚`‚k‚t‚d“ú
                                     PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|ŽæˆøæƒR[ƒh‚P
                                     PIC  X(009).
           03  ‚c‚V‚P‚W|ŽæˆøæƒR[ƒh‚Q
                                     PIC  X(005).
           03  ‚c‚V‚P‚W|Œvã•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚P‚W|‚a‚n‚s‚k˜AŒ‹‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚W|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚W|”„ãÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚W|Žd“üÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚W|ŽóŽæŽè”—¿Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚W|Á”ïÅŒvã‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚W|‘OŽóƒŠ[ƒX—¿‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚W|—LŒø‹àŠzÝ’è”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚P      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚Q      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚R      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚S      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚T      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚U      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚V      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚W      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚X      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|‹àŠz‚P‚O    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚P‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚W|XVŽÒ      PIC  X(008).
