      *****************************************************************
      *   ‰È–ÚŽc‚î•ñŠÇ—ƒ}ƒXƒ^(D721KZN_TBL)
      *****************************************************************
       01  ‰È–ÚŽc‚î•ñŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚V‚Q‚P|•”“X        PIC  X(004).
           03  ‚c‚V‚Q‚P|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚Q‚P|“àŠO‹æ•ª    PIC  X(001).
           03  ‚c‚V‚Q‚P|XVƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚Q‚P|‰È–Úƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚V‚Q‚P|ŒûÀ“o˜^”  PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚P|ŽØ•û‡Œv    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚P|‘Ý•û‡Œv    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚P|Žc‚        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚P|‘OŒŽ––ŽØ•û‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚P|‘OŒŽ––‘Ý•û‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚P|‘OŒŽ––Žc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚Q‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚Q‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚Q‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚Q‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚Q‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚Q‚P|XVŽÒ      PIC  X(008).
