      *****************************************************************
      *   ŒûÀŽc‚î•ñŠÇ—ƒ}ƒXƒ^(D722KKZ_TBL)
      *****************************************************************
       01  ŒûÀŽc‚î•ñŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚V‚Q‚Q|•”“X        PIC  X(004).
           03  ‚c‚V‚Q‚Q|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚Q‚Q|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚Q‚Q|•¼ŽíƒR[ƒh  PIC  X(003).
           03  ‚c‚V‚Q‚Q|XVƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚Q‚Q|ŒûÀƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚V‚Q‚Q|“àŠO‹æ•ª    PIC  X(001).
           03  ‚c‚V‚Q‚Q|ŒÂ•Ê–¾×”  PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|ŽØ•û‡ŒvŠO‰Ý
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|ŽØ•û‡Œv‰~‰Ý
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘Ý•û‡ŒvŠO‰Ý
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘Ý•û‡Œv‰~‰Ý
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|Žc‚ŠO‰Ý    PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|Žc‚‰~‰Ý    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|ŽØ•û‡ŒvŠO‰Ý|”Ä—p“ü—Í
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|ŽØ•û‡Œv‰~‰Ý|”Ä—p“ü—Í
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘Ý•û‡ŒvŠO‰Ý|”Ä—p“ü—Í
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘Ý•û‡Œv‰~‰Ý|”Ä—p“ü—Í
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|Žc‚ŠO‰Ý|”Ä—p“ü—Í
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|Žc‚‰~‰Ý|”Ä—p“ü—Í
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––ŽØ•û‡ŒvŠO‰Ý
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––ŽØ•û‡Œv‰~‰Ý
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––‘Ý•û‡ŒvŠO‰Ý
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––‘Ý•û‡Œv‰~‰Ý
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––Žc‚ŠO‰Ý
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––Žc‚‰~‰Ý
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––ŽØ•û‡ŒvŠO‰Ý|”Ä—p“ü—Í
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––ŽØ•û‡Œv‰~‰Ý|”Ä—p“ü—Í
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––‘Ý•û‡ŒvŠO‰Ý|”Ä—p“ü—Í
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––‘Ý•û‡Œv‰~‰Ý|”Ä—p“ü—Í
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––Žc‚ŠO‰Ý|”Ä—p“ü—Í
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|‘OŒŽ––Žc‚‰~‰Ý|”Ä—p“ü—Í
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚Q‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚Q‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚Q‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚Q‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚Q‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚Q‚Q|XVŽÒ      PIC  X(008).
