      *****************************************************************
      *   ŒÂ•Ê–¾×Žc‚î•ñŠÇ—ƒ}ƒXƒ^(D723KMZ_TBL)
      *****************************************************************
       01  ŒÂ•Ê–¾×Žc‚î•ñŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚V‚Q‚R|•”“X        PIC  X(004).
           03  ‚c‚V‚Q‚R|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚Q‚R|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚Q‚R|‚q‚d‚e|‚m‚n
                                     PIC  X(016).
           03  ‚c‚V‚Q‚R|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|XVƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚Q‚R|Žæˆø“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‚u‚`‚k‚t‚d“ú
                                     PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚Q‚R|‘ÝŽØ‹æ•ª    PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|•¼ŽíƒR[ƒh  PIC  X(003).
           03  ‚c‚V‚Q‚R|ŠO‰Ý‹àŠz    PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‰~‰Ý‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|“àŠO‹æ•ª    PIC  X(001).
           03  ‚c‚V‚Q‚R|Á”ïÅ‰ÛÅ‹æ•ª
                                     PIC  X(003).
           03  ‚c‚V‚Q‚R|Á”ïÅ—¦    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|Š·ŽZƒŒ[ƒg  PIC S9(003)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‘Î‰¿‚e‚h‚w  PIC  X(001).
           03  ‚c‚V‚Q‚R|ŽnŠú”NŒŽ“ú  PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|IŠú”NŒŽ“ú  PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|—˜—¦        PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|•Ð’[|—¼’[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚R|‘OŽæ|ŒãŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚Q‚R|—˜—¦Šî”    PIC  X(001).
           03  ‚c‚V‚Q‚R|“E—v        PIC  X(050).
           03  ‚c‚V‚Q‚R|Žc‚ŠO‰Ý    PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|Žc‚‰~‰Ý    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‘OŒŽ––ŽcŠO‰Ý
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‘OŒŽ––Žc‰~‰Ý
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‘OŠú––ŽcŠO‰Ý
                                     PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‘OŠú––Žc‰~‰Ý
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‘OŒŽŽæˆø“ú  PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|‘OŠúŽæˆø“ú  PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚Q‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚Q‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚Q‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚Q‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚Q‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚Q‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚Q‚R|XVŽÒ      PIC  X(008).
