      *****************************************************************
      *   ’èŠúŽx•¥ƒ}ƒXƒ^(D732HTS_TBL)
      *****************************************************************
       01  ’èŠúŽx•¥ƒ}ƒXƒ^.
           03  ‚c‚V‚R‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚R‚Q|ÄƒŠ[ƒXƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚R‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚R‚Q|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚R‚Q|Žx•¥•ûŽ®    PIC  X(001).
           03  ‚c‚V‚R‚Q|Žx•¥ƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚R‚Q|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚R‚Q|ŒŸŽû“ú      PIC  X(008).
           03  ‚c‚V‚R‚Q|Žx•¥ŠJŽn“ú  PIC  X(008).
           03  ‚c‚V‚R‚Q|Žx•¥I—¹“ú  PIC  X(008).
           03  ‚c‚V‚R‚Q|Žg“r–¾×    PIC  X(056).
           03  ‚c‚V‚R‚Q|Žx•¥Á”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚Q|Žx•¥Žè”—¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚Q|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚Q|Žx•¥–¾×”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚R‚Q|Žx•¥Ï–¾×”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚R‚Q|‹Æ–±ƒR[ƒh  PIC  X(002).
           03  ‚c‚V‚R‚Q|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚Q|“ü—Í•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚R‚Q|ó‘Ô‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚Q|Žx•¥‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚Q|³”FŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚R‚Q|³”F“ú•t    PIC  X(008).
           03  ‚c‚V‚R‚Q|³”FŽž    PIC  X(006).
           03  ‚c‚V‚R‚Q|“o˜^íœ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚R‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚R‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚R‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚R‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚R‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚R‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚R‚Q|XVŽÒ      PIC  X(008).
