      *****************************************************************
      *   ”Ä—pŽx•¥ƒ}ƒXƒ^i–¾×j(D734HSH_TBL)
      *****************************************************************
       01  ”Ä—pŽx•¥ƒ}ƒXƒ^i–¾×j.
           03  ‚c‚V‚R‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚R‚S|ÄƒŠ[ƒXƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚R‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚R‚S|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚R‚S|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚R‚S|‰¼“`•[”Ô†  PIC  X(012).
           03  ‚c‚V‚R‚S|‘ÝŽØ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚R‚S|s”Ô†      PIC  X(002).
           03  ‚c‚V‚R‚S|‰È–ÚƒR[ƒh  PIC  X(006).
           03  ‚c‚V‚R‚S|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚R‚S|‚q‚d‚e‚m‚n‚P
                                     PIC  X(007).
           03  ‚c‚V‚R‚S|‚q‚d‚e‚m‚n‚Q
                                     PIC  X(009).
           03  ‚c‚V‚R‚S|‹àŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚R‚S|‰ÛÅƒR[ƒh  PIC  X(003).
           03  ‚c‚V‚R‚S|Å—¦‹æ•ª    PIC  X(002).
           03  ‚c‚V‚R‚S|Œvã•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚R‚S|®—”Ô†    PIC  X(006).
           03  ‚c‚V‚R‚S|ŽQlÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
