      *****************************************************************
      *   ‰È–Ú•Ê•½ŽcŠÇ—ƒ}ƒXƒ^(D742KHZ_TBL)
      *****************************************************************
       01  ‰È–Ú•Ê•½ŽcŠÇ—ƒ}ƒXƒ^.
           03  ‚c‚V‚S‚Q|•”“X        PIC  X(004).
           03  ‚c‚V‚S‚Q|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚S‚Q|WŒv‰È–Ú    PIC  X(006).
           03  ‚c‚V‚S‚Q|ˆ—‘ÎÛ”NŒŽ
                                     PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|ˆ—ŽÀŽ{“ú  PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|‚m‚d‚sŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|Ï”        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Pƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Qƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Rƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Sƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Tƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Uƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Vƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Wƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚Xƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Oƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Pƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Qƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Rƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Sƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|•½‹ÏŽc‚|“–ŒŽ‚Ì‚P‚Tƒ–ŒŽ‘O•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚S‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚S‚Q|XVŽÒ      PIC  X(008).
