      *****************************************************************
      *   ”z•ªƒ}ƒXƒ^(D743KFH_TBL)
      *****************************************************************
       01  ”z•ªƒ}ƒXƒ^.
           03  ‚c‚V‚S‚R|•”“XƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰ÛŒ³•”“X–¼
                                     PIC  X(040).
           03  ‚c‚V‚S‚R|•Š‰Ûˆ—•”“X‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûˆ—•”“X‹æ•ª–¼
                                     PIC  X(010).
           03  ‚c‚V‚S‚R|•Š‰Ûˆ—•”–å‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûˆ—•”–å‹æ•ª–¼
                                     PIC  X(008).
           03  ‚c‚V‚S‚R|•Š‰Ûˆ—‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚S‚R|•Š‰Ûˆ—‹æ•ª–¼
                                     PIC  X(016).
           03  ‚c‚V‚S‚R|•Š‰ÛðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚S‚R|•Š‰ÛðŒ‹æ•ª–¼
                                     PIC  X(016).
           03  ‚c‚V‚S‚R|Œo‰c”z•ª—¦  PIC S9(001)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|ÝÐ”      PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|à–±•””z•ª—¦
                                     PIC S9(001)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|¤•iŠJ”­•””z•ª—¦
                                     PIC S9(001)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õ”z•ª—¦‚P
                                     PIC S9(001)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õ”z•ª—¦‚Q
                                     PIC S9(001)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õ”z•ª—¦‚R
                                     PIC S9(001)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õ”z•ª—¦‚S
                                     PIC S9(001)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õ”z•ª—¦‚T
                                     PIC S9(001)V9(003) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õŒ”‚P  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õŒ”‚Q  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õŒ”‚R  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õŒ”‚S  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|—\”õŒ”‚T  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|Œ_–ñŒ”    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|–ž—¹Œ”    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|V‹KŒ_–ñŒ³–{Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚U
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚U
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚V
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚V
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚W
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚W
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚X
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚X
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚P‚O
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚P‚O
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚P‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚P‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚P‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚P‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚P‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚P‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚P‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚P‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|Œo‰c‚P‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|Œo‰c‚P‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚U
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚U
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚V
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚V
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚W
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚W
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚X
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚X
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚O
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚O
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚U
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚U
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚V
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚V
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚W
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚W
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚P‚X
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚P‚X
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|ŠÇ—•”–å‚Q‚O
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|ŠÇ—•”–å‚Q‚O
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚U
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚U
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚V
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚V
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚W
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚W
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚X
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚X
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚O
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚O
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚U
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚U
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚V
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚V
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚W
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚W
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚P‚X
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚P‚X
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚Q‚O
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚Q‚O
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚Q‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚Q‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚Q‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚Q‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚Q‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚Q‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚Q‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚Q‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰cŠÇ•”–å‚Q‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰cŠÇ•”–å‚Q‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚U
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚U
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚V
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚V
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚W
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚W
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚X
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚X
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚O
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚O
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚U
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚U
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚V
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚V
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚W
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚W
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚P‚X
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚P‚X
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚O
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚O
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚P
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚P
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚Q
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚Q
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚R
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚R
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚S
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚S
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚T
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚T
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚U
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚U
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚V
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚V
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚W
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚W
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚Q‚X
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚Q‚X
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|•Š‰Ûæ•”“XƒR[ƒh|‰c‹Æ•”–å‚R‚O
                                     PIC  X(004).
           03  ‚c‚V‚S‚R|•Š‰Ûæƒtƒ‰ƒO|‰c‹Æ•”–å‚R‚O
                                     PIC  X(001).
           03  ‚c‚V‚S‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚S‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚S‚R|XVŽÒ      PIC  X(008).
