      *****************************************************************
      *   ¿‹‘”Ô†ŠÇ—(D752SQB_TBL)
      *****************************************************************
       01  ¿‹‘”Ô†ŠÇ—.
           03  ‚c‚V‚T‚Q|¿‹‘”Ô†‚h‚c
                                     PIC  X(008).
           03  ‚c‚V‚T‚Q|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚T‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚T‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚T‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚T‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚T‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚T‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚T‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
