      *****************************************************************
      *   ¿‹‡Œvƒe[ƒuƒ‹(D762SQG_TBL)
      *****************************************************************
       01  ¿‹‡Œvƒe[ƒuƒ‹.
           03  ‚c‚V‚U‚Q|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|¿‹‘“à–¾×˜A”Ô
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|¿‹–¾×‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚U‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚U‚Q|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚U‚Q|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚V‚U‚Q|ƒL[‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚V‚U‚Q|’ŠoŽí•Ê    PIC  X(002).
           03  ‚c‚V‚U‚Q|Äì¬’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚U‚Q|’ •[‹æ•ª    PIC  X(004).
           03  ‚c‚V‚U‚Q|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚U‚Q|”zMæ•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚U‚Q|’ •[‚h‚c    PIC  X(008).
           03  ‚c‚V‚U‚Q|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚V‚U‚Q|¿‹‘ì¬“ú
                                     PIC  X(008).
           03  ‚c‚V‚U‚Q|¿‹‘“àÅ‘å•Å”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|¿‹‘“à–¾×Œ”
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|‡Œv¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|‡Œv—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|‡ŒvÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚PÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚U‚Q|“à–ó‚PÁ”ïÅŒ©o
                                     PIC  X(020).
           03  ‚c‚V‚U‚Q|“à–ó‚P¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚P—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚PÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚QÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚U‚Q|“à–ó‚QÁ”ïÅŒ©o
                                     PIC  X(020).
           03  ‚c‚V‚U‚Q|“à–ó‚Q¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚Q—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚QÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚RÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚U‚Q|“à–ó‚RÁ”ïÅŒ©o
                                     PIC  X(020).
           03  ‚c‚V‚U‚Q|“à–ó‚R¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚R—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚RÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|“à–ó‚SÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚U‚Q|“à–ó‚SÁ”ïÅŒ©o
                                     PIC  X(020).
           03  ‚c‚V‚U‚Q|“à–ó‚S¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|‘—•t‹æ•ª    PIC  X(001).
           03  ‚c‚V‚U‚Q|Žx•¥•û–@    PIC  X(020).
           03  ‚c‚V‚U‚Q|Žx•¥Šú“úˆø—Ž“ú
                                     PIC  X(008).
           03  ‚c‚V‚U‚Q|Žx•¥‹âs‹âs–¼
                                     PIC  X(030).
           03  ‚c‚V‚U‚Q|Žx•¥‹âsŽx“X–¼
                                     PIC  X(030).
           03  ‚c‚V‚U‚Q|—a‹àŽí•Ê    PIC  X(004).
           03  ‚c‚V‚U‚Q|ŒûÀ”Ô†    PIC  X(007).
           03  ‚c‚V‚U‚Q|ŒûÀ–¼‹`l  PIC  X(030).
           03  ‚c‚V‚U‚Q|¿‹æ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚V‚U‚Q|¿‹æZŠ‚P
                                     PIC  X(060).
           03  ‚c‚V‚U‚Q|¿‹æZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚V‚U‚Q|¿‹æZŠ‚R
                                     PIC  X(060).
           03  ‚c‚V‚U‚Q|¿‹æ–¼Ì  PIC  X(080).
           03  ‚c‚V‚U‚Q|¿‹æ•”–å–¼Ì
                                     PIC  X(060).
           03  ‚c‚V‚U‚Q|¿‹æ’S“–ŽÒ–¼
                                     PIC  X(020).
           03  ‚c‚V‚U‚Q|¿‹æUžl–¼
                                     PIC  X(050).
           03  ‚c‚V‚U‚Q|¿‹æ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚V‚U‚Q|Ž©ŽÐ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚V‚U‚Q|Ž©ŽÐZŠ‚P  PIC  X(040).
           03  ‚c‚V‚U‚Q|Ž©ŽÐZŠ‚Q  PIC  X(060).
           03  ‚c‚V‚U‚Q|Ž©ŽÐZŠ‚R  PIC  X(060).
           03  ‚c‚V‚U‚Q|Ž©ŽÐ‘ã•\“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚V‚U‚Q|Ž©ŽÐ’S“–•”
                                     PIC  X(040).
           03  ‚c‚V‚U‚Q|Ž©ŽÐÆ‰ïæ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚V‚U‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚U‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚U‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚U‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚U‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚U‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚U‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚U‚Q|‘ã—‰ñŽû‹ÆŽÒ–¼
                                     PIC  X(030).
           03  ‚c‚V‚U‚Q|‡ŒvŒ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|‡Œv—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚U‚Q|‘Ý‹à‹Æ“o˜^”Ô†
                                     PIC  X(040).
