      *****************************************************************
      *   ŒûUˆÄ“àQ¿‹æ(D771KAS_TBL)
      *****************************************************************
       01  ŒûUˆÄ“à|¿‹æ.
           03  ‚c‚V‚V‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚V‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚V‚P|Ž©“®ˆø—Ž“ú  PIC  X(002).
           03  ‚c‚V‚V‚P|‘—•t‹æ•ª    PIC  X(001).
           03  ‚c‚V‚V‚P|ŒûU‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚V‚P|ŒûUŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚V‚P|ŒûUŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚V‚V‚P|ŒûUŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚V‚V‚P|ŒûU–¼‹`l  PIC  X(030).
           03  ‚c‚V‚V‚P|‹âs–¼      PIC  X(030).
           03  ‚c‚V‚V‚P|Žx“X–¼      PIC  X(030).
           03  ‚c‚V‚V‚P|—a‹àŽí—Þ    PIC  X(004).
           03  ‚c‚V‚V‚P|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚V‚V‚P|ZŠ‚P      PIC  X(060).
           03  ‚c‚V‚V‚P|ZŠ‚Q      PIC  X(060).
           03  ‚c‚V‚V‚P|ZŠ‚R      PIC  X(060).
           03  ‚c‚V‚V‚P|¿‹æ–¼Ì  PIC  X(080).
           03  ‚c‚V‚V‚P|•”–å–¼Ì    PIC  X(060).
           03  ‚c‚V‚V‚P|’S“–ŽÒ–¼Ì  PIC  X(020).
           03  ‚c‚V‚V‚P|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚V‚V‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚V‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚V‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚V‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚V‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚V‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚V‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
