      *****************************************************************
      *   ŒûUˆÄ“àQˆø—Ž‹àŠz(D773KAH_TBL)
      *****************************************************************
       01  ŒûUˆÄ“à|ˆø—Ž‹àŠz.
           03  ‚c‚V‚V‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚V‚R|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚V‚R|ˆø—Ž“ú      PIC  X(008).
           03  ‚c‚V‚V‚R|Œ_–ñŒ”    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚V‚R|ˆø—Ž‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚V‚R|ˆø—ŽŒãŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚V‚R|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚V‚V‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚V‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚V‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚V‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚V‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚V‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚V‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
