      *****************************************************************
      *   Žx•¥æ—š—ðƒ}ƒXƒ^(D783SHR_TBL)
      *****************************************************************
       01  Žx•¥æ—š—ðƒ}ƒXƒ^.
           03  ‚c‚V‚W‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚W‚R|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚R|Žx•¥æ–¼Ì  PIC  X(080).
           03  ‚c‚V‚W‚R|Žx•¥æ’Z–¼Ì
                                     PIC  X(016).
           03  ‚c‚V‚W‚R|•”–å–¼Ì    PIC  X(060).
           03  ‚c‚V‚W‚R|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚V‚W‚R|”[•tæƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚V‚W‚R|ZŠ‚Q      PIC  X(060).
           03  ‚c‚V‚W‚R|ZŠ‚R      PIC  X(060).
           03  ‚c‚V‚W‚R|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚V‚W‚R|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚W‚R|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚V‚W‚R|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚W‚R|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚V‚W‚R|ŒûÀŽí—Þ    PIC  X(001).
           03  ‚c‚V‚W‚R|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚W‚R|–¼‹`l      PIC  X(030).
           03  ‚c‚V‚W‚R|–{“XƒR[ƒh  PIC  X(003).
           03  ‚c‚V‚W‚R|ˆêŠ‡Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚R|XV“úŽž    PIC  X(016).
           03  ‚c‚V‚W‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚W‚R|Žè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚R|•”–åƒJƒi–¼Ì
                                     PIC  X(030).
           03  ‚c‚V‚W‚R|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚W‚R|‘ŠŽEƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚V‚W‚R|ƒRƒƒ“ƒg—“  PIC  X(060).
           03  ‚c‚V‚W‚R|‘O‰ñŽx•¥ƒTƒCƒg
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚R|‘O‰ñXV”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚R|‘OX‰ñŽx•¥ƒTƒCƒg
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚R|‘OX‰ñXV”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚R|‘OXX‰ñŽx•¥ƒTƒCƒg
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚W‚R|‘OXX‰ñXV”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚R|•”‰ÛƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚W‚R|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚W‚R|’n‹æƒuƒƒbƒN
                                     PIC  X(001).
           03  ‚c‚V‚W‚R|•ÛŽç—¿Ž©“®³”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚R|ƒCƒ“ƒ^[ƒKƒCƒhŽ©“®³”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚R|’S“–ŽÒ–¼Ì  PIC  X(020).
           03  ‚c‚V‚W‚R|ZŠ‚P      PIC  X(060).
           03  ‚c‚V‚W‚R|ZŠƒJƒi–¼Ì
                                     PIC  X(060).
           03  ‚c‚V‚W‚R|‚e‚`‚w”Ô†  PIC  X(015).
           03  ‚c‚V‚W‚R|‹x“ú‘Î‰ž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚R|¿‹‘‰ñŽûŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚R|“ü‹àŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚W‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚R|‹Œw“üæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚W‚R|Žd“üÁ”ïÅ–ÆÅ‹æ•ª
                                     PIC S9(001) PACKED-DECIMAL.
