      *****************************************************************
      *   ˆ•ª—š—ð(D811BSR_TBL)
      *****************************************************************
       01  ˆ•ª—š—ð.
           03  ‚c‚W‚P‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚P‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚P|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚P|ˆ•ª˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚W‚P‚P|”„”p——R    PIC  X(002).
           03  ‚c‚W‚P‚P|•ÛŠÇæ      PIC  X(060).
           03  ‚c‚W‚P‚P|ˆ•ª“ú      PIC  X(008).
           03  ‚c‚W‚P‚P|•ÛŠÇ—\’è”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚P|ˆ•ª‹æ•ª    PIC  X(001).
           03  ‚c‚W‚P‚P|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚P‚P|ˆ•ªƒ‹[ƒg  PIC  X(001).
           03  ‚c‚W‚P‚P|\¿ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|\¿ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚P|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|\¿ŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚P|\¿ŽæÁ“ú  PIC  X(008).
           03  ‚c‚W‚P‚P|\¿ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|\¿ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚P|ŒˆÙƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|ŒˆÙˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚P|ŒˆÙƒ‰ƒ“ƒN  PIC  X(001).
           03  ‚c‚W‚P‚P|ŒˆÙ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚P|ŒˆÙŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|³”F‹æ•ª    PIC  X(001).
           03  ‚c‚W‚P‚P|ŒˆÙŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚P|ŒˆÙŽæÁ“ú  PIC  X(008).
           03  ‚c‚W‚P‚P|ŒˆÙŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|ŒˆÙŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚P|Šm’èƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|Šm’èˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚P|Šm’èŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚P|Šm’èŽæÁ“ú  PIC  X(008).
           03  ‚c‚W‚P‚P|Šm’èŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|Šm’èŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚P‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚P‚P|ˆø“næ‹æ•ª  PIC  X(001).
           03  ‚c‚W‚P‚P|ˆøŽæ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚P|ˆøŽæ”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚P|””ï—pÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚P‚P|‰ð–ñ\¿˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚P|‘ã•\•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
