      *****************************************************************
      *   ‹ÆŽíƒ}ƒXƒ^(D833GYS_TBL)
      *****************************************************************
       01  ‹ÆŽíƒ}ƒXƒ^.
           03  ‚c‚W‚R‚R|’é‘‹ÆŽíƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚R‚R|’é‘‹ÆŽí–¼Ì
                                     PIC  X(060).
           03  ‚c‚W‚R‚R|’é‘‹ÆŽíƒJƒi–¼Ì
                                     PIC  X(060).
           03  ‚c‚W‚R‚R|“ú‹â‹ÆŽíƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚W‚R‚R|“ú‹â‹ÆŽí–¼Ì
                                     PIC  X(060).
           03  ‚c‚W‚R‚R|“ú–{ŽY‹Æ•ª—ÞƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚W‚R‚R|“ú–{ŽY‹Æ•ª—Þ–¼Ì
                                     PIC  X(060).
           03  ‚c‚W‚R‚R|‚a‚s‚l‹ÆŽíƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚W‚R‚R|‚a‚s‚l‹ÆŽí–¼Ì
                                     PIC  X(060).
           03  ‚c‚W‚R‚R|—\”õ‚P      PIC  X(007).
           03  ‚c‚W‚R‚R|–¼Ì‚P      PIC  X(060).
           03  ‚c‚W‚R‚R|—\”õ‚Q      PIC  X(007).
           03  ‚c‚W‚R‚R|–¼Ì‚Q      PIC  X(060).
           03  ‚c‚W‚R‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚R‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚R‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚R‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚R‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚R‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚R‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
