      *****************************************************************
      *   ŠÇ——^MŒ_–ñ(D851KRK_TBL)
      *****************************************************************
       01  ŠÇ——^MŒ_–ñ.
           03  ‚c‚W‚T‚P|—^MŠÇ—æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚T‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚T‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚W‚T‚P|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚W‚T‚P|•”‰ÛƒR[ƒh  PIC  X(004).
           03  ‚c‚W‚T‚P|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚W‚T‚P|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚T‚P|Œ_–ñŒ–¼    PIC  X(040).
           03  ‚c‚W‚T‚P|Žæˆø”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚P|Œ_–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚P|ŒŸŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚P|–ž—¹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚P|‘ÎŠOÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘ÎŠOÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘Ý•t‹à•ÊŒû  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘Ý•t‹à•ÊŒûÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|”ñ‰Ò“­Ž‘ŽY  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|’™‘ •i      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|’S•ÛŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚T‚P|M—p•ÛŒ¯‹ž
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|“ü‹à“ú      PIC  X(002).
           03  ‚c‚W‚T‚P|ŠJŽn‰ñ”    PIC  X(001).
           03  ‚c‚W‚T‚P|–¾×Žx•¥‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|ŒvŽZ•ûŽ®    PIC  X(001).
           03  ‚c‚W‚T‚P|¿‹ƒTƒCƒNƒ‹
                                     PIC  X(002).
           03  ‚c‚W‚T‚P|‰„‘ØŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚W‚T‚P|Ž•”²ƒtƒ‰ƒO‚P
                                     PIC  X(002).
           03  ‚c‚W‚T‚P|Ž•”²ƒtƒ‰ƒO‚Q
                                     PIC  X(002).
           03  ‚c‚W‚T‚P|Žc‰¿Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|ŒŽŠ„‚k—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|–ñ•Ù‹æ•ª    PIC  X(001).
           03  ‚c‚W‚T‚P|Ž–ŒÌÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|Ž–ŒÌÂŒ ŽcÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|Ž–ŒÌŒ³–{Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|“–ŒŽ––ÂŒ Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|“–ŒŽ––Œ³–{Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‚m“–ŒŽ––ÂŒ Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‚m“–ŒŽ––Œ³–{Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|–¢ŽûŒ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|–¢Žû—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|–¢’¥Žû‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‚a–¢’¥Žû‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|”„‹p‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|ŒÅ’è—˜—¦    PIC S9(003)V9(008) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‹à—˜•Ï“®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚T‚P|ƒXƒvƒŒƒbƒh  PIC S9(003)V9(008) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|˜A“®‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚T‚P|”õl        PIC  X(040).
           03  ‚c‚W‚T‚P|‘ÎŠOŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––‘ÎŠOÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––‘ÎŠOÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––‘ÎŠOŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––‘Ý•t‹à•ÊŒû
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––‘Ý•t‹à•ÊŒûÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––”ñ‰Ò“­Ž‘ŽY
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‘OŒŽ––’™‘ •i
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚W‚T‚P|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚W‚T‚P|”Û”F‹æ•ª    PIC  X(001).
           03  ‚c‚W‚T‚P|“–ŒŽ––ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚T‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚T‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
