      *****************************************************************
      *   ŠÇ——^Mó‹µ(D855KJO_TBL)
      *****************************************************************
       01  ŠÇ——^Mó‹µ.
           03  ‚c‚W‚T‚T|—^MŠÇ—æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚T‚T|ó‹µŽ¯•Ê‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚T‚T|˜A”Ô        PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚T‚T|”NŒŽ“ú      PIC  X(008).
           03  ‚c‚W‚T‚T|ó‹µ“à—e    PIC  X(200).
           03  ‚c‚W‚T‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚T‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚T‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
