      *****************************************************************
      *   “Á’è—^Mæ(D857TKY_TBL)
      *****************************************************************
       01  “Á’è—^Mæ.
           03  ‚c‚W‚T‚V|—^MŠÇ—æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚T‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚T‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚T‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
