      *****************************************************************
      *   ŠÇ——^M(D85KRY_TBL)
      *****************************************************************
       01  ŠÇ——^M.
           03  ‚c‚W‚T|—^MŠÇ—æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚T|—^MŠÇ—æ–¼  PIC  X(080).
           03  ‚c‚W‚T|ŽåŠÇ•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚W‚T|Â–±ŽÒŠi•t    PIC  X(003).
           03  ‚c‚W‚T|Ž©“®—^M‹æ•ª  PIC  X(001).
           03  ‚c‚W‚T|‰ð–ñ——R      PIC  X(002).
           03  ‚c‚W‚T|Ž–ŒÌ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚W‚T|‰ð–ñ‹æ•ª      PIC  X(001).
           03  ‚c‚W‚T|‘ÎŠOÂŒ Žc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|‘ÎŠOÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|‘OŽó‹àŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|‘Ý•t‹à•ÊŒû    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|‘Ý•t‹à•ÊŒûÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|”ñ‰Ò“­Ž‘ŽY    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|’™‘ •i        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|M—p•ÛŒ¯‹ž  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|‹ž“ü‹àî•ñ  PIC  X(001).
           03  ‚c‚W‚T|‘Ý“|ˆø“–‹à—LÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|‘Ý“|ˆø“–‹à–³Å
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|Žc‚’²®Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|‘OŒŽ––’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚W‚T|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚W‚T|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚W‚T|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚W‚T|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚W‚T|XVŽÒ        PIC  X(008).
           03  ‚c‚W‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
