      *****************************************************************
      *   ŒûU—\’èƒf[ƒ^(D88KUF_TBL)
      *****************************************************************
       01  ŒûU—\’èƒf[ƒ^.
           03  ‚c‚W‚W|U‘Ö‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚W‚W|–ñ’è“ú        PIC  X(008).
           03  ‚c‚W‚W|–¾×˜A”Ô      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚W‚W|˜A”Ô          PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚W‚W|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚W‚W|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚W|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚W‚W|¿‹‹æ•ª      PIC  X(001).
           03  ‚c‚W‚W|¿‹˜A”Ô      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚W‚W|¿‹‰ñ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚W|ŠúŠÔ          PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚W|‹àŠz          PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚W|Á”ïÅŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚W|‡Œv‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚W|Á”ïÅ—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚W‚W|Œ_–ñŒ–¼      PIC  X(040).
           03  ‚c‚W‚W|¿‹‘”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚W‚W|V‹KƒR[ƒh    PIC  X(001).
           03  ‚c‚W‚W|“Á•Ê¿‹‹æ•ª  PIC  X(001).
           03  ‚c‚W‚W|ƒf[ƒ^•ÏXƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚W‚W|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚W‚W|—˜‘§¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚W‚W|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚W‚W|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚W‚W|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚W‚W|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚W‚W|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚W‚W|XVŽÒ        PIC  X(008).
           03  ‚c‚W‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
