      *****************************************************************
      *   ŒŽŽŸÂŒ î•ñ—š—ð(D917SJR_TBL)
      *****************************************************************
       01  ŒŽŽŸÂŒ î•ñ—š—ð.
           03  ‚c‚X‚P‚V|ƒŒƒR[ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚X‚P‚V|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚X‚P‚V|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|ŒŽŽŸ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚V|ŠúŽñ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚V|Šú––”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚V|“–“ú”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚V|ÂŒ Žc‚‹æ•ª
                                     PIC  X(002).
           03  ‚c‚X‚P‚V|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚V|Œ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚V|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚X‚P‚V|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚V|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚X‚P‚V|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚X‚P‚V|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚V|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚V|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚X‚P‚V|¿‹æŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚V|Œ_–ñæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚V|Žx•¥ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚X‚P‚V|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚V|Â–±‹¦’²‹æ•ª
                                     PIC  X(002).
           03  ‚c‚X‚P‚V|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚V|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚V|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚X‚P‚V|’S•Û‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚V|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚V|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚V|Á”ïÅ‹æ•ª  PIC  X(002).
           03  ‚c‚X‚P‚V|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚X‚P‚V|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ•ª¿‹‰ñ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|¬–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚V|¬–ñ”NŒŽ    PIC  X(006).
           03  ‚c‚X‚P‚V|¬–ñŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚V|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚V|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|ŒŸŽûŽæÁ“ú  PIC  X(008).
           03  ‚c‚X‚P‚V|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|ŒŸŽûŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚V|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚V|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚V|Œ_–ñ“ú      PIC  X(008).
           03  ‚c‚X‚P‚V|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚X‚P‚V|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚X‚P‚V|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚V|‘OŽóƒŠ[ƒX—¿“ü‹à“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|“ü‹à“ú      PIC  X(008).
           03  ‚c‚X‚P‚V|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|—¬“®‰»æ    PIC  X(007).
           03  ‚c‚X‚P‚V|”Û”F‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚V|˜’uŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŽó[“–ŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚X‚P‚V|‘OŽó[“–ŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|‘OŽó[“–ŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŽó[“–”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|‘OŽó[“–ÏŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‰‰ñ‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|ÅI‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚X‚P‚V|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ_–ñ‹àŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ_–ñ‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ_–ñ‹àŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘O•¥‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘O•¥‹àŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘O•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘O•¥‹àŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ³–{‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ³–{‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|—˜‘§‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|—˜‘§‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|””ï—p‘Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|””ï—p‘ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|ŒÅ’èŽ‘ŽYÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“®‘•ÛŒ¯—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Žx•¥—˜‘§“K—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Žx•¥—˜‘§ˆê”Ê‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|ˆÏ‘õ•ÛŽç—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ_–ñÏ–¢ŒŸŽû‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Œ_–ñÏ–¢ŒŸŽûÁ”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|ŒˆÙÏ–¢¬–ñ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|ŒˆÙÏ–¢¬–ñÁ”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Žc‰¿‹æ•ª    PIC  X(001).
           03  ‚c‚X‚P‚V|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|ÅžŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|ÅžŽc‰¿Ý’èŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|M—p•ÛŒ¯—¿Žc‚‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|M—p•ÛŒ¯—¿Žc‚Á”ïÅ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãÁ”ïÅŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽóŒvãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽóŒvãŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽóŒvãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽóŒvãŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãŽ©ŽÐŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãŽ©ŽÐ—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvã””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvã””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvã“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒvãˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––”NŒŽ  PIC  X(006).
           03  ‚c‚X‚P‚V|‘OŠú––¿‹‰ñ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––ÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––Á”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–––ñ’èÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–––ñ’èÁ”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––‘OŽó‹àŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––‘OŽó‹àÁ”ïÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––‘OŽó‹àÁ”ïÅŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–––ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–––ñ’è—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––ŽÀŽ¿Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––”„ãŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––”„ãŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––””ï—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––””ï—pŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––Š„•ŠŒ´‰¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––Š„•ŠŒ´‰¿Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰vŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––ŒÅ’èŽ‘ŽYÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––“®‘•ÛŒ¯—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––Žx•¥—˜‘§“K—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––Žx•¥—˜‘§ˆê”ÊŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––ˆÏ‘õ•ÛŽç—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú––”„ã—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜Á”ïÅ‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜ŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜ŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜ŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜Žx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜Žx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜ˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŠú–˜”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‰ñŽûŽÀÑŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‰ñŽûŽÀÑŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‰ñŽûŽÀÑŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‰ñŽûŽÀÑŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŠúŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŠúŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŠúŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŠúŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŠúŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŠúˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–Šú”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––ÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––Á”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–––ñ’èÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––‘OŽó‹àŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––‘OŽó‹àÁ”ïÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––‘OŽó‹àÁ”ïÅŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–––ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–––ñ’è—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––ŽÀŽ¿Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––”„ãŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––”„ãŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––””ï—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––””ï—pŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––Š„•ŠŒ´‰¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––Š„•ŠŒ´‰¿Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰vŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––ŒÅ’èŽ‘ŽYÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––“®‘•ÛŒ¯—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––Žx•¥—˜‘§“K—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––Žx•¥—˜‘§ˆê”ÊŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––ˆÏ‘õ•ÛŽç—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ––”„ã—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜Á”ïÅ‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜ŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜ŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜ŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜Žx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜Žx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜ˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜ŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|‘OŒŽ–˜ŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––ÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––ÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––Á”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––Á”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–––ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–––ñ’èÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–––ñ’èÁ”ïÅÂŒ Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––‘OŽó‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––‘OŽó‹àŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––‘OŽó‹àÁ”ïÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––‘OŽó‹àÁ”ïÅŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–––ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–––ñ’è—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––ŽÀŽ¿Œ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––ŽÀŽ¿—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––”„ãŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––”„ãŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––””ï—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––””ï—pŽc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––Š„•ŠŒ´‰¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––Š„•ŠŒ´‰¿Žc‚Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––Š„•ŠŒ´‰¿–¢ŽÀŒ»—˜‰vŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––ŒÅ’èŽ‘ŽYÅŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––“®‘•ÛŒ¯—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––Žx•¥—˜‘§“K—pŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––Žx•¥—˜‘§ˆê”ÊŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––ˆÏ‘õ•ÛŽç—¿Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––”„ã—˜‘§Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ––‘OŽóŽû‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–––¢ŽûŽû‰v
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜Á”ïÅ‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜ŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜ŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜””ï—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜ŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜Žx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜Žx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜ˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜ŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–˜ŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‰ñŽûŽÀÑŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‰ñŽûŽÀÑŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‰ñŽûŽÀÑŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‰ñŽûŽÀÑŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‰ñŽû—\’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‰ñŽû—\’èŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‰ñŽû—\’èŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‰ñŽû—\’èŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽó‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽó‰ñŽûŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽó‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽó‰ñŽûŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–¢’¥Žû‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–¢’¥Žû‹àŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–¢’¥Žû‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–¢’¥Žû‹àÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–ñ’èŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–ñ’è—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽÀŽ¿Œ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽÀŽ¿—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–¢’¥ŽûŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–¢’¥Žû—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ””ï—pŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‹à—ZŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‹à—ZŒ³–{Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‹à—Z—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‹à—Z—˜‘§Ž©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽÁ”ïÅ’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽÁ”ïÅ’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–ñ’è’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–ñ’è’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–ñ’è’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–ñ’è’²®ŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽó’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽó’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽó’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‘OŽó’²®ŠzÁ”ïÅŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–ñ’èŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ–ñ’è—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽÀŽ¿Œ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽÀŽ¿—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ”„ã’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ”„ã’²®ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ””ï—p’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ””ï—p’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‹à—ZŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‹à—ZŒ³–{’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‹à—Z—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ‹à—Z—˜‘§’²®ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŒÅ’èŽ‘ŽYÅ’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ“®‘•ÛŒ¯—¿’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽx•¥—˜‘§’²®Šz“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽŽx•¥—˜‘§’²®Šzˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽˆÏ‘õ•ÛŽç—¿’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ”„ãŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“–ŒŽ”„ã—˜‘§’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚X‚P‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚P‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚X‚P‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚P‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚P‚V|XVŽÒ      PIC  X(008).
