      *****************************************************************
      *   信用保険料率パターンマスタ(D95SHP_TBL)
      *****************************************************************
       01  信用保険料率パターンマスタ.
           03  Ｄ９５－主契約区分    PIC  X(001).
           03  Ｄ９５－信用保険料率パターン
                                     PIC  X(001).
           03  Ｄ９５－保険期間      PIC S9(003) PACKED-DECIMAL.
           03  Ｄ９５－適用開始日    PIC  X(008).
           03  Ｄ９５－料率          PIC S9(002)V9(008) PACKED-DECIMAL.
           03  Ｄ９５－更新年月日    PIC  X(008).
           03  Ｄ９５－更新時間      PIC  X(008).
           03  Ｄ９５－更新者        PIC  X(008).
           03  Ｄ９５－入力担当者コード
                                     PIC  X(008).
           03  Ｄ９５－登録年月日    PIC  X(008).
           03  Ｄ９５－登録時間      PIC  X(008).
           03  Ｄ９５－登録担当者    PIC  X(008).
