      *****************************************************************
      *   Œ©Ï”Ô†(D997MTB_TBL)
      *****************************************************************
       01  Œ©Ï”Ô†.
           03  ‚c‚X‚X‚V|ƒT[ƒo”Ô†  PIC  X(002).
           03  ‚c‚X‚X‚V|ÅVŒ©Ï”Ô†
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚X‚X‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚X‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚X‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚X‚X‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚X‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚X‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚X‚V|“o˜^’S“–ŽÒ  PIC  X(008).
