      *****************************************************************
      *   ‚e‚aƒwƒbƒ_[ƒŒƒR[ƒhƒe[ƒuƒ‹(D99FBH_TBL)
      *****************************************************************
       01  ‚e‚aƒwƒbƒ_[ƒŒƒR[ƒhƒe[ƒuƒ‹.
           03  ‚c‚X‚X|Ží•ÊƒR[ƒh    PIC  X(002).
           03  ‚c‚X‚X|ì¬“ú        PIC  X(006).
           03  ‚c‚X‚X|Š¨’è“ú|Ž©    PIC  X(006).
           03  ‚c‚X‚X|Š¨’è“ú|ŽŠ    PIC  X(006).
           03  ‚c‚X‚X|‹âsƒR[ƒh    PIC  X(004).
           03  ‚c‚X‚X|Žx“XƒR[ƒh    PIC  X(003).
           03  ‚c‚X‚X|—a‹àŽí–Ú      PIC  X(001).
           03  ‚c‚X‚X|ŒûÀ”Ô†      PIC  X(010).
           03  ‚c‚X‚X|ŒûÀ–¼        PIC  X(040).
           03  ‚c‚X‚X|Žæˆø‘OŽc‚    PIC  X(014).
           03  ‚c‚X‚X|Žx“X–¼        PIC  X(015).
           03  ‚c‚X‚X|‹âs–¼        PIC  X(015).
           03  ‚c‚X‚X|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚X‚X|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚X‚X|XVŽÒ        PIC  X(008).
           03  ‚c‚X‚X|Æ‰ï”Ô†      PIC  X(006).
           03  ‚c‚X‚X|UžˆË—Šl–¼  PIC  X(048).
           03  ‚c‚X‚X|ŽdŒü‹âs–¼    PIC  X(015).
           03  ‚c‚X‚X|ŽdŒüŽx“X–¼    PIC  X(015).
           03  ‚c‚X‚X|Žæˆø‹àŠz      PIC  X(010).
           03  ‚c‚X‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚X|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚X‚X|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚X‚X|“o˜^’S“–ŽÒ    PIC  X(008).
