000010*****************************************************************
000020*   Ž‘ŽYî•ñ‚c‚aƒ_ƒ~[(D99XXX_TBL)
000030*****************************************************************
000040 01  Ž‘ŽYî•ñ.
000050     03  ‚c‚X‚X|Œ_–ñ”Ô†             PIC  X(010).
000060     03  ‚c‚X‚X|Œ_–ñŽí—Þ             PIC  X(003).
000070     03  ‚c‚X‚X|•¨Œ”Ô†             PIC S9(004) PACKED-DECIMAL.
000080     03  ‚c‚X‚X|‰ïŽÐ—˜_|‘OŠú––•ë‰¿ PIC S9(013) PACKED-DECIMAL.
000090     03  ‚c‚X‚X|‰ïŽÐ—˜_|“–Šúž‹p”ï PIC S9(013) PACKED-DECIMAL.
000100     03  ‚c‚X‚X|‰ïŽÐ—˜_|‰ð–ñŽž•ë‰¿ PIC S9(013) PACKED-DECIMAL.
