000010************************************************
000020* (DFS_ERRLST)
000030************************************************
000040 01  DFS_ERRLST-DATTYP PIC  X(001).
000050 01  DFS_ERRLST-BNKCOD PIC  X(004).
000060 01  DFS_ERRLST-BNKNAM PIC  X(015).
000070 01  DFS_ERRLST-BRCCOD PIC  X(003).
000080 01  DFS_ERRLST-BRCNAM PIC  X(015).
000090 01  DFS_ERRLST-PAYDAY PIC  X(004).
000100 01  DFS_ERRLST-DEPKND PIC  X(001).
000110 01  DFS_ERRLST-DEPNUM PIC  X(007).
000120 01  DFS_ERRLST-CSTNAM PIC  X(030).
000130 01  DFS_ERRLST-TRNAMT PIC S9(010) COMP-3.
000140 01  DFS_ERRLST-TRNTYP PIC  X(001).
000150 01  DFS_ERRLST-PAYNUM PIC  X(008).
000160 01  DFS_ERRLST-CSTNUM PIC  X(012).
000170 01  DFS_ERRLST-RESULT PIC  X(001).
000180 01  DFS_ERRLST-CONTAX PIC S9(008) COMP-3.
000190 01  DFS_ERRLST-REGDAY PIC  X(008).
000200 01  DFS_ERRLST-REGTIM PIC  X(006).
000210 01  DFS_ERRLST-REGPSN PIC  X(004).
000220 01  DFS_ERRLST-MODDAY PIC  X(008).
000230 01  DFS_ERRLST-MODTIM PIC  X(006).
000240 01  DFS_ERRLST-MODPSN PIC  X(004).
000250 01  DFS_ERRLST-ERRFLG PIC  X(005).
000260 01  DFS_ERRLST-DBLFLG PIC  X(001).
