000010************************************************
000020* (DFS_DATREC)
000030************************************************
000040 01  DFS_DATREC-DATTYP PIC  X(001).
000050 01  DFS_DATREC-BNKCOD PIC  X(004).
000060 01  DFS_DATREC-BNKNAM PIC  X(015).
000070 01  DFS_DATREC-BRCCOD PIC  X(003).
000080 01  DFS_DATREC-BRCNAM PIC  X(015).
000090 01  DFS_DATREC-PAYDAY PIC  X(004).
000100 01  DFS_DATREC-DEPKND PIC  X(001).
000110 01  DFS_DATREC-DEPNUM PIC  X(007).
000120 01  DFS_DATREC-CSTNAM PIC  X(030).
000130 01  DFS_DATREC-TRNAMT PIC S9(010) COMP-3.
000140 01  DFS_DATREC-TRNTYP PIC  X(001).
000150 01  DFS_DATREC-PAYNUM PIC  X(008).
000160 01  DFS_DATREC-CSTNUM PIC  X(012).
000170 01  DFS_DATREC-RESULT PIC  X(001).
000180 01  DFS_DATREC-CONTAX PIC S9(008) COMP-3.
000190 01  DFS_DATREC-REGDAY PIC  X(008).
000200 01  DFS_DATREC-REGTIM PIC  X(006).
000210 01  DFS_DATREC-REGPSN PIC  X(004).
000220 01  DFS_DATREC-MODDAY PIC  X(008).
000230 01  DFS_DATREC-MODTIM PIC  X(006).
000240 01  DFS_DATREC-MODPSN PIC  X(004).
000250 01  DFS_DATREC-ERRFLG PIC  X(005).
000260 01  DFS_DATREC-DBLFLG PIC  X(001).
