000010************************************************
000020* (DFS_JOBCHK)
000030************************************************
000040 01  DFS_JOBCHK-OPEDAY PIC  X(004).
000050 01  DFS_JOBCHK-PAYDAY PIC  X(004).
000060 01  DFS_JOBCHK-GETTXT PIC  X(001).
000070 01  DFS_JOBCHK-DATMAK PIC  X(001).
000080 01  DFS_JOBCHK-LSTPRT PIC  X(001).
000090 01  DFS_JOBCHK-PUTFDD PIC  X(001).
000100 01  DFS_JOBCHK-SNDDAT PIC  X(001).
