000010************************************************
000020* (DFS_CNVMST)
000030************************************************
000040 01  DFS_CNVMST-PAYNUM PIC  X(008).
000050 01  DFS_CNVMST-CSTNAM PIC  X(030).
000060 01  DFS_CNVMST-REGDAY PIC  X(008).
000070 01  DFS_CNVMST-REGTIM PIC  X(006).
000080 01  DFS_CNVMST-REGPSN PIC  X(004).
000090 01  DFS_CNVMST-MODDAY PIC  X(008).
000100 01  DFS_CNVMST-MODTIM PIC  X(006).
000110 01  DFS_CNVMST-MODPSN PIC  X(004).
