000010************************************************
000020* (ELP_LONPAY)
000030************************************************
000040 01  ELP_LONPAY-LONNUM PIC  X(005).
000050 01  ELP_LONPAY-LONTYP PIC  X(001).
000060 01  ELP_LONPAY-DIVCOD PIC  X(004).
000070 01  ELP_LONPAY-PSNCOD PIC  X(007).
000080 01  ELP_LONPAY-RECNUM PIC  X(004).
000090 01  ELP_LONPAY-PAYDAY PIC  X(008).
000100 01  ELP_LONPAY-SALAMT PIC S9(013) COMP-3.
000110 01  ELP_LONPAY-SALINT PIC S9(013) COMP-3.
000120 01  ELP_LONPAY-SALCAP PIC S9(013) COMP-3.
000130 01  ELP_LONPAY-SALBAL PIC S9(013) COMP-3.
000140 01  ELP_LONPAY-BNSAMT PIC S9(013) COMP-3.
000150 01  ELP_LONPAY-BNSINT PIC S9(013) COMP-3.
000160 01  ELP_LONPAY-BNSCAP PIC S9(013) COMP-3.
000170 01  ELP_LONPAY-BNSBAL PIC S9(013) COMP-3.
000180 01  ELP_LONPAY-TOTBAL PIC S9(013) COMP-3.
