000010************************************************
000020* (ELP_LONMST)
000030************************************************
000040 01  ELP_LONMST-LONNUM PIC  X(005).
000050 01  ELP_LONMST-LONTYP PIC  X(001).
000060 01  ELP_LONMST-DIVCOD PIC  X(004).
000070 01  ELP_LONMST-PSNCOD PIC  X(007).
000080 01  ELP_LONMST-PSNNAM PIC  X(018).
000090 01  ELP_LONMST-LONDAY PIC  X(008).
000100 01  ELP_LONMST-REPDAY PIC  X(008).
000110 01  ELP_LONMST-OBJCOD PIC  X(001).
000120 01  ELP_LONMST-LONTRM PIC S9(003) COMP-3.
000130 01  ELP_LONMST-FRZTRM PIC S9(003) COMP-3.
000140 01  ELP_LONMST-LONAMT PIC S9(013) COMP-3.
000150 01  ELP_LONMST-INTRAT PIC S9(002)V9(6) COMP-3.
000160 01  ELP_LONMST-SALAMT PIC S9(013) COMP-3.
000170 01  ELP_LONMST-SALINT PIC S9(013) COMP-3.
000180 01  ELP_LONMST-SALCAP PIC S9(013) COMP-3.
000190 01  ELP_LONMST-SALBAL PIC S9(013) COMP-3.
000200 01  ELP_LONMST-SALREP PIC S9(013) COMP-3.
000210 01  ELP_LONMST-BNSAMT PIC S9(013) COMP-3.
000220 01  ELP_LONMST-BNSINT PIC S9(013) COMP-3.
000230 01  ELP_LONMST-BNSCAP PIC S9(013) COMP-3.
000240 01  ELP_LONMST-BNSBAL PIC S9(013) COMP-3.
000250 01  ELP_LONMST-BNSREP PIC S9(013) COMP-3.
000260 01  ELP_LONMST-DLYINT PIC S9(013) COMP-3.
000270 01  ELP_LONMST-REMARK PIC  X(040).
000280 01  ELP_LONMST-REGDAY PIC  X(008).
000290 01  ELP_LONMST-REGTIM PIC  X(006).
000300 01  ELP_LONMST-REGPSN PIC  X(004).
000310 01  ELP_LONMST-MODDAY PIC  X(008).
000320 01  ELP_LONMST-MODTIM PIC  X(006).
000330 01  ELP_LONMST-MODPSN PIC  X(004).
