000010************************************************
000020* (EMC_JUSYO)
000030************************************************
000040 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000060 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000070 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|—X•Ö”Ô† PIC  X(007).
000080 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|ZŠ‚P PIC  X(040).
000090 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|ZŠ‚Q PIC  X(040).
000100 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|Žæˆøæ–¼ PIC  X(040).
000110 01  ‚d‚l‚b|‚i‚t‚r‚x‚n|•”–¼ PIC  X(040).
