000010************************************************
000020* (EMC_WK_LIST)
000030************************************************
000040 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|¿‹ƒR[ƒh PIC  X(002).
000060 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|•¨Œ‚m‚n PIC  X(004).
000070 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000080 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|¿‹æƒR[ƒh PIC  X(008).
000100 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|‹âs’ZkƒR[ƒh PIC  X(002).
000110 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|‹âsƒR[ƒh PIC  X(004).
000120 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|Žx“XƒR[ƒh PIC  X(003).
000130 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|–¼Ì‚P PIC  X(040).
000140 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|–¼Ì‚Q PIC  X(040).
000150 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|•ÛŽç—¿ PIC S9(013) COMP-3.
000160 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|ƒŠƒtƒ@ƒŒƒ“ƒX‚P PIC  X(012).
000170 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|ƒŠƒtƒ@ƒŒƒ“ƒX‚Q PIC  X(012).
000180 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|ƒŠƒtƒ@ƒŒƒ“ƒX‚R PIC  X(012).
000190 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|ƒŠƒtƒ@ƒŒƒ“ƒX‚S PIC  X(012).
000200 01  ‚d‚l‚b|‚v‚j|‚k‚h‚r‚s|ƒƒbƒZ[ƒW PIC  X(050).
