000010************************************************
000020* (EXP_SIMPOF)
000030************************************************
000040 01  EXP_SIMPOF-TRNNUM PIC  X(004).
000050 01  EXP_SIMPOF-EXTNUM PIC  X(002).
000060 01  EXP_SIMPOF-DIVCOD PIC  X(004).
000070 01  EXP_SIMPOF-CNTNUM PIC  X(007).
000080 01  EXP_SIMPOF-PAYDAY PIC  X(008).
000090 01  EXP_SIMPOF-PAYBGN PIC  X(006).
000100 01  EXP_SIMPOF-PAYEND PIC  X(006).
000110 01  EXP_SIMPOF-FIXDAY PIC  X(002).
000120 01  EXP_SIMPOF-FISYER PIC  X(004).
000130 01  EXP_SIMPOF-ACCCOD PIC  X(005).
000140 01  EXP_SIMPOF-ACCEXT PIC  X(002).
000150 01  EXP_SIMPOF-PAYTYP PIC  X(001).
000160 01  EXP_SIMPOF-PAYCYC PIC  X(002).
000170 01  EXP_SIMPOF-CLTCOD PIC  X(008).
000180 01  EXP_SIMPOF-FRMNAM PIC  X(050).
000190 01  EXP_SIMPOF-ITMNAM PIC  X(050).
000200 01  EXP_SIMPOF-DEMFLG PIC  X(001).
000210 01  EXP_SIMPOF-RCVFLG PIC  X(001).
000220 01  EXP_SIMPOF-PAYCNT PIC S9(003) COMP-3.
000230 01  EXP_SIMPOF-PAYAMT PIC S9(013) COMP-3.
