000010************************************************
000020* (EXP_SIMAUT)
000030************************************************
000040 01  EXP_SIMAUT-TRNNUM PIC  X(004).
000050 01  EXP_SIMAUT-EXTNUM PIC  X(002).
000060 01  EXP_SIMAUT-DIVCOD PIC  X(004).
000070 01  EXP_SIMAUT-CNTNUM PIC  X(007).
000080 01  EXP_SIMAUT-PAYDAY PIC  X(008).
000090 01  EXP_SIMAUT-PAYBGN PIC  X(006).
000100 01  EXP_SIMAUT-PAYEND PIC  X(006).
000110 01  EXP_SIMAUT-FIXDAY PIC  X(002).
000120 01  EXP_SIMAUT-FISYER PIC  X(004).
000130 01  EXP_SIMAUT-ACCCOD PIC  X(005).
000140 01  EXP_SIMAUT-ACCEXT PIC  X(002).
000150 01  EXP_SIMAUT-PAYTYP PIC  X(001).
000160 01  EXP_SIMAUT-PAYCYC PIC  X(002).
000170 01  EXP_SIMAUT-CLTCOD PIC  X(008).
000180 01  EXP_SIMAUT-FRMNAM PIC  X(050).
000190 01  EXP_SIMAUT-ITMNAM PIC  X(050).
000200 01  EXP_SIMAUT-DEMFLG PIC  X(001).
000210 01  EXP_SIMAUT-RCVFLG PIC  X(001).
000220 01  EXP_SIMAUT-PAYCNT PIC S9(003) COMP-3.
000230 01  EXP_SIMAUT-PAYAMT PIC S9(013) COMP-3.
