000010************************************************
000020* (EXP_SIMADD)
000030************************************************
000040 01  EXP_SIMADD-TRNNUM PIC  X(004).
000050 01  EXP_SIMADD-EXTNUM PIC  X(002).
000060 01  EXP_SIMADD-DIVCOD PIC  X(004).
000070 01  EXP_SIMADD-CNTNUM PIC  X(007).
000080 01  EXP_SIMADD-PAYDAY PIC  X(008).
000090 01  EXP_SIMADD-PAYBGN PIC  X(006).
000100 01  EXP_SIMADD-PAYEND PIC  X(006).
000110 01  EXP_SIMADD-FIXDAY PIC  X(002).
000120 01  EXP_SIMADD-FISYER PIC  X(004).
000130 01  EXP_SIMADD-ACCCOD PIC  X(005).
000140 01  EXP_SIMADD-ACCEXT PIC  X(002).
000150 01  EXP_SIMADD-PAYTYP PIC  X(001).
000160 01  EXP_SIMADD-PAYCYC PIC  X(002).
000170 01  EXP_SIMADD-CLTCOD PIC  X(008).
000180 01  EXP_SIMADD-FRMNAM PIC  X(050).
000190 01  EXP_SIMADD-ITMNAM PIC  X(050).
000200 01  EXP_SIMADD-DEMFLG PIC  X(001).
000210 01  EXP_SIMADD-RCVFLG PIC  X(001).
000220 01  EXP_SIMADD-PAYCNT PIC S9(003) COMP-3.
000230 01  EXP_SIMADD-PAYAMT PIC S9(013) COMP-3.
