000010************************************************
000020* (EXT_PRTWRK)
000030************************************************
000040 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•tæƒR[ƒh PIC  X(006).
000050 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•tæ–¼ PIC  X(020).
000060 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|‹âsƒR[ƒh PIC  X(004).
000070 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|‹âs–¼ PIC  X(030).
000080 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|‹âs–¼ƒJƒi PIC  X(015).
000090 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|•ñž‹à‹æ•ª PIC  X(001).
000100 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t•û–@ PIC  X(001).
000110 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|Ž©“®ˆø—Ž PIC  X(001).
000120 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•tŠúŒÀ‚P PIC  X(008).
000130 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•tŠúŒÀ‚Q PIC  X(008).
000140 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•tŠúŒÀ‚R PIC  X(008).
000150 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•tŠúŒÀ‚S PIC  X(008).
000160 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t“ú‚P PIC  X(008).
000170 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t“ú‚Q PIC  X(008).
000180 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t“ú‚R PIC  X(008).
000190 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t“ú‚S PIC  X(008).
000200 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|•ñž‹à“ü‹à“ú PIC  X(008).
000210 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|Šî€”N PIC  X(004).
000220 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|•s“®ŽYÅ‹æ•ª PIC  X(001).
000230 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|ˆ—‹æ•ª PIC  X(001).
000240 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|ì‹Æ‹æ•ª PIC  X(002).
000250 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|XV•WŽ¯ PIC  X(001).
000260 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|Å—¦ PIC S9(001)V9(3) COMP-3.
000270 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|‰ÛÅ•W€Šz PIC S9(013) COMP-3.
000280 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|ÅŠz PIC S9(013) COMP-3.
000290 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|•ñž‹à PIC S9(013) COMP-3.
000300 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t‹àŠz‚P PIC S9(013) COMP-3.
000310 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t‹àŠz‚Q PIC S9(013) COMP-3.
000320 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t‹àŠz‚R PIC S9(013) COMP-3.
000330 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|”[•t‹àŠz‚S PIC S9(013) COMP-3.
000340 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|•s“®ŽYÅŠz PIC S9(013) COMP-3.
000350 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|•s“®ŽYÅ•ñž‹à PIC S9(013) COMP-3.
000360 01  ‚d‚w‚s|‚o‚q‚s‚v‚q‚j|•ªŠ„”[•tŒÀ“x PIC S9(013) COMP-3.
