000010************************************************
000020* (FCT_KIHON)
000030************************************************
000040 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(007).
000050 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ƒf[ƒ^‹æ•ª PIC  X(001).
000060 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000070 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000080 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000090 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‹Æ–±‹æ•ª PIC  X(001).
000100 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000110 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŒÚ‹q–¼Ì PIC  X(060).
000120 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000130 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Žæˆøæ‹æ•ª PIC  X(001).
000140 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|’S“–ŽÒ–¼ PIC  X(020).
000160 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000170 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|”ƒŽæ—\’è“ú PIC  X(008).
000180 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|”ƒŽæ‘ã‹àŽx•¥“ú PIC  X(008).
000190 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Šz–Ê‹àŠz‡Œv PIC S9(013) COMP-3.
000200 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|”ƒŽæ‹àŠz‡Œv PIC S9(013) COMP-3.
000210 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Žx•¥•ÛØ‹àŠz‡Œv PIC S9(013) COMP-3.
000220 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Š„ˆø—¿‡Œv PIC S9(013) COMP-3.
000230 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŽóŽæŽè”—¿‡Œv PIC S9(013) COMP-3.
000240 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŽóŽæŽè”—¿Á”ïÅ“™Šz‡Œv 
                                             PIC S9(013) COMP-3.
000250 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|–ß‚µ—˜‘§Šz‡Œv PIC S9(013) COMP-3.
000260 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‘e—˜‰v‡Œv PIC S9(013) COMP-3.
000270 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Š„ˆø—¦ PIC S9(002)V9(8) COMP-3.
000280 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|V‹K‘‘Ö‹æ•ª PIC  X(001).
000290 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000300 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ƒ[ƒ“ƒRƒ~•t‹c‚m‚n PIC  X(007).
000310 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|âg‹c‹æ•ª PIC  X(001).
000320 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|âg‹c‚m‚n PIC  X(010).
000330 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŒˆÙ‹æ•ª PIC  X(001).
000340 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|’S•Û‹æ•ª PIC  X(001).
000350 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|˜A“®‹à—˜‹æ•ª PIC  X(002).
000360 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|˜A“®‹à—˜–¼ PIC  X(020).
000370 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ƒXƒvƒŒƒbƒh PIC S9(002)V9(8) COMP-3.
000380 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Šm’è“ú PIC  X(008).
000390 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|•Ð’[—¼’[‹æ•ª PIC  X(001).
000400 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‹à—˜•Ï“®‹æ•ª PIC  X(001).
000410 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‘OŽæŒãŽæ‹æ•ª PIC  X(001).
000420 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|—˜‘§’[”ˆ—ƒR[ƒh PIC  X(001).
000430 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|—˜—¦Šî”ƒR[ƒh PIC  X(001).
000440 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‹x“ú‘Î‰ž‹æ•ª PIC  X(001).
000450 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000460 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‹âs’ZkƒR[ƒh PIC  X(002).
000470 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‹âsƒR[ƒh PIC  X(007).
000480 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŒûÀ–¼Ì PIC  X(060).
000490 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|ŒûÀ”Ô† PIC  X(007).
000500 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|žŠÒ¿‹Œ —L–³‹æ•ª PIC  X(001).
000510 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‘ÎR—vŒ PIC  X(001).
000520 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Â–±ŽÒ’Ê’m‹æ•ª PIC  X(001).
000530 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|‘ã—‰ñŽû—L–³‹æ•ª PIC  X(001).
000540 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|¿‹æƒR[ƒh PIC  X(008).
000550 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Œ´Â–±ŽÒƒR[ƒh PIC  X(008).
000560 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Œ´Â–±ŽÒî•ñ‚P PIC  X(040).
000570 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Œ´Â–±ŽÒî•ñ‚Q PIC  X(040).
000580 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|Œ´Â–±ŽÒî•ñ‚R PIC  X(040).
000590 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000600 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000610 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000620 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000630 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000640 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000650 01  ‚e‚b‚s|‚j‚h‚g‚n‚m|—a‹àŽí—Þ PIC  X(001).
