000010************************************************
000020* ”Û”F(•¨Œ“WŠJ)(HSNINBT)
000030************************************************
000040 01  ‚g‚r‚m‚h‚m‚a‚s|Œ_–ñ”Ô†  PIC  X(009).
000050 01  ‚g‚r‚m‚h‚m‚a‚s|•¨Œ‚m‚n  PIC  X(003).
000060 01  ‚g‚r‚m‚h‚m‚a‚s|–Ú“WŠJ“ú  PIC  X(006).
000070 01  ‚g‚r‚m‚h‚m‚a‚s|–ÚŽx•¥‰ñ”  PIC  X(004).
000080 01  ‚g‚r‚m‚h‚m‚a‚s|–ÚŽÀƒŠ[ƒX—¿  PIC S9(013) COMP-3.
000090 01  ‚g‚r‚m‚h‚m‚a‚s|–Ú—˜‘§  PIC S9(013) COMP-3.
000100 01  ‚g‚r‚m‚h‚m‚a‚s|–ÚŒ³–{“à“ü‚ê  PIC S9(013) COMP-3.
000110 01  ‚g‚r‚m‚h‚m‚a‚s|–ÚŒ³–{Žc  PIC S9(013) COMP-3.
000120 01  ‚g‚r‚m‚h‚m‚a‚s|–ÚÂŒ Žc  PIC S9(013) COMP-3.
000130 01  ‚g‚r‚m‚h‚m‚a‚s|–Ú””ï—p  PIC S9(013) COMP-3.
000140 01  ‚g‚r‚m‚h‚m‚a‚s|”„ãÁ”ïÅ  PIC S9(010) COMP-3.
000150 01  ‚g‚r‚m‚h‚m‚a‚s|‚s‚`‚w‚h‚m‚s‘Š“–  PIC S9(010) COMP-3.
000160 01  ‚g‚r‚m‚h‚m‚a‚s|‚s‚`‚w‚o“à“ü‚ê  PIC S9(010) COMP-3.
000170 01  ‚g‚r‚m‚h‚m‚a‚s|‚s‚`‚w‚oŽc‚  PIC S9(013) COMP-3.
000180 01  ‚g‚r‚m‚h‚m‚a‚s|ŒvŒŽ”  PIC  X(013).
