000010************************************************
000020* (IBS_COUNTRY)
000030************************************************
000040 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|‘ƒR[ƒh PIC  X(003).
000050 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|ƒGƒŠƒAƒR[ƒh PIC  X(001).
000060 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|ƒGƒŠƒA–¼Ì|“ú–{Œê PIC  X(020).
000070 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|ƒGƒŠƒA–¼Ì|‰pŒê PIC  X(020).
000080 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|‘–¼Ì|“ú–{Œê PIC  X(030).
000090 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|‘–¼Ì|‰pŒê PIC  X(030).
000100 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|‚k‚c‚b‹æ•ª PIC  X(001).
000110 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|ƒJƒ“ƒgƒŠ[ƒOƒŒ[ƒh PIC  X(001).
000120 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|“o˜^“ú PIC  X(008).
000130 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|“o˜^Žž PIC  X(006).
000140 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|XV“ú PIC  X(008).
000160 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|XVŽž PIC  X(006).
000170 01  ‚h‚a‚r|‚b‚n‚t‚m‚s‚q‚x|XV’S“–ŽÒƒR[ƒh PIC  X(004).
