000010************************************************
000020* (IBS_WORK)
000030************************************************
000040 01  ‚h‚a‚r|‚v‚n‚q‚j|ŽæˆøæƒR[ƒh PIC  X(008).
000050 01  ‚h‚a‚r|‚v‚n‚q‚j|Žæˆøæ–¼Ì|Š¿Žš PIC  X(040).
