000010************************************************
000020* (IBS_DATE)
000030************************************************
000040 01  ‚h‚a‚r|‚c‚`‚s‚d|‹Æ–±”N PIC  X(004).
000050 01  ‚h‚a‚r|‚c‚`‚s‚d|‹Æ–±ŒŽ PIC  X(002).
000060 01  ‚h‚a‚r|‚c‚`‚s‚d|‹Æ–±“ú PIC  X(002).
000070 01  ‚h‚a‚r|‚c‚`‚s‚d|“o˜^“ú PIC  X(008).
000080 01  ‚h‚a‚r|‚c‚`‚s‚d|“o˜^Žž PIC  X(006).
000090 01  ‚h‚a‚r|‚c‚`‚s‚d|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000100 01  ‚h‚a‚r|‚c‚`‚s‚d|XV“ú PIC  X(008).
000110 01  ‚h‚a‚r|‚c‚`‚s‚d|XVŽž PIC  X(006).
000120 01  ‚h‚a‚r|‚c‚`‚s‚d|XV’S“–ŽÒƒR[ƒh PIC  X(004).
