000010************************************************
000020* (IBS_PASSCODE)
000030************************************************
000040 01  ‚h‚a‚r|‚o‚`‚r‚r‚b‚n‚c‚d|ˆÃØƒR[ƒh PIC  X(010).
000050 01  ‚h‚a‚r|‚o‚`‚r‚r‚b‚n‚c‚d|—LŒøƒtƒ‰ƒO PIC  X(001).
000060 01  ‚h‚a‚r|‚o‚`‚r‚r‚b‚n‚c‚d|“o˜^“ú PIC  X(008).
000070 01  ‚h‚a‚r|‚o‚`‚r‚r‚b‚n‚c‚d|“o˜^Žž PIC  X(006).
000080 01  ‚h‚a‚r|‚o‚`‚r‚r‚b‚n‚c‚d|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚h‚a‚r|‚o‚`‚r‚r‚b‚n‚c‚d|XV“ú PIC  X(008).
000100 01  ‚h‚a‚r|‚o‚`‚r‚r‚b‚n‚c‚d|XVŽž PIC  X(006).
000110 01  ‚h‚a‚r|‚o‚`‚r‚r‚b‚n‚c‚d|XV’S“–ŽÒƒR[ƒh PIC  X(004).
