000010************************************************
000020* (IBS_CITY)
000030************************************************
000040 01  ‚h‚a‚r|‚b‚h‚s‚x|“sŽsƒR[ƒh PIC  X(003).
000050 01  ‚h‚a‚r|‚b‚h‚s‚x|‘ƒR[ƒh PIC  X(003).
000060 01  ‚h‚a‚r|‚b‚h‚s‚x|–¼Ì|“ú–{Œê PIC  X(020).
000070 01  ‚h‚a‚r|‚b‚h‚s‚x|–¼Ì|‰pŒê PIC  X(020).
000080 01  ‚h‚a‚r|‚b‚h‚s‚x|“o˜^“ú PIC  X(008).
000090 01  ‚h‚a‚r|‚b‚h‚s‚x|“o˜^Žž PIC  X(006).
000100 01  ‚h‚a‚r|‚b‚h‚s‚x|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000110 01  ‚h‚a‚r|‚b‚h‚s‚x|XV“ú PIC  X(008).
000120 01  ‚h‚a‚r|‚b‚h‚s‚x|XVŽž PIC  X(006).
000130 01  ‚h‚a‚r|‚b‚h‚s‚x|XV’S“–ŽÒƒR[ƒh PIC  X(004).
