000010************************************************
000020* (JOM_FORM_0004_G)
000030************************************************
000040 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ‚P PIC  X(002).
000050 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ‚Q PIC  X(002).
000060 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ‚R PIC  X(002).
000070 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ‚S PIC  X(002).
000080 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ‚T PIC  X(002).
000090 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ•¶Œ¾‚P PIC  X(040).
000100 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ•¶Œ¾‚Q PIC  X(040).
000110 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ•¶Œ¾‚R PIC  X(040).
000120 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ•¶Œ¾‚S PIC  X(040).
000130 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Žx•¥ðŒ•¶Œ¾‚T PIC  X(040).
000140 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|w“ü‹àŠz‚P 
                                             PIC S9(013) COMP-3.
000150 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|w“ü‹àŠz‚Q 
                                             PIC S9(013) COMP-3.
000160 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|w“ü‹àŠz‚R 
                                             PIC S9(013) COMP-3.
000170 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|w“ü‹àŠz‚S 
                                             PIC S9(013) COMP-3.
000180 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|w“ü‹àŠz‚T 
                                             PIC S9(013) COMP-3.
000190 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Á”ïÅ‚P 
                                             PIC S9(013) COMP-3.
000200 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Á”ïÅ‚Q 
                                             PIC S9(013) COMP-3.
000210 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Á”ïÅ‚R 
                                             PIC S9(013) COMP-3.
000220 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Á”ïÅ‚S 
                                             PIC S9(013) COMP-3.
000230 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚S|‚f|Á”ïÅ‚T 
                                             PIC S9(013) COMP-3.
