000010************************************************
000020* (JOM_FORM_0013)
000030************************************************
000040 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|ÅIŽ}”Ô PIC  X(002).
000060 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Œ_–ñŒ” PIC S9(003) COMP-3.
000070 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000080 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žd“üÁ”ïÅ“™Šz‡Œv 
                                             PIC S9(013) COMP-3.
000090 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000100 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000110 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|‘OŽóƒŠ[ƒX—¿Á”ïÅ 
                                             PIC S9(013) COMP-3.
000120 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000130 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|ƒŠ[ƒX—¿Á”ïÅ 
                                             PIC S9(013) COMP-3.
000140 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ‚P PIC  X(002).
000150 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ‚Q PIC  X(002).
000160 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ‚R PIC  X(002).
000170 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ‚S PIC  X(002).
000180 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ‚T PIC  X(002).
000190 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ•¶Œ¾‚P PIC  X(040).
000200 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ•¶Œ¾‚Q PIC  X(040).
000210 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ•¶Œ¾‚R PIC  X(040).
000220 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ•¶Œ¾‚S PIC  X(040).
000230 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥ðŒ•¶Œ¾‚T PIC  X(040).
000240 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥‹àŠz‚P PIC S9(013) COMP-3.
000250 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥‹àŠz‚Q PIC S9(013) COMP-3.
000260 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥‹àŠz‚R PIC S9(013) COMP-3.
000270 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥‹àŠz‚S PIC S9(013) COMP-3.
000280 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Žx•¥‹àŠz‚T PIC S9(013) COMP-3.
000290 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Á”ïÅ‚P PIC S9(013) COMP-3.
000300 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Á”ïÅ‚Q PIC S9(013) COMP-3.
000310 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Á”ïÅ‚R PIC S9(013) COMP-3.
000320 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Á”ïÅ‚S PIC S9(013) COMP-3.
000330 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚R|Á”ïÅ‚T PIC S9(013) COMP-3.
