000010************************************************
000020* (JOM_FORM_0010)
000030************************************************
000040 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|’[––”Ô† PIC  X(016).
000050 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|ƒWƒ‡ƒ‚Žx“XƒR[ƒh PIC  X(002).
000080 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|Žx“X–¼Š¿Žš PIC  X(060).
000090 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|Ý’uêŠ–¼ PIC  X(020).
000100 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|ƒWƒ‡ƒ‚¤•iƒR[ƒh PIC  X(004).
000110 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|•¨Œ–¼ PIC  X(030).
000120 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|‰ð–ñŒãƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000130 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚P‚O|•ÏXÏ•WŽ¯ PIC  X(001).
