000010************************************************
000020* (JOM_FORM_0019)
000030************************************************
000040 01  JOM_FORM_0019-JOBCOD PIC S9(002) COMP-3.
000050 01  JOM_FORM_0019-Œ_–ñ”Ô† PIC  X(009).
000060 01  JOM_FORM_0019-Œ_–ñ“ú PIC  X(008).
000070 01  JOM_FORM_0019-ŒŸŽû“ú PIC  X(008).
000080 01  JOM_FORM_0019-Ø°½ŠúŠÔ PIC S9(003) COMP-3.
000090 01  JOM_FORM_0019-[“–‰ñ PIC S9(003) COMP-3.
000100 01  JOM_FORM_0019-‘Žx•¥‰ñ” PIC S9(003) COMP-3.
000110 01  JOM_FORM_0019-‘æ1‰ñ“ü‹à“ú PIC  X(008).
000120 01  JOM_FORM_0019-“ü‹à“ú PIC  X(004).
000130 01  JOM_FORM_0019-“–ŒŽØ°½—¿ PIC S9(013) COMP-3.
000140 01  JOM_FORM_0019-“–ŒŽÂŒ Žc‚ PIC S9(013) COMP-3.
000150 01  JOM_FORM_0019-Å—¦ PIC S9(002)V9(1) COMP-3.
000160 01  JOM_FORM_0019-¼Þ®Ó¤•iº°ÄÞ PIC  X(004).
000170 01  JOM_FORM_0019-•¨Œ–¼ PIC  X(030).
000180 01  JOM_FORM_0019-Ý’uêŠ–¼ PIC  X(020).
