000010************************************************
000020* (JOM_SYOHIN_MST)
000030************************************************
000040 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|ƒWƒ‡ƒ‚¤•iƒR[ƒh PIC  X(004).
000050 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|ƒWƒ‡ƒ‚¤•i•ª—Þ–¼ PIC  X(030).
000060 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|•¨Œ–¼|Š¿Žš PIC  X(040).
000070 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|•¨Œ–¼ PIC  X(020).
000080 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|‹@Ží–¼ PIC  X(020).
000090 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|Ž‘ŽYƒR[ƒh PIC  X(007).
000100 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|‘Ï—p”N” PIC  X(002).
000110 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|Å‹æ•ª PIC  X(001).
000120 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|ŒÅ’èŽ‘ŽYÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000130 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000140 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000150 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|M—p•ÛŒ¯ƒR[ƒh|ƒŠ[ƒX 
                                             PIC  X(006).
000160 01  ‚i‚n‚l|‚r‚x‚n‚g‚h‚m|‚l‚r‚s|M—p•ÛŒ¯ƒR[ƒh|Š„•Š 
                                             PIC  X(006).
