000010************************************************
000020* (JOM_FORM_0009_H)
000030************************************************
000040 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚P PIC  X(020).
000050 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚Q PIC  X(020).
000060 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚R PIC  X(020).
000070 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚S PIC  X(020).
000080 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚T PIC  X(020).
000090 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚U PIC  X(020).
000100 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚V PIC  X(020).
000110 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚W PIC  X(020).
000120 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚X PIC  X(020).
000130 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚P‚O PIC  X(020).
000140 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚P‚P PIC  X(020).
000150 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚P‚Q PIC  X(020).
000160 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚P‚R PIC  X(020).
000170 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|Žx“X‚P‚S PIC  X(020).
000180 01  ‚i‚n‚l|‚e‚n‚q‚l|‚O‚O‚O‚X|‚g|‡Œv PIC  X(020).
