000010************************************************
000020* (JOM_PARA)
000030************************************************
000040 01  ‚i‚n‚l|‚o‚`‚q‚`|‚j‚d‚x PIC  X(003).
000050 01  ‚i‚n‚l|‚o‚`‚q‚`|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚i‚n‚l|‚o‚`‚q‚`|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚i‚n‚l|‚o‚`‚q‚`|ŒÚ‹qƒR[ƒh PIC  X(006).
000080 01  ‚i‚n‚l|‚o‚`‚q‚`|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚i‚n‚l|‚o‚`‚q‚`|’S“–ŽÒƒR[ƒh PIC  X(004).
000100 01  ‚i‚n‚l|‚o‚`‚q‚`|Œ_–ñ“ú PIC  X(008).
000110 01  ‚i‚n‚l|‚o‚`‚q‚`|ŒŸŽû“ú PIC  X(008).
000120 01  ‚i‚n‚l|‚o‚`‚q‚`|‘æ‚P‰ñ“ü‹à“ú PIC  X(008).
000130 01  ‚i‚n‚l|‚o‚`‚q‚`|“ü‹àŠî€“ú PIC  X(002).
000140 01  ‚i‚n‚l|‚o‚`‚q‚`|˜’uŒŽ” PIC S9(002)V9(2) COMP-3.
000150 01  ‚i‚n‚l|‚o‚`‚q‚`|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000160 01  ‚i‚n‚l|‚o‚`‚q‚`|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000170 01  ‚i‚n‚l|‚o‚`‚q‚`|[“–‘ŠŽE‹æ•ª PIC  X(001).
000180 01  ‚i‚n‚l|‚o‚`‚q‚`|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000190 01  ‚i‚n‚l|‚o‚`‚q‚`|”„Žå–¼ PIC  X(060).
000200 01  ‚i‚n‚l|‚o‚`‚q‚`|”„ŽåZŠ PIC  X(100).
000210 01  ‚i‚n‚l|‚o‚`‚q‚`|w“üæƒR[ƒh PIC  X(008).
000220 01  ‚i‚n‚l|‚o‚`‚q‚`|Žx•¥æƒR[ƒh PIC  X(004).
000230 01  ‚i‚n‚l|‚o‚`‚q‚`|ˆ´ùŽè”—¿ PIC S9(013) COMP-3.
000240 01  ‚i‚n‚l|‚o‚`‚q‚`|ˆ´ùŽè”—¿Žx•¥“ú PIC  X(060).
000250 01  ‚i‚n‚l|‚o‚`‚q‚`|“o˜^“ú PIC  X(008).
000260 01  ‚i‚n‚l|‚o‚`‚q‚`|“o˜^Žž PIC  X(006).
000270 01  ‚i‚n‚l|‚o‚`‚q‚`|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000280 01  ‚i‚n‚l|‚o‚`‚q‚`|XV“ú PIC  X(008).
000290 01  ‚i‚n‚l|‚o‚`‚q‚`|XVŽž PIC  X(006).
000300 01  ‚i‚n‚l|‚o‚`‚q‚`|XV’S“–ŽÒƒR[ƒh PIC  X(004).
