000010************************************************
000020* (JOM_FORM_0001)
000030************************************************
000040 01  JOM_FORM_0001-JOBCOD PIC S9(002) COMP-3.
000050 01  JOM_FORM_0001-SHTNUM PIC S9(002) COMP-3.
000060 01  JOM_FORM_0001-Œ_–ñ“ú PIC  X(008).
000070 01  JOM_FORM_0001-Œ_–ñ”Ô† PIC  X(009).
000080 01  JOM_FORM_0001-ÅIŽ}”Ô PIC  X(002).
000090 01  JOM_FORM_0001-‘æ1‰ñ“ü‹à“ú PIC  X(008).
000100 01  JOM_FORM_0001-“ü‹àŠî€“ú PIC  X(004).
000110 01  JOM_FORM_0001-‰‰ñØ°½—¿ PIC S9(013) COMP-3.
000120 01  JOM_FORM_0001-‰‰ñÁ”ïÅŠz PIC S9(013) COMP-3.
000130 01  JOM_FORM_0001-Ø°½—¿ PIC S9(013) COMP-3.
000140 01  JOM_FORM_0001-‘OŽóŒŽ” PIC S9(002) COMP-3.
000150 01  JOM_FORM_0001-‘OŽóØ°½—¿ PIC S9(013) COMP-3.
000160 01  JOM_FORM_0001-ŒŽŠzÁ”ïÅŠz PIC S9(013) COMP-3.
000170 01  JOM_FORM_0001-Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000180 01  JOM_FORM_0001-’[––”Ô† PIC  X(016).
