000010************************************************
000020* (JOM_SEIKYU_EXCEL)
000030************************************************
000040 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|Žx“X PIC  X(002).
000070 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|ƒWƒ‡ƒ‚Œ_–ñ”Ô† 
                                             PIC  X(006).
000080 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|ƒWƒ‡ƒ‚¤•iƒR[ƒh 
                                             PIC  X(004).
000090 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|ÄƒŠ[ƒXƒR[ƒh 
                                             PIC  X(001).
000100 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|ŒŸŽû“ú PIC  X(008).
000110 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000120 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|ŠúŠÔ PIC S9(003) COMP-3.
000130 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|•¨Œ–¼ PIC  X(030).
000140 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|Ý’uêŠ–¼ PIC  X(020).
000150 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚d‚w‚b‚d‚k|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
