000010************************************************
000020* (JOM_SITEN_MST)
000030************************************************
000040 01  ‚i‚n‚l|‚r‚h‚s‚d‚m|‚l‚r‚s|ƒWƒ‡ƒ‚Žx“XƒR[ƒh PIC  X(002).
000050 01  ‚i‚n‚l|‚r‚h‚s‚d‚m|‚l‚r‚s|Žx“X–¼ƒJƒi PIC  X(030).
000060 01  ‚i‚n‚l|‚r‚h‚s‚d‚m|‚l‚r‚s|Žx“X–¼Š¿Žš PIC  X(060).
