000010************************************************
000020* (JYO_ASTMST)
000030************************************************
000040 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Šî€”N PIC  X(004).
000050 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Ž‘ŽY”Ô† PIC  X(009).
000060 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Žæ“¾“ú PIC  X(008).
000070 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Žæ“¾”N“x PIC  X(001).
000080 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Žæ“¾”NŒŽ PIC  X(004).
000090 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Ž‘ŽY–¼ PIC  X(030).
000100 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|”—Ê PIC S9(004) COMP-3.
000110 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Ž‘ŽYŽí—Þ PIC  X(001).
000120 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Ž‘ŽYƒR[ƒh PIC  X(006).
000130 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|‘Ï—p”N” PIC S9(002) COMP-3.
000140 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|ž‹p—¦ PIC S9(002)V9(3) COMP-3.
000150 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Žæ“¾‰¿Šz PIC S9(013) COMP-3.
000160 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|”[•tæ PIC  X(006).
000170 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|Žc‘¶—¦ PIC S9(002)V9(3) COMP-3.
000180 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|•]‰¿Šz PIC S9(013) COMP-3.
000190 01  ‚i‚x‚n|‚`‚r‚s‚l‚r‚s|’ •ë‰¿Šz PIC S9(013) COMP-3.
