000010************************************************
000020* (KAI_WK_SYUKEI)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|Ž–‹ÆŠ–¼ PIC  X(020).
000080 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000090 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|‰ð–ñ“ú PIC  X(008).
000100 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|‰ð–ñ‘ÎÛ‹æ•ª 
                                             PIC S9(001) COMP-3.
000110 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|‰ð–ñŽd–óƒR[ƒh PIC  X(003).
000120 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|‹K’è‘¹ŠQ‹àŠz 
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|‰ð–ñ•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|Žæˆøæ–¼ƒJƒi PIC  X(030).
000150 01  ‚j‚`‚h|‚v‚j|‚r‚x‚t‚j‚d‚h|“–ŒŽŒŽ“x PIC  X(008).
