000010************************************************
000020* (KAI_WK_TENKAI)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚s‚d‚m‚j‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚s‚d‚m‚j‚`‚h|“WŠJ”Ô† PIC S9(003) COMP-3.
000060 01  ‚j‚`‚h|‚v‚j|‚s‚d‚m‚j‚`‚h|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000070 01  ‚j‚`‚h|‚v‚j|‚s‚d‚m‚j‚`‚h|‰ñ” PIC S9(013) COMP-3.
000080 01  ‚j‚`‚h|‚v‚j|‚s‚d‚m‚j‚`‚h|Á”ïÅ“™Šz PIC S9(013) COMP-3.
000090 01  ‚j‚`‚h|‚v‚j|‚s‚d‚m‚j‚`‚h|‡Œv PIC S9(013) COMP-3.
