000010************************************************
000020* (KAI_WK_KIROKHYO)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚j‚h‚q‚n‚j‚g‚x‚n|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚j‚h‚q‚n‚j‚g‚x‚n|ˆ—“à—e PIC  X(001).
