000010************************************************
000020* (KAI_KAPPU)
000030************************************************
000040 01  ‚j‚`‚h|‚j‚`‚o‚o‚t|Œ_–ñ”Ô† PIC  X(009).
