000010************************************************
000020* (KAI_SAIKHN)
000030************************************************
000040 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‘ÎÛ‹æ•ª PIC  X(001).
000060 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‰ð–ñ“ú PIC  X(008).
000070 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‚r‚e‚b”»’è‹æ•ª PIC  X(001).
000080 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‹K’è‘¹ŠQ‹àÁ”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000090 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000100 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|Žè”—¿¿‹ƒR[ƒh PIC  X(002).
000110 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‹K’è‘¹ŠQ‹à‡Œv PIC S9(013) COMP-3.
000120 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‰ð–ñŽd–óƒR[ƒh PIC  X(003).
000130 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‹K’è‘¹ŠQ‹à“ü‹àƒtƒ‰ƒO PIC  X(001).
000140 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‰ð–ñ“ü‹à“ú PIC  X(008).
000150 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‘OŽó•ª“à–ó PIC  X(001).
000160 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|ŒvŽZ•ûŽ® PIC  X(001).
000170 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000180 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‹K‘¹‹à|”„‹p‘ã‹à[“–‹àŠz 
                                             PIC S9(013) COMP-3.
000190 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‹K‘¹‹à‘æŽOŽÒŽx•¥æ–¼ƒJƒi PIC  X(030).
000200 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‘æŽOŽÒ‹K‘¹‹àŠz PIC S9(013) COMP-3.
000210 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|‹K‘¹‹à‰ñŽû•û–@ PIC  X(001).
000220 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|•¨Œ‘ã‹à‘ŠŽE‹æ•ª PIC  X(001).
000230 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|“o˜^“ú PIC  X(008).
000240 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|“o˜^Žž PIC  X(006).
000250 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000260 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|XV“ú PIC  X(008).
000270 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|XVŽž PIC  X(006).
000280 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000290 01  ‚j‚`‚h|‚r‚`‚h‚j‚g‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
