000010************************************************
000020* (KAI_WK_IREISINSEI)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|’S“–•”“X PIC  X(020).
000050 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|‰ð–ñ“ú PIC  X(008).
000060 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|–¼Šñ‚¹ƒR[ƒh 
                                             PIC  X(008).
000080 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|Œ_–ñæ–¼ PIC  X(060).
000090 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|ˆÙ—á\¿“à—e‰c‹Æ 
                                             PIC  X(400).
000100 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|‰c‹Æ•”’S“–ˆÓŒ©‰c‹Æ 
                                             PIC  X(400).
000110 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|ˆÙ—á\¿“à—e‘‡ 
                                             PIC  X(400).
000120 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|‰c‹Æ•”’S“–ˆÓŒ©‘‡ 
                                             PIC  X(400).
000130 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|ˆÙ—á\¿“à—eŽ––± 
                                             PIC  X(400).
000140 01  ‚j‚`‚h|‚v‚j|‚h‚q‚d‚h‚r‚h‚m‚r‚d‚h|‰c‹Æ•”’S“–ˆÓŒ©Ž––± 
                                             PIC  X(400).
