000010************************************************
000020* (KAI_WK_BAIZEI)
000030************************************************
000040 01  ‚j‚`‚h|‚v‚j|‚a‚`‚h‚y‚d‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚v‚j|‚a‚`‚h‚y‚d‚h|”„‹pÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
