000010************************************************
000020* (KEI_JOKEN1)
000030************************************************
000040 01  ‚j‚d‚h|‚i‚n‚j‚d‚m‚P|ƒŠ[ƒX—¿ŽóŽæðŒƒR[ƒh PIC  X(002).
000050 01  ‚j‚d‚h|‚i‚n‚j‚d‚m‚P|ƒŠ[ƒX—¿ŽóŽæðŒ PIC  X(060).
000060 01  ‚j‚d‚h|‚i‚n‚j‚d‚m‚P|“o˜^“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚i‚n‚j‚d‚m‚P|“o˜^Žž PIC  X(006).
000080 01  ‚j‚d‚h|‚i‚n‚j‚d‚m‚P|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚i‚n‚j‚d‚m‚P|XV“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚i‚n‚j‚d‚m‚P|XVŽž PIC  X(006).
000110 01  ‚j‚d‚h|‚i‚n‚j‚d‚m‚P|XV’S“–ŽÒƒR[ƒh PIC  X(004).
