000010************************************************
000020* (KEI_HOSHO_HO)
000030************************************************
000040 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚g‚n|•ÛØ’S•Û“à—eƒR[ƒh PIC  X(002).
000050 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚g‚n|“à—e PIC  X(030).
000060 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚g‚n|“o˜^“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚g‚n|“o˜^Žž PIC  X(006).
000080 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚g‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚g‚n|XV“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚g‚n|XVŽž PIC  X(006).
000110 01  ‚j‚d‚h|‚g‚n‚r‚g‚n|‚g‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
