000010************************************************
000020* (KEI_BUNKATU_WORK)
000030************************************************
000040 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|•ªŠ„” 
                                             PIC S9(003) COMP-3.
000070 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|”—Ê PIC S9(004) COMP-3.
000080 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|w“ü‹àŠz‹Ï“™Š„ƒtƒ‰ƒO 
                                             PIC  X(001).
000090 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|ŒÂ•ÊƒŠ[ƒX—¿‹Ï“™Š„ƒtƒ‰ƒO 
                                             PIC  X(001).
000100 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|”—Ê‹Ï“™Š„ƒtƒ‰ƒO 
                                             PIC  X(001).
000110 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|•ªŠ„Œãw“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|•ªŠ„ŒãŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚n‚q‚j|•ªŠ„Œã”—Ê 
                                             PIC S9(004) COMP-3.
