000010************************************************
000020* (KEI_MIZUHO_ERROR)
000030************************************************
000040 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚d‚q‚q‚n‚q|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚d‚q‚q‚n‚q|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚d‚q‚q‚n‚q|¿‹æƒR[ƒh PIC  X(008).
000070 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚d‚q‚q‚n‚q|Žæˆøæ–¼ PIC  X(060).
000080 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚d‚q‚q‚n‚q|ŒŸŽûÏ|íœ‹æ•ª 
                                             PIC  X(001).
000090 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚d‚q‚q‚n‚q|Œ_–ñ‹âsƒR[ƒh 
                                             PIC  X(007).
000100 01  ‚j‚d‚h|‚l‚h‚y‚t‚g‚n|‚d‚q‚q‚n‚q|ŒÚ‹q‹âsƒR[ƒh 
                                             PIC  X(007).
