000010************************************************
000020* (KEI_WK_EDA_KONYU)
000030************************************************
000040 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000060 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|w“üæŽ¯•Ê‚m‚n 
                                             PIC  X(001).
000070 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|w“üæƒR[ƒh PIC  X(008).
000080 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|w“üæ–¼ PIC  X(060).
000090 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000100 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000110 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚P 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚P 
                                             PIC S9(002)V9(2) COMP-3.
000130 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚P 
                                             PIC  X(040).
000140 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚Q 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚Q 
                                             PIC S9(002)V9(2) COMP-3.
000160 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚Q 
                                             PIC  X(040).
000170 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚R 
                                             PIC S9(013) COMP-3.
000180 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚R 
                                             PIC S9(002)V9(2) COMP-3.
000190 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚R 
                                             PIC  X(040).
000200 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚S 
                                             PIC S9(013) COMP-3.
000210 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚S 
                                             PIC S9(002)V9(2) COMP-3.
000220 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚S 
                                             PIC  X(040).
000230 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚T 
                                             PIC S9(013) COMP-3.
000240 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚T 
                                             PIC S9(002)V9(2) COMP-3.
000250 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚T 
                                             PIC  X(040).
