000010************************************************
000020* (KEI_BUNKATU_WK_LIST)
000030************************************************
000040 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚j|‚k‚h‚r‚s|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚j|‚k‚h‚r‚s|V•¨Œ‚m‚n 
                                             PIC  X(003).
000060 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚j|‚k‚h‚r‚s|•¨Œ‚m‚n 
                                             PIC  X(003).
000070 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚j|‚k‚h‚r‚s|Œ³•¨Œ” 
                                             PIC S9(004) COMP-3.
000080 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚v‚j|‚k‚h‚r‚s|’[––‚h‚c 
                                             PIC  X(016).
