000010************************************************
000020* (KEI_TOKUYAKU)
000030************************************************
000040 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|“Á–ñƒR[ƒh PIC  X(002).
000050 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|“à—e PIC  X(150).
000060 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|“o˜^“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|“o˜^Žž PIC  X(006).
000080 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|XV“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|XVŽž PIC  X(006).
000110 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
