000010************************************************
000020* (KEI_SETTI_MST)
000030************************************************
000040 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|Ý’uêŠƒR[ƒh PIC  X(003).
000060 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000070 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|Ý’uêŠ–¼|ƒJƒi PIC  X(020).
000080 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000090 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|”[•tæƒR[ƒh PIC  X(006).
000100 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|Ý’uêŠZŠ PIC  X(100).
000110 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|“o˜^“ú PIC  X(008).
000120 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|“o˜^Žž PIC  X(006).
000130 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000140 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|XV“ú PIC  X(008).
000150 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|XVŽž PIC  X(006).
000160 01  ‚j‚d‚h|‚r‚d‚s‚s‚h|‚l‚r‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
