000010************************************************
000020* (KEI_TOKUYAKU_TAIHI)
000030************************************************
000040 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|‚s‚`‚h‚g‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚s‚n‚j‚t‚x‚`‚j‚t|‚s‚`‚h‚g‚h|“Á–ñ PIC  X(800).
