000010************************************************
000020* (KEI_LPWK_EDA_TENKAI)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|˜A”Ô 
                                             PIC S9(003) COMP-3.
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|’[––”Ô† 
                                             PIC  X(016).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|ŒŽ” 
                                             PIC S9(003) COMP-3.
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|‡ŒvŽx•¥Šz 
                                             PIC S9(014) COMP-3.
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|‘¹ŠQ”…ž‹à 
                                             PIC S9(017) COMP-3.
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|Žæˆøæ–¼ 
                                             PIC  X(060).
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|‘O“n‹à—˜‘§ 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚d‚m‚j‚`‚h|ŒvŽZ•û–@|‹K’è‘¹Ž¸‹à 
                                             PIC  X(002).
