000010************************************************
000020* (KEI_KAKUNIN)
000030************************************************
000040 01  ‚j‚d‚h|‚j‚`‚j‚t‚m‚h‚m|•¨ŒŠm”FŠî€ PIC  X(001).
000050 01  ‚j‚d‚h|‚j‚`‚j‚t‚m‚h‚m|“à—e PIC  X(020).
