000010************************************************
000020* (KEI_BUKKEN_MST)
000030************************************************
000040 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|•¨ŒƒR[ƒh PIC  X(003).
000060 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|•¨Œ–¼|Š¿Žš PIC  X(040).
000070 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|•¨Œ–¼|ƒJƒi PIC  X(020).
000080 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|Žd—l»‘¢”Ô† PIC  X(020).
000090 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|»‘¢‹ÆŽÒ PIC  X(060).
000100 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|“®‘•t•Û‹æ•ª PIC  X(001).
000110 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000120 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|“®‘•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000130 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|Ž‘ŽYƒR[ƒh PIC  X(007).
000140 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|‘Ï—p”N” PIC S9(002) COMP-3.
000150 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|M—p•ÛŒ¯ƒR[ƒh PIC  X(006).
000160 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|Œ^Ž®”Ô† PIC  X(015).
000170 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|Å‹æ•ª PIC  X(001).
000180 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|Å•‰’SƒR[ƒh PIC  X(001).
000190 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|ŒÅ’èŽ‘ŽYÅ—¦ 
                                             PIC S9(002)V9(2) COMP-3.
000200 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|Žw’è“dŽqŒvŽZ‹@ PIC  X(040).
000210 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|Žg—pŒ Ý’èŽÒ PIC  X(060).
000220 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|“o˜^“ú PIC  X(008).
000230 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|“o˜^Žž PIC  X(006).
000240 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000250 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|XV“ú PIC  X(008).
000260 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|XVŽž PIC  X(006).
000270 01  ‚j‚d‚h|‚a‚t‚j‚j‚d‚m|‚l‚r‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
