000010************************************************
000020* (KEI_KYOTYO_CHECK)
000030************************************************
000040 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|Š²Ž–|”ñŠ²Ž–‹æ•ª 
                                             PIC  X(001).
000050 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|‚n‚o‚d‚m|‚b‚k‚n‚r‚d‹æ•ª 
                                             PIC  X(001).
000060 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|‹¦’²‰ñŽûŽè‡ PIC  X(001).
000070 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|Š¨’èˆ—ƒR[ƒh 
                                             PIC  X(002).
000080 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|Â–±‹¦’²ƒR[ƒh 
                                             PIC  X(002).
000090 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|“o˜^“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|“o˜^Žž PIC  X(006).
000110 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|“o˜^’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000120 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|XV“ú PIC  X(008).
000130 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|XVŽž PIC  X(006).
000140 01  ‚j‚d‚h|‚j‚x‚n‚s‚x‚n|‚b‚g‚d‚b‚j|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
