000010************************************************
000020* (KEI_BKDATE_KEY)
000030************************************************
000040 01  ‚j‚d‚h|‚a‚j‚c‚`‚s‚d|‚j‚d‚x|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚a‚j‚c‚`‚s‚d|‚j‚d‚x|ì¬“ú PIC  X(008).
000060 01  ‚j‚d‚h|‚a‚j‚c‚`‚s‚d|‚j‚d‚x|ì¬Žž PIC  X(006).
000070 01  ‚j‚d‚h|‚a‚j‚c‚`‚s‚d|‚j‚d‚x|ì¬’S“–ŽÒƒR[ƒh PIC  X(004).
