000010************************************************
000020* (KEI_KONYU)
000030************************************************
000040 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|w“üæŽ¯•Ê‚m‚n PIC  X(001).
000060 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|w“üæƒR[ƒh PIC  X(008).
000070 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|w“üæ–¼ PIC  X(060).
000080 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥æƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|w“üæ—X•Ö”Ô† PIC  X(007).
000100 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|w“üæZŠ PIC  X(100).
000110 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|w“üæ’S“–ŽÒ PIC  X(020).
000120 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|“d˜b”Ô† PIC  X(015).
000130 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|‚e‚`‚w”Ô† PIC  X(015).
000140 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žd“üÁ”ïÅ“™Šz PIC S9(013) COMP-3.
000160 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚P PIC S9(013) COMP-3.
000170 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚P PIC S9(002)V9(2) COMP-3.
000180 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚P PIC  X(040).
000190 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚Q PIC S9(013) COMP-3.
000200 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚Q PIC S9(002)V9(2) COMP-3.
000210 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚Q PIC  X(040).
000220 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚R PIC S9(013) COMP-3.
000230 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚R PIC S9(002)V9(2) COMP-3.
000240 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚R PIC  X(040).
000250 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚S PIC S9(013) COMP-3.
000260 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚S PIC S9(002)V9(2) COMP-3.
000270 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚S PIC  X(040).
000280 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„‹àŠz‚T PIC S9(013) COMP-3.
000290 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ŒJ‰„ŒŽ”‚T PIC S9(002)V9(2) COMP-3.
000300 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|Žx•¥ðŒ•¶Œ¾‚T PIC  X(040).
000310 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000320 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚P PIC  X(001).
000330 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚Q PIC  X(001).
000340 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚R PIC  X(001).
000350 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚S PIC  X(001).
000360 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|ŽèŒ`Žó“n•û–@‚T PIC  X(001).
000370 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|“o˜^“ú PIC  X(008).
000380 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|“o˜^Žž PIC  X(006).
000390 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000400 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|XV“ú PIC  X(008).
000410 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|XVŽž PIC  X(006).
000420 01  ‚j‚d‚h|‚j‚n‚m‚x‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
