000010************************************************
000020* (KEI_LPWK_SEIKYUSYO_TEGATA)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|˜A”Ô 
                                             PIC  X(003).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|’[––”Ô† 
                                             PIC  X(016).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|‰ñ” 
                                             PIC S9(003) COMP-3.
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|Á”ïÅ’¥Žû‹æ•ª 
                                             PIC  X(001).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|Š¨’èˆ—ƒR[ƒh 
                                             PIC  X(002).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|“®‘•ÛŒ¯—¿‡Œv 
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|¿‹‹æ•ª‚P 
                                             PIC  X(001).
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|¿‹‹æ•ª‚Q 
                                             PIC  X(001).
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚f‚`‚s‚`|ŽèŒ`–‡” 
                                             PIC S9(003) COMP-3.
