000010************************************************
000020* (KOK_KOUSAKU)
000030************************************************
000040 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|–Ê’k“ú PIC  X(008).
000060 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|HìŠJŽn“ú PIC  X(008).
000070 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|HìŠJŽnŽ–‹ÆŠ PIC  X(014).
000080 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|HìŠJŽn’S“–ŽÒ PIC  X(014).
000090 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|æ•û’S“–ŽÒ‚P PIC  X(014).
000100 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|–ðE’S“–‚P PIC  X(014).
000110 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|æ•û’S“–ŽÒ‚Q PIC  X(014).
000120 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|–ðE’S“–‚Q PIC  X(014).
000130 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|“–ŽÐ–Ê’kŽÒ‚P PIC  X(014).
000140 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|“–ŽÐ–Ê’kŽÒ‚Q PIC  X(014).
000150 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|ŠJŽnŒoˆÜ PIC  X(001).
000160 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|Hì•ûj PIC  X(001).
000170 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|ŽæˆøŒ©ž‚Ý PIC  X(001).
000180 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|ƒŠ[ƒX—˜—p PIC  X(001).
000190 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|Žx•¥ƒŠ[ƒX—¿ PIC S9(004) COMP-3.
000200 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|—˜—p•¨Œ PIC  X(060).
000210 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|ƒŠ[ƒX‘‹Œû PIC  X(060).
000220 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|‰‰ñ–Ê’k“à—e PIC  X(800).
000230 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|–K–âŽÒ–¼ PIC  X(020).
000240 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|“o˜^“ú PIC  X(008).
000250 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|“o˜^Žž PIC  X(006).
000260 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000270 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|XV“ú PIC  X(008).
000280 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|XVŽž PIC  X(006).
000290 01  ‚j‚n‚j|‚j‚n‚t‚r‚`‚j‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
