000010************************************************
000020* (KOK_HSMCHO)
000030************************************************
000040 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000060 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|ƒOƒ‹[ƒvƒR[ƒh PIC  X(008).
000070 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000080 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|ƒOƒ‹[ƒv|‘OŒŽ–––¢’¥ŽûŒ” 
                                             PIC  X(006).
000100 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|ƒOƒ‹[ƒv|‘OŒŽ–––¢’¥ŽûŽc‚ 
                                             PIC S9(013) COMP-3.
000110 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|–¼Šñ‚¹|‘OŒŽ–¢’¥ŽûŒ” PIC  X(006).
000120 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|–¼Šñ‚¹|‘OŒŽ––’¥ŽûŽc‚ 
                                             PIC S9(013) COMP-3.
000130 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|ƒ†[ƒU[|‘OŒŽ–––¢’¥ŽûŒ” 
                                             PIC  X(006).
000140 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|ƒ†[ƒU[|‘OŒŽ–––¢’¥ŽûŽc‚ 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|ŽåŠÇŽ–‹ÆŠƒR[ƒh PIC  X(004).
000160 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|“o˜^“ú PIC  X(008).
000170 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|“o˜^Žž PIC  X(006).
000180 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000190 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|XV“ú PIC  X(008).
000200 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|XVŽž PIC  X(006).
000210 01  ‚j‚n‚j|‚g‚r‚l‚b‚g‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
