000010************************************************
000020* (KOK_SOUKI_WKFD)
000030************************************************
000040 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚e‚c|Žæˆøæ–¼ƒJƒi PIC  X(070).
000050 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚e‚c|Žæˆøæ–¼Š¿Žš PIC  X(140).
000060 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚e‚c|ZŠ PIC  X(100).
000070 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚e‚c|¶”NŒŽ“ú PIC  X(007).
000080 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚v‚j‚e‚c|‘ã•\ŽÒŽ–¼ PIC  X(030).
