000010************************************************
000020* (KOK_SIHARAI_H)
000030************************************************
000040 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|Žx•¥æƒR[ƒh PIC  X(004).
000050 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|ˆ—‹æ•ª PIC  X(001).
000060 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|Žx•¥æ–¼ PIC  X(056).
000070 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|ŒûÀ–¼‹`l PIC  X(056).
000080 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|‹âsƒR[ƒh PIC  X(004).
000090 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|Žx“XƒR[ƒh PIC  X(003).
000100 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|—a‹àŽí—Þ PIC  X(001).
000110 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|ŒûÀ”Ô† PIC  X(007).
000120 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|“o˜^”Ô† PIC  X(004).
000130 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|ŽèŒ`–¼ˆ¶l PIC  X(056).
000140 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|—X•Ö”Ô† PIC  X(007).
000150 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|—X‘—æZŠ‚P PIC  X(034).
000160 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|—X‘—æZŠ‚Q PIC  X(032).
000170 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|—X‘—æZŠ‚R PIC  X(032).
000180 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|—X‘—æ–¼‚P PIC  X(028).
000190 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|—X‘—æ–¼‚Q PIC  X(028).
000200 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|‹x“ú‘Î‰ž‹æ•ª PIC  X(001).
000210 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|“o˜^“ú PIC  X(008).
000220 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|“o˜^Žž PIC  X(006).
000230 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000240 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|XV“ú PIC  X(008).
000250 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|XVŽž PIC  X(006).
000260 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000270 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|Žè”—¿—L–³ PIC  X(001).
000280 01  ‚j‚n‚j|‚r‚h‚g‚`‚q‚`‚h|‚g|XV•WŽ¯ PIC  X(001).
