000010************************************************
000020* (KOK_SEIKYU)
000030************************************************
000040 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æ–¼Ì PIC  X(060).
000060 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æ•”–å–¼ PIC  X(040).
000070 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æ—X•Ö”Ô†‚RŒ… PIC  X(003).
000080 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æ—X•Ö”Ô†‚SŒ… PIC  X(004).
000090 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|“s“¹•{Œ§ PIC  X(010).
000100 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æZŠ‚P PIC  X(040).
000110 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æZŠ‚Q PIC  X(040).
000120 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æ“d˜b”Ô† PIC  X(015).
000130 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|¿‹æ‚e‚`‚w”Ô† PIC  X(015).
000140 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|’ZkƒR[ƒh‰‰ñ PIC  X(002).
000150 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|‹âsƒR[ƒh‰‰ñ PIC  X(007).
000160 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|—a‹àŽí—Þ‰‰ñ PIC  X(001).
000170 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|ŒûÀ”Ô†‰‰ñ PIC  X(007).
000180 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|‰ñŽû•ûŽ®‰‰ñ PIC  X(001).
000190 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|’ZkƒR[ƒh‚Q‰ñ–ÚˆÈ~ PIC  X(002).
000200 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|‹âsƒR[ƒh‚Q‰ñ–ÚˆÈ~ PIC  X(007).
000210 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|—a‹àŽí—Þ‚Q‰ñ–ÚˆÈ~ PIC  X(001).
000220 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|ŒûÀ”Ô†‚Q‰ñ–ÚˆÈ~ PIC  X(007).
000230 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|‰ñŽû•ûŽ®‚Q‰ñ–ÚˆÈ~ PIC  X(001).
000240 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|“ü‹àŠî€“ú PIC  X(002).
000250 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|ŒÚ‹qƒR[ƒh PIC  X(006).
000260 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000270 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|‹âsŽx“X–¼‰‰ñ PIC  X(030).
000280 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|‹âsŽx“X–¼‚Q‰ñ–ÚˆÈ~ PIC  X(030).
000290 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|“o˜^“ú PIC  X(008).
000300 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|“o˜^Žž PIC  X(006).
000310 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000320 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|XV“ú PIC  X(008).
000330 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|XVŽž PIC  X(006).
000340 01  ‚j‚n‚j|‚r‚d‚h‚j‚x‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
