000010************************************************
000020* (KSL_WK_UTIWAKE)
000030************************************************
000040 01  ‚j‚r‚k|‚v‚j|‚t‚s‚h‚v‚`‚j‚d|ŒŽ”ƒŠ[ƒX PIC  X(020).
000050 01  ‚j‚r‚k|‚v‚j|‚t‚s‚h‚v‚`‚j‚d|‹àŠzƒŠ[ƒX PIC S9(013) COMP-3.
000060 01  ‚j‚r‚k|‚v‚j|‚t‚s‚h‚v‚`‚j‚d|ŒŽ”Š„•Š PIC  X(020).
000070 01  ‚j‚r‚k|‚v‚j|‚t‚s‚h‚v‚`‚j‚d|‹àŠzŠ„•Š PIC S9(013) COMP-3.
000080 01  ‚j‚r‚k|‚v‚j|‚t‚s‚h‚v‚`‚j‚d|ŒŽ”‡Œv PIC  X(020).
000090 01  ‚j‚r‚k|‚v‚j|‚t‚s‚h‚v‚`‚j‚d|‹àŠz‡Œv PIC S9(013) COMP-3.
