000010************************************************
000020* (KTK_WK_TENKAI)
000030************************************************
000040 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|ƒf[ƒ^‹æ•ª PIC  X(001).
000060 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|“WŠJ”Ô† PIC S9(003) COMP-3.
000070 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|‹àŠz PIC S9(013) COMP-3.
000080 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|‰ñ” PIC S9(003) COMP-3.
000090 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|—˜—¦ PIC S9(002)V9(8) COMP-3.
000100 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(8) COMP-3.
000110 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|‰ñŽû•ûŽ®|Œ³–{ PIC  X(001).
000120 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|‰ñŽû•ûŽ®|—˜‘§ PIC  X(001).
000130 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|“o˜^“ú PIC  X(008).
000140 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|“o˜^Žž PIC  X(006).
000150 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000160 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|XV“ú PIC  X(008).
000170 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|XVŽž PIC  X(006).
000180 01  ‚j‚s‚j|‚v‚j|‚s‚d‚m‚j‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
