000010************************************************
000020* (KTK_TENKAI)
000030************************************************
000040 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|ƒf[ƒ^‹æ•ª PIC  X(001).
000060 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|“WŠJ”Ô† PIC S9(003) COMP-3.
000070 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|–ñ’è•ÔÏ“ú PIC  X(008).
000080 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|‹x“ú‹æ•ª PIC  X(001).
000090 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|—˜‘§Šî€“ú PIC  X(008).
000100 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|Œ³–{“à“üŠz PIC S9(013) COMP-3.
000110 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|—˜‘§Šz PIC S9(013) COMP-3.
000120 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|Œ³—˜‡Œv PIC S9(013) COMP-3.
000130 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|Œ³–{Žc‚ PIC S9(013) COMP-3.
000140 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|ŒŽ” PIC S9(003) COMP-3.
000150 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|“ú” PIC S9(004) COMP-3.
000160 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|“K—p—˜—¦ PIC S9(002)V9(8) COMP-3.
000170 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|“K—pŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000180 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|‰ñŽû•ûŽ®|Œ³–{ PIC  X(001).
000190 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|‰ñŽû•ûŽ®|—˜‘§ PIC  X(001).
000200 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|—˜—¦Šm’è‹æ•ª PIC  X(001).
000210 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|‰ñŽûÏ‹æ•ª|Œ³–{ PIC  X(001).
000220 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|‰ñŽûÏ‹æ•ª|—˜‘§ PIC  X(001).
000230 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|“o˜^“ú PIC  X(008).
000240 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|“o˜^Žž PIC  X(006).
000250 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000260 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|XV“ú PIC  X(008).
000270 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|XVŽž PIC  X(006).
000280 01  ‚j‚s‚j|‚s‚d‚m‚j‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
