000010************************************************
000020* (LCF_PRTTMP)
000030************************************************
000040 01  LCF_PRTTMP-CTLNUM PIC  X(006).
000050 01  LCF_PRTTMP-CLTCOD PIC  X(007).
000060 01  LCF_PRTTMP-CLTNAM PIC  X(040).
000070 01  LCF_PRTTMP-REFNUM PIC  X(010).
000080 01  LCF_PRTTMP-BRDNAM PIC  X(040).
000090 01  LCF_PRTTMP-RATTYP PIC  X(020).
000100 01  LCF_PRTTMP-CNTDAY PIC  X(008).
000110 01  LCF_PRTTMP-BORDAY PIC  X(008).
000120 01  LCF_PRTTMP-DUEDAY PIC  X(008).
000130 01  LCF_PRTTMP-PAYCYC PIC  X(002).
000140 01  LCF_PRTTMP-BORTYP PIC  X(001).
000150 01  LCF_PRTTMP-TRMTYP PIC  X(001).
000160 01  LCF_PRTTMP-FIXFLT PIC  X(001).
000170 01  LCF_PRTTMP-BEFAFT PIC  X(001).
000180 01  LCF_PRTTMP-YERDAY PIC  X(001).
000190 01  LCF_PRTTMP-DAYBAS PIC  X(001).
000200 01  LCF_PRTTMP-FRATYP PIC  X(001).
000210 01  LCF_PRTTMP-SALTYP PIC  X(001).
000220 01  LCF_PRTTMP-OBJTYP PIC  X(001).
000230 01  LCF_PRTTMP-HOLSFT PIC  X(001).
000240 01  LCF_PRTTMP-GAPTYP PIC  X(001).
000250 01  LCF_PRTTMP-CREDEP PIC  X(001).
000260 01  LCF_PRTTMP-CRENUM PIC  X(007).
000270 01  LCF_PRTTMP-DEBBNK PIC  X(004).
000280 01  LCF_PRTTMP-DEBBRC PIC  X(003).
000290 01  LCF_PRTTMP-DEBDEP PIC  X(001).
000300 01  LCF_PRTTMP-DEBNUM PIC  X(007).
000310 01  LCF_PRTTMP-PLNDAY PIC  X(008).
000320 01  LCF_PRTTMP-CAPTYP PIC  X(001).
000330 01  LCF_PRTTMP-DAYCNT PIC S9(004) COMP-3.
000340 01  LCF_PRTTMP-FSTCAP PIC S9(013) COMP-3.
000350 01  LCF_PRTTMP-SECCAP PIC S9(013) COMP-3.
000360 01  LCF_PRTTMP-CAPTOT PIC S9(013) COMP-3.
000370 01  LCF_PRTTMP-CREAMT PIC S9(013) COMP-3.
000380 01  LCF_PRTTMP-FSTRAT PIC S9(002)V9(6) COMP-3.
000390 01  LCF_PRTTMP-SECRAT PIC S9(002)V9(6) COMP-3.
000400 01  LCF_PRTTMP-SUPRAT PIC S9(002)V9(6) COMP-3.
000410 01  LCF_PRTTMP-FSTINT PIC S9(013) COMP-3.
000420 01  LCF_PRTTMP-SECINT PIC S9(013) COMP-3.
000430 01  LCF_PRTTMP-REWRAT PIC S9(002)V9(6) COMP-3.
000440 01  LCF_PRTTMP-REWAMT PIC S9(013) COMP-3.
000450 01  LCF_PRTTMP-REWTAX PIC S9(013) COMP-3.
000460 01  LCF_PRTTMP-CHGRAT PIC S9(002)V9(6) COMP-3.
000470 01  LCF_PRTTMP-CHGAMT PIC S9(013) COMP-3.
000480 01  LCF_PRTTMP-CHGTAX PIC S9(013) COMP-3.
000490 01  LCF_PRTTMP-BKIRAT PIC S9(002)V9(6) COMP-3.
000500 01  LCF_PRTTMP-BKIAMT PIC S9(013) COMP-3.
000510 01  LCF_PRTTMP-BKITAX PIC S9(013) COMP-3.
000520 01  LCF_PRTTMP-UNPDAY PIC S9(004) COMP-3.
000530 01  LCF_PRTTMP-FSTAVE PIC S9(013) COMP-3.
000540 01  LCF_PRTTMP-SECAVE PIC S9(013) COMP-3.
000550 01  LCF_PRTTMP-UNPINT PIC S9(013) COMP-3.
000560 01  LCF_PRTTMP-MONINT PIC S9(013) COMP-3.
000570 01  LCF_PRTTMP-ACMINT PIC S9(013) COMP-3.
000580 01  LCF_PRTTMP-MAXBAL PIC S9(013) COMP-3.
