000010************************************************
000020* (LCF_LCFMST-PL)
000030************************************************
000040 01  LCF-LCFMST-PL-CTLNUM PIC  X(006).
000050 01  LCF-LCFMST-PL-CLTCOD PIC  X(007).
000060 01  LCF-LCFMST-PL-CLTNAM PIC  X(040).
000070 01  LCF-LCFMST-PL-REFNUM PIC  X(010).
000080 01  LCF-LCFMST-PL-BRDNAM PIC  X(040).
000090 01  LCF-LCFMST-PL-RATTYP PIC  X(020).
000100 01  LCF-LCFMST-PL-CNTDAY PIC  X(008).
000110 01  LCF-LCFMST-PL-BORDAY PIC  X(008).
000120 01  LCF-LCFMST-PL-DUEDAY PIC  X(008).
000130 01  LCF-LCFMST-PL-PAYCYC PIC  X(002).
000140 01  LCF-LCFMST-PL-BORTYP PIC  X(001).
000150 01  LCF-LCFMST-PL-TRMTYP PIC  X(001).
000160 01  LCF-LCFMST-PL-FIXFLT PIC  X(001).
000170 01  LCF-LCFMST-PL-BEFAFT PIC  X(001).
000180 01  LCF-LCFMST-PL-YERDAY PIC  X(001).
000190 01  LCF-LCFMST-PL-DAYBAS PIC  X(001).
000200 01  LCF-LCFMST-PL-FRATYP PIC  X(001).
000210 01  LCF-LCFMST-PL-SALTYP PIC  X(001).
000220 01  LCF-LCFMST-PL-OBJTYP PIC  X(001).
000230 01  LCF-LCFMST-PL-HOLSFT PIC  X(001).
000240 01  LCF-LCFMST-PL-GAPTYP PIC  X(001).
000250 01  LCF-LCFMST-PL-CREDEP PIC  X(001).
000260 01  LCF-LCFMST-PL-CRENUM PIC  X(007).
000270 01  LCF-LCFMST-PL-DEBBNK PIC  X(004).
000280 01  LCF-LCFMST-PL-DEBBRC PIC  X(003).
000290 01  LCF-LCFMST-PL-DEBDEP PIC  X(001).
000300 01  LCF-LCFMST-PL-DEBNUM PIC  X(007).
000310 01  LCF-LCFMST-PL-DAYCNT PIC S9(004) COMP-3.
000320 01  LCF-LCFMST-PL-FSTCAP PIC S9(013) COMP-3.
000330 01  LCF-LCFMST-PL-SECCAP PIC S9(013) COMP-3.
000340 01  LCF-LCFMST-PL-CAPTOT PIC S9(013) COMP-3.
000350 01  LCF-LCFMST-PL-CREAMT PIC S9(013) COMP-3.
000360 01  LCF-LCFMST-PL-FSTRAT PIC S9(002)V9(6) COMP-3.
000370 01  LCF-LCFMST-PL-SECRAT PIC S9(002)V9(6) COMP-3.
000380 01  LCF-LCFMST-PL-SUPRAT PIC S9(002)V9(6) COMP-3.
000390 01  LCF-LCFMST-PL-FSTINT PIC S9(013) COMP-3.
000400 01  LCF-LCFMST-PL-SECINT PIC S9(013) COMP-3.
000410 01  LCF-LCFMST-PL-REWRAT PIC S9(002)V9(6) COMP-3.
000420 01  LCF-LCFMST-PL-REWAMT PIC S9(013) COMP-3.
000430 01  LCF-LCFMST-PL-REWTAX PIC S9(013) COMP-3.
000440 01  LCF-LCFMST-PL-CHGRAT PIC S9(002)V9(6) COMP-3.
000450 01  LCF-LCFMST-PL-CHGAMT PIC S9(013) COMP-3.
000460 01  LCF-LCFMST-PL-CHGTAX PIC S9(013) COMP-3.
000470 01  LCF-LCFMST-PL-BKIRAT PIC S9(002)V9(6) COMP-3.
000480 01  LCF-LCFMST-PL-BKIAMT PIC S9(013) COMP-3.
000490 01  LCF-LCFMST-PL-BKITAX PIC S9(013) COMP-3.
000500 01  LCF-LCFMST-PL-REGDAY PIC  X(008).
000510 01  LCF-LCFMST-PL-REGTIM PIC  X(006).
000520 01  LCF-LCFMST-PL-REGPSN PIC  X(004).
000530 01  LCF-LCFMST-PL-MODDAY PIC  X(008).
000540 01  LCF-LCFMST-PL-MODTIM PIC  X(006).
000550 01  LCF-LCFMST-PL-MODPSN PIC  X(004).
