000010************************************************
000020* (LCF-PRTTMP-PL)
000030************************************************
000040 01  LCF-PRTTMP-PL-CTLNUM              PIC  X(006).
000050 01  LCF-PRTTMP-PL-CLTCOD              PIC  X(007).
000060 01  LCF-PRTTMP-PL-CLTNAM              PIC  X(040).
000070 01  LCF-PRTTMP-PL-REFNUM              PIC  X(010).
000080 01  LCF-PRTTMP-PL-BRDNAM              PIC  X(040).
000090 01  LCF-PRTTMP-PL-RATTYP              PIC  X(020).
000100 01  LCF-PRTTMP-PL-CNTDAY              PIC  X(008).
000110 01  LCF-PRTTMP-PL-BORDAY              PIC  X(008).
000120 01  LCF-PRTTMP-PL-DUEDAY              PIC  X(008).
000130 01  LCF-PRTTMP-PL-PAYCYC              PIC  X(002).
000140 01  LCF-PRTTMP-PL-BORTYP              PIC  X(001).
000150 01  LCF-PRTTMP-PL-TRMTYP              PIC  X(001).
000160 01  LCF-PRTTMP-PL-FIXFLT              PIC  X(001).
000170 01  LCF-PRTTMP-PL-BEFAFT              PIC  X(001).
000180 01  LCF-PRTTMP-PL-YERDAY              PIC  X(001).
000190 01  LCF-PRTTMP-PL-DAYBAS              PIC  X(001).
000200 01  LCF-PRTTMP-PL-FRATYP              PIC  X(001).
000210 01  LCF-PRTTMP-PL-SALTYP              PIC  X(001).
000220 01  LCF-PRTTMP-PL-OBJTYP              PIC  X(001).
000230 01  LCF-PRTTMP-PL-HOLSFT              PIC  X(001).
000240 01  LCF-PRTTMP-PL-GAPTYP              PIC  X(001).
000250 01  LCF-PRTTMP-PL-CREDEP              PIC  X(001).
000260 01  LCF-PRTTMP-PL-CRENUM              PIC  X(007).
000270 01  LCF-PRTTMP-PL-DEBBNK              PIC  X(004).
000280 01  LCF-PRTTMP-PL-DEBBRC              PIC  X(003).
000290 01  LCF-PRTTMP-PL-DEBDEP              PIC  X(001).
000300 01  LCF-PRTTMP-PL-DEBNUM              PIC  X(007).
000310 01  LCF-PRTTMP-PL-PLNDAY              PIC  X(008).
000320 01  LCF-PRTTMP-PL-CAPTYP              PIC  X(001).
000330 01  LCF-PRTTMP-PL-DAYCNT              PIC S9(004) COMP-3.
000340 01  LCF-PRTTMP-PL-FSTCAP              PIC S9(013) COMP-3.
000350 01  LCF-PRTTMP-PL-SECCAP              PIC S9(013) COMP-3.
000360 01  LCF-PRTTMP-PL-CAPTOT              PIC S9(013) COMP-3.
000370 01  LCF-PRTTMP-PL-CREAMT              PIC S9(013) COMP-3.
000380 01  LCF-PRTTMP-PL-FSTRAT              PIC S9(002)V9(6) COMP-3.
000390 01  LCF-PRTTMP-PL-SECRAT              PIC S9(002)V9(6) COMP-3.
000400 01  LCF-PRTTMP-PL-SUPRAT              PIC S9(002)V9(6) COMP-3.
000410 01  LCF-PRTTMP-PL-FSTINT              PIC S9(013) COMP-3.
000420 01  LCF-PRTTMP-PL-SECINT              PIC S9(013) COMP-3.
000430 01  LCF-PRTTMP-PL-REWRAT              PIC S9(002)V9(6) COMP-3.
000440 01  LCF-PRTTMP-PL-REWAMT              PIC S9(013) COMP-3.
000450 01  LCF-PRTTMP-PL-REWTAX              PIC S9(013) COMP-3.
000460 01  LCF-PRTTMP-PL-CHGRAT              PIC S9(002)V9(6) COMP-3.
000470 01  LCF-PRTTMP-PL-CHGAMT              PIC S9(013) COMP-3.
000480 01  LCF-PRTTMP-PL-CHGTAX              PIC S9(013) COMP-3.
000490 01  LCF-PRTTMP-PL-BKIRAT              PIC S9(002)V9(6) COMP-3.
000500 01  LCF-PRTTMP-PL-BKIAMT              PIC S9(013) COMP-3.
000510 01  LCF-PRTTMP-PL-BKITAX              PIC S9(013) COMP-3.
000520 01  LCF-PRTTMP-PL-UNPDAY              PIC S9(004) COMP-3.
000530 01  LCF-PRTTMP-PL-FSTAVE              PIC S9(013) COMP-3.
000540 01  LCF-PRTTMP-PL-SECAVE              PIC S9(013) COMP-3.
000550 01  LCF-PRTTMP-PL-UNPINT              PIC S9(013) COMP-3.
000560 01  LCF-PRTTMP-PL-MONINT              PIC S9(013) COMP-3.
000570 01  LCF-PRTTMP-PL-ACMINT              PIC S9(013) COMP-3.
000580 01  LCF-PRTTMP-PL-MAXBAL              PIC S9(013) COMP-3.
