000010************************************************
000020* (LCF-PAYTRN-PL)
000030************************************************
000040 01  LCF-PAYTRN-PL-CTLNUM              PIC  X(006).
000050 01  LCF-PAYTRN-PL-RECNUM              PIC  X(004).
000060 01  LCF-PAYTRN-PL-PLNDAY              PIC  X(008).
000070 01  LCF-PAYTRN-PL-CAPTYP              PIC  X(001).
000080 01  LCF-PAYTRN-PL-PAYAMT              PIC S9(013) COMP-3.
000090 01  LCF-PAYTRN-PL-PAYCAP              PIC S9(013) COMP-3.
000100 01  LCF-PAYTRN-PL-CAPBAL              PIC S9(013) COMP-3.
000110 01  LCF-PAYTRN-PL-BNKINT              PIC S9(013) COMP-3.
000120 01  LCF-PAYTRN-PL-REGDAY              PIC  X(008).
000130 01  LCF-PAYTRN-PL-REGTIM              PIC  X(006).
000140 01  LCF-PAYTRN-PL-REGPSN              PIC  X(004).
000150 01  LCF-PAYTRN-PL-MODDAY              PIC  X(008).
000160 01  LCF-PAYTRN-PL-MODTIM              PIC  X(006).
000170 01  LCF-PAYTRN-PL-MODPSN              PIC  X(004).
