000010*****************************************************************
000020*   íZä˙ÉäÅ[ÉXç¬å†ó¨ìÆâªéxï•ìWäJ(LCF-PAYTRN-PayTrn)
000030*****************************************************************
000040 01  LCF-PAYTRN-CtlNum       PIC  X(6).
000050 01  LCF-PAYTRN-RecNum       PIC  X(4).
000060 01  LCF-PAYTRN-PlnDay       PIC  X(8).
000070 01  LCF-PAYTRN-CapTyp       PIC  X(1).
000080 01  LCF-PAYTRN-PayAmt       PIC S9(13) COMP-3.
000090 01  LCF-PAYTRN-PayCap       PIC S9(13) COMP-3.
000100 01  LCF-PAYTRN-CapBal       PIC S9(13) COMP-3.
000110 01  LCF-PAYTRN-BnkInt       PIC S9(13) COMP-3.
000120 01  LCF-PAYTRN-RegDay       PIC  X(8).
000130 01  LCF-PAYTRN-RegTim       PIC  X(6).
000140 01  LCF-PAYTRN-RegPsn       PIC  X(4).
000150 01  LCF-PAYTRN-ModDay       PIC  X(8).
000160 01  LCF-PAYTRN-ModTim       PIC  X(6).
000170 01  LCF-PAYTRN-ModPsn       PIC  X(4).
