000010************************************************
000020* (LEA_WORK01)
000030************************************************
000040 01  LEA_WORK01-KEY PIC  X(001).
000050 01  LEA_WORK01-Ø°½Š„•Š‹æ•ª PIC  X(001).
000060 01  LEA_WORK01-ŒvŽZ•ûŽ® PIC  X(001).
000070 01  LEA_WORK01-‹Ï“™_•s‹Ï“™ PIC  X(020).
000080 01  LEA_WORK01-ŒJ‰„” PIC S9(002) COMP-3.
000090 01  LEA_WORK01-•¨Œ” PIC S9(003) COMP-3.
000100 01  LEA_WORK01-w“ü‹àŠz PIC S9(013) COMP-3.
000110 01  LEA_WORK01-‰Šú”ï—p PIC S9(013) COMP-3.
000120 01  LEA_WORK01-Ø°½ŠúŠÔ PIC S9(003) COMP-3.
000130 01  LEA_WORK01-¿‹»²¸Ù PIC S9(002) COMP-3.
000140 01  LEA_WORK01-Žx•¥‰ñ” PIC S9(003) COMP-3.
000150 01  LEA_WORK01-˜’uŒŽ” PIC S9(002)V9(2) COMP-3.
000160 01  LEA_WORK01-Ø°½—¿ PIC S9(013) COMP-3.
000170 01  LEA_WORK01-Ø°½—¿—¦ PIC S9(002)V9(8) COMP-3.
000180 01  LEA_WORK01-‘Ï—p”N” PIC S9(002) COMP-3.
000190 01  LEA_WORK01-ŒÅ’èŽ‘ŽYÅ—¦ PIC S9(002)V9(2) COMP-3.
000200 01  LEA_WORK01-“®‘•ÛŒ¯—¿—¦ PIC S9(002)V9(3) COMP-3.
000210 01  LEA_WORK01-Žc‰¿Šz PIC S9(013) COMP-3.
000220 01  LEA_WORK01-ŒŽŠz•ÛŽç—¿ PIC S9(013) COMP-3.
000230 01  LEA_WORK01-‘OŽóŒŽ” PIC S9(002) COMP-3.
000240 01  LEA_WORK01-ŒJ‰„‹àŠz1 PIC S9(013) COMP-3.
000250 01  LEA_WORK01-ŒJ‰„ŒŽ”1 PIC S9(002)V9(2) COMP-3.
000260 01  LEA_WORK01-ŒJ‰„‹àŠz2 PIC S9(013) COMP-3.
000270 01  LEA_WORK01-ŒJ‰„ŒŽ”2 PIC S9(002)V9(2) COMP-3.
000280 01  LEA_WORK01-Œ_–ñ‘Šz PIC S9(013) COMP-3.
000290 01  LEA_WORK01-Šî–{Ø°½—¿‘Šz PIC S9(013) COMP-3.
000300 01  LEA_WORK01-Šî–{Ø°½—¿ŒŽŠz PIC S9(013) COMP-3.
000310 01  LEA_WORK01-Šî–{Ø°½—¿—¦ PIC S9(002)V9(8) COMP-3.
000320 01  LEA_WORK01-ŒÅ’èŽ‘ŽYÅ‘Šz PIC S9(013) COMP-3.
000330 01  LEA_WORK01-ŒÅ’èŽ‘ŽYÅŒŽŠz PIC S9(013) COMP-3.
000340 01  LEA_WORK01-ŒÅ’èŽ‘ŽYÅ—¿—¦ PIC S9(002)V9(8) COMP-3.
000350 01  LEA_WORK01-“®‘•ÛŒ¯‘Šz PIC S9(013) COMP-3.
000360 01  LEA_WORK01-“®‘•ÛŒ¯ŒŽŠz PIC S9(013) COMP-3.
000370 01  LEA_WORK01-“®‘•ÛŒ¯—¿—¿—¦ PIC S9(002)V9(8) COMP-3.
000380 01  LEA_WORK01-‡Œv1 PIC S9(013) COMP-3.
000390 01  LEA_WORK01-‡Œv2 PIC S9(013) COMP-3.
000400 01  LEA_WORK01-‡Œv3 PIC S9(002)V9(8) COMP-3.
000410 01  LEA_WORK01-Žc‰¿Šz‘Šz PIC S9(013) COMP-3.
000420 01  LEA_WORK01-Žc‰¿ŠzŒŽŠz PIC S9(013) COMP-3.
000430 01  LEA_WORK01-Žc‰¿—¦ PIC S9(002)V9(8) COMP-3.
000440 01  LEA_WORK01-‘OŽóØ°½—¿‘Šz PIC S9(013) COMP-3.
000450 01  LEA_WORK01-‘OŽóØ°½—¿ŒŽŠz PIC S9(013) COMP-3.
000460 01  LEA_WORK01-‘OŽóØ°½—¿—¦ PIC S9(002)V9(8) COMP-3.
000470 01  LEA_WORK01-ŒJ‰„‹àŠz‘Šz PIC S9(013) COMP-3.
000480 01  LEA_WORK01-ŒJ‰„‹àŠzŒŽŠz PIC S9(013) COMP-3.
000490 01  LEA_WORK01-ŒJ‰„‹àŠz—¦ PIC S9(002)V9(8) COMP-3.
000500 01  LEA_WORK01-‡Œv4 PIC S9(013) COMP-3.
000510 01  LEA_WORK01-‡Œv5 PIC S9(013) COMP-3.
000520 01  LEA_WORK01-‡Œv6 PIC S9(002)V9(8) COMP-3.
000530 01  LEA_WORK01-ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000540 01  LEA_WORK01-Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000550 01  LEA_WORK01-ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000560 01  LEA_WORK01-ŽÀŽ¿Ø°½—¿PV PIC S9(013) COMP-3.
000570 01  LEA_WORK01-Žc‰¿ŠzPV PIC S9(013) COMP-3.
000580 01  LEA_WORK01-Žû“ü‡Œv PIC S9(013) COMP-3.
000590 01  LEA_WORK01-‘e—˜‰v PIC S9(013) COMP-3.
000600 01  LEA_WORK01-‹K’è‘¹Ž¸‹à1 PIC S9(013) COMP-3.
000610 01  LEA_WORK01-‹K’è‘¹Ž¸‹à2 PIC S9(013) COMP-3.
000620 01  LEA_WORK01-‹K’è‘¹Ž¸‹à3 PIC S9(013) COMP-3.
000630 01  LEA_WORK01-‹K’è‘¹Ž¸‹à4 PIC S9(013) COMP-3.
000640 01  LEA_WORK01-‹K’è‘¹Ž¸‹à5 PIC S9(013) COMP-3.
000650 01  LEA_WORK01-‹K’è‘¹Ž¸‹à6 PIC S9(013) COMP-3.
000660 01  LEA_WORK01-‹K’è‘¹Ž¸‹à7 PIC S9(013) COMP-3.
000670 01  LEA_WORK01-‹K’è‘¹Ž¸‹à8 PIC S9(013) COMP-3.
000680 01  LEA_WORK01-‹K’è‘¹Ž¸‹à9 PIC S9(013) COMP-3.
000690 01  LEA_WORK01-‹K’è‘¹Ž¸‹à10 PIC S9(013) COMP-3.
000700 01  LEA_WORK01-Ø°½—¿1 PIC S9(013) COMP-3.
000710 01  LEA_WORK01-Ø°½—¿2 PIC S9(013) COMP-3.
000720 01  LEA_WORK01-Ø°½—¿3 PIC S9(013) COMP-3.
000730 01  LEA_WORK01-Ø°½—¿4 PIC S9(013) COMP-3.
000740 01  LEA_WORK01-Ø°½—¿5 PIC S9(013) COMP-3.
000750 01  LEA_WORK01-ŽÀŽ¿—˜‰ñ‚è1 PIC S9(002)V9(8) COMP-3.
000760 01  LEA_WORK01-ŽÀŽ¿—˜‰ñ‚è2 PIC S9(002)V9(8) COMP-3.
000770 01  LEA_WORK01-ŽÀŽ¿—˜‰ñ‚è3 PIC S9(002)V9(8) COMP-3.
000780 01  LEA_WORK01-ŽÀŽ¿—˜‰ñ‚è4 PIC S9(002)V9(8) COMP-3.
000790 01  LEA_WORK01-ŽÀŽ¿—˜‰ñ‚è5 PIC S9(002)V9(8) COMP-3.
000800 01  LEA_WORK01-‘e—˜1 PIC S9(013) COMP-3.
000810 01  LEA_WORK01-‘e—˜2 PIC S9(013) COMP-3.
000820 01  LEA_WORK01-‘e—˜3 PIC S9(013) COMP-3.
000830 01  LEA_WORK01-‘e—˜4 PIC S9(013) COMP-3.
000840 01  LEA_WORK01-‘e—˜5 PIC S9(013) COMP-3.
000850 01  LEA_WORK01-Ã·½Ä1 PIC  X(100).
000860 01  LEA_WORK01-Ã·½Ä2 PIC  X(100).
000870 01  LEA_WORK01-Ã·½Ä3 PIC  X(100).
000880 01  LEA_WORK01-Ã·½Ä4 PIC  X(100).
000890 01  LEA_WORK01-Ã·½Ä5 PIC  X(100).
000900 01  LEA_WORK01-“o˜^“ú PIC  X(008).
000910 01  LEA_WORK01-“o˜^Žž PIC  X(006).
000920 01  LEA_WORK01-“o˜^’S“–ŽÒº°ÄÞ PIC  X(004).
000930 01  LEA_WORK01-XV“ú PIC  X(008).
000940 01  LEA_WORK01-XVŽž PIC  X(006).
000950 01  LEA_WORK01-XV’S“–ŽÒº°ÄÞ PIC  X(004).
