000010************************************************
000020* (LEA_KIHON)
000030************************************************
000040 01  LEA_KIHON-KEY PIC  X(001).
000050 01  LEA_KIHON-計算方式 PIC  X(001).
000060 01  LEA_KIHON-ﾘｰｽ期間 PIC S9(003) COMP-3.
000070 01  LEA_KIHON-請求ｻｲｸﾙ PIC S9(002) COMP-3.
000080 01  LEA_KIHON-支払回数 PIC S9(003) COMP-3.
000090 01  LEA_KIHON-前受月数 PIC S9(002) COMP-3.
000100 01  LEA_KIHON-据置期間 PIC S9(002)V9(2) COMP-3.
000110 01  LEA_KIHON-社内金利 PIC S9(002)V9(2) COMP-3.
000120 01  LEA_KIHON-月額平均保守料 PIC S9(013) COMP-3.
000130 01  LEA_KIHON-初期費用 PIC S9(013) COMP-3.
000140 01  LEA_KIHON-消費税率 PIC S9(002)V9(1) COMP-3.
000150 01  LEA_KIHON-消費税徴収区分 PIC  X(001).
000160 01  LEA_KIHON-ﾘｰｽ料 PIC S9(013) COMP-3.
000170 01  LEA_KIHON-実質利回り PIC S9(002)V9(8) COMP-3.
000180 01  LEA_KIHON-基本利回り PIC S9(002)V9(8) COMP-3.
000190 01  LEA_KIHON-粗利益 PIC S9(013) COMP-3.
000200 01  LEA_KIHON-契約金額 PIC S9(013) COMP-3.
000210 01  LEA_KIHON-ﾘｰｽ料率 PIC S9(002)V9(8) COMP-3.
000220 01  LEA_KIHON-基本ﾘｰｽ料 PIC S9(013) COMP-3.
000230 01  LEA_KIHON-月額固定資産税計 PIC S9(013) COMP-3.
000240 01  LEA_KIHON-月額動総保険料計 PIC S9(013) COMP-3.
000250 01  LEA_KIHON-月額前受ﾒﾘｯﾄ PIC S9(013) COMP-3.
000260 01  LEA_KIHON-月額繰延ﾒﾘｯﾄ計 PIC S9(013) COMP-3.
000270 01  LEA_KIHON-実質ﾘｰｽ料PV PIC S9(013) COMP-3.
000280 01  LEA_KIHON-残価PV PIC S9(013) COMP-3.
000290 01  LEA_KIHON-物件数 PIC S9(003) COMP-3.
000300 01  LEA_KIHON-繰延数 PIC S9(002) COMP-3.
000310 01  LEA_KIHON-登録日 PIC  X(008).
000320 01  LEA_KIHON-登録時刻 PIC  X(006).
000330 01  LEA_KIHON-登録担当者ｺｰﾄﾞ PIC  X(004).
000340 01  LEA_KIHON-更新日 PIC  X(008).
000350 01  LEA_KIHON-更新時刻 PIC  X(006).
000360 01  LEA_KIHON-更新担当者ｺｰﾄﾞ PIC  X(004).
