000010************************************************
000020* (LEA_KURINOBE)
000030************************************************
000040 01  LEA_KURINOBE-KEY PIC  X(001).
000050 01  LEA_KURINOBE-ŒJ‰„NO PIC S9(002) COMP-3.
000060 01  LEA_KURINOBE-ŒJ‰„‹àŠz PIC S9(013) COMP-3.
000070 01  LEA_KURINOBE-ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000080 01  LEA_KURINOBE-“o˜^“ú PIC  X(008).
000090 01  LEA_KURINOBE-“o˜^Žž PIC  X(006).
000100 01  LEA_KURINOBE-“o˜^’S“–ŽÒº°ÄÞ PIC  X(004).
000110 01  LEA_KURINOBE-XV“ú PIC  X(008).
000120 01  LEA_KURINOBE-XVŽž PIC  X(006).
000130 01  LEA_KURINOBE-XV’S“–ŽÒº°ÄÞ PIC  X(004).
