000010************************************************
000020* ‹âsƒ}ƒXƒ^[iŽx“XƒŒƒR[ƒhj(LTRBAS)
000030************************************************
000040 01  ‚k‚s‚q‚a‚`‚r|‹âsƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚a‚`‚r|–{Žx“XƒR[ƒh PIC  X(003).
000060 01  ‚k‚s‚q‚a‚`‚r|•t‰ÁƒR[ƒh PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚a‚`‚r|Žx“X–¼Š¿Žš PIC  X(030).
000080 01  ‚k‚s‚q‚a‚`‚r|Žx“X–¼ƒJƒi PIC  X(015).
000090 01  ‚k‚s‚q‚a‚`‚r|–{Žx“X–¼—ªÌŠ¿Žš PIC  X(040).
000100 01  ‚k‚s‚q‚a‚`‚r|–{Žx“X–¼—ªÌƒJƒi PIC  X(030).
000110 01  ‚k‚s‚q‚a‚`‚r|ŽèŒ`ŒðŠ·Š”Ô† PIC  X(004).
000120 01  ‚k‚s‚q‚a‚`‚r|ƒ_ƒ~[‚O‚O‚P PIC  X(042).
000130 01  ‚k‚s‚q‚a‚`‚r|‹¤’Êî•ñ PIC  X(035).
