000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(˜A“®‹à—˜)(LTRCDM0420)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|˜A“®‹à—˜‹æ•ª PIC  X(002).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|‚r‚d‚p‚m‚n PIC  X(002).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|‹à—˜‚P PIC S9(003)V9(7) COMP-3.
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|¢‹I‚P PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|”NŒŽ“ú‚P PIC S9(006) COMP-3.
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|¢‹I‚P PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|”NŒŽ“ú‚P PIC S9(006) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|ƒ_ƒ~[‚P PIC  X(004).
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|‹à—˜‚Q PIC S9(003)V9(7) COMP-3.
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|¢‹I‚Q PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|”NŒŽ“ú‚Q PIC S9(006) COMP-3.
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|¢‹I‚Q PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|”NŒŽ“ú‚Q PIC S9(006) COMP-3.
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|ƒ_ƒ~[‚Q PIC  X(004).
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|‹à—˜‚R PIC S9(003)V9(7) COMP-3.
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|¢‹I‚R PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|”NŒŽ“ú‚R PIC S9(006) COMP-3.
000290 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|¢‹I‚R PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|”NŒŽ“ú‚R PIC S9(006) COMP-3.
000310 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|ƒ_ƒ~[‚R PIC  X(004).
000320 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000340 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|‹à—˜‚S PIC S9(003)V9(7) COMP-3.
000350 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|¢‹I‚S PIC S9(001) COMP-3.
000360 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|”NŒŽ“ú‚S PIC S9(006) COMP-3.
000370 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|¢‹I‚S PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|”NŒŽ“ú‚S PIC S9(006) COMP-3.
000390 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|ƒ_ƒ~[‚S PIC  X(004).
000400 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000410 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000420 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|‹à—˜‚T PIC S9(003)V9(7) COMP-3.
000430 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|¢‹I‚T PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|“o˜^“ú|”NŒŽ“ú‚T PIC S9(006) COMP-3.
000450 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|¢‹I‚T PIC S9(001) COMP-3.
000460 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|XV“ú|”NŒŽ“ú‚T PIC S9(006) COMP-3.
000470 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|ƒ_ƒ~[‚T PIC  X(004).
000480 01  ‚k‚s‚q‚b‚c‚l‚O‚S‚Q‚O|‹¤’Êî•ñ PIC  X(035).
