000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(‹¤’Ê)(LTRCDM)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l|ƒ^ƒCƒv PIC  X(001).
000050 01  ‚k‚s‚q‚b‚c‚l|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000060 01  ‚k‚s‚q‚b‚c‚l|ƒL[€–Ú•” PIC  X(011).
000070 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l|ƒf[ƒ^€–Ú•”‚P PIC  X(023).
000100 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q PIC S9(001) COMP-3.
000110 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q PIC  X(006).
000120 01  ‚k‚s‚q‚b‚c‚l|ƒf[ƒ^€–Ú•”‚Q PIC  X(023).
000130 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R PIC  X(006).
000150 01  ‚k‚s‚q‚b‚c‚l|ƒf[ƒ^€–Ú•”‚R PIC  X(023).
000160 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S PIC  X(006).
000180 01  ‚k‚s‚q‚b‚c‚l|ƒf[ƒ^€–Ú•”‚S PIC  X(023).
000190 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T PIC  X(006).
000210 01  ‚k‚s‚q‚b‚c‚l|ƒf[ƒ^€–Ú•”‚T PIC  X(023).
000220 01  ‚k‚s‚q‚b‚c‚l|‹¤’Êî•ñ PIC  X(035).
