000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(“®‘’ZŠú—¿—¦)(LTRCDM1120)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚P‚P‚Q‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚P‚P‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(011).
000060 01  ‚k‚s‚q‚b‚c‚l‚P‚P‚Q‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(150).
000070 01  ‚k‚s‚q‚b‚c‚l‚P‚P‚Q‚O|‹¤’Êî•ñ PIC  X(035).
