000010************************************************
000020* ƒVƒƒ[ƒv‰ð–ñi‚r‚e‚bŠî–{j(LTRKSK)
000030************************************************
000040 01  ‚k‚s‚q‚j‚r‚j|‚a‚n‚s‚kŒ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚j‚r‚j|‚r‚e‚bŒ_–ñ‚m‚n PIC  X(012).
000060 01  ‚k‚s‚q‚j‚r‚j|‰ïŽÐƒR[ƒh PIC  X(002).
000070 01  ‚k‚s‚q‚j‚r‚j|‰ïŽÐ–¼ PIC  X(030).
000080 01  ‚k‚s‚q‚j‚r‚j|Žx“XƒR[ƒh PIC  X(002).
000090 01  ‚k‚s‚q‚j‚r‚j|Žx“X–¼ PIC  X(020).
000100 01  ‚k‚s‚q‚j‚r‚j|Œ_–ñŽÒ–¼ PIC  X(025).
000110 01  ‚k‚s‚q‚j‚r‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000120 01  ‚k‚s‚q‚j‚r‚j|‘S•”ˆê•”‹æ•ª PIC  X(001).
000130 01  ‚k‚s‚q‚j‚r‚j|‰ð–ñ——R PIC  X(001).
000140 01  ‚k‚s‚q‚j‚r‚j|‰ð–ñˆ— PIC  X(001).
000150 01  ‚k‚s‚q‚j‚r‚j|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚j‚r‚j|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000170 01  ‚k‚s‚q‚j‚r‚j|V‚rŒ_–ñ‚m‚n PIC  X(012).
000180 01  ‚k‚s‚q‚j‚r‚j|‹K‘¹‹àŽx•¥“ú|¢‹I PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚j‚r‚j|‹K‘¹‹àŽx•¥“ú|”NŒŽ“ú PIC  X(006).
000200 01  ‚k‚s‚q‚j‚r‚j|Už’âŽ~“ú|¢‹I PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚j‚r‚j|Už’âŽ~“ú|”NŒŽ“ú PIC  X(006).
000220 01  ‚k‚s‚q‚j‚r‚j|‚l‚s‹æ•ª PIC  X(001).
000230 01  ‚k‚s‚q‚j‚r‚j|•ÏX‹æ•ª PIC  X(001).
000240 01  ‚k‚s‚q‚j‚r‚j|‚l‚sXV‹æ•ª PIC  X(001).
000250 01  ‚k‚s‚q‚j‚r‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(011).
000260 01  ‚k‚s‚q‚j‚r‚j|‹K’è‘¹ŠQ‹à PIC S9(013) COMP-3.
000270 01  ‚k‚s‚q‚j‚r‚j|Å’á‘¹ŠQŠz PIC S9(013) COMP-3.
000280 01  ‚k‚s‚q‚j‚r‚j|‹K’è‘¹Ž¸‹àÁ”ïÅ—¦ PIC S9(003)V9(1) COMP-3.
000290 01  ‚k‚s‚q‚j‚r‚j|‹K’è‘¹Ž¸‹àÁ”ïÅ PIC S9(013) COMP-3.
000300 01  ‚k‚s‚q‚j‚r‚j|ƒ_ƒ~[‚O‚O‚R PIC  X(006).
000310 01  ‚k‚s‚q‚j‚r‚j|·ˆøŽx•¥Šz PIC S9(013) COMP-3.
000320 01  ‚k‚s‚q‚j‚r‚j|·ˆøŽx•¥ŠzÁ”ïÅ PIC S9(013) COMP-3.
000330 01  ‚k‚s‚q‚j‚r‚j|ƒ_ƒ~[‚O‚O‚S PIC  X(071).
000340 01  ‚k‚s‚q‚j‚r‚j|‹¤’Êî•ñ PIC  X(035).
