000010************************************************
000020* ”ƒŠ|‹àŠî–{(LTRKKK)
000030************************************************
000040 01  ‚k‚s‚q‚j‚j‚j|Œ_–ñ”Ô†|‚P PIC  X(007).
000050 01  ‚k‚s‚q‚j‚j‚j|Œ_–ñ”Ô†|‚Q PIC  X(002).
000060 01  ‚k‚s‚q‚j‚j‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000070 01  ‚k‚s‚q‚j‚j‚j|ƒ†[ƒUƒR[ƒh PIC  X(008).
000080 01  ‚k‚s‚q‚j‚j‚j|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000090 01  ‚k‚s‚q‚j‚j‚j|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000100 01  ‚k‚s‚q‚j‚j‚j|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000110 01  ‚k‚s‚q‚j‚j‚j|ŒŸŽû“ú|ŒŸŽû“ú PIC  X(006).
000120 01  ‚k‚s‚q‚j‚j‚j|“]ƒŠ[ƒX’ñŒgæƒŠ[ƒX PIC S9(002) COMP-3.
000130 01  ‚k‚s‚q‚j‚j‚j|ÅIŒ_–ñŽ}”Ô PIC  X(002).
000140 01  ‚k‚s‚q‚j‚j‚j|[“–‘ŠŽE‹æ•ª PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚j‚j‚j|‘O“r‹à‹æ•ª PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚j‚j‚j|Žæˆø“ú|¢‹I PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚j‚j‚j|Žæˆø“ú|ŒŸŽû“ú PIC  X(006).
000180 01  ‚k‚s‚q‚j‚j‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(030).
000190 01  ‚k‚s‚q‚j‚j‚j|w“üæƒŒƒR[ƒhŒ” PIC S9(002) COMP-3.
000200 01  ‚k‚s‚q‚j‚j‚j|‹¤’Êî•ñ PIC  X(035).
