000010************************************************
000020* –¼Ìƒ}ƒXƒ^i’S“–ŽÒƒ}ƒXƒ^)(LTRMEI010)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|’S“–ŽÒƒR[ƒh PIC  X(004).
000070 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000080 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|Š‘®Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000090 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|ŒÂl”Ô† PIC S9(007) COMP-3.
000100 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|© PIC  X(008).
000110 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|–¼ PIC  X(006).
000120 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|©ƒJƒi PIC  X(010).
000130 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|Œo‰cƒtƒ‰ƒO PIC  X(001).
000140 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(114).
000150 01  ‚k‚s‚q‚l‚d‚h‚O‚P‚O|‹¤’Êî•ñ PIC  X(035).
