000010************************************************
000020* –¼Ìƒ}ƒXƒ^i‹ÆŽí–¼)(LTRMEI022)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|‹ÆŽíƒR[ƒh PIC  X(002).
000070 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000080 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|–¼Ì PIC  X(020).
000090 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|—ªÌ PIC  X(010).
000100 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|–¼ÌƒJƒi PIC  X(025).
000110 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|—ªÌƒJƒi PIC  X(012).
000120 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|ƒ_ƒ~[‚O‚O‚Q PIC  X(083).
000130 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚Q|‹¤’Êî•ñ PIC  X(035).
