000010************************************************
000020* –¼Ìƒ}ƒXƒ^iŽO•HŽ©HÝ’uêŠ–¼j(LTRMEI520)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|ŠÝêŠƒR[ƒh PIC  X(005).
000070 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000080 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|”[•tæƒR[ƒh PIC  X(006).
000090 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|Ý’uêŠ–¼Š¿Žš PIC  X(040).
000100 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|Ý’uêŠ–¼ƒJƒi PIC  X(020).
000110 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000120 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|Ý’uêŠZŠŠ¿Žš PIC  X(060).
000130 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(017).
000140 01  ‚k‚s‚q‚l‚d‚h‚T‚Q‚O|‹¤’Êî•ñ PIC  X(035).
