000010************************************************
000020* “ü‹àî•ñi“ü‹àî•ñj(LTRNYU)
000030************************************************
000040 01  ‚k‚s‚q‚m‚x‚t|‚j‚d‚x€–Ú“ü‹à’Ê”Ô PIC S9(009) COMP-3.
000050 01  ‚k‚s‚q‚m‚x‚t|“ü‹à‹æ•ª PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚m‚x‚t|“ü‹àŒ³ƒR[ƒh PIC  X(008).
000070 01  ‚k‚s‚q‚m‚x‚t|“ü‹àŠz PIC S9(013) COMP-3.
000080 01  ‚k‚s‚q‚m‚x‚t|“ü‹àæ–¼Ì PIC  X(048).
000090 01  ‚k‚s‚q‚m‚x‚t|“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000100 01  ‚k‚s‚q‚m‚x‚t|“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000110 01  ‚k‚s‚q‚m‚x‚t|Áž‹àŠz PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚m‚x‚t|‹âsƒR[ƒh PIC S9(007) COMP-3.
000130 01  ‚k‚s‚q‚m‚x‚t|ŒûÀ”Ô† PIC S9(007) COMP-3.
000140 01  ‚k‚s‚q‚m‚x‚t|Œ_–ñ”Ô† PIC  X(009).
000150 01  ‚k‚s‚q‚m‚x‚t|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚m‚x‚t|Áž“ú|¢‹I PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚m‚x‚t|Áž“ú|”NŒŽ“ú PIC  X(006).
000180 01  ‚k‚s‚q‚m‚x‚t|Á”ïÅŽc‚ PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚m‚x‚t|‚q‚`‚s‚d PIC S9(003)V9(2) COMP-3.
000200 01  ‚k‚s‚q‚m‚x‚t|ŠO‰Ý‹àŠz PIC S9(011)V9(2) COMP-3.
000210 01  ‚k‚s‚q‚m‚x‚t|“ü‹à‹âs’ZkƒR[ƒh PIC S9(002) COMP-3.
000220 01  ‚k‚s‚q‚m‚x‚t|“ü‹àŽd•ª’ZkƒR[ƒh PIC S9(002) COMP-3.
000230 01  ‚k‚s‚q‚m‚x‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(024).
000240 01  ‚k‚s‚q‚m‚x‚t|‹¤’Êî•ñ PIC  X(035).
