000010************************************************
000020* 入金消込取消プルーフＦ（消込取消基本)(LTRNTP)
000030************************************************
000040 01  ＬＴＲＮＴＰ－消込取消データ PIC  X(200).
