000010************************************************
000020* ÂŒ —¬“®‰»(LTRRYU)
000030************************************************
000040 01  ‚k‚s‚q‚q‚x‚t|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚q‚x‚t|‹âsƒR[ƒh PIC  X(004).
000060 01  ‚k‚s‚q‚q‚x‚t|Žx“XƒR[ƒh PIC  X(003).
000070 01  ‚k‚s‚q‚q‚x‚t|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000080 01  ‚k‚s‚q‚q‚x‚t|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚k‚s‚q‚q‚x‚t|¿‹æƒR[ƒh PIC  X(008).
000100 01  ‚k‚s‚q‚q‚x‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(025).
000110 01  ‚k‚s‚q‚q‚x‚t|‹¤’Êî•ñ PIC  X(035).
