000010************************************************
000020* ÂŒ iÂŒ Šî–{j(LTRSAK)
000030************************************************
000040 01  ‚k‚s‚q‚r‚`‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚k‚s‚q‚r‚`‚j|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000060 01  ‚k‚s‚q‚r‚`‚j|ƒ†[ƒUƒR[ƒh PIC  X(008).
000070 01  ‚k‚s‚q‚r‚`‚j|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000080 01  ‚k‚s‚q‚r‚`‚j|Œ´Œ_–ñ PIC  X(001).
000090 01  ‚k‚s‚q‚r‚`‚j|Œp‘±ƒŠ[ƒX PIC  X(001).
000100 01  ‚k‚s‚q‚r‚`‚j|ÄƒŠ[ƒX PIC  X(001).
000110 01  ‚k‚s‚q‚r‚`‚j|Š„•Š PIC  X(001).
000120 01  ‚k‚s‚q‚r‚`‚j|Žè”—¿ PIC  X(001).
000130 01  ‚k‚s‚q‚r‚`‚j|ƒtƒ@ƒNƒ^ƒŠƒ“ƒO PIC  X(001).
000140 01  ‚k‚s‚q‚r‚`‚j|‹àÁ PIC  X(001).
000150 01  ‚k‚s‚q‚r‚`‚j|Žx•¥•ÛØ PIC  X(001).
000160 01  ‚k‚s‚q‚r‚`‚j|ŒŸŽûWŒv•\‘ÎÛŠO‹æ•ª PIC  X(001).
000170 01  ‚k‚s‚q‚r‚`‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000180 01  ‚k‚s‚q‚r‚`‚j|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000190 01  ‚k‚s‚q‚r‚`‚j|”Û”F‹æ•ª PIC  X(001).
000200 01  ‚k‚s‚q‚r‚`‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(027).
000210 01  ‚k‚s‚q‚r‚`‚j|Œ³Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000220 01  ‚k‚s‚q‚r‚`‚j|Œ³ƒ†[ƒUƒR[ƒh PIC  X(008).
000230 01  ‚k‚s‚q‚r‚`‚j|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000240 01  ‚k‚s‚q‚r‚`‚j|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000250 01  ‚k‚s‚q‚r‚`‚j|‹¤’Êî•ñ PIC  X(035).
