000010************************************************
000020* —š—ðƒAƒ“ƒ}ƒbƒ`ÂŒ Šî–{(LTRSAK_U)
000030************************************************
000040 01  ‚k‚s‚q‚r‚`‚j|‚t|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚`‚j|‚t|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚k‚s‚q‚r‚`‚j|‚t|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000070 01  ‚k‚s‚q‚r‚`‚j|‚t|ƒ†[ƒUƒR[ƒh PIC  X(008).
000080 01  ‚k‚s‚q‚r‚`‚j|‚t|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000090 01  ‚k‚s‚q‚r‚`‚j|‚t|Œ´Œ_–ñ PIC  X(001).
000100 01  ‚k‚s‚q‚r‚`‚j|‚t|Œp‘±ƒŠ[ƒX PIC  X(001).
000110 01  ‚k‚s‚q‚r‚`‚j|‚t|ÄƒŠ[ƒX PIC  X(001).
000120 01  ‚k‚s‚q‚r‚`‚j|‚t|Š„•Š PIC  X(001).
000130 01  ‚k‚s‚q‚r‚`‚j|‚t|Žè”—¿ PIC  X(001).
000140 01  ‚k‚s‚q‚r‚`‚j|‚t|ƒtƒ@ƒNƒ^ƒŠƒ“ƒO PIC  X(001).
000150 01  ‚k‚s‚q‚r‚`‚j|‚t|‹àÁ PIC  X(001).
000160 01  ‚k‚s‚q‚r‚`‚j|‚t|Žx•¥•ÛØ PIC  X(001).
000170 01  ‚k‚s‚q‚r‚`‚j|‚t|ŒŸŽûWŒv•\‘ÎÛŠO‹æ•ª PIC  X(001).
000180 01  ‚k‚s‚q‚r‚`‚j|‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000190 01  ‚k‚s‚q‚r‚`‚j|‚t|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000200 01  ‚k‚s‚q‚r‚`‚j|‚t|”Û”F‹æ•ª PIC  X(001).
000210 01  ‚k‚s‚q‚r‚`‚j|‚t|ƒ_ƒ~[‚O‚O‚Q PIC  X(027).
000220 01  ‚k‚s‚q‚r‚`‚j|‚t|Œ³Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000230 01  ‚k‚s‚q‚r‚`‚j|‚t|Œ³ƒ†[ƒUƒR[ƒh PIC  X(008).
000240 01  ‚k‚s‚q‚r‚`‚j|‚t|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000250 01  ‚k‚s‚q‚r‚`‚j|‚t|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000260 01  ‚k‚s‚q‚r‚`‚j|‚t|‹¤’Êî•ñ PIC  X(035).
