000010************************************************
000020* ÂŒ i–¾×j(LTRSAM)
000030************************************************
000040 01  ‚k‚s‚q‚r‚`‚l|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚k‚s‚q‚r‚`‚l|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚r‚`‚l|•¨Œ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚r‚`‚l|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000080 01  ‚k‚s‚q‚r‚`‚l|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000090 01  ‚k‚s‚q‚r‚`‚l|‰ð–ñ‹æ•ª PIC  X(001).
000100 01  ‚k‚s‚q‚r‚`‚l|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000110 01  ‚k‚s‚q‚r‚`‚l|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000120 01  ‚k‚s‚q‚r‚`‚l|‰ð–ñ‘ÎÛƒR[ƒh PIC  X(001).
000130 01  ‚k‚s‚q‚r‚`‚l|‰ð–ñˆ—ƒR[ƒh PIC  X(001).
000140 01  ‚k‚s‚q‚r‚`‚l|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚r‚`‚l|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000160 01  ‚k‚s‚q‚r‚`‚l|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚r‚`‚l|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000180 01  ‚k‚s‚q‚r‚`‚l|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚r‚`‚l|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000200 01  ‚k‚s‚q‚r‚`‚l|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚r‚`‚l|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000220 01  ‚k‚s‚q‚r‚`‚l|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000230 01  ‚k‚s‚q‚r‚`‚l|¿‹æƒR[ƒh PIC  X(008).
000240 01  ‚k‚s‚q‚r‚`‚l|Žx•¥‰ñ” PIC S9(003) COMP-3.
000250 01  ‚k‚s‚q‚r‚`‚l|ŒvŽZ•ûŽ® PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚r‚`‚l|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000270 01  ‚k‚s‚q‚r‚`‚l|˜’uŠúŠÔ PIC S9(003) COMP-3.
000280 01  ‚k‚s‚q‚r‚`‚l|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000290 01  ‚k‚s‚q‚r‚`‚l|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚r‚`‚l|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000310 01  ‚k‚s‚q‚r‚`‚l|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚r‚`‚l|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000330 01  ‚k‚s‚q‚r‚`‚l|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000340 01  ‚k‚s‚q‚r‚`‚l|‘OŽó[“–ŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000350 01  ‚k‚s‚q‚r‚`‚l|‘OŽó[“–ŠJŽn“ú|”NŒŽ PIC  X(004).
000360 01  ‚k‚s‚q‚r‚`‚l|‘OŽó[“–I—¹“ú|¢‹I PIC S9(001) COMP-3.
000370 01  ‚k‚s‚q‚r‚`‚l|‘OŽó[“–I—¹“ú|”NŒŽ PIC  X(004).
000380 01  ‚k‚s‚q‚r‚`‚l|‘OŽó[“–ŒŽ” PIC S9(003) COMP-3.
000390 01  ‚k‚s‚q‚r‚`‚l|ˆê•”[“–Šz PIC S9(013) COMP-3.
000400 01  ‚k‚s‚q‚r‚`‚l|‹âsƒR[ƒh PIC  X(007).
000410 01  ‚k‚s‚q‚r‚`‚l|ŒûÀ”Ô† PIC  X(007).
000420 01  ‚k‚s‚q‚r‚`‚l|—a‹àŽí—Þ PIC  X(001).
000430 01  ‚k‚s‚q‚r‚`‚l|“ü‹à“ú PIC S9(002) COMP-3.
000440 01  ‚k‚s‚q‚r‚`‚l|¿‹‘”­sÏ‰ñ” PIC S9(003) COMP-3.
000450 01  ‚k‚s‚q‚r‚`‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(014).
000460 01  ‚k‚s‚q‚r‚`‚l|’S•Û‹âsƒR[ƒh PIC  X(007).
000470 01  ‚k‚s‚q‚r‚`‚l|’S•Û·“ü“ú|¢‹I PIC S9(001) COMP-3.
000480 01  ‚k‚s‚q‚r‚`‚l|’S•Û·“ü“ú|”NŒŽ“ú PIC  X(006).
000490 01  ‚k‚s‚q‚r‚`‚l|’S•Ûˆ—ŒŽ“x|¢‹I PIC S9(001) COMP-3.
000500 01  ‚k‚s‚q‚r‚`‚l|’S•Ûˆ—ŒŽ“x|”NŒŽ PIC  X(004).
000510 01  ‚k‚s‚q‚r‚`‚l|ƒ_ƒ~[‚O‚O‚Q PIC  X(002).
000520 01  ‚k‚s‚q‚r‚`‚l|’P”N“xŒ_–ñ PIC  X(002).
000530 01  ‚k‚s‚q‚r‚`‚l|Â‹¦ƒR[ƒh PIC  X(002).
000540 01  ‚k‚s‚q‚r‚`‚l|Žx•¥ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000550 01  ‚k‚s‚q‚r‚`‚l|‰Šú”ï—p PIC S9(013) COMP-3.
000560 01  ‚k‚s‚q‚r‚`‚l|‘O“n‹à—˜‘§Šz PIC S9(013) COMP-3.
000570 01  ‚k‚s‚q‚r‚`‚l|Šî€‹à—˜ PIC S9(002)V9(8) COMP-3.
000580 01  ‚k‚s‚q‚r‚`‚l|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000590 01  ‚k‚s‚q‚r‚`‚l|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000600 01  ‚k‚s‚q‚r‚`‚l|’¥Žû‹æ•ª PIC S9(001) COMP-3.
000610 01  ‚k‚s‚q‚r‚`‚l|Å—¦ PIC S9(002)V9(1) COMP-3.
000620 01  ‚k‚s‚q‚r‚`‚l|Á”ïÅƒR[ƒh PIC S9(002) COMP-3.
000630 01  ‚k‚s‚q‚r‚`‚l|ŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000640 01  ‚k‚s‚q‚r‚`‚l|ŠJŽn“ú|”NŒŽ PIC  X(004).
000650 01  ‚k‚s‚q‚r‚`‚l|I—¹“ú|¢‹I PIC S9(001) COMP-3.
000660 01  ‚k‚s‚q‚r‚`‚l|I—¹“ú|”NŒŽ PIC  X(004).
000670 01  ‚k‚s‚q‚r‚`‚l|ŠúŠÔ PIC S9(003) COMP-3.
000680 01  ‚k‚s‚q‚r‚`‚l|‘e—˜ PIC S9(013) COMP-3.
000690 01  ‚k‚s‚q‚r‚`‚l|Œ_–ñ‹àŠzŠî–{ PIC S9(013) COMP-3.
000700 01  ‚k‚s‚q‚r‚`‚l|Œ_–ñ‹àŠzŽÀŽ¿ PIC S9(013) COMP-3.
000710 01  ‚k‚s‚q‚r‚`‚l|—˜‘§‡ŒvŠî–{ PIC S9(013) COMP-3.
000720 01  ‚k‚s‚q‚r‚`‚l|—˜‘§‡ŒvŽÀŽ¿ PIC S9(013) COMP-3.
000730 01  ‚k‚s‚q‚r‚`‚l|ŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000740 01  ‚k‚s‚q‚r‚`‚l|•ÛŒ¯—¿ PIC S9(013) COMP-3.
000750 01  ‚k‚s‚q‚r‚`‚l|•ÛŽç—¿ PIC S9(013) COMP-3.
000760 01  ‚k‚s‚q‚r‚`‚l|‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000770 01  ‚k‚s‚q‚r‚`‚l|‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000780 01  ‚k‚s‚q‚r‚`‚l|”Œo”ï‡Œv PIC S9(013) COMP-3.
000790 01  ‚k‚s‚q‚r‚`‚l|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000800 01  ‚k‚s‚q‚r‚`‚l|ƒ_ƒ~[‚O‚O‚R PIC  X(007).
000810 01  ‚k‚s‚q‚r‚`‚l|Žc‰¿•ÛØ‹æ•ª PIC S9(001) COMP-3.
000820 01  ‚k‚s‚q‚r‚`‚l|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000830 01  ‚k‚s‚q‚r‚`‚l|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000840 01  ‚k‚s‚q‚r‚`‚l|Žc‰¿Šz‡Œv PIC S9(011) COMP-3.
000850 01  ‚k‚s‚q‚r‚`‚l|•¨ŒŽ}”Ô” PIC S9(003) COMP-3.
000860 01  ‚k‚s‚q‚r‚`‚l|ÂŒ Žc‚‘OŒŽ–– PIC S9(013) COMP-3.
000870 01  ‚k‚s‚q‚r‚`‚l|‰‰ñ”NŒŽ|¢‹I PIC S9(001) COMP-3.
000880 01  ‚k‚s‚q‚r‚`‚l|‰‰ñ”NŒŽ|”NŒŽ PIC  X(004).
000890 01  ‚k‚s‚q‚r‚`‚l|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000900 01  ‚k‚s‚q‚r‚`‚l|ŽÀƒŠ[ƒX—¿|Šî–{ PIC S9(013) COMP-3.
000910 01  ‚k‚s‚q‚r‚`‚l|ŽÀƒŠ[ƒX—¿|ŽÀŽ¿ PIC S9(013) COMP-3.
000920 01  ‚k‚s‚q‚r‚`‚l|‚m‚d‚s|ƒŠ[ƒX—¿|Šî–{ PIC S9(013) COMP-3.
000930 01  ‚k‚s‚q‚r‚`‚l|‚m‚d‚s|ƒŠ[ƒX—¿|ŽÀŽ¿ PIC S9(013) COMP-3.
000940 01  ‚k‚s‚q‚r‚`‚l|—˜‘§|Šî–{ PIC S9(013) COMP-3.
000950 01  ‚k‚s‚q‚r‚`‚l|—˜‘§|ŽÀŽ¿ PIC S9(013) COMP-3.
000960 01  ‚k‚s‚q‚r‚`‚l|Œ³–{“à“ü PIC S9(013) COMP-3.
000970 01  ‚k‚s‚q‚r‚`‚l|Œ³–{Žc‚ PIC S9(013) COMP-3.
000980 01  ‚k‚s‚q‚r‚`‚l|ÂŒ Žc‚|Šî–{ PIC S9(013) COMP-3.
000990 01  ‚k‚s‚q‚r‚`‚l|ÂŒ Žc‚|ŽÀŽ¿ PIC S9(013) COMP-3.
001000 01  ‚k‚s‚q‚r‚`‚l|Á”ïÅŠz PIC S9(011) COMP-3.
001010 01  ‚k‚s‚q‚r‚`‚l|Á”ïÅ|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
001020 01  ‚k‚s‚q‚r‚`‚l|””ï—p PIC S9(013) COMP-3.
001030 01  ‚k‚s‚q‚r‚`‚l|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
001040 01  ‚k‚s‚q‚r‚`‚l|ƒ_ƒ~[‚O‚O‚S PIC  X(004).
001050 01  ‚k‚s‚q‚r‚`‚l|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
001060 01  ‚k‚s‚q‚r‚`‚l|‰ñŽûÏ•\Ž¦ PIC S9(001) COMP-3.
001070 01  ‚k‚s‚q‚r‚`‚l|‘OŽó[“–•\Ž¦ PIC S9(001) COMP-3.
001080 01  ‚k‚s‚q‚r‚`‚l|Žc‰¿‰ñŽû•\Ž¦ PIC S9(001) COMP-3.
001090 01  ‚k‚s‚q‚r‚`‚l|Žè”—¿¿‹–¼ÌƒJƒi PIC  X(030).
001100 01  ‚k‚s‚q‚r‚`‚l|[“–‘ŠŽE‹æ•ª PIC  X(001).
001110 01  ‚k‚s‚q‚r‚`‚l|ƒ_ƒ~[‚O‚O‚T PIC  X(028).
001120 01  ‚k‚s‚q‚r‚`‚l|³Œp“ú PIC  X(007).
001130 01  ‚k‚s‚q‚r‚`‚l|ÅV“ü—ÍÁ”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
001140 01  ‚k‚s‚q‚r‚`‚l|ˆ—”NŒŽ“x|¢‹I PIC  X(001).
001150 01  ‚k‚s‚q‚r‚`‚l|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
001160 01  ‚k‚s‚q‚r‚`‚l|‹¤’Êî•ñ PIC  X(035).
