000010************************************************
000020* Â–±iÂ–±“WŠJj(LTRSMT)
000030************************************************
000040 01  ‚k‚s‚q‚r‚l‚s|Â–±Œ_–ñ‚m‚n PIC  X(010).
000050 01  ‚k‚s‚q‚r‚l‚s|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚r‚l‚s|Œ_–ñ–¾×‚m‚n PIC S9(002) COMP-3.
000070 01  ‚k‚s‚q‚r‚l‚s|ƒŒƒR[ƒhƒV[ƒPƒ“ƒX PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚r‚l‚s|¢‹I PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚r‚l‚s|”N PIC S9(002) COMP-3.
000100 01  ‚k‚s‚q‚r‚l‚s|ŒŽ PIC S9(002) COMP-3.
000110 01  ‚k‚s‚q‚r‚l‚s|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000120 01  ‚k‚s‚q‚r‚l‚s|ŽÀƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚r‚l‚s|‚m‚d‚sƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000140 01  ‚k‚s‚q‚r‚l‚s|—˜‘§ PIC S9(013) COMP-3.
000150 01  ‚k‚s‚q‚r‚l‚s|Œ³–{Žx•¥Šz PIC S9(013) COMP-3.
000160 01  ‚k‚s‚q‚r‚l‚s|Œ³–{Žc‚ PIC S9(013) COMP-3.
000170 01  ‚k‚s‚q‚r‚l‚s|Â–±Žc‚ PIC S9(013) COMP-3.
000180 01  ‚k‚s‚q‚r‚l‚s|Á”ïÅŠz PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚r‚l‚s|Á”ïÅŽc‚ PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚r‚l‚s|””ï—p PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚l‚s|ŽÀŽx•¥Šz PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚l‚s|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000230 01  ‚k‚s‚q‚r‚l‚s|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000240 01  ‚k‚s‚q‚r‚l‚s|Žx•¥ƒf[ƒ^ì¬“ú|¢‹I PIC S9(001) COMP-3.
000250 01  ‚k‚s‚q‚r‚l‚s|Žx•¥ƒf[ƒ^ì¬“ú|”NŒŽ“ú PIC  X(006).
000260 01  ‚k‚s‚q‚r‚l‚s|¿‹ƒf[ƒ^ì¬“ú|¢‹I PIC S9(001) COMP-3.
000270 01  ‚k‚s‚q‚r‚l‚s|¿‹ƒf[ƒ^ì¬“ú|”NŒŽ“ú PIC  X(006).
000280 01  ‚k‚s‚q‚r‚l‚s|¿‹ƒf[ƒ^ì¬“ú|‹æ•ª PIC  X(001).
000290 01  ‚k‚s‚q‚r‚l‚s|Žd–óƒf[ƒ^ì¬“ú|¢‹I PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚r‚l‚s|Žd–óƒf[ƒ^ì¬“ú|”NŒŽ“ú PIC  X(006).
000310 01  ‚k‚s‚q‚r‚l‚s|‹¤’Êî•ñ PIC  X(035).
