000010************************************************
000020* —š—ðƒ}ƒbƒ`ÂŒ Šî–{(LTRSAK_M)
000030************************************************
000040 01  ‚k‚s‚q‚r‚`‚j|‚l|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚`‚j|‚l|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚k‚s‚q‚r‚`‚j|‚l|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000070 01  ‚k‚s‚q‚r‚`‚j|‚l|ƒ†[ƒUƒR[ƒh PIC  X(008).
000080 01  ‚k‚s‚q‚r‚`‚j|‚l|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000090 01  ‚k‚s‚q‚r‚`‚j|‚l|Œ´Œ_–ñ PIC  X(001).
000100 01  ‚k‚s‚q‚r‚`‚j|‚l|Œp‘±ƒŠ[ƒX PIC  X(001).
000110 01  ‚k‚s‚q‚r‚`‚j|‚l|ÄƒŠ[ƒX PIC  X(001).
000120 01  ‚k‚s‚q‚r‚`‚j|‚l|Š„•Š PIC  X(001).
000130 01  ‚k‚s‚q‚r‚`‚j|‚l|Žè”—¿ PIC  X(001).
000140 01  ‚k‚s‚q‚r‚`‚j|‚l|ƒtƒ@ƒNƒ^ƒŠƒ“ƒO PIC  X(001).
000150 01  ‚k‚s‚q‚r‚`‚j|‚l|‹àÁ PIC  X(001).
000160 01  ‚k‚s‚q‚r‚`‚j|‚l|Žx•¥•ÛØ PIC  X(001).
000170 01  ‚k‚s‚q‚r‚`‚j|‚l|ŒŸŽûWŒv•\‘ÎÛŠO‹æ•ª PIC  X(001).
000180 01  ‚k‚s‚q‚r‚`‚j|‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000190 01  ‚k‚s‚q‚r‚`‚j|‚l|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000200 01  ‚k‚s‚q‚r‚`‚j|‚l|”Û”F‹æ•ª PIC  X(001).
000210 01  ‚k‚s‚q‚r‚`‚j|‚l|ƒ_ƒ~[‚O‚O‚Q PIC  X(027).
000220 01  ‚k‚s‚q‚r‚`‚j|‚l|Œ³Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000230 01  ‚k‚s‚q‚r‚`‚j|‚l|Œ³ƒ†[ƒUƒR[ƒh PIC  X(008).
000240 01  ‚k‚s‚q‚r‚`‚j|‚l|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000250 01  ‚k‚s‚q‚r‚`‚j|‚l|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000260 01  ‚k‚s‚q‚r‚`‚j|‚l|‹¤’Êî•ñ PIC  X(035).
