000010************************************************
000020* —š—ðƒAƒ“ƒ}ƒbƒ`Ž‘ŽYŒÅ’èŽ‘ŽY\(LTRSIZ_U)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚y|‚t|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚h‚y|‚t|Œ_–ñ‚m‚n PIC  X(009).
000060 01  ‚k‚s‚q‚r‚h‚y|‚t|•¨Œ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚r‚h‚y|‚t|‰ð–ñ‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚r‚h‚y|‚t|Ä¶‹æ•ª PIC  X(001).
000090 01  ‚k‚s‚q‚r‚h‚y|‚t|”[•tæƒR[ƒh PIC  X(006).
000100 01  ‚k‚s‚q‚r‚h‚y|‚t|Å‹æ•ª PIC S9(001) COMP-3.
000110 01  ‚k‚s‚q‚r‚h‚y|‚t|Å•‰’S‹æ•ª PIC  X(001).
000120 01  ‚k‚s‚q‚r‚h‚y|‚t|‘Ï—p”N”’Zk‹æ•ª PIC  X(001).
000130 01  ‚k‚s‚q‚r‚h‚y|‚t|ˆÚ“®î•ñ|ˆÚ“®‹æ•ª PIC  X(001).
000140 01  ‚k‚s‚q‚r‚h‚y|‚t|ˆÚ“®î•ñ|¢‹I PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚r‚h‚y|‚t|ˆÚ“®î•ñ|”NŒŽ“ú PIC  X(006).
000160 01  ‚k‚s‚q‚r‚h‚y|‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(010).
000170 01  ‚k‚s‚q‚r‚h‚y|‚t|“Á—á|ŠúŠÔ PIC S9(002) COMP-3.
000180 01  ‚k‚s‚q‚r‚h‚y|‚t|“Á—á|•ªŽq PIC S9(002) COMP-3.
000190 01  ‚k‚s‚q‚r‚h‚y|‚t|“Á—á|•ª•ê PIC S9(003) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚y|‚t|”NÅŠz PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚h‚y|‚t|‘O”N“x•]‰¿Šz PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚y|‚t|‘O”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚h‚y|‚t|“–”N“x•]‰¿Šz PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚r‚h‚y|‚t|“–”N“x—˜_•ë‰¿ PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚y|‚t|“Á•Ê‰ÛÅ•W€Šz PIC S9(013) COMP-3.
000260 01  ‚k‚s‚q‚r‚h‚y|‚t|‘O‰ñ\æ PIC  X(006).
000270 01  ‚k‚s‚q‚r‚h‚y|‚t|Ý’uêŠ–¼Š¿Žš PIC  X(040).
000280 01  ‚k‚s‚q‚r‚h‚y|‚t|Ý’uêŠ–¼ƒJƒi PIC  X(020).
000290 01  ‚k‚s‚q‚r‚h‚y|‚t|Ý’uêŠ—X•Ö”Ô†|e PIC  X(003).
000300 01  ‚k‚s‚q‚r‚h‚y|‚t|Ý’uêŠ—X•Ö”Ô†|Žq PIC  X(004).
000310 01  ‚k‚s‚q‚r‚h‚y|‚t|Ý’uêŠZŠŠ¿Žš PIC  X(100).
000320 01  ‚k‚s‚q‚r‚h‚y|‚t|ƒ_ƒ~[‚O‚O‚Q PIC  X(011).
000330 01  ‚k‚s‚q‚r‚h‚y|‚t|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000340 01  ‚k‚s‚q‚r‚h‚y|‚t|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000350 01  ‚k‚s‚q‚r‚h‚y|‚t|‹¤’Êî•ñ PIC  X(035).
