000010************************************************
000020* ˆ—’Ê”Ô(“ü‹àÁž’Ê”Ô)(LTRTUUT2)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚s‚Q|‚j‚d‚x‚P PIC  X(002).
000050 01  ‚k‚s‚q‚s‚t‚t‚s‚Q|‚j‚d‚x‚Q PIC  X(008).
000060 01  ‚k‚s‚q‚s‚t‚t‚s‚Q|ŒŽ PIC S9(002) COMP-3.
000070 01  ‚k‚s‚q‚s‚t‚t‚s‚Q|“ú PIC S9(002) COMP-3.
000080 01  ‚k‚s‚q‚s‚t‚t‚s‚Q|ˆê˜A”Ô†Ì”Ô—p PIC S9(005) COMP-3.
000090 01  ‚k‚s‚q‚s‚t‚t‚s‚Q|ƒ_ƒ~[‚O‚O‚P PIC  X(046).
000100 01  ‚k‚s‚q‚s‚t‚t‚s‚Q|‹¤’Êî•ñ PIC  X(035).
