000010************************************************
000020* ˆ—’Ê”Ô(ŽØ“ü‹àŽd–ó—p)(LTRTUUH1)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚g‚P|‚j‚d‚x‚P PIC  X(002).
000050 01  ‚k‚s‚q‚s‚t‚t‚g‚P|‚j‚d‚x‚Q PIC  X(008).
000060 01  ‚k‚s‚q‚s‚t‚t‚g‚P|ˆê˜A”Ô† PIC S9(005) COMP-3.
000070 01  ‚k‚s‚q‚s‚t‚t‚g‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(050).
000080 01  ‚k‚s‚q‚s‚t‚t‚g‚P|‹¤’Êî•ñ PIC  X(035).
