000010************************************************
000020* ˆ—’Ê”Ô(”„‹p’Ê”Ô)(LTRTUUB1)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚a‚P|‚j‚d‚x‚P PIC  X(002).
000050 01  ‚k‚s‚q‚s‚t‚t‚a‚P|‚j‚d‚x‚Q PIC  X(008).
000060 01  ‚k‚s‚q‚s‚t‚t‚a‚P|ˆê˜A”Ô† PIC S9(007) COMP-3.
000070 01  ‚k‚s‚q‚s‚t‚t‚a‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(048).
000080 01  ‚k‚s‚q‚s‚t‚t‚a‚P|‹¤’Êî•ñ PIC  X(035).
