000010************************************************
000020* Žæˆøæƒ}ƒXƒ^[iŽ–‹ÆŠ•ÊÂŒ ŽcƒŒƒR[ƒhj(LTRTRZ)
000030************************************************
000040 01  ‚k‚s‚q‚s‚q‚y|ŽæˆøæƒR[ƒh PIC  X(008).
000050 01  ‚k‚s‚q‚s‚q‚y|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000060 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñƒŠ[ƒX PIC S9(013) COMP-3.
000070 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñŠ„•Š PIC S9(013) COMP-3.
000080 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñ‹àÁ PIC S9(013) COMP-3.
000090 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñƒtƒ@ƒNƒ^ƒŠƒ“ƒO 
                                             PIC S9(013) COMP-3.
000100 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñŽx•¥•ÛØ PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñˆ´ù PIC S9(013) COMP-3.
000120 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñŽè”—¿ PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñÄƒŠ[ƒX PIC S9(013) COMP-3.
000140 01  ‚k‚s‚q‚s‚q‚y|ÂŒ Žc‚î•ñ‡ŒvŠz PIC S9(013) COMP-3.
000150 01  ‚k‚s‚q‚s‚q‚y|ƒ_ƒ~[‚O‚O‚P PIC  X(033).
