000010************************************************
000020* ˆ—’Ê”Ô(‹Æ–±—pˆ—’Ê”Ô)(LTRTUUS1)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚r‚P|‚j‚d‚x‚P PIC  X(002).
000050 01  ‚k‚s‚q‚s‚t‚t‚r‚P|ƒTƒuƒVƒXƒeƒ€‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚s‚t‚t‚r‚P|‹Æ–±ƒR[ƒh PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚s‚t‚t‚r‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000080 01  ‚k‚s‚q‚s‚t‚t‚r‚P|ˆê˜A”Ô†Ì”Ô—p PIC S9(005) COMP-3.
000090 01  ‚k‚s‚q‚s‚t‚t‚r‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(050).
000100 01  ‚k‚s‚q‚s‚t‚t‚r‚P|‹¤’Êî•ñ PIC  X(035).
