000010************************************************
000020* (MAN_IKOU)
000030************************************************
000040 01  ‚l‚`‚m|‚h‚j‚n‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚l‚`‚m|‚h‚j‚n‚t|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚l‚`‚m|‚h‚j‚n‚t|•¨Œ–¼|Š¿Žš PIC  X(040).
000070 01  ‚l‚`‚m|‚h‚j‚n‚t|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000080 01  ‚l‚`‚m|‚h‚j‚n‚t|Ý’uêŠZŠ PIC  X(100).
000090 01  ‚l‚`‚m|‚h‚j‚n‚t|Ž‘ŽYˆ•ªƒR[ƒh PIC  X(001).
000100 01  ‚l‚`‚m|‚h‚j‚n‚t|–ž—¹ˆ—“ú PIC  X(008).
000110 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹p•¨Œ‹àŠz PIC S9(013) COMP-3.
000120 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹p”—Ê PIC S9(004) COMP-3.
000130 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹pˆø“næ‹æ•ª PIC  X(001).
000140 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹pˆø“næ–¼|Š¿Žš PIC  X(060).
000150 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹pˆø“næ–¼|ƒJƒi PIC  X(030).
000160 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹p‹àŠz“ü‹àæƒR[ƒh PIC  X(008).
000170 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹p‹àŠz PIC S9(013) COMP-3.
000180 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹pÅ—¦ PIC S9(002)V9(1) COMP-3.
000190 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹pˆÏ‘õŽè”—¿ PIC S9(013) COMP-3.
000200 01  ‚l‚`‚m|‚h‚j‚n‚t|”„‹p‹àŠz“ü‹à—\’è“ú PIC  X(008).
000210 01  ‚l‚`‚m|‚h‚j‚n‚t|Žó“nŠúŒÀ PIC  X(060).
000220 01  ‚l‚`‚m|‚h‚j‚n‚t|Žx•¥ðŒ PIC  X(060).
000230 01  ‚l‚`‚m|‚h‚j‚n‚t|”pŠü•¨Œ‹àŠz PIC S9(013) COMP-3.
000240 01  ‚l‚`‚m|‚h‚j‚n‚t|”pŠü”—Ê PIC S9(004) COMP-3.
000250 01  ‚l‚`‚m|‚h‚j‚n‚t|”pŠüˆø“næ‹æ•ª PIC  X(001).
000260 01  ‚l‚`‚m|‚h‚j‚n‚t|”pŠüˆø“næ–¼|Š¿Žš PIC  X(060).
000270 01  ‚l‚`‚m|‚h‚j‚n‚t|”pŠüˆø“næ–¼|ƒJƒi PIC  X(030).
000280 01  ‚l‚`‚m|‚h‚j‚n‚t|ˆøŽæ”ï—p PIC S9(013) COMP-3.
000290 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒXˆ—“ú PIC  X(008).
000300 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒX•¨Œ‹àŠz PIC S9(013) COMP-3.
000310 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒX”—Ê PIC S9(004) COMP-3.
000320 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒXŠJŽn“ú PIC  X(008).
000330 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000340 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒX—¿|¿‹‹àŠz PIC S9(013) COMP-3.
000350 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒXŽæˆµŽè”—¿ PIC S9(013) COMP-3.
000360 01  ‚l‚`‚m|‚h‚j‚n‚t|¿‹æƒR[ƒh PIC  X(008).
000370 01  ‚l‚`‚m|‚h‚j‚n‚t|‰ñŽû•ûŽ®‚P PIC  X(001).
000380 01  ‚l‚`‚m|‚h‚j‚n‚t|‰ñŽû•ûŽ®‚Q PIC  X(001).
000390 01  ‚l‚`‚m|‚h‚j‚n‚t|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000400 01  ‚l‚`‚m|‚h‚j‚n‚t|Žx•¥‰ñ” PIC S9(003) COMP-3.
000410 01  ‚l‚`‚m|‚h‚j‚n‚t|‚a‚d‚f‚h‚m‰ñ” PIC  X(001).
000420 01  ‚l‚`‚m|‚h‚j‚n‚t|ŒvŽZ•ûŽ® PIC  X(001).
000430 01  ‚l‚`‚m|‚h‚j‚n‚t|‹âsƒR[ƒh PIC  X(007).
000440 01  ‚l‚`‚m|‚h‚j‚n‚t|ŒûÀ”Ô† PIC  X(007).
000450 01  ‚l‚`‚m|‚h‚j‚n‚t|—a‹àŽí—Þ PIC  X(001).
000460 01  ‚l‚`‚m|‚h‚j‚n‚t|“ü‹à“ú PIC S9(002) COMP-3.
000470 01  ‚l‚`‚m|‚h‚j‚n‚t|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú PIC  X(008).
000480 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒXƒR[ƒh|V PIC  X(001).
000490 01  ‚l‚`‚m|‚h‚j‚n‚t|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000500 01  ‚l‚`‚m|‚h‚j‚n‚t|ÄƒŠ[ƒX•t•Û—¦|V PIC S9(002) COMP-3.
000510 01  ‚l‚`‚m|‚h‚j‚n‚t|•ÛŽçŒ_–ñ‹æ•ª PIC  X(001).
000520 01  ‚l‚`‚m|‚h‚j‚n‚t|Žc‰¿Šz|V PIC S9(013) COMP-3.
000530 01  ‚l‚`‚m|‚h‚j‚n‚t|“o˜^“ú PIC  X(008).
000540 01  ‚l‚`‚m|‚h‚j‚n‚t|“o˜^Žž PIC  X(006).
000550 01  ‚l‚`‚m|‚h‚j‚n‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000560 01  ‚l‚`‚m|‚h‚j‚n‚t|XV“ú PIC  X(008).
000570 01  ‚l‚`‚m|‚h‚j‚n‚t|XVŽž PIC  X(006).
000580 01  ‚l‚`‚m|‚h‚j‚n‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
