000010************************************************
000020* (MAN_HAIKI)
000030************************************************
000040 01  ‚l‚`‚m|‚g‚`‚h‚j‚h|ŠÇ—‚m‚n PIC  X(006).
000050 01  ‚l‚`‚m|‚g‚`‚h‚j‚h|—\”õ‚P PIC  X(002).
000060 01  ‚l‚`‚m|‚g‚`‚h‚j‚h|‹@Ží PIC  X(017).
000070 01  ‚l‚`‚m|‚g‚`‚h‚j‚h|‹@”Ô PIC  X(010).
000080 01  ‚l‚`‚m|‚g‚`‚h‚j‚h|—\”õ‚Q PIC  X(036).
