000010************************************************
000020* (MAN_UNMATTI)
000030************************************************
000040 01  ‚l‚`‚m|‚t‚m‚l‚`‚s‚s‚h|ŠÇ—‚m‚n PIC  X(006).
000050 01  ‚l‚`‚m|‚t‚m‚l‚`‚s‚s‚h|—\”õ‚P PIC  X(002).
000060 01  ‚l‚`‚m|‚t‚m‚l‚`‚s‚s‚h|‹@Ží PIC  X(017).
000070 01  ‚l‚`‚m|‚t‚m‚l‚`‚s‚s‚h|‹@”Ô PIC  X(010).
000080 01  ‚l‚`‚m|‚t‚m‚l‚`‚s‚s‚h|—\”õ‚Q PIC  X(036).
000090 01  ‚l‚`‚m|‚t‚m‚l‚`‚s‚s‚h|˜A”Ô PIC S9(003) COMP-3.
