000010************************************************
000020* (MAN_WK_DOSO)
000030************************************************
000040 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|’[––”Ô† PIC  X(016).
000050 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|ˆ—‹æ•ª PIC  X(001).
000060 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|C³‹æ•ª PIC  X(001).
000070 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|¿‹æƒR[ƒh PIC  X(008).
000080 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|‘ÎÛŽ‘ŽYƒR[ƒh PIC  X(007).
000090 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚P PIC S9(002) COMP-3.
000100 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚Q PIC S9(002) COMP-3.
000110 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚R PIC S9(002) COMP-3.
000120 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚S PIC S9(002) COMP-3.
000130 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚T PIC S9(002) COMP-3.
000140 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚U PIC S9(002) COMP-3.
000150 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚V PIC S9(002) COMP-3.
000160 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚W PIC S9(002) COMP-3.
000170 01  ‚l‚`‚m|‚v‚j|‚c‚n‚r‚n|•t•Û—¦‚X PIC S9(002) COMP-3.
