000010************************************************
000020* (MAN_TENKAI)
000030************************************************
000040 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000070 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|˜A”Ô PIC S9(003) COMP-3.
000080 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|ƒŠ[ƒX—¿|¿‹‹àŠz 
                                             PIC S9(013) COMP-3.
000090 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|Žx•¥‰ñ” PIC S9(003) COMP-3.
000100 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|“o˜^“ú PIC  X(008).
000110 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|“o˜^Žž PIC  X(006).
000120 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000130 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|XV“ú PIC  X(008).
000140 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|XVŽž PIC  X(006).
000150 01  ‚l‚`‚m|‚s‚d‚m‚j‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
