000010************************************************
000020* (MAN_MISYORI_KEI)
000030************************************************
000040 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|‚j‚d‚h|’[––”Ô† PIC  X(016).
000050 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|‚j‚d‚h|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|‚j‚d‚h|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|‚j‚d‚h|Œ_–ñŒ”‡Œv 
                                             PIC S9(005) COMP-3.
000080 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|‚j‚d‚h|•¨Œ‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000090 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|‚j‚d‚h|Žc‰¿Šz‡Œv 
                                             PIC S9(013) COMP-3.
000100 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|‚j‚d‚h|Œ_–ñ‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
