000010************************************************
000020* (MFS_HEADER)
000030************************************************
000040 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ƒf[ƒ^‹æ•ª PIC  X(001).
000050 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|Ží•ÊƒR[ƒh PIC  X(002).
000060 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ƒR[ƒh‹æ•ª PIC  X(001).
000070 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|‚l‚e‚rŽg—p—“ PIC  X(002).
000080 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ˆÏ‘õŽÒƒR[ƒh PIC  X(008).
000090 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ˆÏ‘õŽÒ–¼ PIC  X(040).
000100 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ˆø—Ž“ú PIC  X(004).
000110 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|Žæˆø‹âs”Ô† PIC  X(004).
000120 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|Žæˆø‹âs–¼ PIC  X(015).
000130 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ŽæˆøŽx“X”Ô† PIC  X(003).
000140 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ŽæˆøŽx“X–¼ PIC  X(015).
000150 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|—a‹àŽí—Þ PIC  X(001).
000160 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ŒûÀ”Ô† PIC  X(007).
000170 01  ‚l‚e‚r|‚g‚d‚`‚c‚d‚q|ƒ_ƒ~[‚O‚O‚P PIC  X(017).
