000010************************************************
000020* (MST_KIHON)
000030************************************************
000040 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|ŒÂl‚h‚c PIC  X(004).
000050 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|ŒÂl–¼|Š¿Žš PIC  X(020).
000060 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|ŒÂl–¼|‰¼–¼ PIC  X(030).
000070 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|Š‘®Ž–‹ÆŠƒR[ƒh PIC  X(004).
000080 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|Œ“–±Ž–‹ÆŠƒR[ƒh|‚P PIC  X(004).
000090 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|Œ“–±Ž–‹ÆŠƒR[ƒh|‚Q PIC  X(004).
000100 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|Œ“–±Ž–‹ÆŠƒR[ƒh|‚R PIC  X(004).
000110 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|Œ“–±Ž–‹ÆŠƒR[ƒh|‚S PIC  X(004).
000120 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|Œ“–±Ž–‹ÆŠƒR[ƒh|‚T PIC  X(004).
000130 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000140 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000150 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000160 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000170 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000180 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000190 01  ‚l‚r‚s|‚j‚h‚g‚n‚m|ƒ[ƒN PIC  X(001).
