000010************************************************
000020* (MST_NOFU)
000030************************************************
000040 01  ‚l‚r‚s|‚m‚n‚e‚t|”[•tæƒR[ƒh PIC  X(006).
000050 01  ‚l‚r‚s|‚m‚n‚e‚t|”[•tæZŠ|‚P PIC  X(010).
000060 01  ‚l‚r‚s|‚m‚n‚e‚t|”[•tæZŠ|‚Q PIC  X(040).
000070 01  ‚l‚r‚s|‚m‚n‚e‚t|”[•tæZŠ|‚R PIC  X(040).
000080 01  ‚l‚r‚s|‚m‚n‚e‚t|”[•tæZŠ|‚S PIC  X(010).
000090 01  ‚l‚r‚s|‚m‚n‚e‚t|”[•tæZŠ|‚T PIC  X(040).
000100 01  ‚l‚r‚s|‚m‚n‚e‚t|”[•tæZŠ|‚U PIC  X(040).
000110 01  ‚l‚r‚s|‚m‚n‚e‚t|“o˜^“ú PIC  X(008).
000120 01  ‚l‚r‚s|‚m‚n‚e‚t|“o˜^Žž PIC  X(006).
000130 01  ‚l‚r‚s|‚m‚n‚e‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000140 01  ‚l‚r‚s|‚m‚n‚e‚t|XV“ú PIC  X(008).
000150 01  ‚l‚r‚s|‚m‚n‚e‚t|XVŽž PIC  X(006).
000160 01  ‚l‚r‚s|‚m‚n‚e‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
