000010************************************************
000020* (MST_NOFU_TYOSA2)
000030************************************************
000040 01  ‚l‚r‚s|‚m‚n‚e‚t|‚s‚x‚n‚r‚`‚Q|—X•Ö”Ô† PIC  X(007).
000050 01  ‚l‚r‚s|‚m‚n‚e‚t|‚s‚x‚n‚r‚`‚Q|ZŠ PIC  X(100).
000060 01  ‚l‚r‚s|‚m‚n‚e‚t|‚s‚x‚n‚r‚`‚Q|Œë|”[•tæƒR[ƒh 
                                             PIC  X(006).
000070 01  ‚l‚r‚s|‚m‚n‚e‚t|‚s‚x‚n‚r‚`‚Q|³|”[•tæƒR[ƒh 
                                             PIC  X(006).
