000010************************************************
000020* (MST_SHOHIZEI)
000030************************************************
000040 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|Á”ïÅ—¦ƒR[ƒh PIC  X(002).
000050 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|Œo‰ß‘[’u“K—pŠJŽn“ú PIC  X(008).
000060 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|Œo‰ß‘[’u“K—pI—¹“ú PIC  X(008).
000070 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|Á”ïÅ—¦|‚P 
                                             PIC S9(002)V9(1) COMP-3.
000080 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|“K—p“ú|‚P PIC  X(008).
000090 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|Á”ïÅ—¦|‚Q 
                                             PIC S9(002)V9(1) COMP-3.
000100 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|“K—p“ú|‚Q PIC  X(008).
000110 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|Á”ïÅ—¦|‚R 
                                             PIC S9(002)V9(1) COMP-3.
000120 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|“K—p“ú|‚R PIC  X(008).
000130 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|Á”ïÅ—¦|‚S 
                                             PIC S9(002)V9(1) COMP-3.
000140 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|“K—p“ú|‚S PIC  X(008).
000150 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|Á”ïÅ—¦|‚T 
                                             PIC S9(002)V9(1) COMP-3.
000160 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|“K—p“ú|‚T PIC  X(008).
000170 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|“o˜^“ú PIC  X(008).
000180 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|“o˜^Žž PIC  X(006).
000190 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000200 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|XV“ú PIC  X(008).
000210 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|XVŽž PIC  X(006).
000220 01  ‚l‚r‚s|‚r‚g‚n‚g‚h‚y‚d‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
