000010************************************************
000020* (MST_JIKOU200304)
000030************************************************
000040 01  ‚l‚r‚s|‚i‚h‚j‚n‚t‚Q‚O‚O‚R‚O‚S|ŽæˆøæƒR[ƒh PIC  X(008).
000050 01  ‚l‚r‚s|‚i‚h‚j‚n‚t‚Q‚O‚O‚R‚O‚S|VŽ–‹ÆŠƒR[ƒh PIC  X(004).
