000010************************************************
000020* (NTL_LEASE_CSV)
000030************************************************
000040 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(008).
000060 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|Žæˆø‹æ•ª PIC  X(003).
000070 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|d—v«‹æ•ª PIC  X(003).
000080 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|”ñ•\Ž¦ƒtƒ‰ƒO PIC  X(003).
000090 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ŒÚ‹q–¼ PIC  X(098).
000100 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|Œ_–ñ‚h‚c PIC  X(024).
000110 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|Œ_–ñŠz PIC  X(015).
000120 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ƒŠ[ƒXŠúŠÔ PIC  X(006).
000130 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ŒŸŽû“ú PIC  X(012).
000140 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|Žæ“¾‰¿Šz‘Š“–Šz PIC  X(015).
000150 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|Œ¸‰¿ž‹p—ÝŒvŠz‘Š“–Šz 
                                             PIC  X(015).
000160 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|Šú––Žc‚‘Š“–Šz PIC  X(015).
000170 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ƒŠ[ƒXÂ–±Šú––Žc‚‚P”NˆÈ“à 
                                             PIC  X(015).
000180 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ƒŠ[ƒXÂ–±Šú––Žc‚‚P”N’´ 
                                             PIC  X(015).
000190 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ƒŠ[ƒXÂ–±Šú––Žc‚ PIC  X(015).
000200 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|“–ŠúŽx•¥ƒŠ[ƒX—¿ PIC  X(015).
000210 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|“–ŠúŒ¸‰¿ž‹p”ï‘Š“–Šz 
                                             PIC  X(015).
000220 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|“–ŠúŽx•¥—˜‘§‘Š“–Šz PIC  X(015).
000230 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ŒˆŽZ”NŒŽ|‚e‚q‚n‚l PIC  X(012).
000240 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ŒˆŽZ”NŒŽ|‚s‚n PIC  X(012).
000250 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|’S“–“X–¼ PIC  X(022).
000260 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|’S“–•”–¼ PIC  X(066).
000270 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|’S“–ŽÒ–¼ PIC  X(036).
000280 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ŒÚ‹q‚h‚c PIC  X(014).
000290 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ƒŠ[ƒX–ž—¹“ú PIC  X(012).
000300 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|‰ð–ñ“ú PIC  X(012).
000310 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|Ž‘ŽY‰È–Ú PIC  X(004).
000320 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|Ž‘ŽY‰È–Ú–¼ PIC  X(032).
000330 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|‘ã•\•¨Œ–¼ PIC  X(066).
000340 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|•½‹ÏŒŽŠzƒŠ[ƒX—¿ PIC  X(015).
000350 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|‘O•¥ƒŠ[ƒX—¿ PIC  X(015).
000360 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ž‹p•û–@‹æ•ª PIC  X(003).
000370 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ž‹p•û–@‹æ•ª–¼ PIC  X(018).
000380 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ˆ—Šî€‚P PIC  X(003).
000390 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ˆ—Šî€–¼‚P PIC  X(018).
000400 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ˆ—Šî€‚Q PIC  X(003).
000410 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ˆ—Šî€–¼‚Q PIC  X(018).
000420 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ì¬‚h‚c PIC  X(012).
000430 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|ì¬“ú PIC  X(012).
000440 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|XV‚h‚c PIC  X(012).
000450 01  ‚m‚s‚k|‚k‚d‚`‚r‚d|‚b‚r‚u|XV“ú PIC  X(012).
