000010************************************************
000020* (NTT_WK_HBUMON)
000030************************************************
000040 01  ‚m‚s‚s|‚v‚j|‚g‚a‚t‚l‚n‚m|“o˜^”Ô† PIC  X(004).
000050 01  ‚m‚s‚s|‚v‚j|‚g‚a‚t‚l‚n‚m|æ•ûŽQÆ”Ô† PIC  X(010).
000060 01  ‚m‚s‚s|‚v‚j|‚g‚a‚t‚l‚n‚m|¿‹æƒR[ƒh PIC  X(008).
000070 01  ‚m‚s‚s|‚v‚j|‚g‚a‚t‚l‚n‚m|•”–å–¼Ì‚P PIC  X(040).
000080 01  ‚m‚s‚s|‚v‚j|‚g‚a‚t‚l‚n‚m|•”–å–¼Ì‚Q PIC  X(040).
