000010************************************************
000020* (NYU_AUTOADDL)
000030************************************************
000040 01  NYU_AUTOADDL-BNKCOD PIC  X(004).
000050 01  NYU_AUTOADDL-BNKNAM PIC  X(015).
000060 01  NYU_AUTOADDL-BRCCOD PIC  X(003).
000070 01  NYU_AUTOADDL-BRCNAM PIC  X(015).
000080 01  NYU_AUTOADDL-DEPKND PIC  X(001).
000090 01  NYU_AUTOADDL-DEPNUM PIC  X(007).
000100 01  NYU_AUTOADDL-PAYNUM PIC  X(008).
000110 01  NYU_AUTOADDL-CSTNAM PIC  X(030).
000120 01  NYU_AUTOADDL-TRNAMT PIC S9(010) COMP-3.
000130 01  NYU_AUTOADDL-CONTAX PIC S9(008) COMP-3.
000140 01  NYU_AUTOADDL-PAYDAY PIC  X(004).
000150 01  NYU_AUTOADDL-ERRFLG PIC  X(005).
