000010************************************************
000020* (NYU_AUTOMODL)
000030************************************************
000040 01  NYU_AUTOMODL-JOBTYP PIC  X(004).
000050 01  NYU_AUTOMODL-BNKCOD PIC  X(004).
000060 01  NYU_AUTOMODL-BNKNAM PIC  X(015).
000070 01  NYU_AUTOMODL-PAYDAY PIC  X(004).
000080 01  NYU_AUTOMODL-BRCCOD PIC  X(003).
000090 01  NYU_AUTOMODL-BRCNAM PIC  X(015).
000100 01  NYU_AUTOMODL-PAYNUM PIC  X(008).
000110 01  NYU_AUTOMODL-CSTNAM PIC  X(030).
000120 01  NYU_AUTOMODL-DEPKND PIC  X(001).
000130 01  NYU_AUTOMODL-DEPNUM PIC  X(007).
000140 01  NYU_AUTOMODL-TRNAMT PIC S9(010) COMP-3.
000150 01  NYU_AUTOMODL-BRCCOD_O PIC  X(003).
000160 01  NYU_AUTOMODL-BRCNAM_O PIC  X(015).
000170 01  NYU_AUTOMODL-PAYNUM_O PIC  X(008).
000180 01  NYU_AUTOMODL-CSTNAM_O PIC  X(030).
000190 01  NYU_AUTOMODL-DEPKND_O PIC  X(001).
000200 01  NYU_AUTOMODL-DEPNUM_O PIC  X(007).
000210 01  NYU_AUTOMODL-TRNAMT_O PIC S9(010) COMP-3.
000220 01  NYU_AUTOMODL-REGTIM PIC  X(006).
000230 01  NYU_AUTOMODL-BRCCOD_M PIC  X(001).
000240 01  NYU_AUTOMODL-BRCNAM_M PIC  X(001).
000250 01  NYU_AUTOMODL-PAYNUM_M PIC  X(001).
000260 01  NYU_AUTOMODL-CSTNAM_M PIC  X(001).
000270 01  NYU_AUTOMODL-DEPKND_M PIC  X(001).
000280 01  NYU_AUTOMODL-DEPNUM_M PIC  X(001).
000290 01  NYU_AUTOMODL-TRNAMT_M PIC  X(001).
