000010************************************************
000020* (NYU_AUTODATA)
000030************************************************
000040 01  NYU_AUTODATA-DATTYP PIC  X(001).
000050 01  NYU_AUTODATA-BNKCOD PIC  X(004).
000060 01  NYU_AUTODATA-BNKNAM PIC  X(015).
000070 01  NYU_AUTODATA-BRCCOD PIC  X(003).
000080 01  NYU_AUTODATA-BRCNAM PIC  X(015).
000090 01  NYU_AUTODATA-PAYDAY PIC  X(004).
000100 01  NYU_AUTODATA-DEPKND PIC  X(001).
000110 01  NYU_AUTODATA-DEPNUM PIC  X(007).
000120 01  NYU_AUTODATA-CSTNAM PIC  X(030).
000130 01  NYU_AUTODATA-TRNAMT PIC S9(010) COMP-3.
000140 01  NYU_AUTODATA-TRNTYP PIC  X(001).
000150 01  NYU_AUTODATA-PAYNUM PIC  X(008).
000160 01  NYU_AUTODATA-OPEDAY PIC  X(003).
000170 01  NYU_AUTODATA-DUMMY1 PIC  X(009).
000180 01  NYU_AUTODATA-RESULT PIC  X(001).
000190 01  NYU_AUTODATA-CONTAX PIC S9(008) COMP-3.
000200 01  NYU_AUTODATA-REGDAY PIC  X(008).
000210 01  NYU_AUTODATA-REGTIM PIC  X(006).
000220 01  NYU_AUTODATA-REGPSN PIC  X(004).
000230 01  NYU_AUTODATA-MODDAY PIC  X(008).
000240 01  NYU_AUTODATA-MODTIM PIC  X(006).
000250 01  NYU_AUTODATA-MODPSN PIC  X(004).
000260 01  NYU_AUTODATA-ERRFLG PIC  X(005).
000270 01  NYU_AUTODATA-PRTFLG PIC  X(001).
000280 01  NYU_AUTODATA-DELFLG PIC  X(001).
000290 01  NYU_AUTODATA-DBLFLG PIC  X(001).
