000010************************************************
000020* (NYU_HOLDAY)
000030************************************************
000040 01  NYU_HOLDAY-NATCOD PIC  X(003).
000050 01  NYU_HOLDAY-HOLDAY PIC  X(010).
000060 01  NYU_HOLDAY-HOLNAM PIC  X(020).
000070 01  NYU_HOLDAY-HOLSW1 PIC  X(001).
