000010************************************************
000020* (OBA_EXCWRK)
000030************************************************
000040 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|‘ÝŽØƒR[ƒh PIC  X(001).
000060 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|Ž–‹ÆŠ–¼ PIC  X(020).
000080 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|ƒ†[ƒU[–¼ PIC  X(060).
000100 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|”õl PIC  X(040).
000110 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|Žæˆø“ú PIC  X(008).
000120 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|ŠJŽn“ú PIC  X(008).
000130 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|Šî€“ú PIC  X(008).
000140 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|Â–±ŽÒŠi•t PIC  X(004).
000150 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|ÂŒ ‹àŠz PIC S9(013) COMP-3.
000160 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|‰ñŽû‹àŠz PIC S9(013) COMP-3.
000170 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|ÂŒ Žc‚ PIC S9(013) COMP-3.
000180 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|“o˜^“ú PIC  X(008).
000190 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|“o˜^Žž PIC  X(006).
000200 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|“o˜^ŽÒ PIC  X(004).
000210 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|•ÏX“ú PIC  X(008).
000220 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|•ÏXŽž PIC  X(006).
000230 01  ‚n‚a‚`|‚d‚w‚b‚v‚q‚j|•ÏXŽÒ PIC  X(004).
