000010************************************************
000020* (OBA_PRTWRK)
000030************************************************
000040 01  OBA_PRTWRK-CNTNUM PIC  X(009).
000050 01  OBA_PRTWRK-TRNTYP PIC  X(001).
000060 01  OBA_PRTWRK-DIVCOD PIC  X(004).
000070 01  OBA_PRTWRK-DIVNAM PIC  X(020).
000080 01  OBA_PRTWRK-USRCOD PIC  X(008).
000090 01  OBA_PRTWRK-USRNAM PIC  X(060).
000100 01  OBA_PRTWRK-OBJNAM PIC  X(040).
000110 01  OBA_PRTWRK-TRNDAY PIC  X(008).
000120 01  OBA_PRTWRK-BGNDAY PIC  X(008).
000130 01  OBA_PRTWRK-BASDAY PIC  X(008).
000140 01  OBA_PRTWRK-CRERNK PIC  X(004).
000150 01  OBA_PRTWRK-CNTAMT PIC S9(013) COMP-3.
000160 01  OBA_PRTWRK-RCVAMT PIC S9(013) COMP-3.
000170 01  OBA_PRTWRK-BALAMT PIC S9(013) COMP-3.
000180 01  OBA_PRTWRK-REGDAY PIC  X(008).
000190 01  OBA_PRTWRK-REGTIM PIC  X(006).
000200 01  OBA_PRTWRK-REGPSN PIC  X(004).
000210 01  OBA_PRTWRK-MODDAY PIC  X(008).
000220 01  OBA_PRTWRK-MODTIM PIC  X(006).
000230 01  OBA_PRTWRK-MODPSN PIC  X(004).
000240 01  OBA_PRTWRK-SRTWRK PIC  X(009).
