000010************************************************
000020* (PAY_BILWRK)
000030************************************************
000040 01  PAY_BILWRK-REGJPN PIC  X(006).
000050 01  PAY_BILWRK-CTLNUM PIC  X(009).
000060 01  PAY_BILWRK-DATNUM PIC  X(004).
000070 01  PAY_BILWRK-UNICOD PIC  X(003).
000080 01  PAY_BILWRK-BILNUM PIC  X(009).
000090 01  PAY_BILWRK-BNKCOD PIC  X(004).
000100 01  PAY_BILWRK-BRCCOD PIC  X(003).
000110 01  PAY_BILWRK-DRWDAY PIC  X(008).
000120 01  PAY_BILWRK-DRWJPN PIC  X(006).
000130 01  PAY_BILWRK-ISUDAY PIC  X(008).
000140 01  PAY_BILWRK-ISUJPN PIC  X(006).
000150 01  PAY_BILWRK-DUEDAY PIC  X(008).
000160 01  PAY_BILWRK-DUEJPN PIC  X(006).
000170 01  PAY_BILWRK-CLTNAM PIC  X(044).
000180 01  PAY_BILWRK-ISUTYP PIC  X(001).
000190 01  PAY_BILWRK-ISUTRM PIC  X(002).
000200 01  PAY_BILWRK-SEQNUM PIC  X(005).
000210 01  PAY_BILWRK-SEPNUM PIC  X(001).
000220 01  PAY_BILWRK-SNDTYP PIC  X(001).
000230 01  PAY_BILWRK-CNTNUM PIC  X(009).
000240 01  PAY_BILWRK-ZIPCOD PIC  X(007).
000250 01  PAY_BILWRK-MALNAM PIC  X(042).
000260 01  PAY_BILWRK-MALNM2 PIC  X(042).
000270 01  PAY_BILWRK-MALADR PIC  X(042).
000280 01  PAY_BILWRK-MALAD2 PIC  X(042).
000290 01  PAY_BILWRK-MALAD3 PIC  X(042).
000300 01  PAY_BILWRK-ADRTYP PIC  X(001).
000310 01  PAY_BILWRK-DAYBGN PIC  X(008).
000320 01  PAY_BILWRK-DAYEND PIC  X(008).
000330 01  PAY_BILWRK-PUTFLG PIC  X(001).
000340 01  PAY_BILWRK-CNTCNT PIC S9(003) COMP-3.
000350 01  PAY_BILWRK-SEPCNT PIC S9(001) COMP-3.
000360 01  PAY_BILWRK-SEQCNT PIC S9(001) COMP-3.
000370 01  PAY_BILWRK-BILAMT PIC S9(013) COMP-3.
000380 01  PAY_BILWRK-TAXAMT PIC S9(013) COMP-3.
000390 01  PAY_BILWRK-TOTAMT PIC S9(013) COMP-3.
000400 01  PAY_BILWRK-REGDAY PIC  X(008).
000410 01  PAY_BILWRK-REGTIM PIC  X(006).
000420 01  PAY_BILWRK-REGPSN PIC  X(004).
000430 01  PAY_BILWRK-MODDAY PIC  X(008).
000440 01  PAY_BILWRK-MODTIM PIC  X(006).
000450 01  PAY_BILWRK-MODPSN PIC  X(004).
