000010************************************************
000020* (PAY_GAFCOD)
000030************************************************
000040 01  PAY_GAFCOD-EXPCOD PIC  X(003).
000050 01  PAY_GAFCOD-EXPNAM PIC  X(030).
