000010************************************************
000020* (PAY_DATMOD)
000030************************************************
000040 01  PAY_DATMOD-JOBTYP PIC  X(004).
000050 01  PAY_DATMOD-REGTIM PIC  X(006).
000060 01  PAY_DATMOD-OPEDAY PIC  X(004).
000070 01  PAY_DATMOD-PAYDAY PIC  X(004).
000080 01  PAY_DATMOD-TRNNUM PIC  X(004).
000090 01  PAY_DATMOD-OFCCOD PIC  X(004).
000100 01  PAY_DATMOD-USRDEP PIC  X(008).
000110 01  PAY_DATMOD-BNKCOD PIC  X(004).
000120 01  PAY_DATMOD-BNKNAM PIC  X(015).
000130 01  PAY_DATMOD-BRCCOD PIC  X(003).
000140 01  PAY_DATMOD-BRCNAM PIC  X(015).
000150 01  PAY_DATMOD-DEPKND PIC  X(001).
000160 01  PAY_DATMOD-DEPNUM PIC  X(007).
000170 01  PAY_DATMOD-CSTNAM PIC  X(030).
000180 01  PAY_DATMOD-TRNAMT PIC S9(010) COMP-3.
000190 01  PAY_DATMOD-CHGAMT PIC S9(005) COMP-3.
000200 01  PAY_DATMOD-BNKCOD_O PIC  X(004).
000210 01  PAY_DATMOD-BNKNAM_O PIC  X(015).
000220 01  PAY_DATMOD-BRCCOD_O PIC  X(003).
000230 01  PAY_DATMOD-BRCNAM_O PIC  X(015).
000240 01  PAY_DATMOD-DEPKND_O PIC  X(001).
000250 01  PAY_DATMOD-DEPNUM_O PIC  X(007).
000260 01  PAY_DATMOD-CSTNAM_O PIC  X(030).
000270 01  PAY_DATMOD-TRNAMT_O PIC S9(010) COMP-3.
000280 01  PAY_DATMOD-CHGAMT_O PIC S9(005) COMP-3.
000290 01  PAY_DATMOD-BNKCOD_M PIC  X(001).
000300 01  PAY_DATMOD-BNKNAM_M PIC  X(001).
000310 01  PAY_DATMOD-BRCCOD_M PIC  X(001).
000320 01  PAY_DATMOD-BRCNAM_M PIC  X(001).
000330 01  PAY_DATMOD-DEPKND_M PIC  X(001).
000340 01  PAY_DATMOD-DEPNUM_M PIC  X(001).
000350 01  PAY_DATMOD-CSTNAM_M PIC  X(001).
000360 01  PAY_DATMOD-TRNAMT_M PIC  X(001).
000370 01  PAY_DATMOD-CHGAMT_M PIC  X(001).
