000010************************************************
000020* (PAY_BNSUPM)
000030************************************************
000040 01  PAY_BNSUPM-JOBTYP PIC  X(001).
000050 01  PAY_BNSUPM-JOBTIM PIC  X(006).
000060 01  PAY_BNSUPM-OFCCOD PIC  X(004).
000070 01  PAY_BNSUPM-CNTNUM PIC  X(009).
000080 01  PAY_BNSUPM-RELEAS PIC  X(001).
000090 01  PAY_BNSUPM-RECNUM PIC  X(004).
000100 01  PAY_BNSUPM-PAYCLT PIC  X(008).
000110 01  PAY_BNSUPM-PAYNAM PIC  X(060).
000120 01  PAY_BNSUPM-PAYDAY PIC  X(008).
000130 01  PAY_BNSUPM-DIVCOD PIC  X(004).
000140 01  PAY_BNSUPM-EXPCOD PIC  X(003).
000150 01  PAY_BNSUPM-TRNAMT PIC S9(013) COMP-3.
000160 01  PAY_BNSUPM-TRNTAX PIC S9(013) COMP-3.
000170 01  PAY_BNSUPM-PAYAMT PIC S9(013) COMP-3.
000180 01  PAY_BNSUPM-CHGAMT PIC S9(013) COMP-3.
000190 01  PAY_BNSUPM-CHGTAX PIC S9(013) COMP-3.
000200 01  PAY_BNSUPM-TAXRAT PIC S9(002)V9(1) COMP-3.
000210 01  PAY_BNSUPM-REMARK PIC  X(046).
000220 01  PAY_BNSUPM-CHGTYP PIC  X(001).
000230 01  PAY_BNSUPM-TRNNUM PIC  X(010).
000240 01  PAY_BNSUPM-ERRFLG PIC  X(001).
000250 01  PAY_BNSUPM-TRNAMT_O PIC S9(013) COMP-3.
000260 01  PAY_BNSUPM-TRNTAX_O PIC S9(013) COMP-3.
000270 01  PAY_BNSUPM-PAYAMT_O PIC S9(013) COMP-3.
000280 01  PAY_BNSUPM-CHGAMT_O PIC S9(013) COMP-3.
000290 01  PAY_BNSUPM-CHGTAX_O PIC S9(013) COMP-3.
000300 01  PAY_BNSUPM-TAXRAT_O PIC S9(002)V9(1) COMP-3.
000310 01  PAY_BNSUPM-REMARK_O PIC  X(046).
000320 01  PAY_BNSUPM-CHGTYP_O PIC  X(001).
000330 01  PAY_BNSUPM-TRNNUM_O PIC  X(010).
000340 01  PAY_BNSUPM-TRNAMT_M PIC  X(001).
000350 01  PAY_BNSUPM-TRNTAX_M PIC  X(001).
000360 01  PAY_BNSUPM-PAYAMT_M PIC  X(001).
000370 01  PAY_BNSUPM-CHGAMT_M PIC  X(001).
000380 01  PAY_BNSUPM-CHGTAX_M PIC  X(001).
000390 01  PAY_BNSUPM-TAXRAT_M PIC  X(001).
000400 01  PAY_BNSUPM-REMARK_M PIC  X(001).
000410 01  PAY_BNSUPM-CHGTYP_M PIC  X(001).
000420 01  PAY_BNSUPM-TRNNUM_M PIC  X(001).
000430 01  PAY_BNSUPM-REGDAY PIC  X(008).
000440 01  PAY_BNSUPM-REGTIM PIC  X(006).
000450 01  PAY_BNSUPM-REGPSN PIC  X(004).
000460 01  PAY_BNSUPM-MODDAY PIC  X(008).
000470 01  PAY_BNSUPM-MODTIM PIC  X(006).
000480 01  PAY_BNSUPM-MODPSN PIC  X(004).
