000010************************************************
000020* (PAY_KOKMOD)
000030************************************************
000040 01  PAY_KOKMOD-JOBTYP PIC  X(004).
000050 01  PAY_KOKMOD-REGTIM PIC  X(006).
000060 01  PAY_KOKMOD-DIVCOD PIC  X(004).
000070 01  PAY_KOKMOD-PAYCLT PIC  X(004).
000080 01  PAY_KOKMOD-PAYNAM PIC  X(056).
000090 01  PAY_KOKMOD-DEPNAM PIC  X(056).
000100 01  PAY_KOKMOD-BNKCOD PIC  X(004).
000110 01  PAY_KOKMOD-BRCCOD PIC  X(003).
000120 01  PAY_KOKMOD-DEPKND PIC  X(001).
000130 01  PAY_KOKMOD-DEPNUM PIC  X(007).
000140 01  PAY_KOKMOD-REGNUM PIC  X(004).
000150 01  PAY_KOKMOD-BILNAM PIC  X(056).
000160 01  PAY_KOKMOD-ZIPCOD PIC  X(007).
000170 01  PAY_KOKMOD-ADDRS1 PIC  X(034).
000180 01  PAY_KOKMOD-ADDRS2 PIC  X(032).
000190 01  PAY_KOKMOD-ADDRS3 PIC  X(032).
000200 01  PAY_KOKMOD-MALNM1 PIC  X(028).
000210 01  PAY_KOKMOD-MALNM2 PIC  X(028).
000220 01  PAY_KOKMOD-HOLSFT PIC  X(001).
000230 01  PAY_KOKMOD-CHAGYN PIC  X(001).
000240 01  PAY_KOKMOD-CHGFLG PIC  X(001).
000250 01  PAY_KOKMOD-PAYNAM_O PIC  X(056).
000260 01  PAY_KOKMOD-DEPNAM_O PIC  X(056).
000270 01  PAY_KOKMOD-BNKCOD_O PIC  X(004).
000280 01  PAY_KOKMOD-BRCCOD_O PIC  X(003).
000290 01  PAY_KOKMOD-DEPKND_O PIC  X(001).
000300 01  PAY_KOKMOD-DEPNUM_O PIC  X(007).
000310 01  PAY_KOKMOD-REGNUM_O PIC  X(004).
000320 01  PAY_KOKMOD-BILNAM_O PIC  X(056).
000330 01  PAY_KOKMOD-ZIPCOD_O PIC  X(007).
000340 01  PAY_KOKMOD-ADDRS1_O PIC  X(034).
000350 01  PAY_KOKMOD-ADDRS2_O PIC  X(032).
000360 01  PAY_KOKMOD-ADDRS3_O PIC  X(032).
000370 01  PAY_KOKMOD-MALNM1_O PIC  X(028).
000380 01  PAY_KOKMOD-MALNM2_O PIC  X(028).
000390 01  PAY_KOKMOD-HOLSFT_O PIC  X(001).
000400 01  PAY_KOKMOD-CHAGYN_O PIC  X(001).
000410 01  PAY_KOKMOD-PAYNAM_M PIC  X(001).
000420 01  PAY_KOKMOD-DEPNAM_M PIC  X(001).
000430 01  PAY_KOKMOD-BNKCOD_M PIC  X(001).
000440 01  PAY_KOKMOD-BRCCOD_M PIC  X(001).
000450 01  PAY_KOKMOD-DEPKND_M PIC  X(001).
000460 01  PAY_KOKMOD-DEPNUM_M PIC  X(001).
000470 01  PAY_KOKMOD-REGNUM_M PIC  X(001).
000480 01  PAY_KOKMOD-BILNAM_M PIC  X(001).
000490 01  PAY_KOKMOD-ZIPCOD_M PIC  X(001).
000500 01  PAY_KOKMOD-ADDRS1_M PIC  X(001).
000510 01  PAY_KOKMOD-ADDRS2_M PIC  X(001).
000520 01  PAY_KOKMOD-ADDRS3_M PIC  X(001).
000530 01  PAY_KOKMOD-MALNM1_M PIC  X(001).
000540 01  PAY_KOKMOD-MALNM2_M PIC  X(001).
000550 01  PAY_KOKMOD-HOLSFT_M PIC  X(001).
000560 01  PAY_KOKMOD-CHAGYN_M PIC  X(001).
