000010************************************************
000020* (PAY_CNVLST)
000030************************************************
000040 01  PAY_CNVLST-BNKCOD PIC  X(004).
000050 01  PAY_CNVLST-BRCCOD PIC  X(003).
000060 01  PAY_CNVLST-DEPKND PIC  X(001).
000070 01  PAY_CNVLST-DEPNUM PIC  X(007).
000080 01  PAY_CNVLST-CSTNAM PIC  X(030).
