000010************************************************
000020* (POK_KAIYAKU)
000030************************************************
000040 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ŠÇ—‚m‚n PIC  X(009).
000050 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|‹@ŽíƒR[ƒh PIC  X(015).
000060 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|‹@”Ô PIC  X(012).
000070 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|‰Šú”­’‚m‚n PIC  X(011).
000080 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|‹@ŠB‘ã‹à PIC S9(013) COMP-3.
000090 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ƒŠ[ƒXŽx•¥ŠJŽn”NŒŽ PIC  X(006).
000100 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ƒŠ[ƒX‰ïŽÐƒR[ƒh PIC  X(001).
000110 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ŒŽŠzƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000120 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ƒŠ[ƒX—¿—¦ PIC S9(002)V9(8) COMP-3.
000130 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ƒŠ[ƒXŽx•¥‰ñ” PIC S9(003) COMP-3.
000140 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ƒŠ[ƒX‰ð–ñ”NŒŽ PIC  X(006).
000150 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uæ–¼Ì PIC  X(040).
000160 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uæs­‹æ•ª‚P PIC  X(002).
000170 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uæs­‹æ•ª‚Q PIC  X(003).
000180 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uæ“s“¹•{Œ§–¼ PIC  X(008).
000190 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uæŽs‹æ’¬‘º–¼ PIC  X(022).
000200 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uæ’¬ˆæ–¼ PIC  X(074).
000210 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uæ•â•ZŠ PIC  X(060).
000220 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uæ“d˜b”Ô† PIC  X(012).
000230 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|‹@ŠB•ª—Þ–¼Ì PIC  X(016).
000240 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ƒ[ƒJ[ƒR[ƒh PIC  X(002).
000250 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|ƒrƒ‹ƒoƒŠ—L–³–¼Ì PIC  X(020).
000260 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|‰Û|o’£ŠƒR[ƒh PIC  X(005).
000270 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|‰Û|o’£Š—ª–¼ PIC  X(024).
000280 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uŒ_–ñæƒR[ƒh|‰ïŽÐ PIC  X(005).
000290 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Ý’uŒ_–ñæƒR[ƒh|Ž–‹ÆŠ 
                                             PIC  X(005).
000300 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|Œ_–ñæ—ªÌ PIC  X(024).
000310 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|”pŠü“ú PIC  X(008).
000320 01  ‚o‚n‚j|‚j‚`‚h‚x‚`‚j‚t|”pŠü——R PIC  X(010).
