000010************************************************
000020* (POK_LPWK_SEIKYU)
000030************************************************
000040 01  ‚o‚n‚j|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚o‚n‚j|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t|‰ñ” PIC S9(001) COMP-3.
000060 01  ‚o‚n‚j|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000070 01  ‚o‚n‚j|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000080 01  ‚o‚n‚j|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000090 01  ‚o‚n‚j|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t|•¨Œ–¼|Š¿Žš PIC  X(040).
