000010************************************************
000020* (SEC_PASSWORD)
000030************************************************
000040 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|’S“–ŽÒƒR[ƒh PIC  X(004).
000050 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|ƒ[ƒJƒ‹ƒpƒXƒ[ƒh|V 
                                             PIC  X(010).
000060 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|ƒZƒ“ƒ^[ƒpƒXƒ[ƒh PIC  X(005).
000070 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|ƒXƒe[ƒ^ƒX‚m‚n PIC  X(002).
000080 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|—LŒøŠúŒÀ PIC  X(008).
000090 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|XV‚e‚k‚f PIC  X(001).
000100 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|“o˜^“ú PIC  X(008).
000110 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|“o˜^Žž PIC  X(006).
000120 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000130 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|XV“ú PIC  X(008).
000140 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|XVŽž PIC  X(006).
000150 01  ‚r‚d‚b|‚o‚`‚r‚r‚v‚n‚q‚c|XV’S“–ŽÒƒR[ƒh PIC  X(004).
