000010************************************************
000020* (SIN_KEIYAKUSAKI)
000030************************************************
000040 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|âg‹c‚m‚n PIC  X(010).
000050 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ŒÚ‹qƒR[ƒh PIC  X(006).
000060 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|Žæˆøæ–¼Š¿Žš PIC  X(060).
000070 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|e‰ïŽÐ–¼ PIC  X(060).
000080 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ŽæˆøæZŠ PIC  X(090).
000090 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|‹ÆŽíƒR[ƒh PIC  X(002).
000100 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|‹ÆŽí PIC  X(030).
000110 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|Ý—§”NŒŽ“ú PIC  X(008).
000120 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|Ž‘–{‹à PIC S9(006) COMP-3.
000130 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ãê‹æ•ª PIC  X(001).
000140 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|‘åŠé‹ÆƒR[ƒh PIC  X(001).
000150 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|]‹Æˆõ” PIC S9(006) COMP-3.
000160 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ŽæˆøŠJŽn“ú PIC  X(008).
000170 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|‚a‚s‚lŽæˆø‹æ•ª PIC  X(001).
000180 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|‚a‚s‚l’S“–•”“X PIC  X(030).
000190 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|’¼’Ê“d˜b‚P PIC  X(015).
000200 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|æ•û’S“–ŽÒ–¼‚P PIC  X(014).
000210 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ŒˆŽZ”NŒŽ PIC  X(006).
000220 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|”„ã‚ PIC S9(013) COMP-3.
000230 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|Œoí—˜‰v PIC S9(013) COMP-3.
000240 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|“–Šú—˜‰v PIC S9(013) COMP-3.
000250 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|\Š“¾ PIC S9(013) COMP-3.
000260 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|Ž©ŒÈŽ‘–{ PIC S9(013) COMP-3.
000270 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|‘Ž‘ŽY PIC S9(013) COMP-3.
000280 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000290 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ƒ†[ƒU[ƒŠ[ƒXŽc‚ 
                                             PIC S9(006) COMP-3.
000300 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ƒ†[ƒU[Š„•ŠŽc‚ 
                                             PIC S9(006) COMP-3.
000310 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ƒ†[ƒU[‘Ý•t‹à‘¼Žc‚ 
                                             PIC S9(006) COMP-3.
000320 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ƒ†[ƒU[–¢ŒŸŽûŽc‚ 
                                             PIC S9(006) COMP-3.
000330 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|ƒ†[ƒU[–¢’¥Žû‹à 
                                             PIC S9(006) COMP-3.
000340 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000350 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|–¼Šñ‚¹ƒŠ[ƒXŽc‚ 
                                             PIC S9(006) COMP-3.
000360 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|–¼Šñ‚¹Š„•ŠŽc‚ 
                                             PIC S9(006) COMP-3.
000370 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|–¼Šñ‚¹‘Ý•t‹à‘¼Žc‚ 
                                             PIC S9(006) COMP-3.
000380 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|–¼Šñ‚¹–¢ŒŸŽûŽc‚ 
                                             PIC S9(006) COMP-3.
000390 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|–¼Šñ‚¹–¢’¥Žû‹à 
                                             PIC S9(006) COMP-3.
000400 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|“o˜^“ú PIC  X(008).
000410 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|“o˜^Žž PIC  X(006).
000420 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|“o˜^’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000430 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|XV“ú PIC  X(008).
000440 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|XVŽž PIC  X(006).
000450 01  ‚r‚h‚m|‚j‚d‚h‚x‚`‚j‚t‚r‚`‚j‚h|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
