000010************************************************
000020* (SIN_SEIKYU)
000030************************************************
000040 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|âg‹c‚m‚n PIC  X(010).
000050 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|‘æ‚P‰ñƒŠ[ƒX—¿ŽóŽæðŒ PIC  X(020).
000060 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|‘æ‚Q‰ñ–ÚˆÈ~ƒŠ[ƒX—¿ŽóŽæðŒ 
                                             PIC  X(020).
000070 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|¿‹‹æ•ª‚P PIC  X(001).
000080 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|¿‹‹æ•ª‚Q PIC  X(001).
000090 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|‹âs’ZkƒR[ƒh PIC  X(002).
000100 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|‹âs–¼ PIC  X(030).
000110 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|ŽèŒ`–‡” PIC S9(003) COMP-3.
000120 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|“o˜^“ú PIC  X(008).
000130 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|“o˜^Žž PIC  X(006).
000140 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|XV“ú PIC  X(008).
000160 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|XVŽž PIC  X(006).
000170 01  ‚r‚h‚m|‚r‚d‚h‚j‚x‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
