000010************************************************
000020* (SIN_IKEN)
000030************************************************
000040 01  ‚r‚h‚m|‚h‚j‚d‚m|âg‹c‚m‚n PIC  X(010).
000050 01  ‚r‚h‚m|‚h‚j‚d‚m|‰c‹Æ•”ˆÓŒ© PIC  X(340).
000060 01  ‚r‚h‚m|‚h‚j‚d‚m|“o˜^“ú PIC  X(008).
000070 01  ‚r‚h‚m|‚h‚j‚d‚m|“o˜^Žž PIC  X(006).
000080 01  ‚r‚h‚m|‚h‚j‚d‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚r‚h‚m|‚h‚j‚d‚m|XV“ú PIC  X(008).
000100 01  ‚r‚h‚m|‚h‚j‚d‚m|XVŽž PIC  X(006).
000110 01  ‚r‚h‚m|‚h‚j‚d‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
