000010************************************************
000020* (SKY_CHGMST)
000030************************************************
000040 01  SKY_CHGMST-CNTNUM PIC  X(009).
000050 01  SKY_CHGMST-OURDIV PIC  X(004).
000060 01  SKY_CHGMST-OURTEL PIC  X(015).
000070 01  SKY_CHGMST-ISUTYP PIC  X(001).
000080 01  SKY_CHGMST-ISUNAM PIC  X(040).
000090 01  SKY_CHGMST-CLTCOD PIC  X(008).
000100 01  SKY_CHGMST-CLTNAM PIC  X(060).
000110 01  SKY_CHGMST-CLTDIV PIC  X(050).
000120 01  SKY_CHGMST-ADRTYP PIC  X(001).
000130 01  SKY_CHGMST-ZIPCOD PIC  X(007).
000140 01  SKY_CHGMST-CLTADR PIC  X(050).
000150 01  SKY_CHGMST-CLTAD2 PIC  X(050).
000160 01  SKY_CHGMST-TELNUM PIC  X(015).
000170 01  SKY_CHGMST-PAYBGN PIC  X(008).
000180 01  SKY_CHGMST-PAYEND PIC  X(008).
000190 01  SKY_CHGMST-PAYDAY PIC  X(008).
000200 01  SKY_CHGMST-FIXDAY PIC  X(002).
000210 01  SKY_CHGMST-PAYCYC PIC  X(002).
000220 01  SKY_CHGMST-PAYTYP PIC  X(001).
000230 01  SKY_CHGMST-APPLIC PIC  X(020).
000240 01  SKY_CHGMST-PRTTIM PIC  X(001).
000250 01  SKY_CHGMST-PRTPTN PIC  X(002).
000260 01  SKY_CHGMST-PRTMLT PIC  X(001).
000270 01  SKY_CHGMST-DAYSHW PIC  X(001).
000280 01  SKY_CHGMST-DEMTYP PIC  X(001).
000290 01  SKY_CHGMST-ITMNAM PIC  X(040).
000300 01  SKY_CHGMST-REMARK PIC  X(080).
000310 01  SKY_CHGMST-REMAR2 PIC  X(080).
000320 01  SKY_CHGMST-PAYCNT PIC S9(003) COMP-3.
000330 01  SKY_CHGMST-TOTCNT PIC S9(003) COMP-3.
000340 01  SKY_CHGMST-DEMCNT PIC S9(003) COMP-3.
000350 01  SKY_CHGMST-TAXRAT PIC S9(002)V9(2) COMP-3.
000360 01  SKY_CHGMST-LEAAMT PIC S9(013) COMP-3.
000370 01  SKY_CHGMST-LEAAM2 PIC S9(013) COMP-3.
000380 01  SKY_CHGMST-MNTCHG PIC S9(013) COMP-3.
000390 01  SKY_CHGMST-LEATAX PIC S9(013) COMP-3.
000400 01  SKY_CHGMST-LEATX2 PIC S9(013) COMP-3.
000410 01  SKY_CHGMST-MNTTAX PIC S9(013) COMP-3.
