000010************************************************
000020* (SKY_PRTWRK)
000030************************************************
000040 01  SKY_PRTWRK-CNTNUM PIC  X(009).
000050 01  SKY_PRTWRK-OURDIV PIC  X(004).
000060 01  SKY_PRTWRK-OURTEL PIC  X(015).
000070 01  SKY_PRTWRK-ISUTYP PIC  X(001).
000080 01  SKY_PRTWRK-ISUNAM PIC  X(040).
000090 01  SKY_PRTWRK-CLTCOD PIC  X(008).
000100 01  SKY_PRTWRK-CLTNAM PIC  X(060).
000110 01  SKY_PRTWRK-CLTDIV PIC  X(050).
000120 01  SKY_PRTWRK-ADRTYP PIC  X(001).
000130 01  SKY_PRTWRK-ZIPCOD PIC  X(007).
000140 01  SKY_PRTWRK-CLTADR PIC  X(050).
000150 01  SKY_PRTWRK-CLTAD2 PIC  X(050).
000160 01  SKY_PRTWRK-TELNUM PIC  X(015).
000170 01  SKY_PRTWRK-PAYBGN PIC  X(008).
000180 01  SKY_PRTWRK-PAYEND PIC  X(008).
000190 01  SKY_PRTWRK-PAYDAY PIC  X(008).
000200 01  SKY_PRTWRK-FIXDAY PIC  X(002).
000210 01  SKY_PRTWRK-PAYCYC PIC  X(002).
000220 01  SKY_PRTWRK-PAYTYP PIC  X(001).
000230 01  SKY_PRTWRK-APPLIC PIC  X(020).
000240 01  SKY_PRTWRK-PRTTIM PIC  X(001).
000250 01  SKY_PRTWRK-PRTPTN PIC  X(002).
000260 01  SKY_PRTWRK-PRTMLT PIC  X(001).
000270 01  SKY_PRTWRK-DAYSHW PIC  X(001).
000280 01  SKY_PRTWRK-DEMTYP PIC  X(001).
000290 01  SKY_PRTWRK-ITMNAM PIC  X(040).
000300 01  SKY_PRTWRK-REMARK PIC  X(080).
000310 01  SKY_PRTWRK-REMAR2 PIC  X(080).
000320 01  SKY_PRTWRK-PAYCNT PIC S9(003) COMP-3.
000330 01  SKY_PRTWRK-TOTCNT PIC S9(003) COMP-3.
000340 01  SKY_PRTWRK-DEMCNT PIC S9(003) COMP-3.
000350 01  SKY_PRTWRK-TAXRAT PIC S9(002)V9(2) COMP-3.
000360 01  SKY_PRTWRK-LEAAMT PIC S9(013) COMP-3.
000370 01  SKY_PRTWRK-LEAAM2 PIC S9(013) COMP-3.
000380 01  SKY_PRTWRK-MNTCHG PIC S9(013) COMP-3.
000390 01  SKY_PRTWRK-LEATAX PIC S9(013) COMP-3.
000400 01  SKY_PRTWRK-LEATX2 PIC S9(013) COMP-3.
000410 01  SKY_PRTWRK-MNTTAX PIC S9(013) COMP-3.
