000010************************************************
000020* (SOSIN_JIGYO)
000030************************************************
000040 01  ‚r‚n‚r‚h‚m|‚i‚h‚f‚x‚n|‘—MŽ–‹ÆŠƒL[ PIC  X(002).
000050 01  ‚r‚n‚r‚h‚m|‚i‚h‚f‚x‚n|‘—MŽ–‹ÆŠƒR[ƒh PIC  X(004).
