000100*
000200************************************************
000300**　　　ホスト変数定義　　　　　　　　　　　　**
000400************************************************
000500*
000600 01 SQLSTATE      PIC X(005).
000700 01 SQLMSG        PIC X(128).
000800*