000010************************************************
000020* (SWP_CCYMST)
000030************************************************
000040 01  SWP_CCYMST-BASDAY PIC  X(008).
000050 01  SWP_CCYMST-CCYCOD PIC  X(003).
000060 01  SWP_CCYMST-SWIFTC PIC  X(003).
000070 01  SWP_CCYMST-CCYNAM PIC  X(008).
000080 01  SWP_CCYMST-NATION PIC  X(020).
000090 01  SWP_CCYMST-BLWCOL PIC S9(002) COMP-3.
000100 01  SWP_CCYMST-CNVUNT PIC S9(003) COMP-3.
000110 01  SWP_CCYMST-RATTTS PIC S9(004)V9(2) COMP-3.
000120 01  SWP_CCYMST-RATTTB PIC S9(004)V9(2) COMP-3.
000130 01  SWP_CCYMST-RATTTM PIC S9(004)V9(2) COMP-3.
