000010************************************************
000020* (SWP_INTSWP)
000030************************************************
000040 01  SWP_INTSWP-CTLNUM PIC  X(004).
000050 01  SWP_INTSWP-BNKCOD PIC  X(004).
000060 01  SWP_INTSWP-BRCCOD PIC  X(003).
000070 01  SWP_INTSWP-BNKNAM PIC  X(050).
000080 01  SWP_INTSWP-CONDAY PIC  X(008).
000090 01  SWP_INTSWP-CCYCOD PIC  X(003).
000100 01  SWP_INTSWP-CNTCAP PIC S9(013) COMP-3.
000110 01  SWP_INTSWP-BALCAP PIC S9(013) COMP-3.
000120 01  SWP_INTSWP-COLAMT PIC S9(013) COMP-3.
000130 01  SWP_INTSWP-COLLST PIC S9(013) COMP-3.
000140 01  SWP_INTSWP-COLCNT PIC S9(003) COMP-3.
000150 01  SWP_INTSWP-RCVFIX PIC  X(001).
000160 01  SWP_INTSWP-RCVDAY PIC  X(003).
000170 01  SWP_INTSWP-RCVRAT PIC S9(002)V9(6) COMP-3.
000180 01  SWP_INTSWP-PAYFIX PIC  X(001).
000190 01  SWP_INTSWP-PAYDAY PIC  X(003).
000200 01  SWP_INTSWP-PAYRAT PIC S9(002)V9(6) COMP-3.
000210 01  SWP_INTSWP-MARGIN PIC S9(002)V9(6) COMP-3.
000220 01  SWP_INTSWP-HOLSFT PIC  X(001).
000230 01  SWP_INTSWP-ENDFIX PIC  X(001).
000240 01  SWP_INTSWP-FRACTN PIC  X(001).
000250 01  SWP_INTSWP-CCYRAT PIC S9(004)V9(2) COMP-3.
000260 01  SWP_INTSWP-INTBGN PIC  X(008).
000270 01  SWP_INTSWP-DUEDAY PIC  X(008).
000280 01  SWP_INTSWP-MONCNT PIC S9(003) COMP-3.
000290 01  SWP_INTSWP-UPDCYC PIC  X(002).
000300 01  SWP_INTSWP-FRZTRM PIC  X(002).
000310 01  SWP_INTSWP-YLDTYP PIC  X(001).
000320 01  SWP_INTSWP-REMARK PIC  X(050).
000330 01  SWP_INTSWP-UPDFLG PIC  X(001).
