000010************************************************
000020* (TDB_RECSEC)
000030************************************************
000040 01  TDB_RECSEC-FRMCOD PIC  X(009).
000050 01  TDB_RECSEC-GENFLD PIC  X(1191).
