000010************************************************
000020* (TDB_20020719)
000030************************************************
000040 01  ‚s‚c‚a|‚Q‚O‚O‚Q‚O‚V‚P‚X|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000050 01  ‚s‚c‚a|‚Q‚O‚O‚Q‚O‚V‚P‚X|’é‘Šé‹ÆƒR[ƒh PIC  X(009).
