000010************************************************
000020* (TSL_MODLST)
000030************************************************
000040 01  TSL_MODLST-JOBTYP PIC  X(001).
000050 01  TSL_MODLST-REGTIM PIC  X(006).
000060 01  TSL_MODLST-CNTNUM PIC  X(009).
000070 01  TSL_MODLST-PRFCOD PIC  X(002).
000080 01  TSL_MODLST-PRFNAM PIC  X(006).
000090 01  TSL_MODLST-BNKCOD PIC  X(004).
000100 01  TSL_MODLST-BNKNAM PIC  X(020).
000110 01  TSL_MODLST-BRCNAM PIC  X(020).
000120 01  TSL_MODLST-PROGRE PIC  X(001).
000130 01  TSL_MODLST-USRCOD PIC  X(008).
000140 01  TSL_MODLST-USRNAM PIC  X(030).
000150 01  TSL_MODLST-BUYNAM PIC  X(030).
000160 01  TSL_MODLST-OBJNAM PIC  X(040).
000170 01  TSL_MODLST-CNTDAY PIC  X(008).
000180 01  TSL_MODLST-APRDAY PIC  X(008).
000190 01  TSL_MODLST-DUEDAY PIC  X(008).
000200 01  TSL_MODLST-BASDAY PIC  X(008).
000210 01  TSL_MODLST-INDCOD PIC  X(002).
000220 01  TSL_MODLST-INTTYP PIC  X(001).
000230 01  TSL_MODLST-RELEAS PIC  X(001).
000240 01  TSL_MODLST-DELFLG PIC  X(001).
000250 01  TSL_MODLST-MONCNT PIC S9(004) COMP-3.
000260 01  TSL_MODLST-OBJAMT PIC S9(013) COMP-3.
000270 01  TSL_MODLST-CNTAMT PIC S9(013) COMP-3.
000280 01  TSL_MODLST-LEAAMT PIC S9(013) COMP-3.
000290 01  TSL_MODLST-DEPAMT PIC S9(013) COMP-3.
000300 01  TSL_MODLST-INTRAT PIC S9(002)V9(6) COMP-3.
000310 01  TSL_MODLST-PRFCOD_O PIC  X(002).
000320 01  TSL_MODLST-PRFNAM_O PIC  X(006).
000330 01  TSL_MODLST-BNKCOD_O PIC  X(004).
000340 01  TSL_MODLST-BNKNAM_O PIC  X(020).
000350 01  TSL_MODLST-BRCNAM_O PIC  X(020).
000360 01  TSL_MODLST-PROGRE_O PIC  X(001).
000370 01  TSL_MODLST-USRCOD_O PIC  X(008).
000380 01  TSL_MODLST-USRNAM_O PIC  X(030).
000390 01  TSL_MODLST-BUYNAM_O PIC  X(030).
000400 01  TSL_MODLST-OBJNAM_O PIC  X(040).
000410 01  TSL_MODLST-CNTDAY_O PIC  X(008).
000420 01  TSL_MODLST-APRDAY_O PIC  X(008).
000430 01  TSL_MODLST-DUEDAY_O PIC  X(008).
000440 01  TSL_MODLST-INDCOD_O PIC  X(002).
000450 01  TSL_MODLST-INTTYP_O PIC  X(001).
000460 01  TSL_MODLST-RELEAS_O PIC  X(001).
000470 01  TSL_MODLST-DELFLG_O PIC  X(001).
000480 01  TSL_MODLST-MONCNT_O PIC S9(004) COMP-3.
000490 01  TSL_MODLST-OBJAMT_O PIC S9(013) COMP-3.
000500 01  TSL_MODLST-CNTAMT_O PIC S9(013) COMP-3.
000510 01  TSL_MODLST-LEAAMT_O PIC S9(013) COMP-3.
000520 01  TSL_MODLST-DEPAMT_O PIC S9(013) COMP-3.
000530 01  TSL_MODLST-INTRAT_O PIC S9(002)V9(6) COMP-3.
000540 01  TSL_MODLST-PRFCOD_M PIC  X(001).
000550 01  TSL_MODLST-PRFNAM_M PIC  X(001).
000560 01  TSL_MODLST-BNKCOD_M PIC  X(001).
000570 01  TSL_MODLST-BNKNAM_M PIC  X(001).
000580 01  TSL_MODLST-BRCNAM_M PIC  X(001).
000590 01  TSL_MODLST-PROGRE_M PIC  X(001).
000600 01  TSL_MODLST-USRCOD_M PIC  X(001).
000610 01  TSL_MODLST-USRNAM_M PIC  X(001).
000620 01  TSL_MODLST-BUYNAM_M PIC  X(001).
000630 01  TSL_MODLST-OBJNAM_M PIC  X(001).
000640 01  TSL_MODLST-CNTDAY_M PIC  X(001).
000650 01  TSL_MODLST-APRDAY_M PIC  X(001).
000660 01  TSL_MODLST-DUEDAY_M PIC  X(001).
000670 01  TSL_MODLST-INDCOD_M PIC  X(001).
000680 01  TSL_MODLST-INTTYP_M PIC  X(001).
000690 01  TSL_MODLST-RELEAS_M PIC  X(001).
000700 01  TSL_MODLST-DELFLG_M PIC  X(001).
000710 01  TSL_MODLST-MONCNT_M PIC  X(001).
000720 01  TSL_MODLST-OBJAMT_M PIC  X(001).
000730 01  TSL_MODLST-CNTAMT_M PIC  X(001).
000740 01  TSL_MODLST-LEAAMT_M PIC  X(001).
000750 01  TSL_MODLST-DEPAMT_M PIC  X(001).
000760 01  TSL_MODLST-INTRAT_M PIC  X(001).
