000010************************************************
000020* —^M(“ü‹àî•ñ)(YOSHINNYUKIN)
000030************************************************
000040 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|ŠÇ——^MæƒR[ƒh  PIC  X(008).
000050 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|ŠÇ——^M‹æ•ª  PIC  X(001).
000060 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|Ž©“®—^M‹æ•ª  PIC  X(001).
000070 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|Ž–ŒÌ“ú  PIC  X(008).
000080 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|Œ_–ñ‚m‚n  PIC  X(009).
000090 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|Š¨’èƒR[ƒh  PIC  X(002).
000100 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|“ü‹à—\’è“ú  PIC  X(008).
000110 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|¿‹“àƒR[ƒh  PIC  X(003).
000120 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|Áž’Ê”Ô  PIC  X(009).
000130 01  ‚x‚n‚r‚g‚h‚m‚m‚x‚t‚j‚h‚m|¿‹‹àŠz  PIC S9(013) COMP-3.
