000010************************************************
000020* (ZJK_TIMTBL)
000030************************************************
000040 01  ZJK_TIMTBL-BASBGN PIC  X(004).
000050 01  ZJK_TIMTBL-BASEND PIC  X(004).
000060 01  ZJK_TIMTBL-BASNGT PIC  X(004).
000070 01  ZJK_TIMTBL-BASRST PIC S9(004) COMP-3.
000080 01  ZJK_TIMTBL-BASWRK PIC S9(004) COMP-3.
000090 01  ZJK_TIMTBL-BASAFT PIC S9(004) COMP-3.
000100 01  ZJK_TIMTBL-BASATM PIC S9(004) COMP-3.
000110 01  ZJK_TIMTBL-BASBTM PIC S9(004) COMP-3.
000120 01  ZJK_TIMTBL-BASCTM PIC S9(004) COMP-3.
