000010************************************************
000020* (ZJK_PRTWRK)
000030************************************************
000040 01  ZJK_PRTWRK-BASYER PIC  X(004).
000050 01  ZJK_PRTWRK-UPDMON PIC  X(002).
000060 01  ZJK_PRTWRK-PSNCOD PIC  X(007).
000070 01  ZJK_PRTWRK-PSNNAM PIC  X(018).
000080 01  ZJK_PRTWRK-SEXTYP PIC  X(001).
000090 01  ZJK_PRTWRK-DIVCOD PIC  X(004).
000100 01  ZJK_PRTWRK-DIVNAM PIC  X(020).
000110 01  ZJK_PRTWRK-PRTSEQ PIC  X(003).
000120 01  ZJK_PRTWRK-MONATM PIC S9(004) COMP-3.
000130 01  ZJK_PRTWRK-MONBTM PIC S9(004) COMP-3.
000140 01  ZJK_PRTWRK-MONCTM PIC S9(004) COMP-3.
000150 01  ZJK_PRTWRK-MONDTM PIC S9(004) COMP-3.
000160 01  ZJK_PRTWRK-MONETM PIC S9(004) COMP-3.
000170 01  ZJK_PRTWRK-MONVAC PIC S9(002) COMP-3.
000180 01  ZJK_PRTWRK-MONHOL PIC S9(002) COMP-3.
000190 01  ZJK_PRTWRK-YERATM PIC S9(006) COMP-3.
000200 01  ZJK_PRTWRK-YERBTM PIC S9(006) COMP-3.
000210 01  ZJK_PRTWRK-YERCTM PIC S9(006) COMP-3.
000220 01  ZJK_PRTWRK-YERDTM PIC S9(006) COMP-3.
000230 01  ZJK_PRTWRK-YERETM PIC S9(006) COMP-3.
000240 01  ZJK_PRTWRK-YERVAC PIC S9(003) COMP-3.
000250 01  ZJK_PRTWRK-YERHOL PIC S9(003) COMP-3.
000260 01  ZJK_PRTWRK-ATMHOR PIC S9(003) COMP-3.
000270 01  ZJK_PRTWRK-ATMMIN PIC S9(002) COMP-3.
000280 01  ZJK_PRTWRK-BTMHOR PIC S9(003) COMP-3.
000290 01  ZJK_PRTWRK-BTMMIN PIC S9(002) COMP-3.
000300 01  ZJK_PRTWRK-CTMHOR PIC S9(003) COMP-3.
000310 01  ZJK_PRTWRK-CTMMIN PIC S9(002) COMP-3.
000320 01  ZJK_PRTWRK-DTMHOR PIC S9(003) COMP-3.
000330 01  ZJK_PRTWRK-DTMMIN PIC S9(002) COMP-3.
000340 01  ZJK_PRTWRK-ETMHOR PIC S9(003) COMP-3.
000350 01  ZJK_PRTWRK-ETMMIN PIC S9(002) COMP-3.
