000010************************************************
000020* “ŒŽÅæ“ú•tƒf[ƒ^ƒtƒ@ƒCƒ‹(ZZPS0006)
000030************************************************
000040 01  ‚y‚y‚o‚r‚O‚O‚O‚U|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚y‚y‚o‚r‚O‚O‚O‚U|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ƒŠ[ƒXI—¹“ú|¢‹I PIC  X(001).
000070 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000080 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ƒf[ƒ^‹æ•ª PIC  X(002).
000090 01  ‚y‚y‚o‚r‚O‚O‚O‚U|‰ïˆõ”Ô† PIC  X(016).
000100 01  ‚y‚y‚o‚r‚O‚O‚O‚U|Ž‘ŽY”Ô† PIC  X(009).
000110 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ˆê•”•”•ª‹æ•ª PIC  X(001).
000120 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ÄƒŠ[ƒX|¿‹‹àŠz‡Œv PIC S9(013) COMP-3.
000130 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ÄƒŠ[ƒX|w“ü‹àŠz‰ð–ñ•ª 
                                             PIC S9(013) COMP-3.
000140 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ÄƒŠ[ƒX|¿‹Á”ïÅŠz PIC S9(013) COMP-3.
000150 01  ‚y‚y‚o‚r‚O‚O‚O‚U|–ž—¹|”—Ê‰ð–ñ•ª PIC S9(004) COMP-3.
000160 01  ‚y‚y‚o‚r‚O‚O‚O‚U|–ž—¹|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000170 01  ‚y‚y‚o‚r‚O‚O‚O‚U|–ž—¹|w“ü‹àŠz‰ð–ñ•ª PIC S9(013) COMP-3.
000180 01  ‚y‚y‚o‚r‚O‚O‚O‚U|–ž—¹|Ž‘ŽYˆ•ª‚b‚c PIC  X(001).
000190 01  ‚y‚y‚o‚r‚O‚O‚O‚U|–ž—¹|”„‹pŠz PIC S9(013) COMP-3.
000200 01  ‚y‚y‚o‚r‚O‚O‚O‚U|–ž—¹|”„‹pŽ––±‘ãsŽè”—¿ 
                                             PIC S9(013) COMP-3.
000210 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ƒ_ƒ~[‚O‚O‚P PIC  X(011).
000220 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ˆ—“ú|¢‹I PIC  X(001).
000230 01  ‚y‚y‚o‚r‚O‚O‚O‚U|ˆ—“ú|”NŒŽ“ú PIC  X(006).
