000010************************************************
000020* ŽO—mU•ªŒã–ž—¹ƒf[ƒ^(ZZPS0004)
000030************************************************
000040 01  ‚y‚y‚o‚r‚O‚O‚O‚S|‚a‚n‚s‚kŒ_–ñ‚m‚n PIC  X(009).
000050 01  ‚y‚y‚o‚r‚O‚O‚O‚S|‚a‚n‚s‚k•¨Œ‚m‚n PIC  X(003).
000060 01  ‚y‚y‚o‚r‚O‚O‚O‚S|ÄƒŠ[ƒX‚b‚c PIC  X(001).
000070 01  ‚y‚y‚o‚r‚O‚O‚O‚S|ƒŠ[ƒXI—¹“ú|¢‹I PIC  X(001).
000080 01  ‚y‚y‚o‚r‚O‚O‚O‚S|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000090 01  ‚y‚y‚o‚r‚O‚O‚O‚S|”—Ê‰ð–ñ‘O PIC S9(004) COMP-3.
000100 01  ‚y‚y‚o‚r‚O‚O‚O‚S|”—Ê‰ð–ñ•ª PIC S9(004) COMP-3.
000110 01  ‚y‚y‚o‚r‚O‚O‚O‚S|ŒÂ•ÊƒŠ[ƒX—¿‰ð–ñ‘O PIC S9(013) COMP-3.
000120 01  ‚y‚y‚o‚r‚O‚O‚O‚S|w“ü‹àŠz‰ð–ñ‘O PIC S9(013) COMP-3.
000130 01  ‚y‚y‚o‚r‚O‚O‚O‚S|Ž‘ŽYˆ•ª‚b‚c PIC  X(001).
000140 01  ‚y‚y‚o‚r‚O‚O‚O‚S|ƒ_ƒ~[‚O‚O‚P PIC  X(057).
