       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXAMPLE71.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE ASSIGN TO INPUT-MSD.
           SELECT SORT-FILE ASSIGN TO SORT-MSD.
           SELECT OUTPUT-FILE ASSIGN TO OUTPUT-FILE.
       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE LABEL RECORD IS STANDARD.
       01 INPUT-REC.
           COPY RECDEF.
       SD SORT-FILE.
       01 SORT-REC.
           COPY RECDEF.
       FD OUTPUT-FILE LABEL RECORD IS STANDARD.
       01 OUTPUT-REC.
           COPY RECDEF.
       PROCEDURE DIVISION.
       BEGIN.
             SORT SORT-FILE
                 ON ASCENDING  KEY   CUSTOMER OF SORT-REC
                 ON DESCENDING KEY   CUSTOMER-CITY OF SORT-REC
                 USING INPUT-FILE
                 GIVING OUTPUT-FILE.
            STOP RUN.