000010 IDENTIFICATION DIVISION.                                       
000020 PROGRAM-ID. HELLOWORLD.                                    
000030 ENVIRONMENT DIVISION.                                      
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060      SELECT DISK-F ASSIGN TO DISK-MSD.    
000070 DATA DIVISION.
000080 FILE SECTION.
000090 FD DISK-F LABEL RECORD IS STANDARD
000100           VALUE OF IDENTIFICATION  IS "STORE.DAT".
000110 01 MS-REC.
000120    02 PART-NO PIC 9(5).
000130    02 UNTT-PRICE PIC 9(3)V99.
000140    02 PART-DESC  PIC X(20).
000150    02 REORDER-POINT PIC 9(5).
000160    02 ON-HAND     PIC 9(5).
000170    02 ON-ORDER    PIC 9(5).
000180 WORKING-STORAGE SECTION.
000190 77 A PIC 9.  
000191 77 SWITCH-E PIC 9 VALUE 0.                                       
000200 SCREEN SECTION.
000210 SD SCREEN-MAIN 
000220     END STATUS IS SCREEN-END.
000230     LINE SCREEN-LINE
000240     COLUMN SCREEN-COLU.
000250 01 SCREEN-S.
000260*     02 BLANK SCREEN.
000270     02     LINE 3 COLUMN 33 VALUE "STORE ACCOUNT.". 
000271     02 B   LINE 4 COLUMN 11 PIC 9 TO A. 
000280 PROCEDURE DIVISION.                                        
000290      
000300 MAIN.
000310     DISPLAY SCREEN-S. 
000311     ACCEPT SCREEN-S ON ESCAPE MOVE 1 TO SWITCH-E.
000312                                              
000320     DISPLAY  "HELLO WORLD",A .  
000340     STOP RUN.      