000010************************************************
000020* (ALM_FORM_0001)
000030************************************************
000040 01  ()ASTLIA           PIC  X(1).
000050 01  ()ALMDET           PIC  X(2).
000060 01  ()FIXFLT           PIC  X(1).
000070 01  ()ALMNAM           PIC  N(10).
000080 01  ()DIVCOD           PIC  X(1).
000090 01  ()DUE001           PIC S9(13) COMP-3.
000100 01  ()DUE002           PIC S9(13) COMP-3.
000110 01  ()DUE003           PIC S9(13) COMP-3.
000120 01  ()DUE004           PIC S9(13) COMP-3.
000130 01  ()DUE005           PIC S9(13) COMP-3.
000140 01  ()MON001           PIC S9(13) COMP-3.
000150 01  ()MON002           PIC S9(13) COMP-3.
000160 01  ()MON003           PIC S9(13) COMP-3.
000170 01  ()MON004           PIC S9(13) COMP-3.
000180 01  ()MON005           PIC S9(13) COMP-3.
000190 01  ()MON006           PIC S9(13) COMP-3.
000200 01  ()MON007           PIC S9(13) COMP-3.
000210 01  ()MON008           PIC S9(13) COMP-3.
000220 01  ()MON009           PIC S9(13) COMP-3.
000230 01  ()MON010           PIC S9(13) COMP-3.
000240 01  ()MON011           PIC S9(13) COMP-3.
000250 01  ()MON012           PIC S9(13) COMP-3.
000260 01  ()YER001           PIC S9(13) COMP-3.
000270 01  ()YER002           PIC S9(13) COMP-3.
000280 01  ()YER003           PIC S9(13) COMP-3.
000290 01  ()YER004           PIC S9(13) COMP-3.
000300 01  ()YER005           PIC S9(13) COMP-3.
000310 01  ()YER006           PIC S9(13) COMP-3.
000320 01  ()YER007           PIC S9(13) COMP-3.
000330 01  ()YER008           PIC S9(13) COMP-3.
000340 01  ()YER009           PIC S9(13) COMP-3.
000350 01  ()YER010           PIC S9(13) COMP-3.
000360 01  ()YER011           PIC S9(13) COMP-3.
000370 01  ()YER012           PIC S9(13) COMP-3.
000380 01  ()DUER01           PIC S9(2)V9(2) COMP-3.
000390 01  ()DUER02           PIC S9(2)V9(2) COMP-3.
000400 01  ()DUER03           PIC S9(2)V9(2) COMP-3.
000410 01  ()DUER04           PIC S9(2)V9(2) COMP-3.
000420 01  ()DUER05           PIC S9(2)V9(2) COMP-3.
000430 01  ()MONR01           PIC S9(2)V9(2) COMP-3.
000440 01  ()MONR02           PIC S9(2)V9(2) COMP-3.
000450 01  ()MONR03           PIC S9(2)V9(2) COMP-3.
000460 01  ()MONR04           PIC S9(2)V9(2) COMP-3.
000470 01  ()MONR05           PIC S9(2)V9(2) COMP-3.
000480 01  ()MONR06           PIC S9(2)V9(2) COMP-3.
000490 01  ()MONR07           PIC S9(2)V9(2) COMP-3.
000500 01  ()MONR08           PIC S9(2)V9(2) COMP-3.
000510 01  ()MONR09           PIC S9(2)V9(2) COMP-3.
000520 01  ()MONR10           PIC S9(2)V9(2) COMP-3.
000530 01  ()MONR11           PIC S9(2)V9(2) COMP-3.
000540 01  ()MONR12           PIC S9(2)V9(2) COMP-3.
000550 01  ()YERR01           PIC S9(2)V9(2) COMP-3.
000560 01  ()YERR02           PIC S9(2)V9(2) COMP-3.
000570 01  ()YERR03           PIC S9(2)V9(2) COMP-3.
000580 01  ()YERR04           PIC S9(2)V9(2) COMP-3.
000590 01  ()YERR05           PIC S9(2)V9(2) COMP-3.
000600 01  ()YERR06           PIC S9(2)V9(2) COMP-3.
000610 01  ()YERR07           PIC S9(2)V9(2) COMP-3.
000620 01  ()YERR08           PIC S9(2)V9(2) COMP-3.
000630 01  ()YERR09           PIC S9(2)V9(2) COMP-3.
000640 01  ()YERR10           PIC S9(2)V9(2) COMP-3.
000650 01  ()YERR11           PIC S9(2)V9(2) COMP-3.
000660 01  ()YERR12           PIC S9(2)V9(2) COMP-3.
