000010************************************************
000020* (ALM_ACCTRN)
000030************************************************
000040 01  ()ACCCOD           PIC  X(5).
000050 01  ()ACCNAM           PIC  N(16).
000060 01  ()ASTLIA           PIC  X(1).
000070 01  ()ALMDET           PIC  X(2).
000080 01  ()DUECOD           PIC  X(2).
000090 01  ()ALMTYP           PIC  X(1).
000100 01  ()OPEDAY           PIC  X(8).
000110 01  ()BALCAP           PIC S9(13) COMP-3.
000120 01  ()OPEFLG           PIC  X(1).
