000010************************************************
000020* (ALM_ALMTRN)
000030************************************************
000040 01  ()ASTLIA           PIC  X(1).
000050 01  ()ALMDET           PIC  X(2).
000060 01  ()FIXFLT           PIC  X(1).
000070 01  ()ACCCOD           PIC  X(5).
000080 01  ()DUECOD           PIC  X(2).
000090 01  ()MONCNT           PIC S9(3) COMP-3.
000100 01  ()BASYER           PIC  X(4).
000110 01  ()BASMON           PIC  X(2).
000120 01  ()COLAMT           PIC S9(13) COMP-3.
000130 01  ()COLRAT           PIC S9(2)V9(2) COMP-3.
000140 01  ()BALCAP           PIC S9(13) COMP-3.
000150 01  ()AVEBAL           PIC S9(13) COMP-3.
000160 01  ()AVEINT           PIC S9(13) COMP-3.
000170 01  ()AVERAT           PIC S9(2)V9(2) COMP-3.
000180 01  ()DIVCOD           PIC  X(1).
000190 01  ()GAPFLG           PIC  X(1).
000200 01  ()ACCTYP           PIC  X(1).
000210 01  ()COLINT           PIC S9(13) COMP-3.
000220 01  ()BALAST           PIC S9(13) COMP-3.
000230 01  ()BALPRE           PIC S9(13) COMP-3.
000240 01  ()WKRAT1           PIC S9(2)V9(2) COMP-3.
000250 01  ()WKRAT2           PIC S9(2)V9(2) COMP-3.
000260 01  ()WKAMT1           PIC S9(13) COMP-3.
000270 01  ()WKAMT2           PIC S9(13) COMP-3.
000280 01  ()ERRFLG           PIC  X(5).
