000010************************************************
000020* (ALM_ALMTR4)
000030************************************************
000040 01  ()DATTYP           PIC  X(1).
000050 01  ()CNTNUM           PIC  X(10).
000060 01  ()CNTDET           PIC  X(2).
000070 01  ()COLDAY           PIC  X(8).
000080 01  ()COLAMT           PIC S9(13) COMP-3.
000090 01  ()BALCAP           PIC S9(13) COMP-3.
000100 01  ()INTAMT           PIC S9(13) COMP-3.
000110 01  ()ERRFLG           PIC  X(5).
