000010************************************************
000020* (ALM_ALMTR2)
000030************************************************
000040 01  ()DATTYP           PIC  X(1).
000050 01  ()CNTNUM           PIC  X(9).
000060 01  ()APRDAY           PIC  X(8).
000070 01  ()PLNDAY           PIC  X(8).
000080 01  ()PAYDAY           PIC  X(8).
000090 01  ()COLAMT           PIC S9(13) COMP-3.
000100 01  ()CONTAX           PIC S9(13) COMP-3.
000110 01  ()PREAMT           PIC S9(13) COMP-3.
000120 01  ()SETAMT           PIC S9(13) COMP-3.
000130 01  ()TIECOD           PIC  X(2).
000140 01  ()ERRFLG           PIC  X(5).
