000010************************************************
000020* (ANK_LPWK_KIHON)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()端末番号               PIC  N(8).
000070 01  ()リース割賦区分         PIC  X(1).
000080 01  ()計算方式               PIC  X(1).
000090 01  ()繰延数                 PIC S9(2) COMP-3.
000100 01  ()物件数                 PIC S9(3) COMP-3.
000110 01  ()購入金額               PIC S9(13) COMP-3.
000120 01  ()初期費用               PIC S9(13) COMP-3.
000130 01  ()リース期間             PIC S9(3) COMP-3.
000140 01  ()請求サイクル           PIC S9(2) COMP-3.
000150 01  ()支払回数               PIC S9(3) COMP-3.
000160 01  ()据置期間               PIC S9(2)V9(2) COMP-3.
000170 01  ()リース料               PIC S9(13) COMP-3.
000180 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000190 01  ()耐用年数               PIC S9(2) COMP-3.
000200 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000210 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000220 01  ()残価額                 PIC S9(13) COMP-3.
000230 01  ()月額保守料             PIC S9(13) COMP-3.
000240 01  ()前受月数               PIC S9(2) COMP-3.
000250 01  ()繰延金額１             PIC S9(13) COMP-3.
000260 01  ()繰延月数１             PIC S9(2)V9(2) COMP-3.
000270 01  ()繰延金額２             PIC S9(13) COMP-3.
000280 01  ()繰延月数２             PIC S9(2)V9(2) COMP-3.
000290 01  ()契約総額               PIC S9(13) COMP-3.
000300 01  ()基本リース料総額       PIC S9(13) COMP-3.
000310 01  ()基本リース料月額       PIC S9(13) COMP-3.
000320 01  ()基本リース料率         PIC S9(2)V9(8) COMP-3.
000330 01  ()固定資産税総額         PIC S9(13) COMP-3.
000340 01  ()固定資産税月額         PIC S9(13) COMP-3.
000350 01  ()固定資産税料率         PIC S9(2)V9(8) COMP-3.
000360 01  ()動総保険総額           PIC S9(13) COMP-3.
000370 01  ()動総保険月額           PIC S9(13) COMP-3.
000380 01  ()動総保険料料率         PIC S9(2)V9(8) COMP-3.
000390 01  ()合計１                 PIC S9(13) COMP-3.
000400 01  ()合計２                 PIC S9(13) COMP-3.
000410 01  ()合計３                 PIC S9(2)V9(8) COMP-3.
000420 01  ()前受リース料総額       PIC S9(13) COMP-3.
000430 01  ()前受リース料月額       PIC S9(13) COMP-3.
000440 01  ()前受リース料率         PIC S9(2)V9(8) COMP-3.
000450 01  ()繰延金額総額           PIC S9(13) COMP-3.
000460 01  ()繰延金額月額           PIC S9(13) COMP-3.
000470 01  ()繰延金額率             PIC S9(2)V9(8) COMP-3.
000480 01  ()合計４                 PIC S9(13) COMP-3.
000490 01  ()合計５                 PIC S9(13) COMP-3.
000500 01  ()合計６                 PIC S9(2)V9(8) COMP-3.
000510 01  ()社内金利               PIC S9(2)V9(8) COMP-3.
000520 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000530 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000540 01  ()実質リース料ＰＶ       PIC S9(13) COMP-3.
000550 01  ()残価額ＰＶ             PIC S9(13) COMP-3.
000560 01  ()粗利益                 PIC S9(13) COMP-3.
000570 01  ()規定損失金１           PIC S9(13) COMP-3.
000580 01  ()規定損失金２           PIC S9(13) COMP-3.
000590 01  ()規定損失金３           PIC S9(13) COMP-3.
000600 01  ()規定損失金４           PIC S9(13) COMP-3.
000610 01  ()規定損失金５           PIC S9(13) COMP-3.
000620 01  ()規定損失金６           PIC S9(13) COMP-3.
000630 01  ()規定損失金７           PIC S9(13) COMP-3.
000640 01  ()規定損失金８           PIC S9(13) COMP-3.
000650 01  ()規定損失金９           PIC S9(13) COMP-3.
000660 01  ()規定損失金１０         PIC S9(13) COMP-3.
