000010************************************************
000020* (ANK_WORK005)
000030************************************************
000040 01  ()KEY                 PIC S9(1) COMP-3.
000050 01  ()支払連番               PIC S9(3) COMP-3.
000060 01  ()元本                   PIC S9(13) COMP-3.
000070 01  ()賦金                   PIC S9(13) COMP-3.
000080 01  ()諸費用                 PIC S9(13) COMP-3.
000090 01  ()利息                   PIC S9(13) COMP-3.
000100 01  ()元本内入               PIC S9(13) COMP-3.
000110 01  ()一括弁済金             PIC S9(13) COMP-3.
000120 01  ()固定資産税月額         PIC S9(13) COMP-3.
000130 01  ()動総保険月額           PIC S9(13) COMP-3.
000140 01  ()リース期間             PIC S9(3) COMP-3.
000150 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000160 01  ()契約総額               PIC S9(13) COMP-3.
000170 01  ()購入金額               PIC S9(13) COMP-3.
000180 01  ()残価額                 PIC S9(13) COMP-3.
000190 01  ()登録日                 PIC  X(8).
000200 01  ()登録時刻               PIC  X(6).
000210 01  ()登録担当者コード       PIC  X(4).
000220 01  ()更新日                 PIC  X(8).
000230 01  ()更新時刻               PIC  X(6).
000240 01  ()更新担当者コード       PIC  X(4).
