000010************************************************
000020* (ANK_KEY)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()課                     PIC  X(1).
000080 01  ()担当者コード           PIC  X(4).
000090 01  ()処理ステータス         PIC  X(1).
000100 01  ()案件状況区分           PIC  X(2).
000110 01  ()案件発生区分           PIC  X(1).
000120 01  ()削除区分               PIC  X(1).
000130 01  ()登録日                 PIC  X(8).
000140 01  ()登録時刻               PIC  X(6).
000150 01  ()登録担当者コード       PIC  X(4).
000160 01  ()更新日                 PIC  X(8).
000170 01  ()更新時刻               PIC  X(6).
000180 01  ()更新担当者コード       PIC  X(4).
