000010************************************************
000020* (ANK_WORK009)
000030************************************************
000040 01  ()KEY                 PIC  X(1).
000050 01  ()案件番号               PIC  X(10).
000060 01  ()見積枝番               PIC  X(2).
000070 01  ()物件ＮＯ               PIC  X(3).
000080 01  ()物件名_漢字           PIC  N(20).
000090 01  ()購入金額               PIC S9(13) COMP-3.
000100 01  ()耐用年数               PIC S9(2) COMP-3.
000110 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
