000010************************************************
000020* (ANK_CHOHYO)
000030************************************************
000040 01  ()連番                   PIC S9(4) COMP-3.
000050 01  ()帳票１                 PIC S9(1) COMP-3.
000060 01  ()帳票２                 PIC S9(1) COMP-3.
000070 01  ()帳票３                 PIC S9(1) COMP-3.
000080 01  ()帳票４                 PIC S9(1) COMP-3.
000090 01  ()帳票５                 PIC S9(1) COMP-3.
000100 01  ()帳票６                 PIC S9(1) COMP-3.
000110 01  ()帳票７                 PIC S9(1) COMP-3.
000120 01  ()帳票８                 PIC S9(1) COMP-3.
000130 01  ()支払開始日             PIC  X(8).
000140 01  ()購入金額非表示区分     PIC S9(1) COMP-3.
000150 01  ()料率非表示区分         PIC S9(1) COMP-3.
000160 01  ()特約文言非表示区分     PIC S9(1) COMP-3.
000170 01  ()登録日                 PIC  X(8).
000180 01  ()登録時刻               PIC  X(6).
000190 01  ()登録担当者コード       PIC  X(4).
000200 01  ()更新日                 PIC  X(8).
000210 01  ()更新時刻               PIC  X(6).
000220 01  ()更新担当者コード       PIC  X(4).
