000010************************************************
000020* (ANK_KINJITI)
000030************************************************
000040 01  ()結果ＮＯ               PIC S9(1) COMP-3.
000050 01  ()リース料               PIC S9(13) COMP-3.
000060 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000070 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000080 01  ()粗利                   PIC S9(13) COMP-3.
000090 01  ()ＦＲＯＭ               PIC S9(1) COMP-3.
000100 01  ()ＴＯ                   PIC S9(1) COMP-3.
000110 01  ()計算方式               PIC  X(1).
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
