000010************************************************
000020* (ANK_BUKKEN)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()物件ＮＯ               PIC  X(3).
000070 01  ()物件名_漢字           PIC  N(20).
000080 01  ()数量                   PIC S9(4) COMP-3.
000090 01  ()単位                   PIC  N(2).
000100 01  ()購入金額               PIC S9(13) COMP-3.
000110 01  ()残価額                 PIC S9(13) COMP-3.
000120 01  ()耐用年数               PIC S9(2) COMP-3.
000130 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000140 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000150 01  ()個別リース料           PIC S9(13) COMP-3.
000160 01  ()月額動総保険料         PIC S9(13) COMP-3.
000170 01  ()月額固定資産税         PIC S9(13) COMP-3.
000180 01  ()登録日                 PIC  X(8).
000190 01  ()登録時刻               PIC  X(6).
000200 01  ()登録担当者コード       PIC  X(4).
000210 01  ()更新日                 PIC  X(8).
000220 01  ()更新時刻               PIC  X(6).
000230 01  ()更新担当者コード       PIC  X(4).
