000010************************************************
000020* (APR_SJYOKEN_MST)
000030************************************************
000040 01  ()Žx•¥ðŒƒR[ƒh         PIC  X(2).
000050 01  ()Œ_–ñ”Ô†ã‚PŒ…         PIC  X(1).
000060 01  ()ŒJ‰„ŒŽ”               PIC S9(2)V9(2) COMP-3.
000070 01  ()Žx•¥ðŒ•¶Œ¾           PIC  N(20).
