000010************************************************
000020* (APR_LPWK_KEIYAKUSYO)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()リース割賦区分         PIC  X(1).
000060 01  ()開始アポロ契約番号     PIC  X(7).
000070 01  ()ページ区分             PIC S9(1) COMP-3.
000080 01  ()レコード区分           PIC S9(1) COMP-3.
000090 01  ()申込日                 PIC  X(8).
000100 01  ()承諾日                 PIC  X(8).
000110 01  ()終了アポロ契約番号     PIC  X(7).
000120 01  ()物件名                 PIC  N(10).
000130 01  ()リース期間             PIC S9(3) COMP-3.
000140 01  ()購入金額               PIC S9(13) COMP-3.
000150 01  ()リース料総額           PIC S9(13) COMP-3.
000160 01  ()消費税額               PIC S9(11) COMP-3.
000170 01  ()合計額                 PIC S9(13) COMP-3.
