000010************************************************
000020* (APR_BUKKEN_SOSIN)
000030************************************************
000040 01  ()データ識別コード       PIC  X(2).
000050 01  ()送信事業所コード       PIC  X(4).
000060 01  ()作成日付               PIC  X(8).
000070 01  ()作成時刻               PIC  X(6).
000080 01  ()契約番号               PIC  X(9).
000090 01  ()レコード区分           PIC  X(1).
000100 01  ()物件ＮＯ               PIC  X(3).
000110 01  ()物件名漢字             PIC  X(40).
000120 01  ()物件名カナ             PIC  X(20).
000130 01  ()仕様製造番号           PIC  X(20).
000140 01  ()数量                   PIC S9(4) COMP-3.
000150 01  ()購入金額               PIC S9(13) COMP-3.
000160 01  ()仕入消費税等           PIC S9(13) COMP-3.
000170 01  ()資産コード             PIC  X(7).
000180 01  ()耐用年数               PIC  X(2).
000190 01  ()中古資産コード         PIC  X(1).
000200 01  ()動総保険コード         PIC  X(4).
000210 01  ()動総保険料率           PIC S9(4) COMP-3.
000220 01  ()納付先コード           PIC  X(6).
000230 01  ()税区分                 PIC  X(1).
000240 01  ()特例期間               PIC S9(2) COMP-3.
000250 01  ()特例率分子             PIC S9(2) COMP-3.
000260 01  ()特例率分母             PIC S9(2) COMP-3.
000270 01  ()税負担コード           PIC  X(1).
000280 01  ()設置場所郵便番号       PIC  X(7).
000290 01  ()設置場所住所           PIC  N(50).
000300 01  ()設置場所名漢字         PIC  N(20).
000310 01  ()設置場所名カナ         PIC  X(20).
000320 01  ()信用保険コード         PIC  X(6).
000330 01  ()型式番号               PIC  X(15).
000340 01  ()購入先コード           PIC  X(8).
000350 01  ()支払先コード           PIC  X(4).
000360 01  ()個別リース料           PIC S9(13) COMP-3.
000370 01  ()残価額                 PIC S9(13) COMP-3.
000380 01  ()残価保証区分           PIC  X(1).
000390 01  ()残価保証先コード       PIC  X(8).
000400 01  ()残価保証先名           PIC  X(60).
000410 01  ()ユーザーリファレンス１ PIC  X(12).
000420 01  ()ユーザーリファレンス２ PIC  X(12).
000430 01  ()ユーザーリファレンス３ PIC  X(12).
000440 01  ()ユーザーリファレンス４ PIC  X(12).
000450 01  ()ディーラーコード       PIC  X(5).
