000010************************************************
000020* 帝国業種コード(中間)(CISUF890)
000030************************************************
000040    03   ()業種コード             PIC  X(5).
000050    03   ()業種コード             PIC  X(5).
