000010************************************************
000020* 管理与信展開(CISUF670)
000030************************************************
000040    03   ()与信管理先コード       PIC  X(9).
000050    03   ()契約番号               PIC  X(10).
000060    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000070    03   ()契約種類               PIC  X(3).
000080    03   ()連番                   PIC S9(3)  SIGN LEADING SEPARATE.
000090    03   ()展開年月               PIC  X(6).
000100    03   ()展開日付               PIC  X(2).
000110    03   ()入金フラグ             PIC  X(2).
000120    03   ()展開支払回数           PIC  X(3).
000130    03   ()実リース料             PIC S9(13)  SIGN LEADING SEPARATE.
000140    03   ()利息額                 PIC S9(13)  SIGN LEADING SEPARATE.
000150    03   ()元本内入               PIC S9(13)  SIGN LEADING SEPARATE.
000160    03   ()元本残                 PIC S9(13)  SIGN LEADING SEPARATE.
000170    03   ()債権残                 PIC S9(13)  SIGN LEADING SEPARATE.
000180    03   ()諸費用                 PIC S9(13)  SIGN LEADING SEPARATE.
000190    03   ()約定利率               PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
000200    03   ()事故後入金             PIC S9(13)  SIGN LEADING SEPARATE.
000210    03   ()登録年月日             PIC  X(8).
000220    03   ()登録時間               PIC  X(8).
000230    03   ()登録担当者             PIC  X(8).
000240    03   ()更新年月日             PIC  X(8).
000250    03   ()更新時間               PIC  X(8).
000260    03   ()更新者                 PIC  X(8).
000270    03   ()入力担当者コード       PIC  X(8).
