000010************************************************
000020* 取引先マスタLOADER用(CISUF010)
000030************************************************
000040    03   ()取引先コード           PIC S9(9)  SIGN LEADING SEPARATE.
000050    03   ()名寄せコード           PIC  X(40).
000060    03   ()取引先名称             PIC  X(40).
000070    03   ()取引先短名称           PIC  X(16).
000080    03   ()取引先カナ名称         PIC  X(40).
000090    03   ()郵便番号               PIC  X(7).
000100    03   ()納付先コード           PIC  X(11).
000110    03   ()住所１                 PIC  X(60).
000120    03   ()住所２                 PIC  X(60).
000130    03   ()住所３                 PIC  X(60).
000140    03   ()電話番号               PIC  X(15).
000150    03   ()旧社名                 PIC  X(80).
000160    03   ()資本金                 PIC S9(13)  SIGN LEADING SEPARATE.
000170    03   ()設立年                 PIC S9(4)  SIGN LEADING SEPARATE.
000180    03   ()設立月                 PIC S9(2)  SIGN LEADING SEPARATE.
000190    03   ()顧客区分               PIC  X(2).
000200    03   ()企業区分               PIC  X(1).
000210    03   ()従業員数               PIC S9(6)  SIGN LEADING SEPARATE.
000220    03   ()業種コード             PIC  X(5).
000230    03   ()格付ランク             PIC  X(3).
000240    03   ()現担当者               PIC  X(8).
000250    03   ()請求先最終番号         PIC S9(5)  SIGN LEADING SEPARATE.
000260    03   ()支払先最終番号         PIC S9(5)  SIGN LEADING SEPARATE.
000270    03   ()主担当部課コード       PIC  X(4).
000280    03   ()格付ランク２           PIC  X(3).
000290    03   ()代表者名称             PIC  X(20).
000300    03   ()アドレス               PIC  X(40).
000310    03   ()顧客使用不可フラグ     PIC  X(1).
000320    03   ()与信括りコード         PIC  X(7).
000330    03   ()初回請求据置区分       PIC  X(1).
000340    03   ()満了案内送付区分       PIC  X(1).
000350    03   ()再リース自動継続区分   PIC  X(1).
000360    03   ()特定取引先区分         PIC  X(1).
000370    03   ()事業所名称             PIC  X(80).
000380    03   ()事業所郵便番号         PIC  X(7).
000390    03   ()事業所住所コード       PIC  X(11).
000400    03   ()事業所住所２           PIC  X(60).
000410    03   ()事業所電話番号         PIC  X(15).
000420    03   ()生年月日               PIC  X(8).
000430    03   ()管理債権レベル         PIC  X(1).
000440    03   ()貸倒年月日             PIC  X(8).
000450    03   ()貸倒金額               PIC S9(13)  SIGN LEADING SEPARATE.
000460    03   ()貸倒理由コード         PIC  X(2).
000470    03   ()貸倒コメント           PIC  X(100).
000480    03   ()貸倒申請年月日         PIC  X(8).
000490    03   ()自動請求データ作成要否 PIC  X(1).
000500    03   ()開示帳票取得価格区分   PIC  X(1).
000510    03   ()取引開始年月           PIC  X(6).
000520    03   ()創業年月               PIC  X(6).
000530    03   ()系列                   PIC  X(30).
000540    03   ()販売先                 PIC  X(30).
000550    03   ()仕入先                 PIC  X(30).
000560    03   ()主要株主               PIC  X(20).
000570    03   ()主要株主持率           PIC S9(3)V9(3)  SIGN LEADING SEPARATE.
000580    03   ()保証人管理債権レベル   PIC  X(1).
000590    03   ()過去最高督促段階       PIC  X(1).
000600    03   ()過去最高督促段階更新日 PIC  X(8).
000610    03   ()現在最高督促段階       PIC  X(1).
000620    03   ()現在最高督促段階更新日 PIC  X(8).
000630    03   ()売却現在最高督促段階   PIC  X(1).
000640    03   ()売却現在最高督促段階更新日 PIC  X(8).
000650    03   ()リース督促交渉出力フラグ PIC  X(1).
000660    03   ()中途解約督促交渉出力フラグ PIC  X(1).
000670    03   ()売却督促交渉出力フラグ PIC  X(1).
000680    03   ()銀行コード             PIC  X(4).
000690    03   ()支店コード             PIC  X(3).
000700    03   ()代表者役職名           PIC  X(20).
000710    03   ()従業種名               PIC  X(20).
000720    03   ()住所名カナ             PIC  X(40).
000730    03   ()コメント欄             PIC  X(120).
000740    03   ()帝国コード             PIC  X(9).
000750    03   ()主要株主持株数         PIC S9(10)  SIGN LEADING SEPARATE.
000760    03   ()株主数                 PIC S9(10)  SIGN LEADING SEPARATE.
000770    03   ()全国業界順位           PIC S9(7)  SIGN LEADING SEPARATE.
000780    03   ()全国業界会社数         PIC S9(7)  SIGN LEADING SEPARATE.
000790    03   ()県内業界順位           PIC S9(7)  SIGN LEADING SEPARATE.
000800    03   ()県内業界会社数         PIC S9(7)  SIGN LEADING SEPARATE.
000810    03   ()事業所数               PIC S9(5)  SIGN LEADING SEPARATE.
000820    03   ()主要事業所名           PIC  X(120).
000830    03   ()利用リース会社名       PIC  X(40).
000840    03   ()スコアリング評点       PIC S9(3)  SIGN LEADING SEPARATE.
000850    03   ()帝国評点               PIC S9(3)  SIGN LEADING SEPARATE.
000860    03   ()格付申請中フラグ       PIC  X(1).
000870    03   ()格付調整申請理由       PIC  X(200).
000880    03   ()格付日                 PIC  X(8).
000890    03   ()与信限度額適用日       PIC  X(8).
000900    03   ()当社取引開始経緯       PIC  X(160).
000910    03   ()企業目的               PIC  X(100).
000920    03   ()表示単位区分           PIC  X(1).
000930    03   ()ＢＴＭ取引区分         PIC  X(1).
000940    03   ()ＢＴＭ担当支店コード   PIC  X(3).
000950    03   ()情報交換通知区分       PIC  X(1).
000960    03   ()情報交換通知設定日     PIC  X(8).
000970    03   ()ＢＴＭ連結対象区分     PIC  X(1).
000980    03   ()ＢＯＴＬ連結対象区分   PIC  X(1).
000990    03   ()親密先区分             PIC  X(1).
001000    03   ()ＮｅｔＬｅａｓｉｎｇ利用対象区分 PIC  X(1).
001010    03   ()転リース提携先コード   PIC  X(3).
001020    03   ()事業所住所１           PIC  X(60).
001030    03   ()事業所住所３           PIC  X(60).
001040    03   ()企業決算月             PIC  X(2).
001050    03   ()一般大口区分           PIC  X(1).
001060    03   ()借入金識別区分         PIC  X(1).
001070    03   ()借入先種別             PIC  X(2).
001080    03   ()担保差入率             PIC S9(3)  SIGN LEADING SEPARATE.
001090    03   ()旧名寄せコード         PIC  X(8).
001100    03   ()更新年月日             PIC  X(8).
001110    03   ()更新時間               PIC  X(8).
001120    03   ()更新者                 PIC  X(8).
001130    03   ()登録年月日             PIC  X(8).
001140    03   ()登録時間               PIC  X(8).
001150    03   ()登録担当者             PIC  X(8).
001160    03   ()入力担当者コード       PIC  X(8).
