000010************************************************
000020* “ü‹àÁžŠÇ—(ÁžŠî–{)“ü‹à’Ê”Ô’PˆÊ(CISUF610)
000030************************************************
000040    03   ()“ü‹à’Ê”Ô               PIC S9(9)  SIGN LEADING SEPARATE.
000050    03   ()“ü‹àæ–¼               PIC  X(48).
000060    03   ()‹àŠz                   PIC S9(13)  SIGN LEADING SEPARATE.
000070    03   ()Áž’Ê”Ô               PIC S9(9)  SIGN LEADING SEPARATE.
000080    03   ()Áž“ú                 PIC  X(7).
000090    03   ()‹¤’Êî•ñ               PIC  X(35).
