000010************************************************
000020* 月次債権情報ファイル(CISUF971)
000030************************************************
000040    03   ()ＫＥＹ契約ＮＯ         PIC  X(10).
000050    03   ()ＫＥＹ再リース回数     PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()ＫＥＹ契約種類         PIC  X(3).
000070    03   ()契約ＮＯ               PIC  X(9).
000080    03   ()再リースコード         PIC  X(1).
000090    03   ()物件ＮＯ               PIC  X(3).
000100    03   ()請求コード             PIC  X(2).
000110    03   ()勘定処理コード         PIC  X(2).
000120    03   ()解約区分               PIC  X(1).
000130    03   ()ユーザーコード         PIC  X(8).
000140    03   ()名寄せコード           PIC  X(8).
000150    03   ()グループコード         PIC  X(8).
000160    03   ()クラス                 PIC  X(2).
000170    03   ()事業所コード           PIC  X(4).
000180    03   ()ユーザ名称.
000190     05  ()　ユーザ名称－漢字カナ区分 PIC  X(1).
000200     05  ()　ユーザ名称－略称     PIC  X(26).
000210    03   ()名寄せ名称.
000220     05  ()　名寄せ名称－漢字カナ区分 PIC  X(1).
000230     05  ()　名寄せ名称－略称     PIC  X(30).
000240    03   ()与信限度額符号桁       PIC  X(1).
000250    03   ()与信限度額             PIC S9(13)  SIGN LEADING SEPARATE.
000260    03   ()物件枝番数符号桁       PIC  X(1).
000270    03   ()物件枝番数             PIC S9(3)  SIGN LEADING SEPARATE.
000280    03   ()数量符号桁             PIC  X(1).
000290    03   ()数量                   PIC S9(5)  SIGN LEADING SEPARATE.
000300    03   ()ダミー                 PIC  X(1).
000310    03   ()物件名                 PIC  X(30).
000320    03   ()ダミー                 PIC  X(1).
000330    03   ()設置場所名             PIC  X(20).
000340    03   ()請求先コード           PIC  X(8).
000350    03   ()請求先名称.
000360     05  ()　請求先名称－漢字カナ区分 PIC  X(1).
000370     05  ()　請求先名称－略称     PIC  X(26).
000380    03   ()請求サイクル符号桁     PIC  X(1).
000390    03   ()請求サイクル           PIC S9(2)  SIGN LEADING SEPARATE.
000400    03   ()入金日符号桁           PIC  X(1).
000410    03   ()入金日                 PIC S9(2)  SIGN LEADING SEPARATE.
000420    03   ()請求書発行様式         PIC  X(1).
000430    03   ()請求書発行月区分       PIC  X(1).
000440    03   ()入金情報.
000450     05  ()　入金情報－銀行コード PIC  X(7).
000460     05  ()　入金情報－銀行名称－漢字カナ区分 PIC  X(1).
000470     05  ()　入金情報－銀行名称－略称 PIC  X(30).
000480     05  ()　入金情報－口座番号   PIC  X(7).
000490     05  ()　入金情報－預金種類   PIC  X(1).
000500    03   ()自動引落.
000510     05  ()　自動引落－銀行コード PIC  X(7).
000520     05  ()　自動引落－銀行名称－漢字カナ区分 PIC  X(1).
000530     05  ()　自動引落－銀行名称－略称 PIC  X(30).
000540     05  ()　自動引落－口座番号   PIC  X(7).
000550     05  ()　自動引落－預金種類   PIC  X(1).
000560    03   ()業種コード             PIC  X(2).
000570    03   ()大企業コード           PIC  X(1).
000580    03   ()リース料入金単位       PIC  X(1).
000590    03   ()振込手数料単位         PIC  X(1).
000600    03   ()検収日.
000610     05  ()　検収日－世紀         PIC  X(1).
000620     05  ()　検収日－年月日       PIC  X(6).
000630    03   ()リース開始日.
000640     05  ()　リース開始日－世紀   PIC  X(1).
000650     05  ()　リース開始日－年月日 PIC  X(6).
000660    03   ()リース終了日.
000670     05  ()　リース終了日－世紀   PIC  X(1).
000680     05  ()　リース終了日－年月日 PIC  X(6).
000690    03   ()リース期間符号桁       PIC  X(1).
000700    03   ()リース期間             PIC S9(3)  SIGN LEADING SEPARATE.
000710     05  ()第１回リース料入金日.
000720     05  ()　第１回リース料入金日－世紀 PIC  X(1).
000730     05  ()　第１回リース料入金日－年月日 PIC  X(6).
000740    03   ()残価回収日.
000750     05  ()　残価回収日－世紀     PIC  X(1).
000760     05  ()　残価回収日－年月日   PIC  X(6).
000770    03   ()解約日.
000780     05  ()　解約日－世紀         PIC  X(1).
000790     05  ()　解約日－年月日       PIC  X(6).
000800    03   ()残価保証区分           PIC  X(1).
000810    03   ()据置期間符号桁         PIC  X(1).
000820    03   ()据置期間               PIC S9(3)  SIGN LEADING SEPARATE.
000830    03   ()ＢＥＧＩＮ回数符号桁   PIC  X(1).
000840    03   ()ＢＥＧＩＮ回数         PIC S9(1)  SIGN LEADING SEPARATE.
000850    03   ()計算方式               PIC  X(1).
000860    03   ()前受リース料入金日.
000870     05  ()　前受リース料入金日－世紀 PIC  X(1).
000880     05  ()　前受リース料入金日－年月日 PIC  X(6).
000890    03   ()前受リース料符号桁     PIC  X(1).
000900    03   ()前受リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000910    03   ()前受充当開始日.
000920     05  ()　前受充当開始日－世紀 PIC  X(1).
000930     05  ()　前受充当開始日－年月 PIC  X(4).
000940    03   ()前受充当終了日.
000950     05  ()　前受充当終了日－世紀 PIC  X(1).
000960     05  ()　前受充当終了日－年月 PIC  X(4).
000970    03   ()前受充当月数符号桁     PIC  X(1).
000980    03   ()前受充当月数           PIC S9(3)  SIGN LEADING SEPARATE.
000990    03   ()一部充当額符号桁       PIC  X(1).
001000    03   ()一部充当額             PIC S9(13)  SIGN LEADING SEPARATE.
001010    03   ()前受金利息額符号桁     PIC  X(1).
001020    03   ()前受金利息額           PIC S9(13)  SIGN LEADING SEPARATE.
001030    03   ()月次リース料符号桁     PIC  X(1).
001040    03   ()月次リース料           PIC S9(13)  SIGN LEADING SEPARATE.
001050    03   ()契約金額符号桁         PIC  X(1).
001060    03   ()契約金額               PIC S9(13)  SIGN LEADING SEPARATE.
001070    03   ()購入金額合計符号桁     PIC  X(1).
001080    03   ()購入金額合計           PIC S9(13)  SIGN LEADING SEPARATE.
001090    03   ()利息合計符号桁         PIC  X(1).
001100    03   ()利息合計               PIC S9(13)  SIGN LEADING SEPARATE.
001110    03   ()月額固定資産税符号桁   PIC  X(1).
001120    03   ()月額固定資産税         PIC S9(13)  SIGN LEADING SEPARATE.
001130    03   ()月額保険料符号桁       PIC  X(1).
001140    03   ()月額保険料             PIC S9(13)  SIGN LEADING SEPARATE.
001150    03   ()月額保守料符号桁       PIC  X(1).
001160    03   ()月額保守料             PIC S9(13)  SIGN LEADING SEPARATE.
001170    03   ()月額その他１符号桁     PIC  X(1).
001180    03   ()月額その他１           PIC S9(13)  SIGN LEADING SEPARATE.
001190    03   ()月額その他２符号桁     PIC  X(1).
001200    03   ()月額その他２           PIC S9(13)  SIGN LEADING SEPARATE.
001210    03   ()諸費用合計符号桁       PIC  X(1).
001220    03   ()諸費用合計             PIC S9(13)  SIGN LEADING SEPARATE.
001230    03   ()残価額合計符号桁       PIC  X(1).
001240    03   ()残価額合計             PIC S9(13)  SIGN LEADING SEPARATE.
001250    03   ()基本利回り符号桁       PIC  X(1).
001260    03   ()基本利回り             PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
001270    03   ()実質利回り符号桁       PIC  X(1).
001280    03   ()実質利回り             PIC S9(3)V9(8)  SIGN LEADING SEPARATE.
001290    03   ()粗利符号桁             PIC  X(1).
001300    03   ()粗利                   PIC S9(13)  SIGN LEADING SEPARATE.
001310    03   ()基準金利符号桁         PIC  X(1).
001320    03   ()基準金利               PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
001330    03   ()担当者コード           PIC  X(4).
001340    03   ()支払回数符号桁         PIC  X(1).
001350    03   ()支払回数               PIC S9(3)  SIGN LEADING SEPARATE.
001360    03   ()請求書発行済回数符号桁 PIC  X(1).
001370    03   ()請求書発行済回数       PIC S9(3)  SIGN LEADING SEPARATE.
001380    03   ()ファイナンス期間符号桁 PIC  X(1).
001390    03   ()ファイナンス期間       PIC S9(3)  SIGN LEADING SEPARATE.
001400    03   ()ファイナンス開始日.
001410     05  ()　ファイナンス開始日－世紀 PIC  X(1).
001420     05  ()　ファイナンス開始日－年月 PIC  X(4).
001430    03   ()ファイナンス終了日.
001440     05  ()　ファイナンス終了日－世紀 PIC  X(1).
001450     05  ()　ファイナンス終了日－年月 PIC  X(4).
001460    03   ()契約日.
001470     05  ()　契約日－世紀         PIC  X(1).
001480     05  ()　契約日－年月日       PIC  X(6).
001490    03   ()一部解約日.
001500     05  ()　一部解約日－世紀     PIC  X(1).
001510     05  ()　一部解約日－年月日   PIC  X(6).
001520    03   ()請求区分.
001530     05  ()　当月                 PIC  X(1).
001540     05  ()　翌月                 PIC  X(1).
001550     05  ()　翌々月               PIC  X(1).
001560    03   ()担保区分               PIC  X(1).
001570    03   ()担保銀行コード         PIC  X(7).
001580    03   ()担保差入日.
001590     05  ()　担保差入日－世紀     PIC  X(1).
001600     05  ()　担保差入日－年月日   PIC  X(6).
001610    03   ()担保処理月度.
001620     05  ()　担保処理月度－世紀   PIC  X(1).
001630     05  ()　担保処理月度－年月   PIC  X(4).
001640    03   ()協調コード             PIC  X(2).
001650    03   ()斡旋リース判定区分     PIC  X(1).
001660    03   ()消費税徴収区分         PIC  X(1).
001670    03   ()消費税－税率符号桁     PIC  X(1).
001680    03   ()消費税－税率           PIC S9(3)V9(1)  SIGN LEADING SEPARATE.
001690    03   ()仕入消費税符号桁       PIC  X(1).
001700    03   ()仕入消費税             PIC S9(13)  SIGN LEADING SEPARATE.
001710    03   ()単年度契約             PIC  X(2).
001720    03   ()消費税コード           PIC  X(2).
001730    03   ()転リース提携先コード   PIC  X(2).
001740    03   ()処理日.
001750     05  ()　処理日－世紀         PIC  X(1).
001760     05  ()　処理日－年月         PIC  X(4).
001770    03   ()検収集計表対象外区分   PIC  X(1).
001780    03   ()初回請求情報.
001790     05  ()　初回請求情報－初回年月.
001800      07 ()　　初回年月－世紀     PIC  X(1).
001810      07 ()　　初回年月－年月     PIC  X(4).
001820     05  ()　初回請求情報－支払回数番号符号桁 PIC  X(1).
001830     05  ()　初回請求情報－支払回数番号 PIC S9(4)  SIGN LEADING SEPARATE.
001840     05  ()　初回請求情報－実リース料符号桁 PIC  X(1).
001850     05  ()　初回請求情報－実リース料 PIC S9(13)  SIGN LEADING SEPARATE.
001860     05  ()　初回請求情報－ネットリース料符号桁 PIC  X(1).
001870     05  ()　初回請求情報－ネットリース料 PIC S9(13)  SIGN LEADING SEPARATE.
001880     05  ()　初回請求情報－諸費用符号桁 PIC  X(1).
001890     05  ()　初回請求情報－諸費用 PIC S9(13)  SIGN LEADING SEPARATE.
001900     05  ()　初回請求情報－利息符号桁 PIC  X(1).
001910     05  ()　初回請求情報－利息   PIC S9(13)  SIGN LEADING SEPARATE.
001920     05  ()　初回請求情報－元本符号桁 PIC  X(1).
001930     05  ()　初回請求情報－元本   PIC S9(13)  SIGN LEADING SEPARATE.
001940     05  ()　初回請求情報－元本内入符号桁 PIC  X(1).
001950     05  ()　初回請求情報－元本内入 PIC S9(13)  SIGN LEADING SEPARATE.
001960     05  ()　初回請求情報－元本残高符号桁 PIC  X(1).
001970     05  ()　初回請求情報－元本残高 PIC S9(13)  SIGN LEADING SEPARATE.
001980     05  ()　初回請求情報－債権残高符号桁 PIC  X(1).
001990     05  ()　初回請求情報－債権残高 PIC S9(13)  SIGN LEADING SEPARATE.
002000     05  ()　初回請求情報－消費税額符号桁 PIC  X(1).
002010     05  ()　初回請求情報－消費税額 PIC S9(11)  SIGN LEADING SEPARATE.
002020     05  ()　初回請求情報－消費税回収方式コード PIC  X(1).
002030     05  ()　初回請求情報－消費税率符号桁 PIC  X(1).
002040     05  ()　初回請求情報－消費税率 PIC S9(3)V9(1)  SIGN LEADING SEPARATE.
002050     05  ()　ダミ－               PIC  X(7).
002060     05  ()　初回請求情報－回収方式コード PIC  X(1).
002070     05  ()　初回請求情報－回収済コード PIC  X(1).
002080     05  ()　初回請求情報－前受充当表示 PIC  X(1).
002090     05  ()　初回請求情報－残価充当表示 PIC  X(1).
002100    03   ()ユーザリファレンスＮＯ PIC  X(12).
002110    03   ()当月翌月区分           PIC  X(1).
002120    03   ()オペレーティング判定フラグ PIC  X(1).
002130    03   ()最新入力消費税率符号桁 PIC  X(1).
002140    03   ()最新入力消費税率       PIC S9(3)V9(1)  SIGN LEADING SEPARATE.
002150    03   ()前受リース料残高符号桁 PIC  X(1).
002160    03   ()前受リース料残高       PIC S9(13)  SIGN LEADING SEPARATE.
002170    03   ()否認区分               PIC  X(1).
002180    03   ()充当相殺区分           PIC  X(1).
002190    03   ()ダミー                 PIC  X(75).
002200    03   ()貸付種類               PIC  X(1).
002210    03   ()展開部                            OCCURS 5.
002220     05  ()　年月                 PIC S9(4)  SIGN LEADING SEPARATE.
002230     05  ()　支払回数番号符号桁   PIC  X(1).
002240     05  ()　支払回数番号         PIC S9(4)  SIGN LEADING SEPARATE.
002250     05  ()　実リース料符号桁     PIC  X(1).
002260     05  ()　実リース料           PIC S9(13)  SIGN LEADING SEPARATE.
002270     05  ()　ネットリース料符号桁 PIC  X(1).
002280     05  ()　ネットリース料       PIC S9(13)  SIGN LEADING SEPARATE.
002290     05  ()　諸費用符号桁         PIC  X(1).
002300     05  ()　諸費用               PIC S9(13)  SIGN LEADING SEPARATE.
002310     05  ()　利息符号桁           PIC  X(1).
002320     05  ()　利息                 PIC S9(13)  SIGN LEADING SEPARATE.
002330     05  ()　元本符号桁           PIC  X(1).
002340     05  ()　元本                 PIC S9(13)  SIGN LEADING SEPARATE.
002350     05  ()　元本内入符号桁       PIC  X(1).
002360     05  ()　元本内入             PIC S9(13)  SIGN LEADING SEPARATE.
002370     05  ()　元本残高符号桁       PIC  X(1).
002380     05  ()　元本残高             PIC S9(13)  SIGN LEADING SEPARATE.
002390     05  ()　債権残高符号桁       PIC  X(1).
002400     05  ()　債権残高             PIC S9(13)  SIGN LEADING SEPARATE.
002410     05  ()　消費税額符号桁       PIC  X(1).
002420     05  ()　消費税額             PIC S9(11)  SIGN LEADING SEPARATE.
002430     05  ()　消費税回収方式コード PIC S9(1)  SIGN LEADING SEPARATE.
002440     05  ()　消費税率符号桁       PIC  X(1).
002450     05  ()　消費税率             PIC S9(3)V9(1)  SIGN LEADING SEPARATE.
002460     05  ()　ダミー               PIC  X(7).
002470     05  ()　回収方式コード       PIC  X(1).
002480     05  ()　回収済コード         PIC  X(1).
002490     05  ()　前受充当表示         PIC  X(1).
002500     05  ()　残価充当表示         PIC  X(1).
