000010************************************************
000020* 請求先ファイル(CISUF030)
000030************************************************
000040    03   ()取引先コード           PIC  X(9).
000050    03   ()請求先コード           PIC  X(5).
000060    03   ()請求先名称             PIC  X(80).
000070    03   ()部門名称               PIC  X(60).
000080    03   ()担当者名称             PIC  X(20).
000090    03   ()請求書表示             PIC  X(1).
000100    03   ()振込人名               PIC  X(40).
000110    03   ()郵便番号               PIC  X(7).
000120    03   ()納付先コード           PIC  X(11).
000130    03   ()住所２                 PIC  X(60).
000140    03   ()住所３                 PIC  X(60).
000150    03   ()電話番号               PIC  X(15).
000160    03   ()一括入金コード         PIC  X(5).
000170    03   ()送付先名称             PIC  X(60).
000180    03   ()送付先部門             PIC  X(60).
000190    03   ()送付先担当者           PIC  X(20).
000200    03   ()送付先カナ名称         PIC  X(40).
000210    03   ()送付先郵便番号         PIC  X(7).
000220    03   ()送付先市町村コード     PIC  X(11).
000230    03   ()送付先住所２           PIC  X(60).
000240    03   ()送付先住所３           PIC  X(60).
000250    03   ()送付先電話番号         PIC  X(15).
000260    03   ()自動マッチング対象外区分 PIC  X(1).
000270    03   ()回収サイト             PIC S9(2)  SIGN LEADING SEPARATE.
000280    03   ()回収日                 PIC  X(2).
000290    03   ()回収方法               PIC  X(1).
000300    03   ()回収間隔               PIC S9(2)  SIGN LEADING SEPARATE.
000310    03   ()請求サイト             PIC S9(2)  SIGN LEADING SEPARATE.
000320    03   ()請求締日               PIC  X(2).
000330    03   ()請求間隔               PIC S9(2)  SIGN LEADING SEPARATE.
000340    03   ()請求基準月             PIC S9(2)  SIGN LEADING SEPARATE.
000350    03   ()作成通数               PIC S9(2)  SIGN LEADING SEPARATE.
000360    03   ()作成単位               PIC  X(1).
000370    03   ()請求書作成区分         PIC  X(1).
000380    03   ()請求指定様式区分       PIC  X(1).
000390    03   ()送付区分               PIC  X(1).
000400    03   ()受取側金融機関コード   PIC  X(4).
000410    03   ()受取側支店コード       PIC  X(3).
000420    03   ()受取側口座種類         PIC  X(1).
000430    03   ()受取側口座番号         PIC  X(10).
000440    03   ()口振銀行コード         PIC  X(4).
000450    03   ()口振支店コード         PIC  X(3).
000460    03   ()口振口座種類           PIC  X(1).
000470    03   ()口振口座番号           PIC  X(10).
000480    03   ()口振名義人             PIC  X(30).
000490    03   ()請求宛名印刷           PIC  X(1).
000500    03   ()請求日付印刷           PIC  X(1).
000510    03   ()回収期限印刷           PIC  X(1).
000520    03   ()使用月印刷             PIC  X(1).
000530    03   ()内訳印刷               PIC  X(1).
000540    03   ()請求番号印刷           PIC  X(1).
000550    03   ()摘要欄印刷             PIC  X(1).
000560    03   ()摘要欄                 PIC  X(60).
000570    03   ()備考欄印刷             PIC  X(1).
000580    03   ()口振ご案内書作成区分   PIC  X(1).
000590    03   ()集約区分               PIC  X(1).
000600    03   ()更新日時               PIC  X(16).
000610    03   ()更新者                 PIC  X(8).
000620    03   ()送付先コード           PIC  X(3).
000630    03   ()仮想口座連番           PIC S9(3)  SIGN LEADING SEPARATE.
000640    03   ()顧客使用不可フラグ     PIC  X(1).
000650    03   ()コメント欄             PIC  X(60).
000660    03   ()入力担当者コード       PIC  X(8).
000670    03   ()部門カナ名称           PIC  X(30).
000680    03   ()契約先コード           PIC  X(5).
000690    03   ()共有フラグ             PIC  X(1).
000700    03   ()住所１                 PIC  X(60).
000710    03   ()住所カナ名称           PIC  X(60).
000720    03   ()ＦＡＸ番号             PIC  X(15).
000730    03   ()振替銀行コード         PIC  X(4).
000740    03   ()自振引落日             PIC  X(2).
000750    03   ()受取側口座コード       PIC  X(2).
000760    03   ()振込手数料負担区分     PIC  X(1).
000770    03   ()現担当者               PIC  X(8).
000780    03   ()主担当部課コード       PIC  X(4).
000790    03   ()登録年月日             PIC  X(8).
000800    03   ()登録時間               PIC  X(8).
000810    03   ()登録担当者             PIC  X(8).
000820    03   ()更新年月日             PIC  X(8).
000830    03   ()更新時間               PIC  X(8).
000840    03   ()旧請求先コード         PIC  X(8).
000850    03   ()口座引落依頼書受領日   PIC  X(8).
000860    03   ()口座引落開始日         PIC  X(8).
