000010************************************************
000020* 契約種類等変換テーブルDB用WK(CISUF92E)
000030************************************************
000040    03   ()契約ＮＯ               PIC  X(9).
000050    03   ()再リースコード         PIC S9(1)  SIGN LEADING SEPARATE.
000060    03   ()旧債権勘定処理コード   PIC S9(2)  SIGN LEADING SEPARATE.
000070    03   ()旧債務勘定処理コード   PIC S9(2)  SIGN LEADING SEPARATE.
000080    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000090    03   ()債権勘定処理コード     PIC S9(2)  SIGN LEADING SEPARATE.
000100    03   ()債務勘定処理コード     PIC S9(2)  SIGN LEADING SEPARATE.
000110    03   ()契約種類               PIC  X(3).
000120    03   ()主契約区分             PIC  X(1).
000130    03   ()回収手順               PIC  X(1).
