000010************************************************
000020* 解約履歴債権1ファイル（リース展開）(CISUF96G)
000030************************************************
000040    03   ()解約契約ＮＯ           PIC  X(9).
000050    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()契約種類               PIC S9(3)  SIGN LEADING SEPARATE.
000070    03   ()解約履歴債権リース展開 PIC  X(233).
