      *****************************************************************
      *   東京三菱銀行設置部店マスタ(D079TMT_TBL)
      *****************************************************************
           03  ()設置部店コード
                                     PIC  X(005).
           03  ()設置部店名          PIC  X(042).
           03  ()設置部店名カナ
                                     PIC  X(030).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
