      *****************************************************************
      *   物件処分関連帳票発行管理テーブル(D633BUC_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()物件処分区分
                                     PIC  X(001).
           03  ()物件処分連番
                                     PIC S9(003).
           03  ()売却用発行済フラグ
                                     PIC  X(001).
           03  ()廃棄用発行済フラグ
                                     PIC  X(001).
           03  ()紛失用発行済フラグ
                                     PIC  X(001).
           03  ()ソフト用発行済フラグ
                                     PIC  X(001).
           03  ()その他用発行済フラグ
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
