      *****************************************************************
      *   決裁条件指示(D324KJS_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()決裁種類            PIC  X(001).
           03  ()申請連番            PIC S9(002).
           03  ()連番                PIC S9(003).
           03  ()条件指示区分
                                     PIC  X(001).
           03  ()条件指示番号
                                     PIC S9(003).
           03  ()条件指示内容
                                     PIC  X(060).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()担保徴求区分
                                     PIC  X(001).
