      *****************************************************************
      *   取引先メモマスタ(D046TMN_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()メモ区分            PIC  X(002).
           03  ()連番                PIC S9(003).
           03  ()メモ登録日          PIC  X(008).
           03  ()メモ登録者          PIC  X(008).
           03  ()メモ内容            PIC  X(120).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
