      *****************************************************************
      *   資産コード変換マスタ(D077SSH_TBL)
      *****************************************************************
           03  ()転リース提携先コード
                                     PIC  X(003).
           03  ()先方商品コード
                                     PIC  X(007).
           03  ()適用年月日          PIC  X(008).
           03  ()資産コード          PIC  X(007).
           03  ()動総保険コード
                                     PIC  X(004).
           03  ()信用保険コード－リース
                                     PIC  X(006).
           03  ()信用保険コード－割賦
                                     PIC  X(006).
           03  ()税区分              PIC  X(001).
           03  ()商品分類名          PIC  X(030).
           03  ()物件名漢字          PIC  X(040).
           03  ()物件名              PIC  X(020).
           03  ()機種名              PIC  X(020).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
