      *****************************************************************
      *   口振予定データ(D88KUF_TBL)
      *****************************************************************
           03  ()振替銀行コード
                                     PIC  X(004).
           03  ()約定日              PIC  X(008).
           03  ()明細連番            PIC S9(008).
           03  ()連番                PIC S9(008).
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数        PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()請求区分            PIC  X(001).
           03  ()請求連番            PIC S9(003).
           03  ()請求回数            PIC S9(003).
           03  ()期間                PIC S9(003).
           03  ()金額                PIC S9(013).
           03  ()消費税額            PIC S9(013).
           03  ()合計金額            PIC S9(013).
           03  ()消費税率            PIC S9(002)V9(008).
           03  ()契約件名            PIC  X(040).
           03  ()請求書番号          PIC S9(007).
           03  ()新規コード          PIC  X(001).
           03  ()特別請求区分        PIC  X(001).
           03  ()データ変更フラグ
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
