      *****************************************************************
      *   金融機関マスタ(D13KGK_TBL)
      *****************************************************************
           03  ()銀行コード          PIC  X(004).
           03  ()支店コード          PIC  X(003).
           03  ()銀行名              PIC  X(030).
           03  ()支店名              PIC  X(030).
           03  ()その他              PIC  X(033).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()銀行名漢字          PIC  X(030).
           03  ()支店名漢字          PIC  X(030).
           03  ()住所コード          PIC  X(011).
           03  ()郵便番号            PIC  X(007).
           03  ()住所２              PIC  X(060).
           03  ()住所３              PIC  X(060).
           03  ()電話番号            PIC  X(015).
           03  ()振替日              PIC  X(002).
           03  ()自社預金種別        PIC  X(001).
           03  ()本支店名略称        PIC  X(030).
           03  ()本支店名漢字略称
                                     PIC  X(040).
           03  ()手形交換所番号
                                     PIC  X(004).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
