      *****************************************************************
      *   債務割賦展開(D353SKT_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()連番                PIC S9(003).
           03  ()売上年月            PIC  X(008).
           03  ()支払年月日          PIC  X(008).
           03  ()元本                PIC S9(013).
           03  ()利息                PIC S9(013).
           03  ()諸費用              PIC S9(013).
           03  ()当月利息            PIC S9(013).
           03  ()支払種類            PIC  X(002).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()支払先コード
                                     PIC  X(005).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(006).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
