      *****************************************************************
      *   変更申請_貸付金金利変更(D368HKK_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()申請連番            PIC S9(002).
           03  ()現行金利            PIC S9(002)V9(008).
           03  ()変更金利            PIC S9(002)V9(008).
           03  ()変更予定日          PIC  X(008).
           03  ()確定日              PIC  X(008).
           03  ()更新済フラグ
                                     PIC  X(001).
           03  ()粗利差額            PIC S9(013).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
