      *****************************************************************
      *   債権流動化基本(D860SRK_TBL)
      *****************************************************************
           03  ()流動化番号          PIC  X(006).
           03  ()契約番号            PIC  X(010).
           03  ()流動化先            PIC  X(007).
           03  ()流動化先名称
                                     PIC  X(080).
           03  ()信託先設定日
                                     PIC  X(008).
           03  ()信託終了日          PIC  X(008).
           03  ()取引先コード
                                     PIC  X(007).
           03  ()契約先コード
                                     PIC  X(003).
           03  ()契約先名            PIC  X(080).
           03  ()主契約区分          PIC  X(003).
           03  ()契約開始日          PIC  X(008).
           03  ()契約終了日          PIC  X(008).
           03  ()契約金額            PIC S9(013).
           03  ()債権残高            PIC S9(013).
           03  ()債権流動化区分
                                     PIC  X(010).
           03  ()債権流動化更新区分
                                     PIC  X(010).
           03  ()差入予約区分
                                     PIC  X(010).
           03  ()登録年月日          PIC  X(010).
           03  ()登録時間            PIC  X(010).
           03  ()登録担当者          PIC  X(010).
           03  ()更新年月日          PIC  X(010).
           03  ()更新時間            PIC  X(010).
           03  ()入力担当者コード
                                     PIC  X(010).
           03  ()更新者              PIC  X(010).
