      *****************************************************************
      *   取引先業績財務マスタ(D090TRG_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()決算年月            PIC  X(006).
           03  ()売上高              PIC S9(013).
           03  ()営業利益            PIC S9(013).
           03  ()経常利益            PIC S9(013).
           03  ()税引後利益          PIC S9(013).
           03  ()配当率              PIC S9(003)V9(003).
           03  ()自己資本比率
                                     PIC S9(003)V9(003).
           03  ()申告所得            PIC S9(013).
           03  ()自己資本            PIC S9(013).
           03  ()総資産              PIC S9(013).
           03  ()総債務              PIC S9(013).
           03  ()現預金              PIC S9(013).
           03  ()総債務償還年数
                                     PIC S9(003).
           03  ()所要運転資金
                                     PIC S9(013).
           03  ()フリーキャッシュフロー
                                     PIC S9(013).
           03  ()情報元区分          PIC  X(001).
           03  ()情報元作成年月日
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
