      *****************************************************************
      *   解約履歴＿総合採算債権(D482KSA_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()申請連番            PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()回収種類            PIC  X(003).
           03  ()回収連番            PIC S9(003).
           03  ()紐付契約番号
                                     PIC  X(010).
           03  ()紐付再リース回数
                                     PIC S9(002).
           03  ()紐付契約種類
                                     PIC  X(003).
           03  ()紐付連番            PIC S9(003).
           03  ()約定回収年月日
                                     PIC  X(008).
           03  ()回収サイト          PIC S9(003)V9(002).
           03  ()約定回収金額
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
