      *****************************************************************
      *   保険事故請求(D51HJI_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()契約種類            PIC  X(003).
           03  ()物件番号            PIC S9(004).
           03  ()連番                PIC S9(003).
           03  ()再リース回数        PIC S9(002).
           03  ()事故年月日          PIC  X(008).
           03  ()事故時間            PIC  X(004).
           03  ()管理番号            PIC  X(015).
           03  ()物件名称            PIC  X(060).
           03  ()契約開始日          PIC  X(008).
           03  ()契約終了日          PIC  X(008).
           03  ()期間                PIC S9(003).
           03  ()取得価額            PIC S9(013).
           03  ()取引先コード        PIC  X(009).
           03  ()契約先コード        PIC  X(005).
           03  ()ユーザリファレンス
                                     PIC  X(012).
           03  ()設置場所名          PIC  X(020).
           03  ()転リース提携先コード
                                     PIC  X(002).
           03  ()継続リース償却対象額
                                     PIC S9(013).
           03  ()勘定処理コード
                                     PIC  X(002).
           03  ()保険会社コード
                                     PIC  X(004).
           03  ()責任期間自          PIC  X(008).
           03  ()責任期間至          PIC  X(008).
           03  ()保険証券番号        PIC  X(011).
           03  ()動総保険価格        PIC S9(013).
           03  ()再リース付保率
                                     PIC S9(002).
           03  ()事故請求登録日
                                     PIC  X(008).
           03  ()事故区分            PIC  X(001).
           03  ()事故原因            PIC  X(001).
           03  ()被災物件金額        PIC S9(013).
           03  ()被災物件残価額
                                     PIC S9(013).
           03  ()請求年月日          PIC  X(008).
           03  ()請求ＲＥＦＮＯ
                                     PIC  X(008).
           03  ()請求保険金          PIC S9(013).
           03  ()臨時費用保険金
                                     PIC S9(013).
           03  ()保険金請求額        PIC S9(013).
           03  ()保険金請求済フラグ
                                     PIC  X(001).
           03  ()入送金登録日        PIC  X(008).
           03  ()保険金入金日        PIC  X(008).
           03  ()保険金入金額        PIC S9(013).
           03  ()保険金処理区分
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
