      *****************************************************************
      *   機械類コードマスタ(D055KCM_TBL)
      *****************************************************************
           03  ()主契約区分          PIC  X(001).
           03  ()適用年月            PIC  X(006).
           03  ()機械類コード
                                     PIC  X(002).
           03  ()信用保険会社コード
                                     PIC  X(001).
           03  ()機械類名            PIC  X(060).
           03  ()最長保険期間
                                     PIC S9(002).
           03  ()一台当たりの限度額上限
                                     PIC S9(009).
           03  ()一台当たりの限度額下限
                                     PIC S9(009).
           03  ()信用保険料率パターン
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
