      *****************************************************************
      *   保険事故送金(D511HJS_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()契約種類            PIC  X(003).
           03  ()物件番号            PIC S9(004).
           03  ()連番                PIC S9(003).
           03  ()送金連番            PIC S9(002).
           03  ()送金先コード
                                     PIC  X(002).
           03  ()送金先名            PIC  X(040).
           03  ()送金額              PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
