      *****************************************************************
      *   帳票名称マスタ(D049PNM_TBL)
      *****************************************************************
           03  ()帳票ＩＤ            PIC  X(008).
           03  ()区分                PIC  X(001).
           03  ()プログラムＩＤ
                                     PIC  X(008).
           03  ()フォームＩＤ
                                     PIC  X(008).
           03  ()帳票名称            PIC  X(080).
           03  ()未印刷削除期限
                                     PIC S9(004).
           03  ()印刷済削除期限
                                     PIC S9(004).
           03  ()取りまとめ部課コード
                                     PIC  X(004).
           03  ()処理区分            PIC  X(003).
           03  ()設計用紙サイズ
                                     PIC  X(002).
           03  ()印刷用紙サイズ
                                     PIC  X(002).
           03  ()用紙方向            PIC  X(001).
           03  ()設計行数            PIC S9(002).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()プリンタ識別コード
                                     PIC  X(001).
           03  ()ＪＯＢコード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()出力形態            PIC  X(001).
           03  ()用紙区分            PIC  X(001).
