      *****************************************************************
      *   グループクレライン履歴マスタ(D083GPR_TBL)
      *****************************************************************
           03  ()グループコード
                                     PIC  X(009).
           03  ()適用開始年月日
                                     PIC  X(008).
           03  ()与信限度金額
                                     PIC S9(013).
           03  ()適用期限年月日
                                     PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
