      *****************************************************************
      *   受取手形展開(D645UTT_TBL)
      *****************************************************************
           03  ()代表契約番号
                                     PIC  X(010).
           03  ()束数                PIC S9(003).
           03  ()連番                PIC S9(003).
           03  ()手形番号            PIC  X(010).
           03  ()期日                PIC  X(008).
           03  ()金額                PIC S9(013).
           03  ()振出人取引先コード
                                     PIC  X(009).
           03  ()振出人契約先コード
                                     PIC  X(005).
           03  ()振出人名称          PIC  X(040).
           03  ()振出人名称カナ
                                     PIC  X(040).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()手形状態            PIC  X(001).
