      *****************************************************************
      *   幣種換算相場マスタ(D182KSB_TBL)
      *****************************************************************
           03  ()幣種コード          PIC  X(003).
           03  ()適用年月            PIC  X(006).
           03  ()ユニット単位
                                     PIC  X(001).
           03  ()通貨小数点位置
                                     PIC S9(002).
           03  ()月末ＴＴＳ          PIC S9(004)V9(006).
           03  ()月末ＴＴＢ          PIC S9(004)V9(006).
           03  ()月末換算相場
                                     PIC S9(004)V9(006).
           03  ()月末基準日          PIC  X(008).
           03  ()前月末ＴＴＳ
                                     PIC S9(004)V9(006).
           03  ()前月末ＴＴＢ
                                     PIC S9(004)V9(006).
           03  ()前月末換算相場
                                     PIC S9(004)V9(006).
           03  ()前月末基準日
                                     PIC  X(008).
           03  ()前期末ＴＴＳ
                                     PIC S9(004)V9(006).
           03  ()前期末ＴＴＢ
                                     PIC S9(004)V9(006).
           03  ()前期末換算相場
                                     PIC S9(004)V9(006).
           03  ()前期末基準日
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
