      *****************************************************************
      *   資産情報テーブル(D921SIJ_TBL)
      *****************************************************************
           03  ()キー情報－契約番号
                                     PIC  X(010).
           03  ()キー情報－契約種類
                                     PIC  X(003).
           03  ()キー情報－物件番号
                                     PIC S9(004).
           03  ()契約内容－再リース回数
                                     PIC S9(002).
           03  ()契約内容－主契約区分
                                     PIC  X(001).
           03  ()契約内容－契約区分
                                     PIC  X(001).
           03  ()契約内容－協調区分
                                     PIC  X(001).
           03  ()契約内容－契約開始日
                                     PIC  X(008).
           03  ()契約内容－契約終了日
                                     PIC  X(008).
           03  ()契約内容－期間
                                     PIC S9(003).
           03  ()契約内容－引渡年月日
                                     PIC  X(008).
           03  ()契約内容－検収処理年月
                                     PIC  X(006).
           03  ()契約内容－契約処理年月
                                     PIC  X(006).
           03  ()契約内容－成約年月日
                                     PIC  X(008).
           03  ()契約内容－検収取消年月日
                                     PIC  X(008).
           03  ()契約内容－検収取消処理年月
                                     PIC  X(006).
           03  ()契約内容－検収取消エントリ日
                                     PIC  X(008).
           03  ()契約内容－担当部課コード
                                     PIC  X(004).
           03  ()契約内容－担当者コード
                                     PIC  X(008).
           03  ()契約内容－取引先コード
                                     PIC  X(009).
           03  ()契約内容－契約先コード
                                     PIC  X(005).
           03  ()契約内容－顧客区分
                                     PIC  X(002).
           03  ()債権－勘定処理コード
                                     PIC S9(002).
           03  ()物件－取得年月日
                                     PIC  X(008).
           03  ()物件－移動年月日
                                     PIC  X(008).
           03  ()物件－状態フラグ
                                     PIC  X(001).
           03  ()物件－移動理由
                                     PIC  X(002).
           03  ()物件－物件処分連番
                                     PIC S9(003).
           03  ()物件－取得価額
                                     PIC S9(013).
           03  ()物件－取消取得価額
                                     PIC S9(013).
           03  ()物件－物件取得価額
                                     PIC S9(013).
           03  ()物件－残価区分
                                     PIC  X(001).
           03  ()物件－契約残価設定額
                                     PIC S9(013).
           03  ()物件－他社購入額
                                     PIC S9(013).
           03  ()物件－他社残価設定額
                                     PIC S9(013).
           03  ()物件－定額－月額償却費
                                     PIC S9(013).
           03  ()物件－定額－月額償却費端数
                                     PIC S9(013).
           03  ()物件－物件リース料
                                     PIC S9(013).
           03  ()物件－数量          PIC S9(005).
           03  ()物件－資産種類
                                     PIC  X(007).
           03  ()物件－耐用年数
                                     PIC S9(002).
           03  ()物件－物件種類
                                     PIC  X(002).
           03  ()物件－自他社区分
                                     PIC  X(001).
           03  ()物件－ソフト区分
                                     PIC  X(001).
           03  ()物件－少額資産区分
                                     PIC  X(001).
           03  ()物件－中古資産区分
                                     PIC  X(001).
           03  ()物件－会社償却区分
                                     PIC  X(001).
           03  ()物件－固定資産税区分
                                     PIC  X(001).
           03  ()物件－海外設置場所区分
                                     PIC  X(001).
           03  ()物件－旧契約番号
                                     PIC  X(010).
           03  ()物件－旧物件番号
                                     PIC S9(004).
           03  ()物件－分割年月日
                                     PIC  X(008).
           03  ()物件－分割元物件番号
                                     PIC S9(004).
           03  ()物件－物件名称
                                     PIC  X(060).
           03  ()物件－Ｆ型名
                                     PIC  X(025).
           03  ()物件－ディーラ取引先
                                     PIC  X(009).
           03  ()物件－ディーラコード
                                     PIC  X(005).
           03  ()解約満了－解約申請フラグ
                                     PIC  X(001).
           03  ()解約満了－解約フラグ
                                     PIC  X(001).
           03  ()解約満了－解約年月日
                                     PIC  X(008).
           03  ()解約満了－解約処理年月
                                     PIC  X(006).
           03  ()解約満了－解約取消処理年月
                                     PIC  X(006).
           03  ()解約満了－解約理由
                                     PIC  X(002).
           03  ()解約満了－解約区分
                                     PIC  X(001).
           03  ()解約満了－解約月数
                                     PIC S9(003).
           03  ()解約満了－解約取消フラグ
                                     PIC  X(001).
           03  ()解約満了－取消解約日
                                     PIC  X(008).
           03  ()解約満了－満了処理年月
                                     PIC  X(006).
           03  ()解約満了－満了取消処理年月
                                     PIC  X(006).
           03  ()物件処分－売廃フラグ
                                     PIC  X(001).
           03  ()物件処分－物件処分区分
                                     PIC  X(001).
           03  ()物件処分－申請状態フラグ
                                     PIC  X(001).
           03  ()物件処分－物件処分申請連番
                                     PIC S9(002).
           03  ()物件処分－処分先取引先コード
                                     PIC  X(009).
           03  ()物件処分－処分先コード
                                     PIC  X(005).
           03  ()物件処分－売廃年月日
                                     PIC  X(008).
           03  ()物件処分－売廃処理年月
                                     PIC  X(006).
           03  ()物件処分－売廃月数
                                     PIC S9(003).
           03  ()物件処分－売廃理由
                                     PIC  X(002).
           03  ()物件処分－売廃取消区分
                                     PIC  X(001).
           03  ()物件処分－売廃取消処理年月
                                     PIC  X(006).
           03  ()承継－承継フラグ
                                     PIC  X(001).
           03  ()承継－承継二次済フラグ
                                     PIC  X(001).
           03  ()承継－承継元契約番号
                                     PIC  X(010).
           03  ()承継－承継元物件番号
                                     PIC S9(004).
           03  ()承継－承継処理年月
                                     PIC  X(006).
           03  ()承継－承継日
                                     PIC  X(008).
           03  ()承継－承継時簿価
                                     PIC S9(013).
           03  ()承継－承継時償却累計額
                                     PIC S9(013).
           03  ()承継－承継取消年月日
                                     PIC  X(008).
           03  ()動総保険－動総付保区分
                                     PIC  X(001).
           03  ()動総保険－付保日
                                     PIC  X(008).
           03  ()動総保険－付保日数
                                     PIC S9(003).
           03  ()動総保険－動総付保開始年月日
                                     PIC  X(008).
           03  ()動総保険－動総保険料
                                     PIC S9(013).
           03  ()動総保険－事故有無
                                     PIC  X(001).
           03  ()動総保険－事故日
                                     PIC  X(008).
           03  ()動総保険－保険継続
                                     PIC  X(001).
           03  ()動総保険－保険料率
                                     PIC S9(002)V9(007).
           03  ()動総保険－保険価格
                                     PIC S9(013).
           03  ()動総保険－返戻保険料
                                     PIC S9(013).
           03  ()動総保険－動総保険証券番号
                                     PIC  X(011).
           03  ()動総保険－付保率
                                     PIC S9(002).
           03  ()動総保険－継続リース償却対象額
                                     PIC S9(013).
           03  ()動総保険－設置場所名カナ
                                     PIC  X(080).
           03  ()動総保険－賠償保険区分
                                     PIC  X(001).
           03  ()信用保険－信用保険区分
                                     PIC  X(001).
           03  ()信用保険－保険会社区分
                                     PIC  X(004).
           03  ()信用保険－信用保険会社コード
                                     PIC  X(001).
           03  ()信用保険－機械類分類コード
                                     PIC  X(002).
           03  ()信用保険－通知書発送日
                                     PIC  X(008).
           03  ()信用保険－通知書番号
                                     PIC S9(003).
           03  ()信用保険－保険料
                                     PIC S9(013).
           03  ()信用保険－符号
                                     PIC  X(005).
           03  ()信用保険－契約総額
                                     PIC S9(013).
           03  ()信用保険－控除すべき金額
                                     PIC S9(013).
           03  ()信用保険－以降回収サイト
                                     PIC S9(002).
           03  ()固定資産税－残存率
                                     PIC S9(002)V9(007).
           03  ()固定資産税－前年度納付先コード
                                     PIC  X(011).
           03  ()固定資産税－納付先コード
                                     PIC  X(006).
           03  ()固定資産税－固定資産税率
                                     PIC S9(002)V9(007).
           03  ()固定資産税－対象取得価額
                                     PIC S9(013).
           03  ()固定資産税－年税額
                                     PIC S9(013).
           03  ()固定資産税－前年度評価額
                                     PIC S9(013).
           03  ()固定資産税－前年度理論簿価
                                     PIC S9(013).
           03  ()固定資産税－当年度評価額
                                     PIC S9(013).
           03  ()固定資産税－当年度理論簿価
                                     PIC S9(013).
           03  ()固定資産税－残存到達フラグ
                                     PIC  X(001).
           03  ()固定資産税－残存到達年月
                                     PIC  X(006).
           03  ()固定資産税－申告フラグ
                                     PIC  X(001).
           03  ()前月－前月状態フラグ
                                     PIC  X(001).
           03  ()前月－前月検収処理年月
                                     PIC  X(006).
           03  ()前月－前月契約開始日
                                     PIC  X(008).
           03  ()前月－前月再リース回数
                                     PIC S9(002).
           03  ()前月－前月解約日
                                     PIC  X(008).
           03  ()前月－前月解約年月
                                     PIC  X(006).
           03  ()前月－前月売廃日
                                     PIC  X(008).
           03  ()前月－前月売廃年月
                                     PIC  X(006).
           03  ()前月－前月売廃理由
                                     PIC  X(002).
           03  ()前月－取消解約理由
                                     PIC  X(002).
           03  ()前月－前期解約年月日
                                     PIC  X(008).
           03  ()前月－遡及処理区分
                                     PIC  X(001).
           03  ()前月－遡及処理年月
                                     PIC  X(006).
           03  ()前月－前月経過月数
                                     PIC S9(003).
           03  ()共通－期末年月
                                     PIC  X(006).
           03  ()共通－期首年月
                                     PIC  X(006).
           03  ()共通－月次年月
                                     PIC  X(006).
           03  ()共通－追加減少フラグ
                                     PIC  X(001).
           03  ()共通－取得年度
                                     PIC  X(004).
           03  ()共通－償却月数
                                     PIC S9(003).
           03  ()共通－当月迄償却経過月数
                                     PIC S9(003).
           03  ()共通－当期償却月数
                                     PIC S9(013).
           03  ()共通－処理区分
                                     PIC  X(001).
           03  ()共通－当月償却対象フラグ
                                     PIC  X(001).
           03  ()共通－定率償却調整可能フラグ
                                     PIC  X(001).
           03  ()会社理論－償却停止フラグ
                                     PIC  X(001).
           03  ()会社理論－償却停止日
                                     PIC  X(008).
           03  ()会社理論－前期末簿価
                                     PIC S9(013).
           03  ()会社理論－前期迄償却額累計
                                     PIC S9(013).
           03  ()会社理論－償却残価設定額
                                     PIC S9(013).
           03  ()会社理論－前月償却額
                                     PIC S9(013).
           03  ()会社理論－前月迄償却額累計
                                     PIC S9(013).
           03  ()会社理論－現在簿価
                                     PIC S9(013).
           03  ()会社理論－除却簿価
                                     PIC S9(013).
           03  ()会社理論－当月迄償却額累計
                                     PIC S9(013).
           03  ()会社理論－当月償却額
                                     PIC S9(013).
           03  ()会社理論－当期償却額
                                     PIC S9(013).
           03  ()管理会計－前期末簿価
                                     PIC S9(013).
           03  ()管理会計－前期迄償却額累計
                                     PIC S9(013).
           03  ()管理会計－前月償却額
                                     PIC S9(013).
           03  ()管理会計－前月迄償却額累計
                                     PIC S9(013).
           03  ()管理会計－現在簿価
                                     PIC S9(013).
           03  ()管理会計－当月迄償却額累計
                                     PIC S9(013).
           03  ()管理会計－当月償却額
                                     PIC S9(013).
           03  ()管理会計－当期償却額
                                     PIC S9(013).
           03  ()税務－償却率
                                     PIC S9(002)V9(007).
           03  ()税務－割増償却
                                     PIC  X(002).
           03  ()税務－割増償却率
                                     PIC S9(002)V9(007).
           03  ()税務－割増償却費
                                     PIC S9(013).
           03  ()税務－特別償却率分子
                                     PIC S9(002).
           03  ()税務－特別償却率分母
                                     PIC S9(003).
           03  ()税務－特別償却費
                                     PIC S9(013).
           03  ()税務－前期末実施額簿価
                                     PIC S9(013).
           03  ()税務－前期実施額累計
                                     PIC S9(013).
           03  ()税務－前期繰越超過額
                                     PIC S9(013).
           03  ()税務－前期償却不足額
                                     PIC S9(013).
           03  ()税務－当期償却限度額
                                     PIC S9(013).
           03  ()税務－当期償却実施額
                                     PIC S9(013).
           03  ()税務－当期償却実施額累計
                                     PIC S9(013).
           03  ()税務－当期償却不足額
                                     PIC S9(013).
           03  ()税務－当期償却超過額
                                     PIC S9(013).
           03  ()税務－当期償却への振替額
                                     PIC S9(013).
           03  ()税務－当期末実施額簿価
                                     PIC S9(013).
           03  ()税務－申告残存到達フラグ
                                     PIC  X(001).
           03  ()税務－税務申告残存到達年月
                                     PIC  X(006).
           03  ()税務－前期末法定簿価
                                     PIC S9(013).
           03  ()税務－当期末法定簿価
                                     PIC S9(013).
           03  ()管理情報－登録年月日
                                     PIC  X(008).
           03  ()管理情報－登録時間
                                     PIC  X(008).
           03  ()管理情報－登録担当者
                                     PIC  X(008).
           03  ()管理情報－更新年月日
                                     PIC  X(008).
           03  ()管理情報－更新時間
                                     PIC  X(008).
           03  ()管理情報－更新者
                                     PIC  X(008).
           03  ()管理情報－入力担当者コード
                                     PIC  X(008).
