      *****************************************************************
      *   協調転売却履歴(D814KTB_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()売却連番            PIC S9(003).
           03  ()契約種類            PIC  X(003).
           03  ()他社支払取引先コード
                                     PIC  X(009).
           03  ()他社支払先コード
                                     PIC  X(005).
           03  ()支払方法            PIC  X(001).
           03  ()支払エントリ日
                                     PIC  X(008).
           03  ()支払処理年月
                                     PIC  X(006).
           03  ()取消区分            PIC  X(001).
           03  ()取消日              PIC  X(008).
           03  ()取消エントリ日
                                     PIC  X(008).
           03  ()支払取消処理年月
                                     PIC  X(006).
           03  ()他社支払予定日
                                     PIC  X(008).
           03  ()他社支払額          PIC S9(013).
           03  ()他社支払消費税
                                     PIC S9(013).
           03  ()他社支払消費税率
                                     PIC S9(002)V9(008).
           03  ()他社支払消費税区分
                                     PIC  X(002).
           03  ()他社支払日          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
