      *****************************************************************
      *   解約履歴＿前払金(D468KMA_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()前払金額            PIC S9(013).
           03  ()前払金額消費税
                                     PIC S9(013).
           03  ()前払金額消費税率
                                     PIC S9(002)V9(008).
           03  ()前払金額消費税率区分
                                     PIC  X(002).
           03  ()前払回収方法
                                     PIC  X(001).
           03  ()前払回収サイト
                                     PIC S9(002).
           03  ()前払回収日          PIC S9(002).
           03  ()充当開始回          PIC S9(003).
           03  ()充当月数            PIC S9(002).
           03  ()充当開始年月
                                     PIC  X(006).
           03  ()回収額              PIC S9(013).
           03  ()回収額消費税
                                     PIC S9(013).
           03  ()振込手数料          PIC S9(013).
           03  ()回収年月日          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()解約年月日          PIC  X(008).
           03  ()解約分料金累計
                                     PIC S9(013).
           03  ()解約分消費税累計
                                     PIC S9(013).
           03  ()請求書番号          PIC S9(007).
           03  ()未回収額            PIC S9(013).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()自社前払金額
                                     PIC S9(013).
           03  ()自社前払金額消費税
                                     PIC S9(013).
           03  ()他社回収額          PIC S9(013).
           03  ()他社回収額消費税
                                     PIC S9(013).
           03  ()他社解約分料金累計
                                     PIC S9(013).
           03  ()他社解約分消費税累計
                                     PIC S9(013).
           03  ()他社未回収額
                                     PIC S9(013).
           03  ()管理債権レベル
                                     PIC  X(001).
           03  ()貸倒損失金          PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()請求内訳コード
                                     PIC  X(003).
           03  ()消込通番            PIC  X(011).
           03  ()充当済月数          PIC S9(002).
           03  ()充当済額            PIC S9(013).
           03  ()未充当残高          PIC S9(013).
           03  ()初回入金日          PIC  X(008).
           03  ()自社回収額          PIC S9(013).
           03  ()自社回収額消費税
                                     PIC S9(013).
           03  ()他社前払金額
                                     PIC S9(013).
           03  ()他社前払金額消費税
                                     PIC S9(013).
           03  ()充当年月日          PIC  X(008).
           03  ()充当済額消費税
                                     PIC S9(013).
           03  ()自社充当済額
                                     PIC S9(013).
           03  ()自社充当済額消費税
                                     PIC S9(013).
           03  ()未充当残高消費税
                                     PIC S9(013).
           03  ()自社未充当残高
                                     PIC S9(013).
           03  ()自社未充当残高消費税
                                     PIC S9(013).
           03  ()消込年月日          PIC  X(008).
