      *****************************************************************
      *   徴求書類マスタ(D096TKS_TBL)
      *****************************************************************
           03  ()徴求管理種類
                                     PIC  X(002).
           03  ()書類番号            PIC S9(003).
           03  ()書類名称            PIC  X(080).
           03  ()ソート順            PIC S9(003).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
