      *****************************************************************
      *   保険情報(D914HJM_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()契約種類            PIC  X(003).
           03  ()物件番号            PIC S9(004).
           03  ()処理年月            PIC  X(006).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()主契約区分          PIC  X(001).
           03  ()契約形態            PIC  X(020).
           03  ()保険会社識別コード
                                     PIC  X(002).
           03  ()保険会社名          PIC  X(040).
           03  ()当月・当月外区分
                                     PIC  X(001).
           03  ()当月・当月外
                                     PIC  X(012).
           03  ()ユーザー名          PIC  X(040).
           03  ()物件名称            PIC  X(040).
           03  ()付保日              PIC  X(008).
           03  ()購入金額            PIC S9(013).
           03  ()保険価格            PIC S9(013).
           03  ()保険会社区分
                                     PIC  X(004).
           03  ()料率                PIC S9(002)V9(007).
           03  ()保険料              PIC S9(013).
           03  ()残価有              PIC  X(001).
           03  ()勘定処理コード
                                     PIC  X(002).
           03  ()新規継続区分
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時刻            PIC  X(008).
           03  ()登録者              PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時刻            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
