      *****************************************************************
      *   ネットリーシングユーザリストＩＤテーブル(D085NLU_TBL)
      *****************************************************************
           03  ()分類コード          PIC  X(001).
           03  ()ログインＩＤ
                                     PIC  X(010).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()契約先コード
                                     PIC  X(010).
           03  ()請求先コード
                                     PIC  X(010).
           03  ()会社名              PIC  X(096).
           03  ()部署名              PIC  X(034).
           03  ()氏名                PIC  X(034).
           03  ()ｅｍａｉｌアドレス
                                     PIC  X(050).
           03  ()郵便番号            PIC  X(007).
           03  ()住所                PIC  X(120).
           03  ()電話番号            PIC  X(015).
           03  ()担当者              PIC  X(001).
           03  ()区分                PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
