      *****************************************************************
      *   東京三菱銀行主管部店マスタ(D078TMS_TBL)
      *****************************************************************
           03  ()主管部コード
                                     PIC  X(006).
           03  ()主管部名            PIC  X(062).
           03  ()主管部名カナ
                                     PIC  X(030).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()入金日              PIC  X(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
