      *****************************************************************
      *   管理与信支払(D854KSH_TBL)
      *****************************************************************
           03  ()与信管理先コード
                                     PIC  X(009).
           03  ()支払予定年月日
                                     PIC  X(008).
           03  ()支払連番            PIC S9(004).
           03  ()支払先名            PIC  X(080).
           03  ()支払理由            PIC  X(020).
           03  ()支払金額            PIC S9(013).
           03  ()支払消費税金額
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
