      *****************************************************************
      *   機種コードマスタ(D056KSM_TBL)
      *****************************************************************
           03  ()主契約区分          PIC  X(001).
           03  ()適用年月            PIC  X(006).
           03  ()機械類コード
                                     PIC  X(002).
           03  ()機種名番号          PIC  X(002).
           03  ()機種名              PIC  X(060).
           03  ()機種名カナ          PIC  X(010).
           03  ()付保対象区分
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
