      *****************************************************************
      *   再リース計算率マスタ(D184SKR_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()適用年月日          PIC  X(008).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()計算単位            PIC  X(001).
           03  ()端数処理区分
                                     PIC  X(001).
           03  ()計算率分子          PIC S9(003).
           03  ()計算率分母          PIC S9(004).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
