      *****************************************************************
      *   解約申請＿ファクタリング期限前決裁(D512KFK_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()申請連番            PIC S9(002).
           03  ()期限前決済予定日
                                     PIC  X(008).
           03  ()違約金              PIC S9(013).
           03  ()債権買取明細選択数
                                     PIC S9(003).
           03  ()額面金額合計
                                     PIC S9(013).
           03  ()戻し利息合計
                                     PIC S9(013).
           03  ()返戻区分            PIC  X(001).
           03  ()元本残高            PIC S9(013).
           03  ()消込フラグ          PIC  X(001).
           03  ()確定フラグ          PIC  X(001).
           03  ()決裁フラグ          PIC  X(001).
           03  ()決裁日              PIC  X(008).
           03  ()確定日              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
