      *****************************************************************
      *   口振ステータス(D871KFS_TBL)
      *****************************************************************
           03  ()振替銀行コード
                                     PIC  X(004).
           03  ()約定年月日          PIC  X(008).
           03  ()振替日              PIC  X(008).
           03  ()約定日              PIC  X(002).
           03  ()作成日              PIC  X(008).
           03  ()口振ステータス
                                     PIC  X(001).
           03  ()銀行数              PIC S9(008).
           03  ()請求件数            PIC S9(008).
           03  ()請求金額            PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()変更済フラグ
                                     PIC  X(001).
           03  ()入力担当者コード
                                     PIC  X(008).
