      *****************************************************************
      *   広報メッセージ管理マスタ(D116KMK_TBL)
      *****************************************************************
           03  ()管理ＩＤ            PIC  X(008).
           03  ()広報メッセージ
                                     PIC  X(138).
           03  ()表示フラグ          PIC  X(001).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()文字色区分          PIC  X(001).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
