      *****************************************************************
      *   契約番号予約テーブル(D317YYK_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()部所                PIC  X(002).
           03  ()契約形態            PIC  X(001).
           03  ()状態                PIC  X(001).
           03  ()担当者コード
                                     PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()コメント            PIC  X(040).
           03  ()使用中フラグ
                                     PIC  X(001).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
