      *****************************************************************
      *   項目名称マスタ(D19MSY_TBL)
      *****************************************************************
           03  ()コードＮＯ          PIC  X(012).
           03  ()コード              PIC  X(005).
           03  ()コード名            PIC  X(040).
           03  ()名称                PIC  X(060).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()デフォルト区分
                                     PIC  X(001).
           03  ()パスワード入力区分
                                     PIC  X(001).
           03  ()ソート順            PIC S9(003).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
