      *****************************************************************
      *   口振合計データ(D881KFG_TBL)
      *****************************************************************
           03  ()振替銀行コード
                                     PIC  X(004).
           03  ()約定日              PIC  X(008).
           03  ()明細連番            PIC S9(008).
           03  ()振替日              PIC  X(008).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()請求先名称          PIC  X(040).
           03  ()銀行コード          PIC  X(004).
           03  ()銀行名              PIC  X(015).
           03  ()支店コード          PIC  X(003).
           03  ()支店名              PIC  X(015).
           03  ()口座種類            PIC  X(001).
           03  ()口座番号            PIC  X(010).
           03  ()名義人              PIC  X(030).
           03  ()金額                PIC S9(013).
           03  ()消費税額            PIC S9(013).
           03  ()合計金額            PIC S9(013).
           03  ()摘要                PIC  X(040).
           03  ()データ変更フラグ
                                     PIC  X(001).
           03  ()口振引落結果
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
