      *****************************************************************
      *   解約申請＿損害金請求(D511SGS_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()損害金請求方法
                                     PIC  X(001).
           03  ()連番                PIC S9(003).
           03  ()損害金取引先コード
                                     PIC  X(009).
           03  ()損害金請求先コード
                                     PIC  X(005).
           03  ()損害金回収予定日
                                     PIC  X(008).
           03  ()新契約番号          PIC  X(010).
           03  ()損害金請求額
                                     PIC S9(013).
           03  ()損害金請求額消費税
                                     PIC S9(013).
           03  ()損害金請求額消費税率
                                     PIC S9(002)V9(008).
           03  ()損害金請求額消費税率区分
                                     PIC  X(000).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()相殺過入金額
                                     PIC  X(002).
           03  ()相殺過入金消費税
                                     PIC  X(002).
           03  ()相殺前払金額
                                     PIC  X(002).
           03  ()相殺前払金消費税
                                     PIC  X(002).
           03  ()保険会社コード
                                     PIC  X(002).
           03  ()損害金支払先コード
                                     PIC  X(005).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
