      *****************************************************************
      *   解約履歴＿損害金請求(D471KSG_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()損害金請求方法
                                     PIC  X(001).
           03  ()連番                PIC S9(003).
           03  ()解約連番            PIC S9(002).
           03  ()解約本算年月日
                                     PIC  X(008).
           03  ()損害金取引先コード
                                     PIC  X(009).
           03  ()損害金請求先コード
                                     PIC  X(005).
           03  ()損害金回収予定日
                                     PIC  X(008).
           03  ()新契約番号          PIC  X(015).
           03  ()損害金請求額
                                     PIC S9(013).
           03  ()損害金請求額消費税
                                     PIC S9(013).
           03  ()損害金請求額消費税率
                                     PIC S9(002)V9(008).
           03  ()損害金請求額消費税率区分
                                     PIC  X(002).
           03  ()請求書発行済フラグ
                                     PIC  X(001).
           03  ()請求書番号          PIC S9(007).
           03  ()未回収額            PIC S9(013).
           03  ()損害金回収額
                                     PIC S9(013).
           03  ()損害金回収額消費税
                                     PIC S9(013).
           03  ()損害金回収日
                                     PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()自社売上額          PIC S9(013).
           03  ()自社売上額消費税
                                     PIC S9(013).
           03  ()他社回収額          PIC S9(013).
           03  ()管理債権レベル
                                     PIC  X(001).
           03  ()貸倒損失金          PIC S9(013).
           03  ()督促カード発行フラグ
                                     PIC  X(001).
           03  ()繰上弁済元本
                                     PIC S9(013).
           03  ()繰上弁済利息
                                     PIC S9(013).
           03  ()繰上弁済元本自社
                                     PIC S9(013).
           03  ()繰上弁済利息自社
                                     PIC S9(013).
           03  ()戻し利息            PIC S9(013).
           03  ()消費税一括徴収過入金額
                                     PIC S9(013).
           03  ()消費税一括徴収不足金額
                                     PIC S9(013).
           03  ()自社消費税一括徴収過入金額
                                     PIC S9(013).
           03  ()自社消費税一括徴収不足金額
                                     PIC S9(013).
           03  ()解約以降利息合計
                                     PIC S9(013).
           03  ()請求内訳コード
                                     PIC  X(003).
           03  ()消込通番            PIC  X(011).
           03  ()損害金回収方法
                                     PIC  X(001).
           03  ()初回入金日          PIC  X(008).
           03  ()消込年月日          PIC  X(008).
           03  ()相殺過入金額
                                     PIC  X(002).
           03  ()相殺過入金消費税
                                     PIC  X(002).
           03  ()相殺前払金額
                                     PIC  X(002).
           03  ()相殺前払金消費税
                                     PIC  X(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
