      *****************************************************************
      *   解約申請(D510KSI_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()解約承継区分
                                     PIC  X(001).
           03  ()解約年月日          PIC  X(008).
           03  ()解約区分            PIC  X(001).
           03  ()解約理由            PIC  X(002).
           03  ()承継種類            PIC  X(001).
           03  ()協調転区分          PIC  X(001).
           03  ()債務協調コード
                                     PIC  X(002).
           03  ()経過月数            PIC S9(003).
           03  ()契約件名            PIC  X(040).
           03  ()代表解約物件番号
                                     PIC S9(004).
           03  ()継続諸費用          PIC S9(013).
           03  ()残リース料          PIC S9(013).
           03  ()減額法１１０
                                     PIC S9(013).
           03  ()減額法１０５
                                     PIC S9(013).
           03  ()保険価格１１０
                                     PIC S9(013).
           03  ()実質元本残１０５
                                     PIC S9(013).
           03  ()実質未回収元本残
                                     PIC S9(013).
           03  ()未徴収固定資産税
                                     PIC S9(013).
           03  ()未徴収保険料
                                     PIC S9(013).
           03  ()未徴収合計額
                                     PIC S9(013).
           03  ()実質元本残１０２
                                     PIC S9(013).
           03  ()解約計上粗利
                                     PIC S9(013).
           03  ()法定定額償却額残高
                                     PIC S9(013).
           03  ()法定定率償却額残高
                                     PIC S9(013).
           03  ()解約物件耐用年数
                                     PIC S9(002).
           03  ()解約物件保険料率
                                     PIC S9(002)V9(008).
           03  ()申請年月日          PIC  X(008).
           03  ()解約申請フラグ
                                     PIC  X(001).
           03  ()営業意見            PIC  X(160).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
