      *****************************************************************
      *   スケジュール管理マスタ(D115SCH_TBL)
      *****************************************************************
           03  ()業務年月日          PIC  X(008).
           03  ()照会更新区分
                                     PIC  X(001).
           03  ()メニューボタンＩＤ
                                     PIC  X(008).
           03  ()開始時間            PIC  X(004).
           03  ()終了時間            PIC  X(004).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
