      *****************************************************************
      *   納税マスタ(EXT_TAXMST)
      *****************************************************************
           03  ()基準年              PIC  X(004).
           03  ()納付先コード        PIC  X(006).
           03  ()納付先名            PIC  X(040).
           03  ()銀行コード          PIC  X(004).
           03  ()銀行名漢字          PIC  X(020).
           03  ()銀行名カナ          PIC  X(015).
           03  ()報償金区分          PIC S9(001).
           03  ()納付方法            PIC S9(001).
           03  ()自動引落            PIC  X(001).
           03  ()納付期限１          PIC  X(008).
           03  ()納付期限２          PIC  X(008).
           03  ()納付期限３          PIC  X(008).
           03  ()納付期限４          PIC  X(008).
           03  ()納付日１            PIC  X(008).
           03  ()納付日２            PIC  X(008).
           03  ()納付日３            PIC  X(008).
           03  ()納付日４            PIC  X(008).
           03  ()報償金入金日        PIC  X(008).
           03  ()不動産税区分        PIC S9(001).
           03  ()処理区分            PIC S9(001).
           03  ()作業区分            PIC S9(002).
           03  ()更新標識            PIC S9(001).
           03  ()税率                PIC S9(002)V9(007).
           03  ()課税標準額          PIC S9(013).
           03  ()税額                PIC S9(013).
           03  ()報償金              PIC S9(013).
           03  ()納付金額１          PIC S9(013).
           03  ()納付金額２          PIC S9(013).
           03  ()納付金額３          PIC S9(013).
           03  ()納付金額４          PIC S9(013).
           03  ()不動産税額          PIC S9(013).
           03  ()不動産税報償金      PIC S9(013).
           03  ()分割納付限度        PIC S9(013).
           03  ()理論金額            PIC S9(013).
           03  ()決定額              PIC S9(013).
           03  ()不動産報奨金入金日  PIC  X(008).
           03  ()課税標準額－土地建物
                                     PIC S9(013).
           03  ()決定額－土地建物    PIC S9(013).
           03  ()理論金額－土地建物  PIC S9(013).
           03  ()集約申告先コード    PIC  X(004).
           03  ()課税標準額－通知書  PIC S9(013).
           03  ()課税標準額－土地建物－通知書
                                     PIC S9(013).
           03  ()課税標準額－土地－通知書
                                     PIC S9(013).
           03  ()課税標準額－建物－通知書
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()入力担当者コード    PIC  X(008).
           03  ()更新者              PIC  X(008).
