000010************************************************
000020* 三洋振分後再リースデータ(CPBIS181)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()ＢＯＴＬ契約ＮＯ       PIC  X(9).
000060     05  ()ＢＯＴＬ物件ＮＯ       PIC  X(3).
000070    03  ()再リースＣＤ           PIC  X(1).
000080    03  ()請求金額合計           PIC S9(13)  SIGN LEADING SEPARATE.
000090    03  ()物件名                 PIC  X(30).
000100    03  ()リファレンスＮＯ１     PIC  X(10).
000110    03  ()リース終了日.
000120     05  ()リース終了日－世紀     PIC  X(1).
000130     05  ()リース終了日－年月日   PIC  X(6).
000140    03  ()数量                   PIC S9(4)  SIGN LEADING SEPARATE.
000150    03  FILLER           PIC  X(29).
