000010************************************************
000020* 汎用入金プルーフF（汎用入金基本)(CPBIS107)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()入金通番               PIC S9(9).
000060    03  ()入金区分               PIC S9(1).
000070    03  ()入金先コード           PIC  X(8).
000080    03  ()入金額                 PIC S9(13)  SIGN LEADING SEPARATE.
000090    03  ()入金先名称             PIC  X(48).
000100    03  ()入金日                 PIC  X(7).
000110    03  ()銀行コード             PIC S9(7).
000120    03  ()口座番号               PIC S9(7).
000130    03  ()契約番号               PIC  X(9).
000140    03  ()消込残高               PIC S9(13)  SIGN LEADING SEPARATE.
000150    03  ()銀行短縮コード         PIC S9(2).
000160    03  ()入金仕訳短縮コード     PIC S9(2).
000170    03  ()処理区分               PIC S9(1).
000180    03  ()共通情報               PIC  X(35).
