000010************************************************
000020* 請求（請求先情報）(CPBIS081)
000030************************************************
000040    03  ()ＫＥＹ項目請求先コード PIC  X(8).
000050    03  ()入金元コード           PIC  X(8).
000060    03  ()請求金額               PIC S9(13)  SIGN LEADING SEPARATE.
000070    03  ()消込金額               PIC S9(13)  SIGN LEADING SEPARATE.
000080    03  ()消込残高               PIC S9(13)  SIGN LEADING SEPARATE.
000090    03  ()請求先名               PIC  X(30).
000100    03  FILLER           PIC  X(48).
000110    03  ()共通情報               PIC  X(35).
