000010************************************************
000020* 銀行マスター（支店レコード）(CPBIS031)
000030************************************************
000040    03  ()銀行コード             PIC  X(4).
000050    03  ()本支店コード           PIC  X(3).
000060    03  ()付加コード             PIC S9(1).
000070    03  ()支店名漢字             PIC  X(30).
000080    03  ()支店名カナ             PIC  X(15).
000090    03  ()本支店名略称漢字       PIC  X(40).
000100    03  ()本支店名略称カナ       PIC  X(30).
000110    03  ()手形交換所番号         PIC  X(4).
000120    03  FILLER           PIC  X(42).
000130    03  ()共通情報               PIC  X(35).
