000010************************************************
000020* コードマスタ(再リース料計算率メンバー)(CPBIS009)
000030************************************************
000040    03  ()ＫＥＹ１.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()請求先コード           PIC  X(8).
000070     05  FILLER           PIC  X(3).
000080    03  ()ＫＥＹ２.
000090     05  ()適用年月日.
000100      07  ()適用年月日－世紀       PIC S9(1).
000110      07  ()適用年月日－年月日     PIC  X(6).
000120     05  ()適用継続区分           PIC S9(1).
000130    03  ()適用範囲                          OCCURS 5.
000140     05  ()再リースコード         PIC S9(2).
000150     05  ()計算単位               PIC  X(1).
000160     05  ()端数処理区分           PIC  X(1).
000170     05  ()計算率.
000180      07  ()計算率－分子           PIC S9(3)  SIGN LEADING SEPARATE.
000190      07  ()計算率－分母           PIC S9(4)  SIGN LEADING SEPARATE.
000200    03  FILLER           PIC  X(2).
000210    03  ()共通情報               PIC  X(35).
