000010************************************************
000020* ˆ—’Ê”Ô(”„‹p’Ê”Ô)(CPBIS077)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()‚j‚d‚x‚P               PIC  X(2).
000060     05  ()‚j‚d‚x‚Q               PIC  X(8).
000070    03  ()ˆê˜A”Ô†               PIC S9(7).
000080    03  FILLER           PIC  X(48).
000090    03  ()‹¤’Êî•ñ               PIC  X(35).
