000010************************************************
000020* 名称マスタ（保険会社名(動総保険))(CPBIS128)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()保険会社コード         PIC  X(1).
000100      07  FILLER           PIC  X(10).
000110    03  ()保険会社名             PIC  X(20).
000120    03  ()保険会社名略称         PIC  X(10).
000130    03  ()保険会社名カナ         PIC  X(25).
000140    03  ()保険会社名カナ略称     PIC  X(12).
000150    03  FILLER           PIC  X(83).
000160    03  ()共通情報               PIC  X(35).
