000010************************************************
000020* 支払先（支払先マスタ）(CPBIS046)
000030************************************************
000040    03  ()支払取引先コード       PIC  X(4).
000050    03  ()フラグ.
000060     05  ()フラグ－登録削除       PIC  X(1).
000070     05  FILLER           PIC  X(4).
000080    03  ()相手先名称             PIC  X(56).
000090    03  ()振込情報.
000100     05  ()口座名義人             PIC  X(30).
000110     05  ()被仕向銀行情報.
000120      07  ()銀行コード             PIC S9(4).
000130      07  ()支店コード             PIC S9(3).
000140      07  ()預金種目               PIC S9(1).
000150      07  ()口座番号               PIC S9(7).
000160     05  ()登録番号               PIC S9(4).
000170    03  ()手形情報.
000180     05  ()名宛人                 PIC  X(56).
000190     05  ()郵送先情報.
000200      07  ()郵便番号.
000210       09  ()郵便番号－親           PIC  X(3).
000220       09  ()郵便番号－子           PIC  X(4).
000230      07  ()郵送先情報.
000240       09  ()郵送先住所１           PIC  X(34).
000250       09  ()郵送先住所２           PIC  X(32).
000260       09  ()郵送先住所３           PIC  X(32).
000270      07  ()郵送先名.
000280       09  ()郵送先名１             PIC  X(28).
000290       09  ()郵送先名２             PIC  X(28).
000300    03  ()休日対応区分           PIC  X(1).
000310    03  ()手数料有無             PIC  X(1).
000320    03  FILLER           PIC  X(56).
000330    03  ()共通情報               PIC  X(35).
