000010************************************************
000020* ‰¼Žó‹àŽc‚Æ‰ïƒtƒ@ƒCƒ‹(CPBIS142)
000030************************************************
000040    03  ()ƒvƒ‰ƒCƒ}ƒŠ[‚j‚d‚x.
000050     05  ()“ü‹à’Ê”Ô               PIC  X(9).
000060    03  ()“ü‹à‹æ•ª               PIC S9(1).
000070    03  ()“ü‹àæ‚b‚c             PIC  X(8).
000080    03  ()‚j‚d‚x|‚h‚s‚d‚l.
000090     05  ()ƒIƒ‹ƒ^ƒl[ƒg‚j‚d‚x‚P.
000100      07  ()“ü‹à“ú‚P.
000110       09  ()“ü‹à“ú‚P|¢‹I         PIC  X(1).
000120       09  ()“ü‹à“ú‚P|”NŒŽ“ú       PIC  X(6).
000130      07  ()ƒIƒ‹ƒ^ƒl[ƒg‚j‚d‚x‚Q.
000140       09  ()“ü‹àŠz‚P               PIC S9(12)  SIGN LEADING SEPARATE.
000150       09  ()“ü‹àæ–¼‚P             PIC  X(30).
000160     05  ()“ü‹àŠz‚Q•„‡Œ…         PIC  X(1).
000170     05  ()“ü‹àŠz‚Q               PIC  X(12).
000180     05  ()ƒIƒ‹ƒ^ƒl[ƒg‚j‚d‚x‚S.
000190      07  ()“ü‹à“ú‚Q.
000200       09  ()“ü‹à“ú‚Q|¢‹I         PIC  X(1).
000210       09  ()“ü‹à“ú‚Q|”NŒŽ“ú       PIC  X(6).
000220      07  ()“ü‹àæ–¼‚Q             PIC  X(30).
000230     05  ()“ü‹à“ú‚R.
000240      07  ()“ü‹à“ú‚R|¢‹I         PIC  X(1).
000250      07  ()“ü‹à“ú‚R|”NŒŽ“ú       PIC  X(6).
000260     05  ()“ü‹àŠz‚R•„‡Œ…         PIC  X(1).
000270     05  ()“ü‹àŠz‚R               PIC S9(12).
000280    03  ()“ü‹àæ–¼|•ÒW‘O       PIC  X(48).
000290    03  ()Áž‹àŠz               PIC S9(13)  SIGN LEADING SEPARATE.
000300    03  ()‹âs‚b‚c               PIC S9(7).
000310    03  ()ŒûÀ”Ô†               PIC S9(7).
000320    03  ()Œ_–ñ‚m‚n               PIC  X(9).
000330    03  ()ÄƒŠ[ƒX‚b‚c           PIC S9(1).
000340    03  ()Áž“ú.
000350     05  ()Áž“ú|¢‹I           PIC  X(1).
000360     05  ()Áž“ú|”NŒŽ“ú         PIC  X(6).
000370    03  ()ÁžŽc‚               PIC S9(13)  SIGN LEADING SEPARATE.
000380    03  ()‚q‚`‚s‚d               PIC S9(3)V9(2)  SIGN LEADING SEPARATE.
000390    03  ()ŠO‰Ý‹àŠz               PIC S9(11)V9(2)  SIGN LEADING SEPARATE.
000400    03  ()“ü‹à‹âs’Zk‚b‚c       PIC S9(2).
000410    03  ()“ü‹àŽd–ó’Zk‚b‚c       PIC S9(2).
000420    03  FILLER           PIC  X(52).
