000010************************************************
000020* 解約履歴資産ファイル（基本）(CPBIS153)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()ＫＥＹ－契約ＮＯ       PIC  X(9).
000060     05  ()ＫＥＹ－解約日.
000070      07  ()ＫＥＹ－解約日－世紀   PIC S9(1).
000080      07  ()ＫＥＹ－解約日－年月日 PIC  X(6).
000090     05  ()ＫＥＹ－解約処理コード PIC  X(1).
000100     05  ()ＫＥＹ－物件ＮＯ       PIC S9(3).
000110     05  ()ＫＥＹ－解約区分       PIC  X(1).
000120    03  ()ＫＥＹ１.
000130     05  ()契約ＮＯ               PIC  X(9).
000140    03  ()事業所コード           PIC S9(4).
000150    03  ()ユーザコード           PIC  X(8).
000160    03  ()担当者コード           PIC S9(4).
000170    03  ()契約状態区分.
000180     05  ()原契約                 PIC  X(1).
000190     05  ()継続                   PIC  X(1).
000200     05  ()再リース               PIC  X(1).
000210     05  ()割賦                   PIC  X(1).
000220     05  ()手数料                 PIC  X(1).
000230     05  ()ファクタリング         PIC  X(1).
000240     05  ()金消                   PIC  X(1).
000250     05  ()支払保証               PIC  X(1).
000260    03  FILLER           PIC  X(5).
000270    03  ()契約情報.
000280     05  ()契約日.
000290      07  ()契約日－世紀           PIC S9(1).
000300      07  ()契約日－年月日         PIC  X(6).
000310     05  ()検収日.
000320      07  ()検収日－世紀           PIC S9(1).
000330      07  ()検収日－年月日         PIC  X(6).
000340     05  ()残価回収日.
000350      07  ()残価回収日－世紀       PIC S9(1).
000360      07  ()残価回収日－年月日     PIC  X(6).
000370     05  ()購入金額合計           PIC S9(13)  SIGN LEADING SEPARATE.
000380     05  ()残価額合計額           PIC S9(13)  SIGN LEADING SEPARATE.
000390     05  ()物件枝番数             PIC S9(3)  SIGN LEADING SEPARATE.
000400     05  ()数量合計               PIC S9(5)  SIGN LEADING SEPARATE.
000410     05  ()単年度契約             PIC  X(2).
000420     05  ()転リース提携先コード   PIC  X(2).
000430     05  ()債権協調コード         PIC  X(2).
000440     05  ()仕入消費税額合計       PIC S9(13)  SIGN LEADING SEPARATE.
000450     05  ()案件発生区分           PIC  X(1).
000460     05  ()稟議区分               PIC  X(1).
000470    03  ()最終物件ＮＯ           PIC S9(3).
000480    03  ()協調区分.
000490     05  ()幹事非幹事区分         PIC  X(1).
000500     05  ()ＯＰＥＮＣＬＯＳＥ区分 PIC  X(1).
000510     05  ()回収手順               PIC  X(1).
000520    03  ()否認区分               PIC  X(1).
000530    03  FILLER           PIC  X(33).
000540    03  ()地位継承元情報.
000550     05  ()元契約ＮＯ             PIC  X(9).
000560     05  ()元最終物件ＮＯ         PIC S9(3).
000570     05  ()元事業所コード         PIC S9(4).
000580     05  ()元ユーザコード         PIC  X(8).
000590    03  ()処理年月度.
000600     05  ()処理年月度－世紀       PIC S9(1).
000610     05  ()処理年月度－年月       PIC  X(4).
000620    03  ()共通情報               PIC  X(35).
