000010************************************************
000020* コードマスタ(動総短期料率)(CPBIS019)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  FILLER           PIC  X(11).
000070    03  FILLER           PIC  X(150).
000080    03  ()共通情報               PIC  X(35).
