000010************************************************
000020* 照査ファイル(個別明細レコード)(CPBIS080)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()勘定科目.
000060      07  ()科目コード             PIC  X(3).
000070      07  ()取引コード             PIC  X(2).
000080     05  ()幣種１                 PIC  X(3).
000090     05  ()口座番号               PIC  X(8).
000100     05  ()ＲＥＦＮＯ             PIC  X(16).
000110    03  ()フラグ.
000120     05  ()登録削除               PIC  X(1).
000130     05  FILLER           PIC  X(4).
000140    03  ()取引日.
000150     05  ()取引日－世紀           PIC S9(1).
000160     05  ()取引日－年月日         PIC S9(6).
000170    03  ()事業所                 PIC S9(4).
000180    03  ()幣種２                 PIC  X(3).
000190    03  ()外貨金額               PIC S9(12)V9(2)  SIGN LEADING SEPARATE.
000200    03  ()ＥＸ区分               PIC  X(4).
000210    03  ()換算レート             PIC S9(4)V9(2)  SIGN LEADING SEPARATE.
000220    03  ()円貨金額               PIC S9(13)  SIGN LEADING SEPARATE.
000230    03  ()対価ＦＩＸ             PIC  X(1).
000240    03  ()始期.
000250     05  ()始期－世紀             PIC S9(1).
000260     05  ()始期－年月日           PIC S9(6).
000270    03  ()終期.
000280     05  ()終期－世紀             PIC S9(1).
000290     05  ()終期－年月日           PIC S9(6).
000300    03  ()利率                   PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
000310    03  ()片端両端区分           PIC  X(1).
000320    03  ()前取後取区分           PIC  X(1).
000330    03  ()利率基数               PIC  X(1).
000340    03  ()適用                   PIC  X(34).
000350    03  ()解約日.
000360     05  ()解約日－世紀           PIC S9(1).
000370     05  ()解約日－年月日         PIC S9(6).
000380    03  ()前月末算.
000390     05  ()前月末外貨残高         PIC S9(12)V9(2)  SIGN LEADING SEPARATE.
000400     05  ()前月末円貨残高         PIC S9(13)  SIGN LEADING SEPARATE.
000410    03  ()前期末算.
000420     05  ()前期末外貨残高         PIC S9(12)V9(2)  SIGN LEADING SEPARATE.
000430     05  ()前期末円貨残高         PIC S9(13)  SIGN LEADING SEPARATE.
000440    03  ()前月取引日.
000450     05  ()前月取引日－世紀       PIC S9(1).
000460     05  ()前月取引日－年月日     PIC S9(6).
000470    03  ()期末取引日.
000480     05  ()期末取引日－世紀       PIC S9(1).
000490     05  ()期末取引日－年月日     PIC S9(6).
000500    03  FILLER           PIC  X(3).
000510    03  ()共通情報               PIC  X(35).
