000010************************************************
000020* 流動化用債権残高ファイル(CPBIS148)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()流動化ＩＤ             PIC  X(7).
000060     05  ()契約番号               PIC S9(9).
000070    03  ()再リースコード         PIC S9(1).
000080    03  ()解約区分               PIC  X(1).
000090    03  ()解約日.
000100     05  ()解約日－世紀区分       PIC  X(1).
000110     05  ()解約日－年             PIC  X(2).
000120     05  ()解約日－月             PIC  X(2).
000130     05  ()解約日－日             PIC  X(2).
000140    03  ()勘定処理コード         PIC S9(2).
000150    03  ()ファイナンス開始.
000160     05  ()ファイナンス開始－世紀区分 PIC  X(1).
000170     05  ()ファイナンス開始－年   PIC  X(2).
000180     05  ()ファイナンス開始－月   PIC  X(2).
000190    03  ()ファイナンス終了.
000200     05  ()ファイナンス終了－世紀区分 PIC  X(1).
000210     05  ()ファイナンス終了－年   PIC  X(2).
000220     05  ()ファイナンス終了－月   PIC  X(2).
000230    03  ()ファイナンス期間       PIC S9(3).
000240    03  ()債権残高               PIC S9(13)  SIGN LEADING SEPARATE.
000250    03  ()一部解約金額           PIC S9(13)  SIGN LEADING SEPARATE.
000260    03  FILLER           PIC  X(46).
