000010************************************************
000020* ’nˆÊ³Œp(CPBIS141)
000030************************************************
000040    03  ()‚j‚d‚x.
000050     05  ()Œ³Œ_–ñ‚m‚n             PIC  X(9).
000060     05  ()³Œp‹æ•ª               PIC  X(1).
000070     05  ()Œ³•¨Œ‚m‚n             PIC S9(3).
000080     05  ()Œ³Å—¦                 PIC S9(2)V9(1).
000090     05  ()Š¨’èˆ—‚b‚c           PIC S9(2).
000100     05  ()Œ_–ñ‚m‚n               PIC  X(9).
000110     05  ()•¨Œ‚m‚n               PIC S9(3).
000120    03  ()ˆ—‹æ•ª               PIC  X(1).
000130    03  ()ˆ—Š®—¹Ï‹æ•ª         PIC  X(1).
000140    03  ()Ž–‹ÆŠ‚b‚c             PIC S9(4).
000150    03  ()ƒ†[ƒU[‚b‚c           PIC  X(8).
000160    03  ()¿‹æ‚b‚c             PIC  X(8).
000170    03  ()Å—¦                   PIC S9(2)V9(1).
000180    03  ()¿‹‹æ•ª‚Q             PIC S9(1).
000190    03  ()‹âs‚b‚c               PIC  X(7).
000200    03  ()—a‹àŽí—Þ               PIC  X(1).
000210    03  ()ŒûÀ”Ô†               PIC  X(7).
000220    03  ()“ü‹à“ú                 PIC S9(2).
000230    03  ()w“ü‹àŠz               PIC S9(13).
000240    03  ()ŒÂ•ÊƒŠ[ƒX—¿           PIC S9(13).
000250    03  ()”[•tæ‚b‚c             PIC  X(6).
000260    03  ()”—Ê                   PIC S9(4).
000270    03  ()Ý’uêŠ–¼ƒJƒi         PIC  X(20).
000280    03  ()•¨Œ–¼ƒJƒi             PIC  X(30).
000290    03  ()ÄƒŠ[ƒX‚b‚c           PIC S9(1).
000300    03  ()³Œp•ªŠ„Œ”           PIC S9(2).
000310    03  ()Ž‘ŽY‚b‚c               PIC S9(7).
000320    03  ()“®‘•ÛŒ¯‚b‚c.
000330     05  ()•ÛŒ¯‰ïŽÐ‚b‚c           PIC  X(1).
000340     05  ()•ÛŒ¯—¿Ží•Ê             PIC  X(3).
000350    03  ()M—p•ÛŒ¯‚b‚c.
000360     05  ()•t•Û‹æ•ª               PIC  X(1).
000370     05  ()ƒŠ[ƒXŠ„•Š‹æ•ª         PIC  X(1).
000380     05  ()‹@ŠB‹æ•ª               PIC  X(2).
000390     05  ()‹@Ží–¼”Ô†             PIC  X(2).
000400    03  ()Œ^Ž®”Ô†               PIC  X(15).
000410    03  FILLER           PIC  X(18).
