000010************************************************
000020* 契約（展開情報）(CPBIS033)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()請求コード             PIC S9(2).
000070    03  ()ＳＥＱ番号             PIC S9(3).
000080    03  ()展開リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000090    03  ()回数                   PIC S9(3)  SIGN LEADING SEPARATE.
000100    03  FILLER           PIC  X(12).
