000010************************************************
000020* 契約（物件情報）(CPBIS034)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()請求コード             PIC S9(2).
000070    03  ()ＫＥＹ項目物件番号     PIC S9(3).
000080    03  ()物件名漢字             PIC  X(60).
000090    03  ()物件名カナ             PIC  X(30).
000100    03  ()仕様製造番号           PIC  X(20).
000110    03  ()数量                   PIC S9(4)  SIGN LEADING SEPARATE.
000120    03  ()購入先情報.
000130     05  ()購入先コード           PIC  X(8).
000140     05  ()購入金額               PIC S9(13)  SIGN LEADING SEPARATE.
000150    03  ()ディーラー             PIC  X(5).
000160    03  ()残価情報.
000170     05  ()残価保証区分           PIC S9(1).
000180     05  ()残価保証先コード       PIC  X(8).
000190     05  ()残価保証先名漢字       PIC  X(60).
000200     05  ()残価額                 PIC S9(13)  SIGN LEADING SEPARATE.
000210    03  ()個別リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000220    03  FILLER           PIC  X(25).
000230    03  ()償却情報.
000240     05  ()資産コード             PIC S9(7).
000250     05  ()耐用年数               PIC S9(2)  SIGN LEADING SEPARATE.
000260     05  ()特例.
000270      07  ()期間                   PIC  X(2).
000280      07  ()率.
000290       09  ()分子                   PIC S9(2)  SIGN LEADING SEPARATE.
000300       09  ()分母                   PIC S9(3)  SIGN LEADING SEPARATE.
000310      07  ()中古資産コード         PIC S9(1).
000320    03  ()納付先情報.
000330     05  ()納付先コード           PIC  X(6).
000340     05  ()税区分                 PIC S9(1).
000350     05  ()税負担コード           PIC  X(1).
000360     05  ()耐用年数短縮           PIC  X(1).
000370     05  ()設置場所名漢字         PIC  X(40).
000380     05  ()設置場所名カナ         PIC  X(20).
000390     05  ()設置場所郵便番号.
000400      07  ()親                     PIC  X(3).
000410      07  ()子                     PIC  X(4).
000420     05  ()設置場所住所漢字       PIC  X(100).
000430     05  ()動産保険情報.
000440      07  ()保険会社コード         PIC  X(1).
000450      07  ()保険料種別             PIC  X(3).
000460    03  ()信用保険情報.
000470     05  ()信用保険コード.
000480      07  ()付保区分               PIC  X(1).
000490      07  ()リースＸＸ区分         PIC  X(1).
000500      07  ()機械区分               PIC  X(2).
000510      07  ()機種区分               PIC  X(2).
000520     05  ()型式番号               PIC  X(15).
000530    03  ()仕入消費税額           PIC S9(13)  SIGN LEADING SEPARATE.
000540    03  FILLER           PIC  X(30).
000550    03  ()リファレンス情報.
000560     05  ()ユーザリファレンスＮＯ１ PIC  X(12).
000570     05  ()ユーザリファレンスＮＯ２ PIC  X(12).
000580     05  ()ユーザリファレンスＮＯ３ PIC  X(12).
000590     05  ()ユーザリファレンスＮＯ４ PIC  X(12).
000600    03  ()支払先コード           PIC  X(4).
000610    03  FILLER           PIC  X(8).
000620    03  ()処理年月度.
000630     05  ()処理年月度ー世紀       PIC  X(1).
000640     05  ()処理年月度ー年月       PIC  X(4).
000650    03  ()共通情報               PIC  X(35).
