000010************************************************
000020* 名称マスタ（事業所名)(CPBIS123)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()事業所コード           PIC S9(4).
000100      07  FILLER           PIC  X(7).
000110    03  ()部支店名               PIC  X(20).
000120    03  ()部支店名略称           PIC  X(10).
000130    03  ()部支店名カナ           PIC  X(25).
000140    03  ()部支店名カナ略称       PIC  X(12).
000150    03  ()適用日.
000160     05  ()適用日－世紀           PIC S9(1).
000170     05  ()適用日－年月日         PIC S9(6).
000180    03  ()電話番号               PIC  X(15).
000190    03  ()グループＮＯ           PIC  X(2).
000200    03  FILLER           PIC  X(59).
000210    03  ()共通情報               PIC  X(35).
