000010************************************************
000020* 資産（資産明細）(CPBIS049)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()物件ＮＯ               PIC S9(3).
000070     05  ()解約区分               PIC  X(1).
000080     05  ()再生区分               PIC  X(1).
000090    03  ()再リースコード         PIC S9(1).
000100    03  ()リース開始日.
000110     05  ()リース開始日－世紀     PIC S9(1).
000120     05  ()リース開始日－年月日   PIC  X(6).
000130    03  ()リース終了日.
000140     05  ()リース終了日－世紀     PIC S9(1).
000150     05  ()リース終了日－年月日   PIC  X(6).
000160    03  ()ファイナンス終了日.
000170     05  ()ファイナンス終了日－世紀 PIC S9(1).
000180     05  ()ファイナンス終了日－年月日 PIC  X(6).
000190    03  ()リース期間             PIC S9(3)  SIGN LEADING SEPARATE.
000200    03  ()勘定処理コード         PIC S9(2).
000210    03  ()資産コード             PIC S9(7).
000220    03  ()中古資産コード         PIC S9(1).
000230    03  ()資産処分コード         PIC  X(1).
000240    03  ()耐用年数               PIC S9(2).
000250    03  ()付保区分.
000260     05  ()付保区分－動産総合     PIC  X(1).
000270     05  ()付保区分－信用保険     PIC  X(1).
000280    03  ()数量                   PIC S9(4)  SIGN LEADING SEPARATE.
000290    03  ()個別リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000300    03  ()個別契約金額           PIC S9(13)  SIGN LEADING SEPARATE.
000310    03  ()残価情報.
000320     05  ()残価情報－残価保証区分 PIC S9(1).
000330     05  ()残価情報－残価保証先コード PIC  X(8).
000340     05  ()残価情報－残価保証先名 PIC  X(60).
000350     05  ()残価情報－残価額１保証 PIC S9(13)  SIGN LEADING SEPARATE.
000360     05  ()残価情報－残価額２見積 PIC S9(13)  SIGN LEADING SEPARATE.
000370     05  ()残価情報－継続リース償却対象額 PIC S9(13)  SIGN LEADING SEPARATE.
000380    03  FILLER           PIC  X(8).
000390    03  ()物件名漢字             PIC  X(60).
000400    03  ()物件名カナ             PIC  X(30).
000410    03  ()仕様製造番号           PIC  X(20).
000420    03  ()解約情報.
000430     05  ()解約対象コード         PIC  X(1).
000440     05  ()解約処理コード         PIC  X(1).
000450     05  ()解約日.
000460      07  ()解約日－世紀           PIC S9(1).
000470      07  ()解約日－年月日         PIC  X(6).
000480    03  ()処理日再リース継続リース.
000490     05  ()処理日再リース継続リース世紀 PIC S9(1).
000500     05  ()処理日再リース継続リース年月日 PIC  X(6).
000510    03  ()再リース周回コード     PIC S9(1).
000520    03  FILLER           PIC  X(3).
000530    03  ()購入先情報.
000540     05  ()購入先コード           PIC  X(8).
000550     05  ()購入先金額             PIC S9(13)  SIGN LEADING SEPARATE.
000560     05  ()仕入消費税             PIC S9(13)  SIGN LEADING SEPARATE.
000570    03  ()ディーラーコード       PIC  X(5).
000580    03  FILLER           PIC  X(13).
000590    03  ()リファレンス情報.
000600     05  ()ユーザリファレンスＮＯ１ PIC  X(12).
000610     05  ()ユーザリファレンスＮＯ２ PIC  X(12).
000620     05  ()ユーザリファレンスＮＯ３ PIC  X(12).
000630     05  ()ユーザリファレンスＮＯ４ PIC  X(12).
000640    03  FILLER           PIC  X(57).
000650    03  ()地位承継情報.
000660     05  ()承継区分               PIC  X(1).
000670     05  ()元物件ＮＯ             PIC  X(3).
000680     05  ()承継日.
000690      07  ()承継日世紀             PIC  X(1).
000700      07  ()承継日年月日           PIC  X(6).
000710    03  ()読込ＳＥＱ             PIC S9(7)  SIGN LEADING SEPARATE.
000720    03  ()処理年月度.
000730     05  ()処理年月度－世紀       PIC S9(1).
000740     05  ()処理年月度－年月       PIC  X(4).
000750    03  ()共通情報               PIC  X(35).
000760    03  ()保険情報.
000770     05  ()保険情報－保険会社コード PIC  X(1).
000780     05  ()保険情報－保険料種別   PIC  X(3).
000790    03  ()保険新規継続区分       PIC  X(1).
000800    03  ()事故有無区分           PIC  X(1).
000810    03  ()付保日.
000820     05  ()付保日－世紀           PIC S9(1).
000830     05  ()付保日－年月日         PIC  X(6).
000840    03  ()事故日.
000850     05  ()事故日－世紀           PIC S9(1).
000860     05  ()事故日－年月日         PIC  X(6).
000870    03  ()無事故戻し日.
000880     05  ()無事故戻し日－世紀     PIC S9(1).
000890     05  ()無事故戻し日－年月日   PIC  X(6).
000900    03  ()規定損害金ＵＰ率       PIC S9(2)V9(7).
000910    03  ()動総保険価格           PIC S9(13)  SIGN LEADING SEPARATE.
000920    03  ()動総保険料             PIC S9(13)  SIGN LEADING SEPARATE.
000930    03  ()動総払戻し保険料       PIC S9(13)  SIGN LEADING SEPARATE.
000940    03  ()動総無事故戻し料       PIC S9(13)  SIGN LEADING SEPARATE.
000950    03  ()動総申込明細情報.
000960     05  ()当年度.
000970      07  ()動総申込明細情報－当年度ページ PIC S9(5)  SIGN LEADING SEPARATE.
000980      07  ()動総申込明細情報－当年度桁数 PIC S9(2)  SIGN LEADING SEPARATE.
000990     05  ()前年度.
001000      07  ()動総申込明細情報－前年度ページ PIC S9(5)  SIGN LEADING SEPARATE.
001010      07  ()動総申込明細情報－前年度桁数 PIC S9(2)  SIGN LEADING SEPARATE.
001020     05  FILLER           PIC  X(8).
001030    03  ()再リース付保率         PIC S9(2)  SIGN LEADING SEPARATE.
001040    03  ()動総保険料率           PIC S9(3)V9(6)  SIGN LEADING SEPARATE.
001050    03  FILLER           PIC  X(10).
001060    03  ()信用保険コード.
001070     05  ()信用保険コード－リース割賦区分 PIC  X(1).
001080     05  ()信用保険コード－機械区分 PIC  X(2).
001090     05  ()信用保険コード－機種名番号 PIC  X(2).
001100    03  ()型式番号               PIC  X(15).
001110    03  ()通知書送付日.
001120     05  ()通知書送付日－世紀     PIC S9(1).
001130     05  ()通知書送付日－年月日   PIC  X(6).
001140    03  ()符号一連番号           PIC  X(5).
001150    03  ()信用保険料             PIC S9(13)  SIGN LEADING SEPARATE.
001160    03  ()動総保険証券番号       PIC  X(11).
001170    03  FILLER           PIC  X(15).
001180    03  ()保険情報－処理年月度.
001190     05  ()保険情報－処理年月度－世紀 PIC S9(1).
001200     05  ()保険情報－処理年月度－年月 PIC  X(4).
001210    03  ()固定資産申告情報.
001220     05  ()納付先コード           PIC  X(6).
001230     05  ()税区分                 PIC S9(1).
001240     05  ()税負担区分             PIC  X(1).
001250     05  ()耐用年数短縮区分       PIC  X(1).
001260     05  ()移動情報.
001270      07  ()移動情報－移動区分     PIC  X(1).
001280      07  ()移動情報－世紀         PIC S9(1).
001290      07  ()移動情報－年月日       PIC  X(6).
001300     05  FILLER           PIC  X(10).
001310    03  ()償却資産税申告.
001320     05  ()特例.
001330      07  ()特例－期間             PIC S9(2)  SIGN LEADING SEPARATE.
001340      07  ()特例－率.
001350       09  ()特例－分子             PIC S9(2)  SIGN LEADING SEPARATE.
001360       09  ()特例－分母             PIC S9(3)  SIGN LEADING SEPARATE.
001370     05  ()年税額                 PIC S9(13)  SIGN LEADING SEPARATE.
001380     05  ()前年度評価額           PIC S9(13)  SIGN LEADING SEPARATE.
001390     05  ()前年度理論簿価         PIC S9(13)  SIGN LEADING SEPARATE.
001400     05  ()当年度評価額           PIC S9(13)  SIGN LEADING SEPARATE.
001410     05  ()当年度理論簿価         PIC S9(13)  SIGN LEADING SEPARATE.
001420     05  ()特別課税標準額         PIC S9(13)  SIGN LEADING SEPARATE.
001430    03  ()前回申告先             PIC  X(6).
001440    03  ()設置場所名漢字         PIC  X(40).
001450    03  ()設置場所名カナ         PIC  X(20).
001460    03  ()設置場所郵便番号.
001470     05  ()設置場所郵便番号－親   PIC  X(3).
001480     05  ()設置場所郵便番号－子   PIC  X(4).
001490    03  ()設置場所住所漢字       PIC  X(100).
001500    03  FILLER           PIC  X(11).
001510    03  ()固定資産申告情報－処理年月度.
001520     05  ()固定資産申告情報処理年月度世紀 PIC S9(1).
001530     05  ()固定資産申告情報処理年月度年月 PIC  X(4).
001540    03  ()償却計算情報.
001550     05  ()償却計算会社.
001560      07  ()会社前期末簿価         PIC S9(13)  SIGN LEADING SEPARATE.
001570      07  ()会社当月償却高         PIC S9(13)  SIGN LEADING SEPARATE.
001580      07  ()会社当期償却高         PIC S9(13)  SIGN LEADING SEPARATE.
001590      07  ()会社現在簿価           PIC S9(13)  SIGN LEADING SEPARATE.
001600     05  FILLER           PIC  X(10).
001610    03  ()償却計算法定.
001620     05  ()税法償却区分           PIC S9(2).
001630     05  ()税法割増区分           PIC S9(2).
001640     05  ()税法特別償却率.
001650      07  ()税法特別償却率－分子   PIC S9(2)  SIGN LEADING SEPARATE.
001660      07  ()税法特別償却率－分母   PIC S9(3)  SIGN LEADING SEPARATE.
001670     05  ()税法前期末簿価法定     PIC S9(13)  SIGN LEADING SEPARATE.
001680     05  ()税法普通償却費         PIC S9(13)  SIGN LEADING SEPARATE.
001690     05  ()税法割増償却費         PIC S9(13)  SIGN LEADING SEPARATE.
001700     05  ()税法特別償却費         PIC S9(13)  SIGN LEADING SEPARATE.
001710     05  ()税法当期末簿価         PIC S9(13)  SIGN LEADING SEPARATE.
001720     05  ()税法繰越超過額         PIC S9(13)  SIGN LEADING SEPARATE.
001730     05  ()税法償却限度額         PIC S9(13)  SIGN LEADING SEPARATE.
001740    03  FILLER           PIC  X(15).
001750    03  ()理論簿価情報.
001760     05  ()会社理論前期末簿価     PIC S9(13)  SIGN LEADING SEPARATE.
001770     05  ()会社理論当期末簿価     PIC S9(13)  SIGN LEADING SEPARATE.
001780    03  ()当期償却過不足額       PIC S9(13)  SIGN LEADING SEPARATE.
001790    03  FILLER           PIC  X(28).
001800    03  ()償却計算情報－処理年月度.
001810     05  ()償却計算情報処理年月度世紀 PIC S9(1).
001820     05  ()償却計算情報処理年月度年月 PIC  X(4).
