000010************************************************
000020* コントロールデータ施設賠償責任保険ファイル(CPBIS199)
000030************************************************
000040    03  ()ＫＥＹ部.
000050     05  ()識別                   PIC  X(7).
000060     05  ()種別                   PIC  X(1).
000070     05  FILLER           PIC  X(7).
000080    03  ()データ部.
000090     05  ()保険単価円             PIC S9(3)  SIGN LEADING SEPARATE.
000100     05  FILLER           PIC  X(1).
000110     05  ()ユーザーコード.
000120      07  ()ユーザーコード１       PIC  X(8).
000130      07  FILLER           PIC  X(1).
000140      07  ()ユーザーコード２       PIC  X(8).
000150      07  FILLER           PIC  X(1).
000160      07  ()ユーザーコード３       PIC  X(8).
000170      07  FILLER           PIC  X(1).
000180      07  ()ユーザーコード４       PIC  X(8).
000190      07  FILLER           PIC  X(1).
000200      07  ()ユーザーコード５       PIC  X(8).
000210      07  FILLER           PIC  X(1).
000220     05  ()適用年月               PIC  X(5).
000230     05  ()再リース出力区分       PIC  X(1).
