000010************************************************
000020* コードマスタ(手形印紙税メンバー)(CPBIS011)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  FILLER           PIC  X(11).
000070    03  ()ＫＥＹ.
000080     05  ()テーブル区分           PIC  X(1).
000090     05  ()ＳＥＱＮＯ             PIC S9(7).
000100    03  ()手形印紙税テーブル.
000110     05  ()テーブル                          OCCURS 5.
000120      07  ()範囲金額以下           PIC S9(11)  SIGN LEADING SEPARATE.
000130      07  ()印紙税                 PIC S9(7)  SIGN LEADING SEPARATE.
000140    03  FILLER           PIC  X(7).
000150    03  ()共通情報               PIC  X(35).
