000010************************************************
000020* 名称マスタ（契約形態名)(CPBIS119)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()契約形態コード         PIC  X(2).
000100      07  ()形態補助               PIC  X(1).
000110      07  FILLER           PIC  X(8).
000120    03  ()契約形態名             PIC  X(20).
000130    03  ()契約形態名略称         PIC  X(10).
000140    03  ()契約形態名カナ         PIC  X(25).
000150    03  ()契約形態名カナ略称     PIC  X(12).
000160    03  FILLER           PIC  X(83).
000170    03  ()共通情報               PIC  X(35).
