000010************************************************
000020* 債権流動化(CPBIS040)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()契約ＮＯ               PIC  X(9).
000060    03  ()スキーム情報.
000070     05  ()銀行コード             PIC  X(4).
000080     05  ()支店コード             PIC  X(3).
000090    03  ()名寄せコード           PIC  X(8).
000100    03  ()ユーザーコード         PIC  X(8).
000110    03  ()請求先コード           PIC  X(8).
000120    03  FILLER           PIC  X(25).
000130    03  ()共通情報               PIC  X(35).
