000010************************************************
000020* 借入金管理（借入金基本）(CPBIS054)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()管理ＮＯ               PIC  X(7).
000060     05  ()枝番                   PIC S9(2).
000070    03  ()フラグ.
000080     05  ()登録削除               PIC  X(1).
000090     05  FILLER           PIC  X(4).
000100    03  ()処理ステータス.
000110     05  ()届用区分               PIC  X(1).
000120     05  ()更新区分               PIC  X(1).
000130     05  ()新規書替区分           PIC  X(1).
000140     05  ()決済区分               PIC  X(1).
000150     05  ()決済方法               PIC  X(1).
000160     05  FILLER           PIC  X(5).
000170    03  ()基本情報.
000180     05  ()借入先コード           PIC  X(7).
000190     05  ()借入日.
000200      07  ()借入日－世紀           PIC S9(1).
000210      07  ()借入日－借入日         PIC S9(6).
000220     05  ()幣種                   PIC  X(3).
000230     05  ()借入金額               PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000240     05  ()ＥＸ区分               PIC  X(4).
000250     05  ()換算相場               PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000260     05  ()円貨金額               PIC S9(13)  SIGN LEADING SEPARATE.
000270     05  ()対価ＦＩＸ             PIC  X(1).
000280     05  ()借入形態               PIC  X(1).
000290     05  ()長短区分               PIC  X(1).
000300     05  ()借入勘定コード         PIC  X(1).
000310     05  ()前払後払区分           PIC  X(1).
000320     05  ()利率基数               PIC  X(1).
000330     05  ()片端両端区分           PIC  X(1).
000340     05  ()端数処理               PIC  X(1).
000350     05  ()金利変更基準           PIC  X(1).
000360     05  ()借入種別               PIC  X(1).
000370     05  ()納付区分               PIC  X(1).
000380     05  ()利息基準日.
000390      07  ()利息基準日－世紀       PIC S9(1).
000400      07  ()利息基準日－年月日     PIC S9(6).
000410     05  ()利率                   PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
000420     05  ()入金情報.
000430      07  ()入金情報短縮コード     PIC  X(2).
000440      07  ()入金口座.
000450       09  ()入金口座銀行コード     PIC  X(7).
000460       09  ()入金口座預金種目       PIC  X(1).
000470       09  ()入金口座口座番号       PIC  X(7).
000480     05  FILLER           PIC  X(15).
000490    03  ()残高情報.
000500     05  ()残高情報－元本残高     PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000510     05  ()残高情報－換算相場     PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000520     05  ()残高情報－円貨残高終値 PIC S9(13)  SIGN LEADING SEPARATE.
000530     05  ()残高情報－未返済展開数 PIC S9(3).
000540     05  ()残高情報－前月換算相場 PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000550     05  FILLER           PIC  X(10).
000560    03  ()展開情報.
000570     05  ()休日対応区分           PIC  X(1).
000580     05  ()約定日計算             PIC  X(1).
000590     05  ()わかち計算             PIC  X(1).
000600     05  ()利率変更日             PIC S9(2).
000610     05  ()返済基準日             PIC S9(2).
000620     05  ()連動金利区分           PIC  X(2).
000630     05  ()ＳＰＲＥＡＤ           PIC S9(3)V9(5)  SIGN LEADING SEPARATE.
000640     05  ()利払サイクル           PIC S9(3).
000650     05  ()初回内入日.
000660      07  ()初回内入日－世紀       PIC S9(1).
000670      07  ()初回内入日－年月日     PIC S9(6).
000680     05  ()内入サイクル           PIC S9(3).
000690     05  ()内入回数               PIC S9(3).
000700     05  ()内入金額               PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000710     05  FILLER           PIC  X(15).
000720    03  ()総計情報.
000730     05  ()期日.
000740      07  ()期日－世紀             PIC S9(1).
000750      07  ()期日－年月日           PIC S9(6).
000760     05  ()金利変動区分           PIC  X(1).
000770     05  ()資産使途区分           PIC  X(1).
000780     05  ()資金原価区分           PIC  X(1).
000790     05  ()担保区分               PIC  X(1).
000800     05  ()約定弁済区分           PIC  X(1).
000810     05  ()ＧＡＰ分析表区分       PIC  X(1).
000820     05  ()ＭＵＬＴＩＣＵＲＲＥＮＣＹ PIC  X(1).
000830     05  ()ＰＲＥＰＡＹＭＥＮＴ   PIC  X(1).
000840     05  ()選択金利期間           PIC  X(20).
000850     05  ()ＲＥＭＡＲＫＳ         PIC  X(20).
000860     05  ()原債務情報.
000870      07  ()原債務借入先コード     PIC  X(7).
000880      07  ()原債務幣種             PIC  X(3).
000890      07  ()原債務借入金額         PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000900      07  ()原債務ＥＸ区分         PIC  X(4).
000910      07  ()原債務換算相場         PIC S9(3)V9(6)  SIGN LEADING SEPARATE.
000920      07  ()原債務円貨金額         PIC S9(13)  SIGN LEADING SEPARATE.
000930      07  ()原債務対価ＦＩＸ       PIC  X(1).
000940     05  ()支払情報.
000950      07  ()支払情報返済方法       PIC  X(1).
000960      07  ()支払情報短縮コード     PIC  X(2).
000970      07  ()支払口座.
000980       09  ()支払口座銀行コード     PIC  X(7).
000990       09  ()支払口座預金種目       PIC  X(1).
001000       09  ()支払口座口座番号       PIC  X(7).
001010     05  ()変更情報.
001020      07  ()新借入種別.
001030       09  ()新借入種別変更日.
001040        11  ()新借入種別変更日－世紀 PIC S9(1).
001050        11  ()新借入種別変更日－年月日 PIC S9(6).
001060       09  ()変更借入種別           PIC  X(1).
001070      07  ()新納付区分.
001080       09  ()新納付区分変更日.
001090        11  ()新納付区分変更日-世紀 PIC S9(1).
001100        11  ()新納付区分変更日-年月日 PIC S9(6).
001110       09  ()未記入                 PIC  X(1).
001120      07  FILLER           PIC  X(15).
001130    03  ()書替情報.
001140     05  ()書替日.
001150      07  ()書替日－世紀           PIC S9(1).
001160      07  ()書替日－年月日         PIC S9(6).
001170     05  ()旧借入情報                        OCCURS 3.
001180      07  ()旧借入情報－管理ＮＯ   PIC  X(7).
001190      07  ()旧借入情報－枝番       PIC S9(2).
001200      07  ()旧借入情報－借入勘定コード PIC  X(1).
001210      07  ()旧借入情報－元本残高   PIC S9(13)  SIGN LEADING SEPARATE.
001220      07  ()旧借入情報－利息額     PIC S9(13)  SIGN LEADING SEPARATE.
001230     05  ()書替情報－書替方法     PIC  X(1).
001240     05  ()書替情報－返済方法     PIC  X(1).
001250     05  ()書替情報－短縮コード   PIC  X(2).
001260     05  ()書替情報－支払口座.
001270      07  ()銀行コード             PIC  X(7).
001280      07  ()預金種目               PIC  X(1).
001290      07  ()口座番号               PIC  X(7).
001300     05  FILLER           PIC  X(15).
001310    03  ()決済情報.
001320     05  ()決済日.
001330      07  ()決済日－世紀           PIC S9(1).
001340      07  ()決済日－年月日         PIC S9(6).
001350     05  ()決済情報－元本残高     PIC S9(13)  SIGN LEADING SEPARATE.
001360     05  ()決済情報－利息額       PIC S9(13)  SIGN LEADING SEPARATE.
001370     05  ()決済情報－戻し利息額   PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
001380     05  ()決済情報－利率         PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
001390     05  ()決済情報－日数         PIC S9(4).
001400     05  ()決済情報－戻し利息相殺コード PIC  X(1).
001410    03  FILLER           PIC  X(62).
001420    03  ()共通情報               PIC  X(35).
