000010************************************************
000020* 名称マスタ（ポッカ・メーカー名）(CPBIS111)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()メーカーコード         PIC  X(2).
000100      07  FILLER           PIC  X(9).
000110    03  ()購入先コード           PIC  X(8).
000120    03  ()購入先名               PIC  X(40).
000130    03  ()支払繰延月数           PIC S9(3)V9(2)  SIGN LEADING SEPARATE.
000140    03  ()支払先コード           PIC  X(4).
000150    03  FILLER           PIC  X(94).
000160    03  ()共通情報               PIC  X(35).
