000010************************************************
000020* 解約履歴資産ファイル(CPFKAIRC)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()解約日                 PIC  X(7).
000070     05  ()解約処理コード         PIC  X(1).
000080     05  ()物件ＮＯ               PIC S9(3).
000090     05  ()解約区分               PIC  X(1).
000100    03  ()基本部                 PIC  X(200).
000110    03  ()明細部                 PIC  X(500).
000120    03  ()保険部                 PIC  X(200).
000130    03  ()償却部                 PIC  X(200).
000140    03  ()固定資産税部           PIC  X(300).
000150    03  FILLER           PIC  X(79).
