000010************************************************
000020* (ELP_LONMST)
000030************************************************
000040 01  ()LONNUM           PIC  X(5).
000050 01  ()LONTYP           PIC  X(1).
000060 01  ()DIVCOD           PIC  X(4).
000070 01  ()PSNCOD           PIC  X(7).
000080 01  ()PSNNAM           PIC  N(9).
000090 01  ()LONDAY           PIC  X(8).
000100 01  ()REPDAY           PIC  X(8).
000110 01  ()OBJCOD           PIC  X(1).
000120 01  ()LONTRM           PIC S9(3) COMP-3.
000130 01  ()FRZTRM           PIC S9(3) COMP-3.
000140 01  ()LONAMT           PIC S9(13) COMP-3.
000150 01  ()INTRAT           PIC S9(2)V9(6) COMP-3.
000160 01  ()SALAMT           PIC S9(13) COMP-3.
000170 01  ()SALINT           PIC S9(13) COMP-3.
000180 01  ()SALCAP           PIC S9(13) COMP-3.
000190 01  ()SALBAL           PIC S9(13) COMP-3.
000200 01  ()SALREP           PIC S9(13) COMP-3.
000210 01  ()BNSAMT           PIC S9(13) COMP-3.
000220 01  ()BNSINT           PIC S9(13) COMP-3.
000230 01  ()BNSCAP           PIC S9(13) COMP-3.
000240 01  ()BNSBAL           PIC S9(13) COMP-3.
000250 01  ()BNSREP           PIC S9(13) COMP-3.
000260 01  ()DLYINT           PIC S9(13) COMP-3.
000270 01  ()REMARK           PIC  N(20).
000280 01  ()REGDAY           PIC  X(8).
000290 01  ()REGTIM           PIC  X(6).
000300 01  ()REGPSN           PIC  X(4).
000310 01  ()MODDAY           PIC  X(8).
000320 01  ()MODTIM           PIC  X(6).
000330 01  ()MODPSN           PIC  X(4).
