000010************************************************
000020* (EMC_GINKO)
000030************************************************
000040 01  ()銀行短縮コード         PIC  X(2).
000050 01  ()銀行コード             PIC  X(4).
000060 01  ()支店コード             PIC  X(3).
000070 01  ()銀行名                 PIC  N(15).
000080 01  ()支店名                 PIC  N(15).
000090 01  ()預金種類               PIC  X(1).
000100 01  ()口座番号               PIC  X(7).
000110 01  ()口座名                 PIC  N(20).
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
