000010************************************************
000020* (EMC_JUSYO_DAIRI)
000030************************************************
000040 01  ()請求先コード           PIC  X(8).
000050 01  ()ユーザーコード         PIC  X(8).
000060 01  ()名寄せコード           PIC  X(8).
000070 01  ()郵便番号               PIC  X(7).
000080 01  ()住所１                 PIC  N(20).
000090 01  ()住所２                 PIC  N(20).
000100 01  ()取引先名               PIC  N(20).
000110 01  ()部署名                 PIC  N(20).
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
