000010************************************************
000020* (EMC_HOSYU)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()請求コード             PIC  X(2).
000060 01  ()名寄せコード           PIC  X(8).
000070 01  ()ユーザーコード         PIC  X(8).
000080 01  ()物件名                 PIC  X(30).
000090 01  ()保守料                 PIC S9(13) COMP-3.
000100 01  ()消費税                 PIC S9(13) COMP-3.
000110 01  ()税率                   PIC S9(2)V9(1) COMP-3.
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
