000010************************************************
000020* (EXP_SIMADD)
000030************************************************
000040 01  ()TRNNUM           PIC  X(4).
000050 01  ()EXTNUM           PIC  X(2).
000060 01  ()DIVCOD           PIC  X(4).
000070 01  ()CNTNUM           PIC  X(7).
000080 01  ()PAYDAY           PIC  X(8).
000090 01  ()PAYBGN           PIC  X(6).
000100 01  ()PAYEND           PIC  X(6).
000110 01  ()FIXDAY           PIC  X(2).
000120 01  ()FISYER           PIC  X(4).
000130 01  ()ACCCOD           PIC  X(5).
000140 01  ()ACCEXT           PIC  X(2).
000150 01  ()PAYTYP           PIC  X(1).
000160 01  ()PAYCYC           PIC  X(2).
000170 01  ()CLTCOD           PIC  X(8).
000180 01  ()FRMNAM           PIC  N(25).
000190 01  ()ITMNAM           PIC  N(25).
000200 01  ()DEMFLG           PIC  X(1).
000210 01  ()RCVFLG           PIC  X(1).
000220 01  ()PAYCNT           PIC S9(3) COMP-3.
000230 01  ()PAYAMT           PIC S9(13) COMP-3.
