000010************************************************
000020* (EXP_SIMACT)
000030************************************************
000040 01  ()TRNNUM           PIC  X(4).
000050 01  ()EXTNUM           PIC  X(2).
000060 01  ()RECNUM           PIC  X(4).
000070 01  ()DIVCOD           PIC  X(4).
000080 01  ()ADDNUM           PIC  X(4).
000090 01  ()ADDEXT           PIC  X(2).
000100 01  ()PAYDAY           PIC  X(8).
000110 01  ()PAYMON           PIC  X(6).
000120 01  ()FISYER           PIC  X(4).
000130 01  ()ACCCOD           PIC  X(5).
000140 01  ()ACCEXT           PIC  X(2).
000150 01  ()PAYTYP           PIC  X(1).
000160 01  ()APRNUM           PIC  X(10).
000170 01  ()CLTCOD           PIC  X(8).
000180 01  ()FRMNAM           PIC  N(25).
000190 01  ()ITMNAM           PIC  N(25).
000200 01  ()REMAK1           PIC  N(25).
000210 01  ()REMAK2           PIC  N(25).
000220 01  ()DEMFLG           PIC  X(1).
000230 01  ()RCVFLG           PIC  X(1).
000240 01  ()AUTFLG           PIC  X(1).
000250 01  ()TAXTYP           PIC  X(1).
000260 01  ()ITMCNT           PIC S9(3) COMP-3.
000270 01  ()PAYAMT           PIC S9(13) COMP-3.
000280 01  ()CONTAX           PIC S9(13) COMP-3.
000290 01  ()TOTAMT           PIC S9(13) COMP-3.
000300 01  ()UNTPRC           PIC S9(13) COMP-3.
000310 01  ()PAYFIS           PIC S9(13) COMP-3.
000320 01  ()ADDDAY           PIC  X(8).
000330 01  ()ADDTIM           PIC  X(6).
000340 01  ()ADDPSN           PIC  X(4).
000350 01  ()MODDAY           PIC  X(8).
000360 01  ()MODTIM           PIC  X(6).
000370 01  ()MODPSN           PIC  X(4).
