000010************************************************
000020* (EXT_PRTWRK)
000030************************************************
000040 01  ()納付先コード           PIC  X(6).
000050 01  ()納付先名               PIC  X(20).
000060 01  ()銀行コード             PIC  X(4).
000070 01  ()銀行名                 PIC  X(30).
000080 01  ()銀行名カナ             PIC  X(15).
000090 01  ()報償金区分             PIC  X(1).
000100 01  ()納付方法               PIC  X(1).
000110 01  ()自動引落               PIC  X(1).
000120 01  ()納付期限１             PIC  X(8).
000130 01  ()納付期限２             PIC  X(8).
000140 01  ()納付期限３             PIC  X(8).
000150 01  ()納付期限４             PIC  X(8).
000160 01  ()納付日１               PIC  X(8).
000170 01  ()納付日２               PIC  X(8).
000180 01  ()納付日３               PIC  X(8).
000190 01  ()納付日４               PIC  X(8).
000200 01  ()報償金入金日           PIC  X(8).
000210 01  ()基準年                 PIC  X(4).
000220 01  ()不動産税区分           PIC  X(1).
000230 01  ()処理区分               PIC  X(1).
000240 01  ()作業区分               PIC  X(2).
000250 01  ()更新標識               PIC  X(1).
000260 01  ()税率                   PIC S9(1)V9(3) COMP-3.
000270 01  ()課税標準額             PIC S9(13) COMP-3.
000280 01  ()税額                   PIC S9(13) COMP-3.
000290 01  ()報償金                 PIC S9(13) COMP-3.
000300 01  ()納付金額１             PIC S9(13) COMP-3.
000310 01  ()納付金額２             PIC S9(13) COMP-3.
000320 01  ()納付金額３             PIC S9(13) COMP-3.
000330 01  ()納付金額４             PIC S9(13) COMP-3.
000340 01  ()不動産税額             PIC S9(13) COMP-3.
000350 01  ()不動産税報償金         PIC S9(13) COMP-3.
000360 01  ()分割納付限度           PIC S9(13) COMP-3.
