000010************************************************
000020* (EXT_MODLST)
000030************************************************
000040 01  ()作業区分               PIC  X(1).
000050 01  ()処理時刻               PIC  X(6).
000060 01  ()納付先コード           PIC  X(6).
000070 01  ()納付先名               PIC  X(20).
000080 01  ()銀行コード             PIC  X(4).
000090 01  ()銀行名                 PIC  X(30).
000100 01  ()銀行名カナ             PIC  X(15).
000110 01  ()報償金区分             PIC  X(1).
000120 01  ()納付方法               PIC  X(1).
000130 01  ()自動引落               PIC  X(1).
000140 01  ()納付期限１             PIC  X(8).
000150 01  ()納付期限２             PIC  X(8).
000160 01  ()納付期限３             PIC  X(8).
000170 01  ()納付期限４             PIC  X(8).
000180 01  ()納付日１               PIC  X(8).
000190 01  ()納付日２               PIC  X(8).
000200 01  ()納付日３               PIC  X(8).
000210 01  ()納付日４               PIC  X(8).
000220 01  ()報償金入金日           PIC  X(8).
000230 01  ()基準年                 PIC  X(4).
000240 01  ()不動産税区分           PIC  X(1).
000250 01  ()処理区分               PIC  X(1).
000260 01  ()印刷区分               PIC  X(2).
000270 01  ()更新標識               PIC  X(1).
000280 01  ()税率                   PIC S9(1)V9(3) COMP-3.
000290 01  ()課税標準額             PIC S9(13) COMP-3.
000300 01  ()税額                   PIC S9(13) COMP-3.
000310 01  ()報償金                 PIC S9(13) COMP-3.
000320 01  ()納付金額１             PIC S9(13) COMP-3.
000330 01  ()納付金額２             PIC S9(13) COMP-3.
000340 01  ()納付金額３             PIC S9(13) COMP-3.
000350 01  ()納付金額４             PIC S9(13) COMP-3.
000360 01  ()不動産税額             PIC S9(13) COMP-3.
000370 01  ()不動産税報償金         PIC S9(13) COMP-3.
000380 01  ()分割納付限度           PIC S9(13) COMP-3.
000390 01  ()納付先名_O           PIC  X(20).
000400 01  ()銀行コード_O         PIC  X(4).
000410 01  ()銀行名_O             PIC  X(30).
000420 01  ()銀行名カナ_O         PIC  X(15).
000430 01  ()報償金区分_O         PIC  X(1).
000440 01  ()納付方法_O           PIC  X(1).
000450 01  ()自動引落_O           PIC  X(1).
000460 01  ()納付期限１_O         PIC  X(8).
000470 01  ()納付期限２_O         PIC  X(8).
000480 01  ()納付期限３_O         PIC  X(8).
000490 01  ()納付期限４_O         PIC  X(8).
000500 01  ()納付日１_O           PIC  X(8).
000510 01  ()納付日２_O           PIC  X(8).
000520 01  ()納付日３_O           PIC  X(8).
000530 01  ()納付日４_O           PIC  X(8).
000540 01  ()報償金入金日_O       PIC  X(8).
000550 01  ()不動産税区分_O       PIC  X(1).
000560 01  ()処理区分_O           PIC  X(1).
000570 01  ()税率_O               PIC S9(1)V9(3) COMP-3.
000580 01  ()課税標準額_O         PIC S9(13) COMP-3.
000590 01  ()税額_O               PIC S9(13) COMP-3.
000600 01  ()報償金_O             PIC S9(13) COMP-3.
000610 01  ()納付金額１_O         PIC S9(13) COMP-3.
000620 01  ()納付金額２_O         PIC S9(13) COMP-3.
000630 01  ()納付金額３_O         PIC S9(13) COMP-3.
000640 01  ()納付金額４_O         PIC S9(13) COMP-3.
000650 01  ()不動産税額_O         PIC S9(13) COMP-3.
000660 01  ()不動産税報償金_O     PIC S9(13) COMP-3.
000670 01  ()納付先名_M           PIC  X(1).
000680 01  ()銀行コード_M         PIC  X(1).
000690 01  ()銀行名_M             PIC  X(1).
000700 01  ()銀行名カナ_M         PIC  X(1).
000710 01  ()報償金区分_M         PIC  X(1).
000720 01  ()納付方法_M           PIC  X(1).
000730 01  ()自動引落_M           PIC  X(1).
000740 01  ()納付期限１_M         PIC  X(1).
000750 01  ()納付期限２_M         PIC  X(1).
000760 01  ()納付期限３_M         PIC  X(1).
000770 01  ()納付期限４_M         PIC  X(1).
000780 01  ()納付日１_M           PIC  X(1).
000790 01  ()納付日２_M           PIC  X(1).
000800 01  ()納付日３_M           PIC  X(1).
000810 01  ()納付日４_M           PIC  X(1).
000820 01  ()報償金入金日_M       PIC  X(1).
000830 01  ()不動産税区分_M       PIC  X(1).
000840 01  ()処理区分_M           PIC  X(1).
000850 01  ()税率_M               PIC  X(1).
000860 01  ()課税標準額_M         PIC  X(1).
000870 01  ()税額_M               PIC  X(1).
000880 01  ()報償金_M             PIC  X(1).
000890 01  ()納付金額１_M         PIC  X(1).
000900 01  ()納付金額２_M         PIC  X(1).
000910 01  ()納付金額３_M         PIC  X(1).
000920 01  ()納付金額４_M         PIC  X(1).
000930 01  ()不動産税額_M         PIC  X(1).
000940 01  ()不動産税報償金_M     PIC  X(1).
