000010************************************************
000020* (EXT_BNKMST)
000030************************************************
000040 01  ()銀行コード             PIC  X(4).
000050 01  ()支店コード             PIC  X(3).
000060 01  ()付加コード             PIC  X(1).
000070 01  ()短縮コード             PIC  X(4).
000080 01  ()委託者コード           PIC  X(10).
000090 01  ()銀行名                 PIC  X(30).
000100 01  ()銀行名カナ             PIC  X(15).
000110 01  ()支店名                 PIC  X(30).
000120 01  ()支店名カナ             PIC  X(15).
000130 01  ()本店所在県             PIC  X(2).
000140 01  ()手形交換所             PIC  X(4).
000150 01  ()郵便番号               PIC  X(7).
000160 01  ()住所１                 PIC  X(40).
000170 01  ()住所２                 PIC  X(40).
000180 01  ()預金種類               PIC  X(1).
000190 01  ()口座番号               PIC  X(7).
000200 01  ()入金日                 PIC  X(2).
000210 01  ()回収方式               PIC  X(1).
000220 01  ()適用日１               PIC  X(8).
000230 01  ()適用日２               PIC  X(8).
000240 01  ()適用日３               PIC  X(8).
000250 01  ()適用日４               PIC  X(8).
000260 01  ()適用日５               PIC  X(8).
000270 01  ()適用日６               PIC  X(8).
000280 01  ()自振ファイル名         PIC  X(8).
