000010************************************************
000020* 否認(物件)(HSNINB)
000030************************************************
000040    03  ()契約番号               PIC  X(9).
000050    03  ()物件ＮＯ               PIC  X(3).
000060    03  ()否認日                 PIC  X(8).
000070    03  ()否認タイプ             PIC  X(1).
000080    03  ()資産更新区分           PIC  X(1).
000090    03  ()物件名                 PIC  X(30).
000100    03  ()当初購入金             PIC S9(13).
000110    03  ()前月購入金             PIC S9(13).
000120    03  ()当月購入金             PIC S9(13).
000130    03  ()仕入消費税             PIC S9(10).
000140    03  ()残価                   PIC S9(13).
000150    03  ()目展開日               PIC  X(6).
000160    03  ()目支払回数             PIC  X(4).
000170    03  ()目実リース料           PIC S9(13).
000180    03  ()目利息                 PIC S9(13).
000190    03  ()目元本内入れ           PIC S9(13).
000200    03  ()目元本残               PIC S9(13).
000210    03  ()目債権残               PIC S9(13).
000220    03  ()目諸費用               PIC S9(13).
000230    03  ()売上消費税             PIC S9(10).
000240    03  ()ＴＡＸＩＮＴ相当       PIC S9(10).
000250    03  ()ＴＡＸＰ内入れ         PIC S9(10).
000260    03  ()ＴＡＸＰ残高           PIC S9(13).
000270    03  ()計月数                 PIC  X(13).
