000010************************************************
000020* 否認(初回情報)(HSNINS)
000030************************************************
000040    03  ()契約番号               PIC  X(9).
000050    03  ()初実リース料           PIC S9(13).
000060    03  ()初回利息               PIC S9(13).
000070    03  ()初元本内               PIC S9(13).
000080    03  ()初元本残               PIC S9(13).
000090    03  ()初債権残               PIC S9(13).
000100    03  ()初回諸費用             PIC S9(13).
