000010************************************************
000020* ”Û”F(•¨Œ“WŠJ)(HSNINBT)
000030************************************************
000040    03  ()Œ_–ñ”Ô†               PIC  X(9).
000050    03  ()•¨Œ‚m‚n               PIC  X(3).
000060    03  ()–Ú“WŠJ“ú               PIC  X(6).
000070    03  ()–ÚŽx•¥‰ñ”             PIC  X(4).
000080    03  ()–ÚŽÀƒŠ[ƒX—¿           PIC S9(13).
000090    03  ()–Ú—˜‘§                 PIC S9(13).
000100    03  ()–ÚŒ³–{“à“ü‚ê           PIC S9(13).
000110    03  ()–ÚŒ³–{Žc               PIC S9(13).
000120    03  ()–ÚÂŒ Žc               PIC S9(13).
000130    03  ()–Ú””ï—p               PIC S9(13).
000140    03  ()”„ãÁ”ïÅ             PIC S9(10).
000150    03  ()‚s‚`‚w‚h‚m‚s‘Š“–       PIC S9(10).
000160    03  ()‚s‚`‚w‚o“à“ü‚ê         PIC S9(10).
000170    03  ()‚s‚`‚w‚oŽc‚           PIC S9(13).
000180    03  ()ŒvŒŽ”                 PIC  X(13).
