000010************************************************
000020* 否認(展開)(HSNINT)
000030************************************************
000040    03  ()契約番号               PIC  X(9).
000050    03  ()展開年月               PIC  X(6).
000060    03  ()支払回数               PIC  X(4).
000070    03  ()実リース料             PIC S9(13).
000080    03  ()利息                   PIC S9(13).
000090    03  ()元本内入れ             PIC S9(13).
000100    03  ()元本残                 PIC S9(13).
000110    03  ()債権残                 PIC S9(13).
000120    03  ()諸費用                 PIC S9(13).
000130    03  ()計算パターン           PIC  X(1).
000140    03  ()計上パターン           PIC  X(1).
000150    03  ()経過月数               PIC  X(3).
000160    03  ()リース利用１２         PIC S9(13).
000170    03  ()リース利用３           PIC S9(13).
000180    03  ()利息１２               PIC S9(13).
000190    03  ()利息３                 PIC S9(13).
000200    03  ()費用１２               PIC S9(13).
000210    03  ()費用３                 PIC S9(13).
