000010************************************************
000020* (IBS_CURRENCY)
000030************************************************
000040 01  ()幣種コード             PIC  X(3).
000050 01  ()国コード               PIC  X(3).
000060 01  ()ＳＷＩＦＴコード       PIC  X(3).
000070 01  ()ユニット単位           PIC S9(5) COMP-3.
000080 01  ()小数点位               PIC S9(1) COMP-3.
000090 01  ()名称＿日本語           PIC  N(15).
000100 01  ()名称＿英語             PIC  N(15).
000110 01  ()登録日                 PIC  X(8).
000120 01  ()登録時刻               PIC  X(6).
000130 01  ()登録担当者コード       PIC  X(4).
000140 01  ()更新日                 PIC  X(8).
000150 01  ()更新時刻               PIC  X(6).
000160 01  ()更新担当者コード       PIC  X(4).
