000010************************************************
000020* (IBS_TRANS)
000030************************************************
000040 01  ()案件№                 PIC  X(12).
000050 01  ()稟議№                 PIC  X(10).
000060 01  ()契約形態               PIC  X(1).
000070 01  ()成約日                 PIC  X(8).
000080 01  ()案件名                 PIC  N(30).
000090 01  ()協調形態               PIC  X(2).
000100 01  ()幹事会社コード         PIC  X(8).
000110 01  ()案件全体幣種           PIC  X(3).
000120 01  ()案件全体額             PIC S9(14)V9(2) COMP-3.
000130 01  ()当社持分額幣種         PIC  X(3).
000140 01  ()当社持分額             PIC S9(14)V9(2) COMP-3.
000150 01  ()主導店コード           PIC  X(4).
000160 01  ()記帳店コード           PIC  X(4).
000170 01  ()営業担当者             PIC  X(4).
000180 01  ()事務担当者             PIC  X(1).
000190 01  ()与信先コード           PIC  X(8).
000200 01  ()被保証形態             PIC  X(1).
000210 01  ()保険書類徴求           PIC  X(1).
000220 01  ()保険更新月１           PIC  X(4).
000230 01  ()保険更新月２           PIC  X(4).
000240 01  ()保険更新月３           PIC  X(4).
000250 01  ()資金使途コード         PIC  X(4).
000260 01  ()担保種類               PIC  X(2).
000270 01  ()担保評価額幣種         PIC  X(3).
000280 01  ()担保評価額             PIC S9(14)V9(2) COMP-3.
000290 01  ()担保名称               PIC  N(20).
000300 01  ()登録日                 PIC  X(8).
000310 01  ()登録時刻               PIC  X(6).
000320 01  ()登録担当者コード       PIC  X(4).
000330 01  ()更新日                 PIC  X(8).
000340 01  ()更新時刻               PIC  X(6).
000350 01  ()更新担当者コード       PIC  X(4).
