000010************************************************
000020* (IBS_FINANCE)
000030************************************************
000040 01  ()契約№                 PIC  X(9).
000050 01  ()連番                   PIC S9(3) COMP-3.
000060 01  ()計算日                 PIC  X(8).
000070 01  ()日数                   PIC S9(4) COMP-3.
000080 01  ()回収日                 PIC  X(8).
000090 01  ()ＴＴＭ                 PIC S9(4)V9(2) COMP-3.
000100 01  ()調達金利               PIC S9(4)V9(8) COMP-3.
000110 01  ()運用金利               PIC S9(4)V9(8) COMP-3.
000120 01  ()元本内入               PIC S9(14)V9(2) COMP-3.
000130 01  ()利息                   PIC S9(14)V9(2) COMP-3.
000140 01  ()その他                 PIC S9(14)V9(2) COMP-3.
000150 01  ()回収額                 PIC S9(14)V9(2) COMP-3.
000160 01  ()元本残高               PIC S9(14)V9(2) COMP-3.
000170 01  ()未実現利益             PIC S9(14)V9(2) COMP-3.
000180 01  ()未実現利益差額累計     PIC S9(14)V9(2) COMP-3.
000190 01  ()備考                   PIC  N(10).
000200 01  ()登録日                 PIC  X(8).
000210 01  ()登録時刻               PIC  X(6).
000220 01  ()登録担当者コード       PIC  X(4).
000230 01  ()更新日                 PIC  X(8).
000240 01  ()更新時刻               PIC  X(6).
000250 01  ()更新担当者コード       PIC  X(4).
