000010************************************************
000020* (IBS_COUNTRY)
000030************************************************
000040 01  ()国コード               PIC  X(3).
000050 01  ()エリアコード           PIC  X(1).
000060 01  ()エリア名称＿日本語     PIC  N(10).
000070 01  ()エリア名称＿英語       PIC  N(10).
000080 01  ()国名称＿日本語         PIC  N(15).
000090 01  ()国名称＿英語           PIC  N(15).
000100 01  ()ＬＤＣ区分             PIC  X(1).
000110 01  ()カントリーグレード     PIC  X(1).
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
