000010************************************************
000020* (IBS_CONTRACT)
000030************************************************
000040 01  ()契約№                 PIC  X(9).
000050 01  ()案件№                 PIC  X(12).
000060 01  ()与信対象区分           PIC  X(1).
000070 01  ()貸主コード             PIC  X(8).
000080 01  ()借主コード             PIC  X(8).
000090 01  ()契約識別名             PIC  N(15).
000100 01  ()元本元利区分           PIC  X(1).
000110 01  ()元本幣種               PIC  X(3).
000120 01  ()元本                   PIC S9(14)V9(2) COMP-3.
000130 01  ()ユニット価格           PIC S9(14)V9(2) COMP-3.
000140 01  ()残価額                 PIC S9(14)V9(2) COMP-3.
000150 01  ()元利合計               PIC S9(14)V9(2) COMP-3.
000160 01  ()利息幣種               PIC  X(3).
000170 01  ()成約日                 PIC  X(8).
000180 01  ()実行日                 PIC  X(8).
000190 01  ()終了日                 PIC  X(8).
000200 01  ()契約期間               PIC S9(3) COMP-3.
000210 01  ()据置期間               PIC S9(2) COMP-3.
000220 01  ()サイクル               PIC S9(2) COMP-3.
000230 01  ()支払回数               PIC S9(4) COMP-3.
000240 01  ()貸主勘定科目コード     PIC  X(2).
000250 01  ()借主勘定科目コード     PIC  X(2).
000260 01  ()前取後取区分           PIC  X(1).
000270 01  ()利率基数コード         PIC  X(1).
000280 01  ()片端両端区分           PIC  X(1).
000290 01  ()利息単位               PIC S9(2) COMP-3.
000300 01  ()端数処理コード         PIC  X(1).
000310 01  ()利息基準日             PIC  X(2).
000320 01  ()基準日休日区分         PIC  X(2).
000330 01  ()基準日変動区分         PIC  X(1).
000340 01  ()回収日日数差           PIC S9(2) COMP-3.
000350 01  ()運用金利区分           PIC  X(1).
000360 01  ()運用金利メモ           PIC  N(20).
000370 01  ()調達金利区分           PIC  X(1).
000380 01  ()調達金利メモ           PIC  N(20).
000390 01  ()調達先名称             PIC  N(20).
000400 01  ()利率確定限度日         PIC  X(8).
000410 01  ()洗替対象区分           PIC  X(1).
000420 01  ()外税控除コード         PIC  X(1).
000430 01  ()消費税コード           PIC  X(3).
000440 01  ()書類名１               PIC  N(15).
000450 01  ()期日管理１             PIC S9(2) COMP-3.
000460 01  ()営業日判定１           PIC  X(1).
000470 01  ()書類名２               PIC  N(15).
000480 01  ()期日管理２             PIC S9(2) COMP-3.
000490 01  ()営業日判定２           PIC  X(1).
000500 01  ()書類名３               PIC  N(15).
000510 01  ()期日管理３             PIC S9(2) COMP-3.
000520 01  ()営業日判定３           PIC  X(1).
000530 01  ()書類名４               PIC  N(15).
000540 01  ()期日管理４             PIC S9(2) COMP-3.
000550 01  ()営業日判定４           PIC  X(1).
000560 01  ()書類名５               PIC  N(15).
000570 01  ()期日管理５             PIC S9(2) COMP-3.
000580 01  ()営業日判定５           PIC  X(1).
000590 01  ()書類名６               PIC  N(15).
000600 01  ()期日管理６             PIC S9(2) COMP-3.
000610 01  ()営業日判定６           PIC  X(1).
000620 01  ()書類名７               PIC  N(15).
000630 01  ()期日管理７             PIC S9(2) COMP-3.
000640 01  ()営業日判定７           PIC  X(1).
000650 01  ()書類名８               PIC  N(15).
000660 01  ()期日管理８             PIC S9(2) COMP-3.
000670 01  ()営業日判定８           PIC  X(1).
000680 01  ()書類名９               PIC  N(15).
000690 01  ()期日管理９             PIC S9(2) COMP-3.
000700 01  ()営業日判定９           PIC  X(1).
000710 01  ()書類名１０             PIC  N(15).
000720 01  ()期日管理１０           PIC S9(2) COMP-3.
000730 01  ()営業日判定１０         PIC  X(1).
000740 01  ()汎用区分１             PIC  X(2).
000750 01  ()汎用区分２             PIC  X(2).
000760 01  ()汎用区分３             PIC  X(2).
000770 01  ()登録日                 PIC  X(8).
000780 01  ()登録時刻               PIC  X(6).
000790 01  ()登録担当者コード       PIC  X(4).
000800 01  ()更新日                 PIC  X(8).
000810 01  ()更新時刻               PIC  X(6).
000820 01  ()更新担当者コード       PIC  X(4).
