000010************************************************
000020* (JOM_FORM_0009_G)
000030************************************************
000040 01  ()JOBCOD           PIC S9(2) COMP-3.
000050 01  ()契約番号               PIC  X(9).
000060 01  ()契約日                 PIC  X(8).
000070 01  ()第１回入金日           PIC  X(8).
000080 01  ()入金日                 PIC  X(4).
000090 01  ()税率                   PIC S9(2)V9(1) COMP-3.
000100 01  ()ジョモ商品コード       PIC  X(4).
000110 01  ()物件名                 PIC  N(15).
000120 01  ()リース料１             PIC S9(13) COMP-3.
000130 01  ()リース料２             PIC S9(13) COMP-3.
000140 01  ()リース料３             PIC S9(13) COMP-3.
000150 01  ()リース料４             PIC S9(13) COMP-3.
000160 01  ()リース料５             PIC S9(13) COMP-3.
000170 01  ()リース料６             PIC S9(13) COMP-3.
000180 01  ()リース料７             PIC S9(13) COMP-3.
000190 01  ()リース料８             PIC S9(13) COMP-3.
000200 01  ()リース料９             PIC S9(13) COMP-3.
000210 01  ()リース料１０           PIC S9(13) COMP-3.
000220 01  ()リース料１１           PIC S9(13) COMP-3.
000230 01  ()リース料１２           PIC S9(13) COMP-3.
000240 01  ()リース料１３           PIC S9(13) COMP-3.
000250 01  ()リース料１４           PIC S9(13) COMP-3.
000260 01  ()リース料合計           PIC S9(13) COMP-3.
000270 01  ()消費税１               PIC S9(13) COMP-3.
000280 01  ()消費税２               PIC S9(13) COMP-3.
000290 01  ()消費税３               PIC S9(13) COMP-3.
000300 01  ()消費税４               PIC S9(13) COMP-3.
000310 01  ()消費税５               PIC S9(13) COMP-3.
000320 01  ()消費税６               PIC S9(13) COMP-3.
000330 01  ()消費税７               PIC S9(13) COMP-3.
000340 01  ()消費税８               PIC S9(13) COMP-3.
000350 01  ()消費税９               PIC S9(13) COMP-3.
000360 01  ()消費税１０             PIC S9(13) COMP-3.
000370 01  ()消費税１１             PIC S9(13) COMP-3.
000380 01  ()消費税１２             PIC S9(13) COMP-3.
000390 01  ()消費税１３             PIC S9(13) COMP-3.
000400 01  ()消費税１４             PIC S9(13) COMP-3.
000410 01  ()消費税合計             PIC S9(13) COMP-3.
