000010************************************************
000020* (JOM_FORM_0004)
000030************************************************
000040 01  ()ジョモ支払条件コード   PIC  X(2).
000050 01  ()ジョモ支店コード       PIC  X(2).
000060 01  ()ジョモ契約番号         PIC  X(9).
000070 01  ()契約番号               PIC  X(9).
000080 01  ()設置場所名＿漢字       PIC  N(20).
000090 01  ()設置場所住所           PIC  N(50).
000100 01  ()物件名＿漢字           PIC  N(20).
000110 01  ()数量                   PIC S9(4) COMP-3.
000120 01  ()支払条件文言           PIC  N(20).
000130 01  ()購入金額               PIC S9(13) COMP-3.
000140 01  ()仕入消費税等額         PIC S9(13) COMP-3.
