000010************************************************
000020* (JOM_FORM_0005)
000030************************************************
000040 01  ()SELCOD           PIC  X(1).
000050 01  ()ジョモ支店コード       PIC  X(2).
000060 01  ()支店名漢字             PIC  N(30).
000070 01  ()ジョモ契約番号         PIC  X(9).
000080 01  ()契約番号               PIC  X(9).
000090 01  ()リース期間             PIC S9(3) COMP-3.
000100 01  ()前受月数               PIC S9(2) COMP-3.
000110 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000120 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000130 01  ()リース料               PIC S9(13) COMP-3.
000140 01  ()前受リース料           PIC S9(13) COMP-3.
000150 01  ()購入金額合計           PIC S9(13) COMP-3.
000160 01  ()仕入消費税等額合計     PIC S9(13) COMP-3.
000170 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000180 01  ()繰延金額               PIC S9(13) COMP-3.
000190 01  ()契約金額               PIC S9(13) COMP-3.
000200 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000210 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000220 01  ()粗利益                 PIC S9(13) COMP-3.
000230 01  ()受取手数料             PIC S9(13) COMP-3.
000240 01  ()基本リース料           PIC S9(13) COMP-3.
000250 01  ()月額固定資産税総額     PIC S9(13) COMP-3.
000260 01  ()月額動総保険料総額     PIC S9(13) COMP-3.
000270 01  ()売主名                 PIC  N(30).
000280 01  ()ジョモ支払条件コード   PIC  X(2).
000290 01  ()支払条件文言           PIC  X(40).
000300 01  ()購入先コード           PIC  X(8).
000310 01  ()物件ＮＯ               PIC  X(3).
000320 01  ()ジョモ商品コード       PIC  X(4).
000330 01  ()ジョモ商品分類名       PIC  N(15).
000340 01  ()資産コード             PIC  X(7).
000350 01  ()耐用年数               PIC  X(2).
000360 01  ()平均耐用年数           PIC S9(2)V9(3) COMP-3.
000370 01  ()信用保険コード         PIC  X(6).
000380 01  ()動総保険コード         PIC  X(4).
000390 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000400 01  ()物件名漢字             PIC  N(20).
000410 01  ()物件名カナ             PIC  N(10).
000420 01  ()数量                   PIC S9(4) COMP-3.
000430 01  ()購入金額               PIC S9(13) COMP-3.
000440 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000450 01  ()個別リース料           PIC S9(13) COMP-3.
000460 01  ()設置場所住所           PIC  N(50).
000470 01  ()設置場所名漢字         PIC  N(20).
000480 01  ()設置場所名カナ         PIC  N(10).
000490 01  ()納付先コード           PIC  X(6).
000500 01  ()斡旋手数料             PIC S9(13) COMP-3.
