000010************************************************
000020* (JOM_FORM_0003)
000030************************************************
000040 01  ()SHTNUM           PIC S9(2) COMP-3.
000050 01  ()Œ_–ñ“ú                 PIC  X(8).
000060 01  ()Œ_–ñ”Ô†               PIC  X(7).
000070 01  ()ŠJŽnŽ}”Ô               PIC  X(2).
000080 01  ()ÅIŽ}”Ô               PIC  X(2).
000090 01  ()w“ü‹àŠz‡Œv           PIC S9(13) COMP-3.
000100 01  ()Žd“üÁ”ïÅ“™Šz‡Œv     PIC S9(13) COMP-3.
000110 01  ()Žx•¥ðŒ‚P             PIC  X(2).
000120 01  ()Žx•¥ðŒ‚Q             PIC  X(2).
000130 01  ()Žx•¥ðŒ‚R             PIC  X(2).
000140 01  ()Žx•¥ðŒ‚S             PIC  X(2).
000150 01  ()Žx•¥ðŒ‚T             PIC  X(2).
000160 01  ()Žx•¥ðŒ•¶Œ¾‚P         PIC  N(20).
000170 01  ()Žx•¥ðŒ•¶Œ¾‚Q         PIC  N(20).
000180 01  ()Žx•¥ðŒ•¶Œ¾‚R         PIC  N(20).
000190 01  ()Žx•¥ðŒ•¶Œ¾‚S         PIC  N(20).
000200 01  ()Žx•¥ðŒ•¶Œ¾‚T         PIC  N(20).
000210 01  ()Žx•¥‹àŠz‚P             PIC S9(13) COMP-3.
000220 01  ()Žx•¥‹àŠz‚Q             PIC S9(13) COMP-3.
000230 01  ()Žx•¥‹àŠz‚R             PIC S9(13) COMP-3.
000240 01  ()Žx•¥‹àŠz‚S             PIC S9(13) COMP-3.
000250 01  ()Žx•¥‹àŠz‚T             PIC S9(13) COMP-3.
