000010************************************************
000020* (JOM_SITEN_MST)
000030************************************************
000040 01  ()ジョモ支店コード       PIC  X(2).
000050 01  ()支店名カナ             PIC  N(15).
000060 01  ()支店名漢字             PIC  N(30).
