000010************************************************
000020* (JYO_INPWRK)
000030************************************************
000040 01  ()Ž‘ŽYƒR[ƒh             PIC  X(14).
000050 01  ()Ž‘ŽY–¼                 PIC  N(20).
000060 01  ()•”–å                   PIC  X(10).
000070 01  ()êŠ                   PIC  N(10).
000080 01  ()Š¨’è                   PIC  N(10).
000090 01  ()ž‹p•û–@               PIC  X(6).
000100 01  ()”—Ê                   PIC S9(4) COMP-3.
000110 01  ()’PˆÊ                   PIC  X(1).
000120 01  ()‘‰Á——R               PIC  X(6).
000130 01  ()Œ¸­——R               PIC  X(6).
000140 01  ()Ž–‹Æ‹Ÿ—p“ú             PIC  X(10).
000150 01  ()‘‰Á“ú                 PIC  X(10).
000160 01  ()Œ¸­“ú                 PIC  X(10).
000170 01  ()Žæ“¾‰¿Šz               PIC S9(13) COMP-3.
000180 01  ()ˆ³kˆø“–‹à             PIC S9(13) COMP-3.
000190 01  ()Žc‘¶‰¿Šz               PIC S9(13) COMP-3.
000200 01  ()ž‹p‰Â”\ŒÀ“x           PIC S9(13) COMP-3.
000210 01  ()ŠúŽñ’ •ë‰¿Šz           PIC S9(13) COMP-3.
000220 01  ()Šú’†Œ¸­Šz             PIC S9(13) COMP-3.
000230 01  ()Šú’†‘‰ÁŠz             PIC S9(13) COMP-3.
000240 01  ()ŠúŽñž‹p‰ß•s‘«         PIC S9(13) COMP-3.
000250 01  ()ž‹pŠî‘bŠz             PIC S9(13) COMP-3.
000260 01  ()‘Ï—p”N”               PIC S9(3) COMP-3.
000270 01  ()ž‹p—¦                 PIC S9(2)V9(3) COMP-3.
000280 01  ()ƒŠ[ƒXŠúŠÔ             PIC S9(4) COMP-3.
000290 01  ()ž‹pŒŽ”               PIC S9(4) COMP-3.
000300 01  ()ŽZož‹pŠz             PIC S9(13) COMP-3.
000310 01  ()‘‰Áž‹pŠz             PIC S9(13) COMP-3.
000320 01  ()“–Šúž‹pŒÀ“xŠz         PIC S9(13) COMP-3.
000330 01  ()Š„‘ž‹pŠz             PIC S9(13) COMP-3.
000340 01  ()“Á•Êž‹pŠz             PIC S9(13) COMP-3.
000350 01  ()“–Šúž‹pŠz             PIC S9(13) COMP-3.
000360 01  ()ˆø“–‹àŽæ•öŠz           PIC S9(13) COMP-3.
000370 01  ()Šú––ˆø“–‹àŠz           PIC S9(13) COMP-3.
000380 01  ()Šú––’ •ë‰¿Šz           PIC S9(13) COMP-3.
000390 01  ()ž‹p’´‰ßŠz             PIC S9(13) COMP-3.
000400 01  ()ž‹p•s‘«Šz             PIC S9(13) COMP-3.
000410 01  ()ž‹p—ÝŒvŠz             PIC S9(13) COMP-3.
000420 01  ()‰c‹ÆŠO”ï—p             PIC S9(13) COMP-3.
000430 01  ()»‘¢Œ´‰¿               PIC S9(13) COMP-3.
000440 01  ()”ÌŠÇ”ï                 PIC S9(13) COMP-3.
