000010************************************************
000020* (JYO_CHKTMP)
000030************************************************
000040 01  ()ダミー１               PIC  N(10).
000050 01  ()データ区分             PIC  X(1).
000060 01  ()資産番号               PIC  X(9).
000070 01  ()ダミー２               PIC  N(15.5).
000080 01  ()ダミー３               PIC  X(8).
000090 01  ()資産種類               PIC  X(1).
000100 01  ()資産コード             PIC  X(6).
000110 01  ()耐用年数               PIC  X(2).
000120 01  ()償却率                 PIC  X(3).
000130 01  ()ダミー４               PIC  N(9.5).
