000010************************************************
000020* (KAI_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()名寄せコード           PIC  X(8).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()取引先名漢字           PIC  N(30).
000080 01  ()取引先名カナ           PIC  N(15).
000090 01  ()事業所コード           PIC  X(4).
000100 01  ()契約日                 PIC  X(8).
000110 01  ()検収日                 PIC  X(8).
000120 01  ()リース期間             PIC S9(3) COMP-3.
000130 01  ()勘定処理コード         PIC  X(2).
000140 01  ()定額リース料           PIC S9(13) COMP-3.
000150 01  ()前受リース料           PIC S9(13) COMP-3.
000160 01  ()前受リース料入金日     PIC  X(8).
000170 01  ()契約金額               PIC S9(13) COMP-3.
000180 01  ()月額固定資産税         PIC S9(13) COMP-3.
000190 01  ()月額保険料             PIC S9(13) COMP-3.
000200 01  ()月額保守料             PIC S9(13) COMP-3.
000210 01  ()その他１               PIC S9(13) COMP-3.
000220 01  ()その他２               PIC S9(13) COMP-3.
000230 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000240 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000250 01  ()初期費用               PIC S9(13) COMP-3.
000260 01  ()請求サイクル           PIC S9(2) COMP-3.
000270 01  ()支払回数               PIC S9(3) COMP-3.
000280 01  ()据置月数               PIC S9(3) COMP-3.
000290 01  ()BEGIN回数         PIC S9(1) COMP-3.
000300 01  ()残価回収日             PIC  X(8).
000310 01  ()入金日                 PIC  X(2).
000320 01  ()第１回リース料入金日   PIC  X(8).
000330 01  ()第２回リース料入金日   PIC  X(8).
000340 01  ()再リースコード         PIC  X(1).
000350 01  ()手数料請求コード       PIC  X(2).
000360 01  ()リース終了日           PIC  X(8).
000370 01  ()購入金額合計           PIC S9(13) COMP-3.
000380 01  ()残価額合計             PIC S9(13) COMP-3.
000390 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000400 01  ()消費税徴収区分         PIC  X(1).
000410 01  ()債務協調コード         PIC  X(2).
000420 01  ()リース料充当年月前月   PIC  X(6).
000430 01  ()充当回数前月           PIC S9(3) COMP-3.
000440 01  ()リース料前月           PIC S9(13) COMP-3.
000450 01  ()債権残高前月           PIC S9(13) COMP-3.
000460 01  ()前受リース料残高前月   PIC S9(13) COMP-3.
000470 01  ()リース料充当年月当月   PIC  X(6).
000480 01  ()充当回数当月           PIC S9(3) COMP-3.
000490 01  ()リース料当月           PIC S9(13) COMP-3.
000500 01  ()債権残高当月           PIC S9(13) COMP-3.
000510 01  ()前受リース料残高当月   PIC S9(13) COMP-3.
000520 01  ()リース料充当年月翌月   PIC  X(6).
000530 01  ()充当回数翌月           PIC S9(3) COMP-3.
000540 01  ()リース料翌月           PIC S9(13) COMP-3.
000550 01  ()債権残高翌月           PIC S9(13) COMP-3.
000560 01  ()前受リース料残高翌月   PIC S9(13) COMP-3.
000570 01  ()未回収元本残高         PIC S9(13) COMP-3.
000580 01  ()未徴収保険料           PIC S9(13) COMP-3.
000590 01  ()未徴収TAX           PIC S9(13) COMP-3.
000600 01  ()経過月数               PIC S9(3) COMP-3.
000610 01  ()前受充当開始年月       PIC  X(6).
000620 01  ()前受充当開始充当額     PIC S9(13) COMP-3.
000630 01  ()回収方式               PIC  X(1).
000640 01  ()銀行コード             PIC  X(7).
000650 01  ()銀行名カナ             PIC  N(15).
000660 01  ()口座番号               PIC  X(7).
000670 01  ()預金種類               PIC  X(1).
000680 01  ()請求先コード           PIC  X(8).
000690 01  ()計算方式               PIC  X(1).
000700 01  ()データ識別コード       PIC  X(2).
000710 01  ()文言番号               PIC S9(2) COMP-3.
000720 01  ()文言                   PIC  N(300).
000730 01  ()異例FLG             PIC  X(1).
000740 01  ()登録日                 PIC  X(8).
000750 01  ()登録時刻               PIC  X(6).
000760 01  ()登録担当者コード       PIC  X(4).
000770 01  ()更新日                 PIC  X(8).
000780 01  ()更新時刻               PIC  X(6).
000790 01  ()更新担当者コード       PIC  X(4).
000800 01  ()初回リース料           PIC S9(13) COMP-3.
