000010************************************************
000020* (KAI_WK_BAIZEI)
000030************************************************
000040 01  ()å_ñÒî‘çÜ               PIC  X(9).
000050 01  ()îÑãpê≈ó¶               PIC S9(2)V9(1) COMP-3.
