000010************************************************
000020* (KEI_PATTERN_WK)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()物件コード             PIC  X(3).
000070 01  ()設置場所コード         PIC  X(3).
