000010************************************************
000020* (KEI_BUNKATU_KEY)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()処理ステータス         PIC  X(1).
000060 01  ()送信区分               PIC  X(1).
000070 01  ()購入金額合計           PIC S9(13) COMP-3.
000080 01  ()登録日                 PIC  X(8).
000090 01  ()登録時刻               PIC  X(6).
000100 01  ()登録担当者コード       PIC  X(4).
000110 01  ()更新日                 PIC  X(8).
000120 01  ()更新時刻               PIC  X(6).
000130 01  ()更新担当者コード       PIC  X(4).
