000010************************************************
000020* (KEI_BUNKATU_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()新物件ＮＯ             PIC  X(3).
000060 01  ()物件ＮＯ               PIC  X(3).
000070 01  ()物件名＿漢字           PIC  N(20).
000080 01  ()物件名＿カナ           PIC  N(10).
000090 01  ()仕様製造番号           PIC  N(10).
000100 01  ()数量                   PIC S9(4) COMP-3.
000110 01  ()購入金額               PIC S9(13) COMP-3.
000120 01  ()納付先コード           PIC  X(6).
000130 01  ()設置場所郵便番号       PIC  X(7).
000140 01  ()設置場所住所           PIC  N(50).
000150 01  ()設置場所名＿漢字       PIC  N(20).
000160 01  ()設置場所名＿カナ       PIC  N(10).
000170 01  ()個別リース料           PIC S9(13) COMP-3.
000180 01  ()ユーザーリファレンス１ PIC  X(12).
000190 01  ()ユーザーリファレンス２ PIC  X(12).
000200 01  ()ディーラーコード       PIC  X(5).
000210 01  ()登録日                 PIC  X(8).
000220 01  ()登録時刻               PIC  X(6).
000230 01  ()登録担当者コード       PIC  X(4).
000240 01  ()更新日                 PIC  X(8).
000250 01  ()更新時刻               PIC  X(6).
000260 01  ()更新担当者コード       PIC  X(4).
