000010************************************************
000020* (KEI_LPWK_EDA_THUMON3)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()端末番号               PIC  N(8).
000060 01  ()ディーラーコード       PIC  X(5).
000070 01  ()支払条件文言           PIC  N(20).
000080 01  ()番号                   PIC S9(3) COMP-3.
000090 01  ()支払繰延金額           PIC S9(13) COMP-3.
000100 01  ()支払繰延月数           PIC S9(2)V9(2) COMP-3.
