000010************************************************
000020* (KEI_LPWK_KEISANSYO_2)
000030************************************************
000040 01  ()å_ñÒî‘çÜ               PIC  X(9).
000050 01  ()ÇvÇjòAî‘               PIC S9(3) COMP-3.
000060 01  ()í[ññî‘çÜ               PIC  N(8).
000070 01  ()éxï•åJâÑã‡äz           PIC S9(13) COMP-3.
000080 01  ()éxï•åJâÑåéêî           PIC S9(2)V9(2) COMP-3.
