000010************************************************
000020* (KEI_IKEN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()営業部意見             PIC  N(170).
000060 01  ()事務連絡事項           PIC  N(100).
000070 01  ()登録日                 PIC  X(8).
000080 01  ()登録時刻               PIC  X(6).
000090 01  ()登録担当者コード       PIC  X(4).
000100 01  ()更新日                 PIC  X(8).
000110 01  ()更新時刻               PIC  X(6).
000120 01  ()更新担当者コード       PIC  X(4).
