000010************************************************
000020* (KEI_LPWK_RINGI_YOSIN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()ＷＫ連番               PIC S9(3) COMP-3.
000060 01  ()端末番号               PIC  N(8).
000070 01  ()名寄せコード           PIC  X(8).
000080 01  ()与信先名               PIC  N(30).
000090 01  ()保証担保内容           PIC  N(15).
000100 01  ()保全範囲               PIC  N(10).
000110 01  ()負担割合               PIC S9(3) COMP-3.
000120 01  ()リース残高名寄せ       PIC S9(13) COMP-3.
000130 01  ()割賦残高名寄せ         PIC S9(13) COMP-3.
000140 01  ()貸付残高名寄せ         PIC S9(13) COMP-3.
000150 01  ()未検収残高名寄せ       PIC S9(13) COMP-3.
000160 01  ()未徴収残高名寄せ       PIC S9(13) COMP-3.
000170 01  ()取引先名               PIC  N(30).
000180 01  ()契約日                 PIC  X(8).
