000010************************************************
000020* (KEI_SEIKYU_WK)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()手形枚数               PIC S9(3) COMP-3.
000060 01  ()入金基準日             PIC  X(2).
000070 01  ()預金種類               PIC  X(1).
000080 01  ()銀行コード             PIC  X(7).
000090 01  ()口座番号               PIC  X(7).
000100 01  ()銀行短縮コード         PIC  X(2).
