000010************************************************
000020* (KEI_TOKUYAKU)
000030************************************************
000040 01  ()特約コード             PIC  X(2).
000050 01  ()内容                   PIC  N(75).
000060 01  ()登録日                 PIC  X(8).
000070 01  ()登録時刻               PIC  X(6).
000080 01  ()登録担当者コード       PIC  X(4).
000090 01  ()更新日                 PIC  X(8).
000100 01  ()更新時刻               PIC  X(6).
000110 01  ()更新担当者コード       PIC  X(4).
