000010************************************************
000020* (KEI_LPWK_SEIKYUSYO_TENKAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()連番                   PIC S9(3) COMP-3.
000060 01  ()消費税額               PIC S9(13) COMP-3.
000070 01  ()手形枚数               PIC S9(3) COMP-3.
000080 01  ()消費税計算フラグ       PIC  X(1).
000090 01  ()端末番号               PIC  N(8).
