000010************************************************
000020* (KOK_HSMKN)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()勘定処理コード         PIC  X(2).
000060 01  ()グループコード         PIC  X(8).
000070 01  ()名寄せコード           PIC  X(8).
000080 01  ()ユーザーコード         PIC  X(8).
000090 01  ()グループ_未検収件数   PIC  X(6).
000100 01  ()グループ_未検収残高   PIC S9(13) COMP-3.
000110 01  ()名寄せ_未検収件数     PIC  X(6).
000120 01  ()名寄せ_末検収残高     PIC S9(13) COMP-3.
000130 01  ()ユーザー_未検収件数   PIC  X(6).
000140 01  ()ユーザー_未検収残高   PIC S9(13) COMP-3.
000150 01  ()主管事業所コード       PIC  X(4).
000160 01  ()登録日                 PIC  X(8).
000170 01  ()登録時刻               PIC  X(6).
000180 01  ()登録担当者コード       PIC  X(4).
000190 01  ()更新日                 PIC  X(8).
000200 01  ()更新時刻               PIC  X(6).
000210 01  ()更新担当者コード       PIC  X(4).
