000010************************************************
000020* (KOK_SIHARAI_H)
000030************************************************
000040 01  ()支払先コード           PIC  X(4).
000050 01  ()処理区分               PIC  X(1).
000060 01  ()支払先名               PIC  N(28).
000070 01  ()口座名義人             PIC  N(28).
000080 01  ()銀行コード             PIC  X(4).
000090 01  ()支店コード             PIC  X(3).
000100 01  ()預金種類               PIC  X(1).
000110 01  ()口座番号               PIC  X(7).
000120 01  ()登録番号               PIC  X(4).
000130 01  ()手形名宛人             PIC  N(28).
000140 01  ()郵便番号               PIC  X(7).
000150 01  ()郵送先住所１           PIC  N(17).
000160 01  ()郵送先住所２           PIC  N(16).
000170 01  ()郵送先住所３           PIC  N(16).
000180 01  ()郵送先名１             PIC  N(14).
000190 01  ()郵送先名２             PIC  N(14).
000200 01  ()休日対応区分           PIC  X(1).
000210 01  ()登録日                 PIC  X(8).
000220 01  ()登録時刻               PIC  X(6).
000230 01  ()登録担当者コード       PIC  X(4).
000240 01  ()更新日                 PIC  X(8).
000250 01  ()更新時刻               PIC  X(6).
000260 01  ()更新担当者コード       PIC  X(4).
000270 01  ()手数料有無             PIC  X(1).
000280 01  ()更新標識               PIC  X(1).
