000010************************************************
000020* (KOK_HSZAN)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()勘定処理コード         PIC  X(2).
000060 01  ()グループコード         PIC  X(8).
000070 01  ()名寄せコード           PIC  X(8).
000080 01  ()ユーザーコード         PIC  X(8).
000090 01  ()グループ_前月末契約件数 PIC  X(6).
000100 01  ()グループ_前月末債権残高 PIC S9(13) COMP-3.
000110 01  ()グループ_当月検収件数 PIC  X(6).
000120 01  ()グループ_当月検収金額 PIC S9(13) COMP-3.
000130 01  ()グループ_当月回収額   PIC S9(13) COMP-3.
000140 01  ()グループ_前受リース料残高 PIC S9(13) COMP-3.
000150 01  ()名寄せ_前月末契約件数 PIC  X(6).
000160 01  ()名寄せ_前月末債権残高 PIC S9(13) COMP-3.
000170 01  ()名寄せ_当月検収件数   PIC  X(6).
000180 01  ()名寄せ_当月検収金額   PIC S9(13) COMP-3.
000190 01  ()名寄せ_当月回収額     PIC S9(13) COMP-3.
000200 01  ()名寄せ_前受リース料残高 PIC S9(13) COMP-3.
000210 01  ()ユーザー_前月末契約件数 PIC  X(6).
000220 01  ()ユーザー_前月末債権残高 PIC S9(13) COMP-3.
000230 01  ()ユーザー_当月検収件数 PIC  X(6).
000240 01  ()ユーザー_当月検収金額 PIC S9(13) COMP-3.
000250 01  ()ユーザー_当月回収額   PIC S9(13) COMP-3.
000260 01  ()ユーザー_前受リース料残高 PIC S9(13) COMP-3.
000270 01  ()主管事業所コード       PIC  X(4).
000280 01  ()格付                   PIC  X(3).
000290 01  ()登録日                 PIC  X(8).
000300 01  ()登録時刻               PIC  X(6).
000310 01  ()登録担当者コード       PIC  X(4).
000320 01  ()更新日                 PIC  X(8).
000330 01  ()更新時刻               PIC  X(6).
000340 01  ()更新担当者コード       PIC  X(4).
