000010************************************************
000020* (KOK_PATCH_JIGYO)
000030************************************************
000040 01  ()取引先コード           PIC  X(8).
000050 01  ()新事業所コード         PIC  X(4).
000060 01  ()新担当者コード         PIC  X(4).
000070 01  ()新サーバーコード       PIC  X(2).
