000010************************************************
000020* (KTK_SAIBAN)
000030************************************************
000040 01  ()事業所コード           PIC  X(4).
000050 01  ()契約形態               PIC  X(1).
000060 01  ()期                     PIC S9(2) COMP-3.
000070 01  ()担当部店               PIC  X(1).
000080 01  ()連番                   PIC  X(3).
000090 01  ()登録日                 PIC  X(8).
000100 01  ()登録時刻               PIC  X(6).
000110 01  ()登録担当者コード       PIC  X(4).
000120 01  ()更新日                 PIC  X(8).
000130 01  ()更新時刻               PIC  X(6).
000140 01  ()更新担当者コード       PIC  X(4).
