000010************************************************
000020* (LCF_ALMDAT)
000030************************************************
000040 01  ()GENREC           PIC  N(60).
