000010************************************************
000020* (LEA_WORK05)
000030************************************************
000040 01  ()KEY                 PIC  X(1).
000050 01  ()支払連番１             PIC S9(3) COMP-3.
000060 01  ()支払日１               PIC  X(8).
000070 01  ()リース料１             PIC S9(13) COMP-3.
000080 01  ()残高１                 PIC S9(13) COMP-3.
000090 01  ()支払連番２             PIC S9(3) COMP-3.
000100 01  ()支払日２               PIC  X(8).
000110 01  ()リース料２             PIC S9(13) COMP-3.
000120 01  ()残高２                 PIC S9(13) COMP-3.
000130 01  ()支払連番３             PIC S9(3) COMP-3.
000140 01  ()支払日３               PIC  X(8).
000150 01  ()リース料３             PIC S9(13) COMP-3.
000160 01  ()残高３                 PIC S9(13) COMP-3.
000170 01  ()支払連番４             PIC S9(3) COMP-3.
000180 01  ()支払日４               PIC  X(8).
000190 01  ()リース料４             PIC S9(13) COMP-3.
000200 01  ()残高４                 PIC S9(13) COMP-3.
000210 01  ()支払連番５             PIC S9(3) COMP-3.
000220 01  ()支払日５               PIC  X(8).
000230 01  ()リース料５             PIC S9(13) COMP-3.
000240 01  ()残高５                 PIC S9(13) COMP-3.
000250 01  ()リース期間             PIC S9(3) COMP-3.
000260 01  ()前受月数               PIC S9(2) COMP-3.
000270 01  ()契約総額               PIC S9(13) COMP-3.
000280 01  ()残価額                 PIC S9(13) COMP-3.
000290 01  ()登録日                 PIC  X(8).
000300 01  ()登録時刻               PIC  X(6).
000310 01  ()登録担当者コード       PIC  X(4).
000320 01  ()更新日                 PIC  X(8).
000330 01  ()更新時刻               PIC  X(6).
000340 01  ()更新担当者コード       PIC  X(4).
