000010************************************************
000020* (LEA_BUKKEN)
000030************************************************
000040 01  ()KEY                 PIC  X(1).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()購入金額               PIC S9(13) COMP-3.
000070 01  ()残価額                 PIC S9(13) COMP-3.
000080 01  ()耐用年数               PIC S9(2) COMP-3.
000090 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000100 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000110 01  ()登録日                 PIC  X(8).
000120 01  ()登録時刻               PIC  X(6).
000130 01  ()登録担当者コード       PIC  X(4).
000140 01  ()更新日                 PIC  X(8).
000150 01  ()更新時刻               PIC  X(6).
000160 01  ()更新担当者コード       PIC  X(4).
