000010************************************************
000020* (LEA_KURINOBE)
000030************************************************
000040 01  ()KEY                 PIC  X(1).
000050 01  ()繰延ＮＯ               PIC S9(2) COMP-3.
000060 01  ()繰延金額               PIC S9(13) COMP-3.
000070 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000080 01  ()登録日                 PIC  X(8).
000090 01  ()登録時刻               PIC  X(6).
000100 01  ()登録担当者コード       PIC  X(4).
000110 01  ()更新日                 PIC  X(8).
000120 01  ()更新時刻               PIC  X(6).
000130 01  ()更新担当者コード       PIC  X(4).
