000010************************************************
000020* 履歴アンマッチ資産明細(LTRSIM_U)
000030************************************************
000040    03  ()解約履歴ＫＥＹ.
000050     05  ()ＫＥＹ－解約日                  PIC  X(7).
000060    03  ()ＫＥＹ項目.
000070     05  ()契約ＮＯ                        PIC  X(9).
000080     05  ()物件ＮＯ                        PIC S9(3).
000090     05  ()解約区分                        PIC  X(1).
000100     05  ()再生区分                        PIC  X(1).
000110    03  ()再リースコード                   PIC S9(1).
000120    03  ()リース開始日.
000130     05  ()リース開始日－世紀              PIC S9(1).
000140     05  ()リース開始日－年月日            PIC  X(6).
000150    03  ()リース終了日.
000160     05  ()リース終了日－世紀              PIC S9(1).
000170     05  ()リース終了日－年月日            PIC  X(6).
000180    03  ()ファイナンス終了日.
000190     05  ()ファイナンス終了日－世紀        PIC S9(1).
000200     05  ()ファイナンス終了日－年月日      PIC  X(6).
000210    03  ()リース期間                       PIC S9(3).
000220    03  ()勘定処理コード                   PIC S9(2).
000230    03  ()資産コード                       PIC S9(7).
000240    03  ()中古資産コード                   PIC S9(1).
000250    03  ()資産処分コード                   PIC  X(1).
000260    03  ()耐用年数                         PIC S9(2).
000270    03  ()付保区分.
000280     05  ()付保区分－動産総合              PIC  X(1).
000290     05  ()付保区分－信用保険              PIC  X(1).
000300    03  ()数量                             PIC S9(4).
000310    03  ()個別リース料                     PIC S9(13)
000315                                           SIGN LEADING SEPARATE.
000320    03  ()個別契約金額                     PIC S9(13)
000325                                           SIGN LEADING SEPARATE.
000330    03  ()残価情報.
000340     05  ()残価情報－残価保証区分          PIC S9(1).
000350     05  ()残価情報－残価保証先コード      PIC  X(8).
000360     05  ()残価情報－残価保証先名          PIC  X(60).
000370     05  ()残価情報－残価額１保証          PIC S9(13)
000375                                           SIGN LEADING SEPARATE.
000380     05  ()残価情報－残価額２見積          PIC S9(13)
000385                                           SIGN LEADING SEPARATE.
000390     05  ()残価情報－継続リース償却対象額  PIC S9(13)
000495                                           SIGN LEADING SEPARATE.
000400    03  FILLER                             PIC  X(8).
000410    03  ()物件名漢字                       PIC  X(60).
000420    03  ()物件名カナ                       PIC  X(30).
000430    03  ()仕様製造番号                     PIC  X(20).
000440    03  ()解約情報.
000450     05  ()解約対象コード                  PIC  X(1).
000460     05  ()解約処理コード                  PIC  X(1).
000470     05  ()解約日.
000480      07  ()解約日－世紀                   PIC S9(1).
000490      07  ()解約日－年月日                 PIC  X(6).
000500    03  ()処理日再リース継続リース.
000510     05  ()処理日再リース継続リース世紀    PIC S9(1).
000520     05  ()処理日再リース継続リース年月日  PIC  X(6).
000530    03  ()再リース周回コード               PIC S9(1).
000540    03  FILLER                             PIC  X(3).
000550    03  ()購入先情報.
000560     05  ()購入先コード                    PIC  X(8).
000570     05  ()購入先金額                      PIC S9(13)
000575                                           SIGN LEADING SEPARATE.
000580     05  ()仕入消費税                      PIC S9(13)
000585                                           SIGN LEADING SEPARATE.
000590    03  ()ディーラーコード                 PIC  X(5).
000600    03  FILLER                             PIC  X(13).
000610    03  ()リファレンス情報.
000620     05  ()ユーザリファレンスＮＯ１        PIC  X(12).
000630     05  ()ユーザリファレンスＮＯ２        PIC  X(12).
000640     05  ()ユーザリファレンスＮＯ３        PIC  X(12).
000650     05  ()ユーザリファレンスＮＯ４        PIC  X(12).
000660    03  FILLER                             PIC  X(68).
000670    03  ()読込ＳＥＱ                       PIC S9(13)
000675                                           SIGN LEADING SEPARATE.
000680    03  ()処理年月度.
000690     05  ()処理年月度－世紀                PIC S9(1).
000700     05  ()処理年月度－年月                PIC  X(4).
000710    03  ()共通情報                         PIC  X(35).
000720    03  ()保険情報.
000730     05  ()保険情報－保険会社コード        PIC  X(1).
000740     05  ()保険情報－保険料種別            PIC  X(3).
000750    03  ()保険新規継続区分                 PIC  X(1).
000760    03  ()事故有無区分                     PIC  X(1).
000770    03  ()付保日.
000780     05  ()付保日－世紀                    PIC S9(1).
000790     05  ()付保日－年月日                  PIC  X(6).
000800    03  ()事故日.
000810     05  ()事故日－世紀                    PIC S9(1).
000820     05  ()事故日－年月日                  PIC  X(6).
000830    03  ()無事故戻し日.
000840     05  ()無事故戻し日－世紀              PIC S9(1).
000850     05  ()無事故戻し日－年月日            PIC  X(6).
000860    03  ()規定損害金ＵＰ率                 PIC S9(3)V9(7).
000870    03  ()動総保険価格                     PIC S9(13)
000875                                           SIGN LEADING SEPARATE.
000880    03  ()動総保険料                       PIC S9(13)
000885                                           SIGN LEADING SEPARATE.
000890    03  ()動総払戻し保険料                 PIC S9(13)
000895                                           SIGN LEADING SEPARATE.
000900    03  ()動総無事故戻し料                 PIC S9(13)
000905                                           SIGN LEADING SEPARATE.
000910    03  ()動総申込明細情報.
000920     05  ()当年度.
000930      07  ()動総申込明細情報－当年度ページ PIC S9(5)  SIGN LEADING SEPARATE.
000940      07  ()動総申込明細情報－当年度桁数   PIC S9(2).
000950     05  ()前年度.
000960      07  ()動総申込明細情報－前年度ページ PIC S9(5)  SIGN LEADING SEPARATE.
000970      07  ()動総申込明細情報－前年度桁数   PIC S9(2).
000980     05  FILLER                            PIC  X(8).
000990    03  ()再リース付保率                   PIC S9(2).
001000    03  ()動総保険料率                     PIC S9(4)V9(6)
001005                                           SIGN LEADING SEPARATE.
001010    03  FILLER                             PIC  X(10).
001020    03  ()信用保険コード.
001030     05  ()信用保険コード－リース割賦区分  PIC  X(1).
001040     05  ()信用保険コード－機械区分        PIC  X(2).
001050     05  ()信用保険コード－機種名番号      PIC  X(2).
001060    03  ()型式番号                         PIC  X(15).
001070    03  ()通知書送付日.
001080     05  ()通知書送付日－世紀              PIC S9(1).
001090     05  ()通知書送付日－年月日            PIC  X(6).
001100    03  ()符号一連番号                     PIC  X(5).
001110    03  ()信用保険料                       PIC S9(13)
001115                                           SIGN LEADING SEPARATE.
001120    03  ()動総保険証券番号                 PIC  X(11).
001130    03  FILLER                             PIC  X(15).
001140    03  ()保険情報－処理年月度.
001150     05  ()保険情報－処理年月度－世紀      PIC S9(1).
001160     05  ()保険情報－処理年月度－年月      PIC  X(4).
001170    03  ()固定資産申告情報.
001180     05  ()納付先コード                    PIC  X(6).
001190     05  ()税区分                          PIC S9(1).
001200     05  ()税負担区分                      PIC  X(1).
001210     05  ()耐用年数短縮区分                PIC  X(1).
001220     05  ()移動情報.
001230      07  ()移動情報－移動区分             PIC  X(1).
001240      07  ()移動情報－世紀                 PIC S9(1).
001250      07  ()移動情報－年月日               PIC  X(6).
001260     05  FILLER                            PIC  X(10).
001270    03  ()償却資産税申告.
001280     05  ()特例.
001290      07  ()特例－期間                     PIC S9(2).
001300      07  ()特例－率.
001310       09  ()特例－分子                    PIC S9(2).
001320       09  ()特例－分母                    PIC S9(3).
001330     05  ()年税額                          PIC S9(13)
001330                                           SIGN LEADING SEPARATE.
001340     05  ()前年度評価額                    PIC S9(13)
001345                                           SIGN LEADING SEPARATE.
001350     05  ()前年度理論簿価                  PIC S9(13)
001355                                           SIGN LEADING SEPARATE.
001360     05  ()当年度評価額                    PIC S9(13)
001365                                           SIGN LEADING SEPARATE.
001370     05  ()当年度理論簿価                  PIC S9(13)
001375                                           SIGN LEADING SEPARATE.
001380     05  ()特別課税標準額                  PIC S9(13)
001385                                           SIGN LEADING SEPARATE.
001390    03  ()前回申告先                       PIC  X(6).
001400    03  ()設置場所名漢字                   PIC  X(40).
001410    03  ()設置場所名カナ                   PIC  X(20).
001420    03  ()設置場所郵便番号.
001430     05  ()設置場所郵便番号－親            PIC  X(3).
001440     05  ()設置場所郵便番号－子            PIC  X(4).
001450    03  ()設置場所住所漢字                 PIC  X(100).
001460    03  FILLER                             PIC  X(11).
001470    03  ()固定資産申告情報－処理年月度.
001480     05  ()固定資産申告情報処理年月度世紀  PIC S9(1).
001490     05  ()固定資産申告情報処理年月度年月  PIC  X(4).
001500    03  ()償却計算情報.
001510     05  ()償却計算会社.
001520      07  ()会社前期末簿価                 PIC S9(13)
001425                                           SIGN LEADING SEPARATE.
001530      07  ()会社当月償却高                 PIC S9(13)
001535                                           SIGN LEADING SEPARATE.
001540      07  ()会社当期償却高                 PIC S9(13)
001545                                           SIGN LEADING SEPARATE.
001550      07  ()会社現在簿価                   PIC S9(13)
001555                                           SIGN LEADING SEPARATE.
001560     05  FILLER                            PIC  X(10).
001570    03  ()償却計算法定.
001580     05  ()税法償却区分                    PIC S9(2).
001590     05  ()税法割増区分                    PIC S9(2).
001600     05  ()税法特別償却率.
001610      07  ()税法特別償却率－分子           PIC S9(2).
001620      07  ()税法特別償却率－分母           PIC S9(3).
001630     05  ()税法前期末簿価法定              PIC S9(13)
001635                                           SIGN LEADING SEPARATE.
001640     05  ()税法普通償却費                  PIC S9(13)
001645                                           SIGN LEADING SEPARATE.
001650     05  ()税法割増償却費                  PIC S9(13)
001655                                           SIGN LEADING SEPARATE.
001660     05  ()税法特別償却費                  PIC S9(13)
001665                                           SIGN LEADING SEPARATE.
001670     05  ()税法当期末簿価                  PIC S9(13)
001675                                           SIGN LEADING SEPARATE.
001680     05  ()税法繰越超過額                  PIC S9(13)
001685                                           SIGN LEADING SEPARATE.
001690     05  ()税法償却限度額                  PIC S9(13)
001895                                           SIGN LEADING SEPARATE.
001700    03  FILLER                             PIC  X(15).
001710    03  ()理論簿価情報.
001720     05  ()会社理論前期末簿価              PIC S9(13)
000725                                           SIGN LEADING SEPARATE.
001730     05  ()会社理論当期末簿価              PIC S9(13)
001735                                           SIGN LEADING SEPARATE.
001740    03  ()当期償却過不足額                 PIC S9(13)
001745                                           SIGN LEADING SEPARATE.
001750    03  FILLER                             PIC  X(28).
001760    03  ()償却計算情報－処理年月度.
001770     05  ()償却計算情報処理年月度世紀 PIC S9(1).
001780     05  ()償却計算情報処理年月度年月 PIC  X(4).

