000010************************************************
000020* (MAN_PATCH_WK_SIN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()請求先コード_新       PIC  X(8).
000060 01  ()回収方式１_新         PIC  X(1).
000070 01  ()回収方式２_新         PIC  X(1).
000080 01  ()銀行コード_新         PIC  X(7).
000090 01  ()口座番号_新           PIC  X(7).
000100 01  ()預金種類_新           PIC  X(1).
000110 01  ()更新回収方式１_新     PIC  X(1).
000120 01  ()更新回収方式２_新     PIC  X(1).
000130 01  ()更新銀行コード_新     PIC  X(7).
000140 01  ()更新口座番号_新       PIC  X(7).
000150 01  ()更新預金種類_新       PIC  X(1).
