000010************************************************
000020* (MAN_MEISAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()再リースコード         PIC  X(1).
000070 01  ()再リース周回コード     PIC  X(1).
000080 01  ()リース開始日           PIC  X(8).
000090 01  ()リース終了日           PIC  X(8).
000100 01  ()リース期間             PIC S9(3) COMP-3.
000110 01  ()勘定処理コード         PIC  X(2).
000120 01  ()資産コード             PIC  X(7).
000130 01  ()残価保証先コード       PIC  X(8).
000140 01  ()残価額                 PIC S9(13) COMP-3.
000150 01  ()物件名_漢字           PIC  N(20).
000160 01  ()物件名_カナ           PIC  N(10).
000170 01  ()数量                   PIC S9(4) COMP-3.
000180 01  ()個別リース料           PIC S9(13) COMP-3.
000190 01  ()購入金額               PIC S9(13) COMP-3.
000200 01  ()ユーザーリファレンスＮＯ１ PIC  N(6).
000210 01  ()ユーザーリファレンスＮＯ２ PIC  N(6).
000220 01  ()ユーザーリファレンスＮＯ３ PIC  N(6).
000230 01  ()ユーザーリファレンスＮＯ４ PIC  N(6).
000240 01  ()動総付保区分           PIC  X(1).
000250 01  ()動総保険コード         PIC  X(4).
000260 01  ()再リース付保率         PIC  X(2).
000270 01  ()納付先コード           PIC  X(6).
000280 01  ()税区分                 PIC  X(1).
000290 01  ()設置場所名_漢字       PIC  N(20).
000300 01  ()設置場所名_カナ       PIC  N(10).
000310 01  ()設置場所郵便番号       PIC  X(7).
000320 01  ()設置場所住所           PIC  N(50).
000330 01  ()資産処分コード         PIC  X(1).
000340 01  ()満了処理日             PIC  X(8).
000350 01  ()売却物件金額           PIC S9(13) COMP-3.
000360 01  ()売却数量               PIC S9(4) COMP-3.
000370 01  ()売却引渡先区分         PIC  X(1).
000380 01  ()売却引渡先名_漢字     PIC  N(30).
000390 01  ()売却引渡先名_カナ     PIC  N(15).
000400 01  ()売却金額入金先コード   PIC  X(8).
000410 01  ()売却金額               PIC S9(13) COMP-3.
000420 01  ()売却税率               PIC S9(2)V9(1) COMP-3.
000430 01  ()売却委託手数料         PIC S9(13) COMP-3.
000440 01  ()売却金額入金予定日     PIC  X(8).
000450 01  ()受渡期限               PIC  N(30).
000460 01  ()支払条件               PIC  N(30).
000470 01  ()廃棄物件金額           PIC S9(13) COMP-3.
000480 01  ()廃棄数量               PIC S9(4) COMP-3.
000490 01  ()廃棄引渡先区分         PIC  X(1).
000500 01  ()廃棄引渡先名_漢字     PIC  N(30).
000510 01  ()廃棄引渡先名_カナ     PIC  N(15).
000520 01  ()引取費用               PIC S9(13) COMP-3.
000530 01  ()再リース処理日         PIC  X(8).
000540 01  ()再リース物件金額       PIC S9(13) COMP-3.
000550 01  ()再リース数量           PIC S9(4) COMP-3.
000560 01  ()再リース開始日         PIC  X(8).
000570 01  ()再リース期間           PIC S9(3) COMP-3.
000580 01  ()再リース料_請求金額   PIC S9(13) COMP-3.
000590 01  ()再リース取扱手数料     PIC S9(13) COMP-3.
000600 01  ()請求先コード           PIC  X(8).
000610 01  ()回収方式１             PIC  X(1).
000620 01  ()回収方式２             PIC  X(1).
000630 01  ()請求サイクル           PIC S9(2) COMP-3.
000640 01  ()支払回数               PIC S9(3) COMP-3.
000650 01  ()ＢＥＧＩＮ回数         PIC  X(1).
000660 01  ()計算方式               PIC  X(1).
000670 01  ()銀行コード             PIC  X(7).
000680 01  ()口座番号               PIC  X(7).
000690 01  ()預金種類               PIC  X(1).
000700 01  ()入金日                 PIC S9(2) COMP-3.
000710 01  ()第１回リース料入金日   PIC  X(8).
000720 01  ()再リースコード_新     PIC  X(1).
000730 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000740 01  ()再リース付保率_新     PIC S9(2) COMP-3.
000750 01  ()保守契約区分           PIC  X(1).
000760 01  ()残価額_新             PIC S9(13) COMP-3.
000770 01  ()登録日                 PIC  X(8).
000780 01  ()登録時刻               PIC  X(6).
000790 01  ()登録担当者コード       PIC  X(4).
000800 01  ()更新日                 PIC  X(8).
000810 01  ()更新時刻               PIC  X(6).
000820 01  ()更新担当者コード       PIC  X(4).
000830 01  ()個別契約金額_元       PIC S9(13) COMP-3.
000840 01  ()継続リース償却対象額   PIC S9(13) COMP-3.
000850 01  ()個別再リース料         PIC S9(13) COMP-3.
000860 01  ()個別消費税             PIC S9(13) COMP-3.
