000010************************************************
000020* (MAN_PATCH_WK_JUSIN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()請求先コード           PIC  X(8).
000060 01  ()回収方式               PIC  X(1).
000070 01  ()銀行コード             PIC  X(7).
000080 01  ()口座番号               PIC  X(7).
000090 01  ()預金種類               PIC  X(1).
000100 01  ()更新回収方式           PIC  X(1).
000110 01  ()更新銀行コード         PIC  X(7).
000120 01  ()更新口座番号           PIC  X(7).
000130 01  ()更新預金種類           PIC  X(1).
