000010************************************************
000020* (MAN_WK_MEISAI)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()契約番号               PIC  X(9).
000060 01  ()物件ＮＯ               PIC  X(3).
000070 01  ()再リースコード         PIC  X(1).
000080 01  ()再リース周回コード     PIC  X(1).
000090 01  ()リース開始日           PIC  X(8).
000100 01  ()リース終了日           PIC  X(8).
000110 01  ()リース期間             PIC S9(3) COMP-3.
000120 01  ()勘定処理コード         PIC  X(2).
000130 01  ()資産コード             PIC  X(7).
000140 01  ()残価保証先コード       PIC  X(8).
000150 01  ()残価額                 PIC S9(13) COMP-3.
000160 01  ()物件名_漢字           PIC  N(20).
000170 01  ()物件名_カナ           PIC  N(10).
000180 01  ()数量                   PIC S9(4) COMP-3.
000190 01  ()個別リース料           PIC S9(13) COMP-3.
000200 01  ()購入金額               PIC S9(13) COMP-3.
000210 01  ()ユーザーリファレンスＮＯ１ PIC  N(6).
000220 01  ()ユーザーリファレンスＮＯ２ PIC  N(6).
000230 01  ()ユーザーリファレンスＮＯ３ PIC  N(6).
000240 01  ()ユーザーリファレンスＮＯ４ PIC  N(6).
000250 01  ()動総付保区分           PIC  X(1).
000260 01  ()動総保険コード         PIC  X(4).
000270 01  ()再リース付保率         PIC  X(2).
000280 01  ()納付先コード           PIC  X(6).
000290 01  ()税区分                 PIC  X(1).
000300 01  ()設置場所名_漢字       PIC  N(20).
000310 01  ()設置場所名_カナ       PIC  N(10).
000320 01  ()設置場所郵便番号       PIC  X(7).
000330 01  ()設置場所住所           PIC  N(50).
000340 01  ()資産処分コード         PIC  X(1).
000350 01  ()満了処理日             PIC  X(8).
000360 01  ()売却物件金額           PIC S9(13) COMP-3.
000370 01  ()売却数量               PIC S9(4) COMP-3.
000380 01  ()売却引渡先区分         PIC  X(1).
000390 01  ()売却引渡先名_漢字     PIC  N(30).
000400 01  ()売却引渡先名_カナ     PIC  N(15).
000410 01  ()売却金額入金先コード   PIC  X(8).
000420 01  ()売却金額               PIC S9(13) COMP-3.
000430 01  ()売却税率               PIC S9(2)V9(1) COMP-3.
000440 01  ()売却委託手数料         PIC S9(13) COMP-3.
000450 01  ()売却金額入金予定日     PIC  X(8).
000460 01  ()受渡期限               PIC  N(30).
000470 01  ()支払条件               PIC  N(30).
000480 01  ()廃棄物件金額           PIC S9(13) COMP-3.
000490 01  ()廃棄数量               PIC S9(4) COMP-3.
000500 01  ()廃棄引渡先区分         PIC  X(1).
000510 01  ()廃棄引渡先名_漢字     PIC  N(30).
000520 01  ()廃棄引渡先名_カナ     PIC  N(15).
000530 01  ()引取費用               PIC S9(13) COMP-3.
000540 01  ()再リース処理日         PIC  X(8).
000550 01  ()再リース物件金額       PIC S9(13) COMP-3.
000560 01  ()再リース数量           PIC S9(4) COMP-3.
000570 01  ()再リース開始日         PIC  X(8).
000580 01  ()再リース期間           PIC S9(3) COMP-3.
000590 01  ()再リース料_請求金額   PIC S9(13) COMP-3.
000600 01  ()再リース取扱手数料     PIC S9(13) COMP-3.
000610 01  ()請求先コード           PIC  X(8).
000620 01  ()回収方式１             PIC  X(1).
000630 01  ()回収方式２             PIC  X(1).
000640 01  ()請求サイクル           PIC S9(2) COMP-3.
000650 01  ()支払回数               PIC S9(3) COMP-3.
000660 01  ()ＢＥＧＩＮ回数         PIC  X(1).
000670 01  ()計算方式               PIC  X(1).
000680 01  ()銀行コード             PIC  X(7).
000690 01  ()口座番号               PIC  X(7).
000700 01  ()預金種類               PIC  X(1).
000710 01  ()入金日                 PIC S9(2) COMP-3.
000720 01  ()第１回リース料入金日   PIC  X(8).
000730 01  ()再リースコード_新     PIC  X(1).
000740 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000750 01  ()再リース付保率_新     PIC S9(2) COMP-3.
000760 01  ()保守契約区分           PIC  X(1).
000770 01  ()残価額_新             PIC S9(13) COMP-3.
