000010************************************************
000020* ƒRƒ“ƒgƒ[ƒ‹ƒf[ƒ^Ž{Ý”…žÓ”C•ÛŒ¯ƒtƒ@ƒCƒ‹(MCLT22)
000030************************************************
000040 01  ‚l‚b‚k‚s‚Q‚Q|Ž¯•Ê                     PIC  X(007).
000050 01  ‚l‚b‚k‚s‚Q‚Q|Ží•Ê                     PIC  X(001).
000060 01  ‚l‚b‚k‚s‚Q‚Q|ƒ_ƒ~[‚O‚O‚P             PIC  X(007).
000070 01  ‚l‚b‚k‚s‚Q‚Q|•ÛŒ¯’P‰¿‰~               PIC S9(003) COMP-3.
000080 01  ‚l‚b‚k‚s‚Q‚Q|ƒ_ƒ~[‚O‚O‚Q             PIC  X(001).
000090 01  ‚l‚b‚k‚s‚Q‚Q|ƒ†[ƒU[ƒR[ƒh‚P         PIC  X(008).
000100 01  ‚l‚b‚k‚s‚Q‚Q|ƒ_ƒ~[‚O‚O‚R             PIC  X(001).
000110 01  ‚l‚b‚k‚s‚Q‚Q|ƒ†[ƒU[ƒR[ƒh‚Q         PIC  X(008).
000120 01  ‚l‚b‚k‚s‚Q‚Q|ƒ_ƒ~[‚O‚O‚S             PIC  X(001).
000130 01  ‚l‚b‚k‚s‚Q‚Q|ƒ†[ƒU[ƒR[ƒh‚R         PIC  X(008).
000140 01  ‚l‚b‚k‚s‚Q‚Q|ƒ_ƒ~[‚O‚O‚T             PIC  X(001).
000150 01  ‚l‚b‚k‚s‚Q‚Q|ƒ†[ƒU[ƒR[ƒh‚S         PIC  X(008).
000160 01  ‚l‚b‚k‚s‚Q‚Q|ƒ_ƒ~[‚O‚O‚U             PIC  X(001).
000170 01  ‚l‚b‚k‚s‚Q‚Q|ƒ†[ƒU[ƒR[ƒh‚T         PIC  X(008).
000180 01  ‚l‚b‚k‚s‚Q‚Q|ƒ_ƒ~[‚O‚O‚V             PIC  X(001).
000190 01  ‚l‚b‚k‚s‚Q‚Q|“K—p”NŒŽ                 PIC  X(005).
000200 01  ‚l‚b‚k‚s‚Q‚Q|ÄƒŠ[ƒXo—Í‹æ•ª         PIC  X(001).
