000010************************************************
000020* (MFS_TORERA)
000030************************************************
000040 01  ()データ区分             PIC  X(1).
000050 01  ()請求合計件数           PIC S9(6) COMP-3.
000060 01  ()請求合計金額           PIC S9(12) COMP-3.
000070 01  ()振替済合計件数         PIC  X(6).
000080 01  ()振替済合計金額         PIC  X(12).
000090 01  ()振替不能合計件数       PIC  X(6).
000100 01  ()振替不能合計金額       PIC  X(12).
000110 01  ()ダミー                 PIC  X(65).
