000010************************************************
000020* (MST_SINYO)
000030************************************************
000040 01  ()信用保険料率コード     PIC  X(4).
000050 01  ()適用日_１             PIC  X(8).
000060 01  ()信用保険保険料率_１   PIC S9(2)V9(8) COMP-3.
000070 01  ()適用日_２             PIC  X(8).
000080 01  ()信用保険保険料率_２   PIC S9(2)V9(8) COMP-3.
000090 01  ()適用日_３             PIC  X(8).
000100 01  ()信用保険保険料率_３   PIC S9(2)V9(8) COMP-3.
000110 01  ()信用保険料率区分       PIC  X(1).
000120 01  ()リース_割賦区分       PIC  X(1).
000130 01  ()信用保険コード_機械区分 PIC  X(2).
000140 01  ()信用保険コード_機種区分 PIC  X(2).
000150 01  ()登録日                 PIC  X(8).
000160 01  ()登録時刻               PIC  X(6).
000170 01  ()登録担当者コード       PIC  X(4).
000180 01  ()更新日                 PIC  X(8).
000190 01  ()更新時刻               PIC  X(6).
000200 01  ()更新担当者コード       PIC  X(4).
000210 01  ()付保区分               PIC  X(1).
000220 01  ()保険期間月数_１       PIC  X(3).
000230 01  ()割増割引区分_１       PIC  X(1).
000240 01  ()割増割引率_１         PIC S9(2)V9(8) COMP-3.
000250 01  ()保険期間月数_２       PIC  X(3).
000260 01  ()割増割引区分_２       PIC  X(1).
000270 01  ()割増割引率_２         PIC S9(2)V9(8) COMP-3.
000280 01  ()保険期間月数_３       PIC  X(3).
000290 01  ()割増割引区分_３       PIC  X(1).
000300 01  ()割増割引率_３         PIC S9(2)V9(8) COMP-3.
