000010************************************************
000020* (MST_SINYOREI)
000030************************************************
000040 01  ()ƒŠ[ƒX_Š„•Š‹æ•ª       PIC  X(1).
000050 01  ()M—p•ÛŒ¯ƒR[ƒh_‹@Ží‹æ•ª PIC  X(2).
000060 01  ()‹ï‘Ì—á_‚P             PIC  N(25).
000070 01  ()‹ï‘Ì—á_‚Q             PIC  N(25).
000080 01  ()‹ï‘Ì—á_‚R             PIC  N(25).
000090 01  ()‹ï‘Ì—á_‚S             PIC  N(25).
000100 01  ()‹ï‘Ì—á_‚T             PIC  N(25).
000110 01  ()‹ï‘Ì—á_‚U             PIC  N(25).
000120 01  ()‹ï‘Ì—á_‚V             PIC  N(25).
000130 01  ()‹ï‘Ì—á_‚W             PIC  N(25).
000140 01  ()‹ï‘Ì—á_‚X             PIC  N(25).
000150 01  ()‹ï‘Ì—á_‚P‚O           PIC  N(25).
000160 01  ()‹ï‘Ì—á_‚P‚P           PIC  N(25).
000170 01  ()‹ï‘Ì—á_‚P‚Q           PIC  N(25).
000180 01  ()‹ï‘Ì—á_‚P‚R           PIC  N(25).
000190 01  ()‹ï‘Ì—á_‚P‚S           PIC  N(25).
000200 01  ()‹ï‘Ì—á_‚P‚T           PIC  N(25).
000210 01  ()‹ï‘Ì—á_‚P‚U           PIC  N(25).
000220 01  ()‹ï‘Ì—á_‚P‚V           PIC  N(25).
000230 01  ()‹ï‘Ì—á_‚P‚W           PIC  N(25).
000240 01  ()‹ï‘Ì—á_‚P‚X           PIC  N(25).
000250 01  ()‹ï‘Ì—á_‚Q‚O           PIC  N(25).
000260 01  ()‹ï‘Ì—á_‚Q‚P           PIC  N(25).
000270 01  ()‹ï‘Ì—á_‚Q‚Q           PIC  N(25).
000280 01  ()‹ï‘Ì—á_‚Q‚R           PIC  N(25).
000290 01  ()‹ï‘Ì—á_‚Q‚S           PIC  N(25).
000300 01  ()‹ï‘Ì—á_‚Q‚T           PIC  N(25).
000310 01  ()‹ï‘Ì—á_‚Q‚U           PIC  N(25).
000320 01  ()‹ï‘Ì—á_‚Q‚V           PIC  N(25).
000330 01  ()‹ï‘Ì—á_‚Q‚W           PIC  N(25).
000340 01  ()‹ï‘Ì—á_‚Q‚X           PIC  N(25).
000350 01  ()‹ï‘Ì—á_‚R‚O           PIC  N(25).
000360 01  ()‹ï‘Ì—á_‚R‚P           PIC  N(25).
000370 01  ()‹ï‘Ì—á_‚R‚Q           PIC  N(25).
000380 01  ()‹ï‘Ì—á_‚R‚R           PIC  N(25).
000390 01  ()‹ï‘Ì—á_‚R‚S           PIC  N(25).
000400 01  ()‹ï‘Ì—á_‚R‚T           PIC  N(25).
000410 01  ()‹ï‘Ì—á_‚R‚U           PIC  N(25).
000420 01  ()‹ï‘Ì—á_‚R‚V           PIC  N(25).
000430 01  ()‹ï‘Ì—á_‚R‚W           PIC  N(25).
000440 01  ()‹ï‘Ì—á_‚R‚X           PIC  N(25).
000450 01  ()‹ï‘Ì—á_‚S‚O           PIC  N(25).
000460 01  ()‹ï‘Ì—á_‚S‚P           PIC  N(25).
000470 01  ()‹ï‘Ì—á_‚S‚Q           PIC  N(25).
000480 01  ()‹ï‘Ì—á_‚S‚R           PIC  N(25).
000490 01  ()‹ï‘Ì—á_‚S‚S           PIC  N(25).
000500 01  ()‹ï‘Ì—á_‚S‚T           PIC  N(25).
000510 01  ()‹ï‘Ì—á_‚S‚U           PIC  N(25).
000520 01  ()‹ï‘Ì—á_‚S‚V           PIC  N(25).
000530 01  ()‹ï‘Ì—á_‚S‚W           PIC  N(25).
000540 01  ()‹ï‘Ì—á_‚S‚X           PIC  N(25).
000550 01  ()‹ï‘Ì—á_‚T‚O           PIC  N(25).
000560 01  ()‹ï‘Ì—á_‚T‚P           PIC  N(25).
000570 01  ()‹ï‘Ì—á_‚T‚Q           PIC  N(25).
000580 01  ()‹ï‘Ì—á_‚T‚R           PIC  N(25).
000590 01  ()‹ï‘Ì—á_‚T‚S           PIC  N(25).
000600 01  ()‹ï‘Ì—á_‚T‚T           PIC  N(25).
000610 01  ()‹ï‘Ì—á_‚T‚U           PIC  N(25).
000620 01  ()‹ï‘Ì—á_‚T‚V           PIC  N(25).
000630 01  ()‹ï‘Ì—á_‚T‚W           PIC  N(25).
000640 01  ()‹ï‘Ì—á_‚T‚X           PIC  N(25).
000650 01  ()‹ï‘Ì—á_‚U‚O           PIC  N(25).
000660 01  ()‹ï‘Ì—á_‚U‚P           PIC  N(25).
000670 01  ()‹ï‘Ì—á_‚U‚Q           PIC  N(25).
000680 01  ()‹ï‘Ì—á_‚U‚R           PIC  N(25).
000690 01  ()‹ï‘Ì—á_‚U‚S           PIC  N(25).
000700 01  ()‹ï‘Ì—á_‚U‚T           PIC  N(25).
000710 01  ()‹ï‘Ì—á_‚U‚U           PIC  N(25).
000720 01  ()‹ï‘Ì—á_‚U‚V           PIC  N(25).
000730 01  ()‹ï‘Ì—á_‚U‚W           PIC  N(25).
000740 01  ()‹ï‘Ì—á_‚U‚X           PIC  N(25).
000750 01  ()‹ï‘Ì—á_‚V‚O           PIC  N(25).
000760 01  ()‹ï‘Ì—á_‚V‚P           PIC  N(25).
000770 01  ()‹ï‘Ì—á_‚V‚Q           PIC  N(25).
000780 01  ()‹ï‘Ì—á_‚V‚R           PIC  N(25).
000790 01  ()‹ï‘Ì—á_‚V‚S           PIC  N(25).
000800 01  ()‹ï‘Ì—á_‚V‚T           PIC  N(25).
000810 01  ()‹ï‘Ì—á_‚V‚U           PIC  N(25).
000820 01  ()‹ï‘Ì—á_‚V‚V           PIC  N(25).
000830 01  ()‹ï‘Ì—á_‚V‚W           PIC  N(25).
000840 01  ()‹ï‘Ì—á_‚V‚X           PIC  N(25).
000850 01  ()‹ï‘Ì—á_‚W‚O           PIC  N(25).
000860 01  ()‹ï‘Ì—á_‚W‚P           PIC  N(25).
000870 01  ()‹ï‘Ì—á_‚W‚Q           PIC  N(25).
000880 01  ()‹ï‘Ì—á_‚W‚R           PIC  N(25).
000890 01  ()‹ï‘Ì—á_‚W‚S           PIC  N(25).
000900 01  ()‹ï‘Ì—á_‚W‚T           PIC  N(25).
000910 01  ()‹ï‘Ì—á_‚W‚U           PIC  N(25).
000920 01  ()‹ï‘Ì—á_‚W‚V           PIC  N(25).
000930 01  ()‹ï‘Ì—á_‚W‚W           PIC  N(25).
000940 01  ()‹ï‘Ì—á_‚W‚X           PIC  N(25).
000950 01  ()‹ï‘Ì—á_‚X‚O           PIC  N(25).
000960 01  ()‹ï‘Ì—á_‚X‚P           PIC  N(25).
000970 01  ()‹ï‘Ì—á_‚X‚Q           PIC  N(25).
000980 01  ()‹ï‘Ì—á_‚X‚R           PIC  N(25).
000990 01  ()‹ï‘Ì—á_‚X‚S           PIC  N(25).
001000 01  ()‹ï‘Ì—á_‚X‚T           PIC  N(25).
001010 01  ()‹ï‘Ì—á_‚X‚U           PIC  N(25).
001020 01  ()‹ï‘Ì—á_‚X‚V           PIC  N(25).
001030 01  ()‹ï‘Ì—á_‚X‚W           PIC  N(25).
001040 01  ()‹ï‘Ì—á_‚X‚X           PIC  N(25).
001050 01  ()‹ï‘Ì—á_‚P‚O‚O         PIC  N(25).
001060 01  ()‹ï‘Ì—á_‚P‚O‚P         PIC  N(25).
001070 01  ()‹ï‘Ì—á_‚P‚O‚Q         PIC  N(25).
001080 01  ()‹ï‘Ì—á_‚P‚O‚R         PIC  N(25).
001090 01  ()‹ï‘Ì—á_‚P‚O‚S         PIC  N(25).
001100 01  ()‹ï‘Ì—á_‚P‚O‚T         PIC  N(25).
001110 01  ()‹ï‘Ì—á_‚P‚O‚U         PIC  N(25).
001120 01  ()‹ï‘Ì—á_‚P‚O‚V         PIC  N(25).
001130 01  ()‹ï‘Ì—á_‚P‚O‚W         PIC  N(25).
001140 01  ()‹ï‘Ì—á_‚P‚O‚X         PIC  N(25).
001150 01  ()‹ï‘Ì—á_‚P‚P‚O         PIC  N(25).
001160 01  ()‹ï‘Ì—á_‚P‚P‚P         PIC  N(25).
001170 01  ()‹ï‘Ì—á_‚P‚P‚Q         PIC  N(25).
001180 01  ()‹ï‘Ì—á_‚P‚P‚R         PIC  N(25).
001190 01  ()‹ï‘Ì—á_‚P‚P‚S         PIC  N(25).
001200 01  ()‹ï‘Ì—á_‚P‚P‚T         PIC  N(25).
001210 01  ()‹ï‘Ì—á_‚P‚P‚U         PIC  N(25).
001220 01  ()‹ï‘Ì—á_‚P‚P‚V         PIC  N(25).
001230 01  ()‹ï‘Ì—á_‚P‚P‚W         PIC  N(25).
001240 01  ()‹ï‘Ì—á_‚P‚P‚X         PIC  N(25).
001250 01  ()‹ï‘Ì—á_‚P‚Q‚O         PIC  N(25).
001260 01  ()‹ï‘Ì—á_‚P‚Q‚P         PIC  N(25).
001270 01  ()‹ï‘Ì—á_‚P‚Q‚Q         PIC  N(25).
001280 01  ()‹ï‘Ì—á_‚P‚Q‚R         PIC  N(25).
001290 01  ()‹ï‘Ì—á_‚P‚Q‚S         PIC  N(25).
001300 01  ()‹ï‘Ì—á_‚P‚Q‚T         PIC  N(25).
001310 01  ()‹ï‘Ì—á_‚P‚Q‚U         PIC  N(25).
001320 01  ()‹ï‘Ì—á_‚P‚Q‚V         PIC  N(25).
001330 01  ()‹ï‘Ì—á_‚P‚Q‚W         PIC  N(25).
001340 01  ()‹ï‘Ì—á_‚P‚Q‚X         PIC  N(25).
001350 01  ()‹ï‘Ì—á_‚P‚R‚O         PIC  N(25).
001360 01  ()‹ï‘Ì—á_‚P‚R‚P         PIC  N(25).
001370 01  ()‹ï‘Ì—á_‚P‚R‚Q         PIC  N(25).
001380 01  ()‹ï‘Ì—á_‚P‚R‚R         PIC  N(25).
001390 01  ()‹ï‘Ì—á_‚P‚R‚S         PIC  N(25).
001400 01  ()‹ï‘Ì—á_‚P‚R‚T         PIC  N(25).
001410 01  ()‹ï‘Ì—á_‚P‚R‚U         PIC  N(25).
001420 01  ()‹ï‘Ì—á_‚P‚R‚V         PIC  N(25).
001430 01  ()‹ï‘Ì—á_‚P‚R‚W         PIC  N(25).
001440 01  ()‹ï‘Ì—á_‚P‚R‚X         PIC  N(25).
001450 01  ()‹ï‘Ì—á_‚P‚S‚O         PIC  N(25).
001460 01  ()‹ï‘Ì—á_‚P‚S‚P         PIC  N(25).
001470 01  ()‹ï‘Ì—á_‚P‚S‚Q         PIC  N(25).
001480 01  ()‹ï‘Ì—á_‚P‚S‚R         PIC  N(25).
001490 01  ()‹ï‘Ì—á_‚P‚S‚S         PIC  N(25).
001500 01  ()‹ï‘Ì—á_‚P‚S‚T         PIC  N(25).
001510 01  ()‹ï‘Ì—á_‚P‚S‚U         PIC  N(25).
001520 01  ()‹ï‘Ì—á_‚P‚S‚V         PIC  N(25).
001530 01  ()‹ï‘Ì—á_‚P‚S‚W         PIC  N(25).
001540 01  ()‹ï‘Ì—á_‚P‚S‚X         PIC  N(25).
001550 01  ()‹ï‘Ì—á_‚P‚T‚O         PIC  N(25).
001560 01  ()‘ÎÛŠO_‚P             PIC  N(25).
001570 01  ()‘ÎÛŠO_‚Q             PIC  N(25).
001580 01  ()‘ÎÛŠO_‚R             PIC  N(25).
001590 01  ()‘ÎÛŠO_‚S             PIC  N(25).
001600 01  ()‘ÎÛŠO_‚T             PIC  N(25).
001610 01  ()‘ÎÛŠO_‚U             PIC  N(25).
001620 01  ()‘ÎÛŠO_‚V             PIC  N(25).
001630 01  ()‘ÎÛŠO_‚W             PIC  N(25).
001640 01  ()‘ÎÛŠO_‚X             PIC  N(25).
001650 01  ()‘ÎÛŠO_‚P‚O           PIC  N(25).
001660 01  ()‘ÎÛŠO_‚P‚P           PIC  N(25).
001670 01  ()‘ÎÛŠO_‚P‚Q           PIC  N(25).
001680 01  ()‘ÎÛŠO_‚P‚R           PIC  N(25).
001690 01  ()‘ÎÛŠO_‚P‚S           PIC  N(25).
001700 01  ()‘ÎÛŠO_‚P‚T           PIC  N(25).
001710 01  ()‘ÎÛŠO_‚P‚U           PIC  N(25).
001720 01  ()‘ÎÛŠO_‚P‚V           PIC  N(25).
001730 01  ()‘ÎÛŠO_‚P‚W           PIC  N(25).
001740 01  ()‘ÎÛŠO_‚P‚X           PIC  N(25).
001750 01  ()‘ÎÛŠO_‚Q‚O           PIC  N(25).
001760 01  ()‘ÎÛŠO_‚Q‚P           PIC  N(25).
001770 01  ()‘ÎÛŠO_‚Q‚Q           PIC  N(25).
001780 01  ()‘ÎÛŠO_‚Q‚R           PIC  N(25).
001790 01  ()‘ÎÛŠO_‚Q‚S           PIC  N(25).
001800 01  ()‘ÎÛŠO_‚Q‚T           PIC  N(25).
001810 01  ()‘ÎÛŠO_‚Q‚U           PIC  N(25).
001820 01  ()‘ÎÛŠO_‚Q‚V           PIC  N(25).
001830 01  ()‘ÎÛŠO_‚Q‚W           PIC  N(25).
001840 01  ()‘ÎÛŠO_‚Q‚X           PIC  N(25).
001850 01  ()‘ÎÛŠO_‚R‚O           PIC  N(25).
001860 01  ()‘ÎÛŠO_‚R‚P           PIC  N(25).
001870 01  ()‘ÎÛŠO_‚R‚Q           PIC  N(25).
001880 01  ()‘ÎÛŠO_‚R‚R           PIC  N(25).
001890 01  ()‘ÎÛŠO_‚R‚S           PIC  N(25).
001900 01  ()‘ÎÛŠO_‚R‚T           PIC  N(25).
001910 01  ()‘ÎÛŠO_‚R‚U           PIC  N(25).
001920 01  ()‘ÎÛŠO_‚R‚V           PIC  N(25).
001930 01  ()‘ÎÛŠO_‚R‚W           PIC  N(25).
001940 01  ()‘ÎÛŠO_‚R‚X           PIC  N(25).
001950 01  ()‘ÎÛŠO_‚S‚O           PIC  N(25).
001960 01  ()‘ÎÛŠO_‚S‚P           PIC  N(25).
001970 01  ()‘ÎÛŠO_‚S‚Q           PIC  N(25).
001980 01  ()‘ÎÛŠO_‚S‚R           PIC  N(25).
001990 01  ()‘ÎÛŠO_‚S‚S           PIC  N(25).
002000 01  ()‘ÎÛŠO_‚S‚T           PIC  N(25).
002010 01  ()‘ÎÛŠO_‚S‚U           PIC  N(25).
002020 01  ()‘ÎÛŠO_‚S‚V           PIC  N(25).
002030 01  ()‘ÎÛŠO_‚S‚W           PIC  N(25).
002040 01  ()‘ÎÛŠO_‚S‚X           PIC  N(25).
002050 01  ()‘ÎÛŠO_‚T‚O           PIC  N(25).
002060 01  ()“o˜^“ú                 PIC  X(8).
002070 01  ()“o˜^Žž               PIC  X(6).
002080 01  ()“o˜^’S“–ŽÒƒR[ƒh       PIC  X(4).
002090 01  ()XV“ú                 PIC  X(8).
002100 01  ()XVŽž               PIC  X(6).
002110 01  ()XV’S“–ŽÒƒR[ƒh       PIC  X(4).
