000010************************************************
000020* (MST_NOFU)
000030************************************************
000040 01  ()納付先コード           PIC  X(6).
000050 01  ()納付先住所_１         PIC  N(5).
000060 01  ()納付先住所_２         PIC  N(20).
000070 01  ()納付先住所_３         PIC  N(20).
000080 01  ()納付先住所_４         PIC  N(5).
000090 01  ()納付先住所_５         PIC  N(20).
000100 01  ()納付先住所_６         PIC  N(20).
000110 01  ()登録日                 PIC  X(8).
000120 01  ()登録時刻               PIC  X(6).
000130 01  ()登録担当者コード       PIC  X(4).
000140 01  ()更新日                 PIC  X(8).
000150 01  ()更新時刻               PIC  X(6).
000160 01  ()更新担当者コード       PIC  X(4).
