000010************************************************
000020* (MST_SINYO_LEASE)
000030************************************************
000040 01  ()リース_割賦区分       PIC  X(1).
000050 01  ()保険期間月数           PIC  X(3).
000060 01  ()適用日                 PIC  X(8).
000070 01  ()信用保険料率           PIC S9(2)V9(8) COMP-3.
000080 01  ()登録日                 PIC  X(8).
000090 01  ()登録時刻               PIC  X(6).
000100 01  ()登録担当者コード       PIC  X(4).
000110 01  ()更新日                 PIC  X(8).
000120 01  ()更新時刻               PIC  X(6).
000130 01  ()更新担当者コード       PIC  X(4).
