000010************************************************
000020* (MST_SINYO_KIKAI)
000030************************************************
000040 01  ()リース_割賦区分       PIC  X(1).
000050 01  ()信用保険コード_機械区分 PIC  X(2).
000060 01  ()信用保険機械類名       PIC  N(35).
000070 01  ()金額ファイル下限       PIC S9(13) COMP-3.
000080 01  ()金額ファイル上限       PIC S9(13) COMP-3.
000090 01  ()最長期間               PIC  X(2).
000100 01  ()登録日                 PIC  X(8).
000110 01  ()登録時刻               PIC  X(6).
000120 01  ()登録担当者コード       PIC  X(4).
000130 01  ()更新日                 PIC  X(8).
000140 01  ()更新時刻               PIC  X(6).
000150 01  ()更新担当者コード       PIC  X(4).
