000010************************************************
000020* (MST_WK_002)
000030************************************************
000040 01  ()Žæˆøæ‹æ•ª             PIC  X(1).
000050 01  ()Žæˆøæ‹æ•ª–¼           PIC  N(15).
000060 01  ()ƒ[ƒN                 PIC  X(1).
