000010************************************************
000020* (MST_SHOHIZEI)
000030************************************************
000040 01  ()消費税率コード         PIC  X(2).
000050 01  ()経過措置適用開始日     PIC  X(8).
000060 01  ()経過措置適用終了日     PIC  X(8).
000070 01  ()消費税率_１           PIC S9(2)V9(1) COMP-3.
000080 01  ()適用日_１             PIC  X(8).
000090 01  ()消費税率_２           PIC S9(2)V9(1) COMP-3.
000100 01  ()適用日_２             PIC  X(8).
000110 01  ()消費税率_３           PIC S9(2)V9(1) COMP-3.
000120 01  ()適用日_３             PIC  X(8).
000130 01  ()消費税率_４           PIC S9(2)V9(1) COMP-3.
000140 01  ()適用日_４             PIC  X(8).
000150 01  ()消費税率_５           PIC S9(2)V9(1) COMP-3.
000160 01  ()適用日_５             PIC  X(8).
000170 01  ()登録日                 PIC  X(8).
000180 01  ()登録時刻               PIC  X(6).
000190 01  ()登録担当者コード       PIC  X(4).
000200 01  ()更新日                 PIC  X(8).
000210 01  ()更新時刻               PIC  X(6).
000220 01  ()更新担当者コード       PIC  X(4).
