000010************************************************
000020* (NTL_CONTRACT_CSV)
000030************************************************
000040 01  ()レコード種別           PIC  N(1.5).
000050 01  ()リース会社ＩＤ         PIC  N(4).
000060 01  ()顧客ＩＤ               PIC  N(7).
000070 01  ()契約ＩＤ               PIC  N(12).
000080 01  ()代表ＳＰ顧客ＩＤ       PIC  N(7).
000090 01  ()取引種類ＣＤ           PIC  N(2).
000100 01  ()平均月額リース料       PIC  N(7.5).
000110 01  ()次回約定回収額         PIC  N(7).
000120 01  ()成約日                 PIC  N(6).
000130 01  ()検収日                 PIC  N(6).
000140 01  ()リース期間             PIC  N(3).
000150 01  ()再リース回数           PIC  N(3).
000160 01  ()代表物件名             PIC  N(41).
000170 01  ()満了日                 PIC  N(6).
000180 01  ()残回数＿約定ベース     PIC  N(3).
000190 01  ()債権残高＿約定ベース   PIC  N(8).
000200 01  ()請求先部署名           PIC  N(33).
000210 01  ()検索用契約番号         PIC  N(12).
000220 01  ()契約ＩＤ店番           PIC  N(2.5).
000230 01  ()契約ＩＤ枝番           PIC  N(2).
000240 01  ()均等＿不均等区分       PIC  N(7).
000250 01  ()前受区分               PIC  N(7).
000260 01  ()残価有無区分           PIC  N(7).
000270 01  ()代理回収保守料区分     PIC  N(3).
000280 01  ()代理回収保守料         PIC  N(7).
000290 01  ()契約担当部署名         PIC  N(33).
000300 01  ()契約備忘情報           PIC  N(31).
000310 01  ()社員ＩＤ               PIC  N(5).
000320 01  ()ソート専用項目         PIC  N(16).
000330 01  ()契約種類               PIC  N(6).
000340 01  ()作成ＩＤ               PIC  N(6).
000350 01  ()作成日                 PIC  N(6).
000360 01  ()更新ＩＤ               PIC  N(6).
000370 01  ()更新日                 PIC  N(6).
