000010************************************************
000020* (NTL_MANTSU_CSV)
000030************************************************
000040 01  ()レコード種別           PIC  N(1.5).
000050 01  ()リース会社ＩＤ         PIC  N(4).
000060 01  ()顧客ＩＤ               PIC  N(7).
000070 01  ()契約ＩＤ               PIC  N(12).
000080 01  ()満了年月               PIC  N(4).
000090 01  ()送付先コード           PIC  N(11).
000100 01  ()再リース期間＿自       PIC  N(6).
000110 01  ()再リース期間＿至       PIC  N(6).
000120 01  ()再リース料             PIC  N(7.5).
000130 01  ()再リース料消費税       PIC  N(8).
000140 01  ()送付先会社名           PIC  N(33).
000150 01  ()送付先部署名           PIC  N(18).
000160 01  ()送付先担当者名         PIC  N(18).
000170 01  ()送付先住所             PIC  N(61).
000180 01  ()代理回収保守料         PIC  N(7.5).
000190 01  ()代理回収保守料消費税   PIC  N(8).
000200 01  ()代表物件名             PIC  N(33).
000210 01  ()ハードソフト区分       PIC  N(1.5).
000220 01  ()再リース料区分         PIC  N(3).
000230 01  ()代理回収保守料区分     PIC  N(3).
000240 01  ()ソート専用項目         PIC  N(16).
000250 01  ()備忘情報               PIC  N(31).
000260 01  ()作成ＩＤ               PIC  N(6).
000270 01  ()作成日                 PIC  N(6).
000280 01  ()更新ＩＤ               PIC  N(6).
000290 01  ()更新日                 PIC  N(6).
