000010************************************************
000020* (NTL_SNDREC)
000030************************************************
000040 01  ()GENREC           PIC  N(200).
