000010************************************************
000020* (NTT_WK_BUMON)
000030************************************************
000040 01  ()登録番号               PIC  X(4).
000050 01  ()先方参照番号           PIC  X(10).
000060 01  ()請求先コード           PIC  X(8).
000070 01  ()部門名称１             PIC  N(20).
000080 01  ()部門名称２             PIC  N(20).
000090 01  ()処理区分               PIC  X(1).
000100 01  ()チェック１             PIC  X(1).
000110 01  ()チェック２             PIC  X(1).
000120 01  ()チェック３             PIC  X(1).
000130 01  ()チェック４             PIC  X(1).
