000010************************************************
000020* (NYU_AUTOGENR)
000030************************************************
000040 01  ()GENREC           PIC  X(120).
