000010************************************************
000020* (NYU_AUTOEDIT)
000030************************************************
000040 01  ()BNKCOD           PIC  X(4).
000050 01  ()BNKNAM           PIC  X(15).
000060 01  ()BRCCOD           PIC  X(3).
000070 01  ()BRCNAM           PIC  X(15).
000080 01  ()DEPKND           PIC  X(1).
000090 01  ()DEPNUM           PIC  X(7).
000100 01  ()PAYNUM           PIC  X(8).
000110 01  ()CSTNAM           PIC  X(30).
000120 01  ()TRNAMT           PIC S9(10) COMP-3.
000130 01  ()CONTAX           PIC S9(8) COMP-3.
000140 01  ()PAYDAY           PIC  X(4).
000150 01  ()ERRFLG           PIC  X(5).
000160 01  ()DBLFLG           PIC  X(1).
