000010************************************************
000020* (NYU_NAMELIST)
000030************************************************
000040 01  ()BNKCOD           PIC  X(4).
000050 01  ()PAYNUM           PIC  X(8).
000060 01  ()CSTNAM           PIC  X(30).
000070 01  ()PAYDAY           PIC  X(2).
