000010************************************************
000020* (OBA_CNVWRK)
000030************************************************
000040 01  ()CNTNUM           PIC  N(9).
000050 01  ()USRNAM           PIC  N(30).
000060 01  ()CNTAMT           PIC S9(13) COMP-3.
000070 01  ()TRNDAY           PIC  X(8).
