000010************************************************
000020* (PAY_EXPGEN)
000030************************************************
000040 01  ()EXPGEN           PIC  X(200).
