000010************************************************
000020* (SFC_WK_ERROR)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()シャープ契約番号       PIC  X(12).
000060 01  ()エラー連番             PIC S9(2) COMP-3.
000070 01  ()シャープ商品連番       PIC  X(3).
000080 01  ()項目連番               PIC S9(2) COMP-3.
000090 01  ()メッセージ             PIC  X(60).
