000010************************************************
000020* (SKY_PRTDEM)
000030************************************************
000040 01  ()CNTNUM           PIC  X(9).
000050 01  ()OURDIV           PIC  X(4).
000060 01  ()OURTEL           PIC  N(7.5).
000070 01  ()ISUTYP           PIC  X(1).
000080 01  ()ISUNAM           PIC  N(20).
000090 01  ()CLTCOD           PIC  X(8).
000100 01  ()CLTNAM           PIC  N(30).
000110 01  ()CLTDIV           PIC  N(25).
000120 01  ()ADRTYP           PIC  X(1).
000130 01  ()ZIPCOD           PIC  X(7).
000140 01  ()CLTADR           PIC  N(25).
000150 01  ()CLTAD2           PIC  N(25).
000160 01  ()TELNUM           PIC  N(7.5).
000170 01  ()PAYBGN           PIC  X(8).
000180 01  ()PAYEND           PIC  X(8).
000190 01  ()PAYDAY           PIC  X(8).
000200 01  ()FIXDAY           PIC  X(2).
000210 01  ()PAYCYC           PIC  X(2).
000220 01  ()PAYTYP           PIC  X(1).
000230 01  ()APPLIC           PIC  N(10).
000240 01  ()PRTTIM           PIC  X(1).
000250 01  ()PRTPTN           PIC  X(2).
000260 01  ()PRTMLT           PIC  X(1).
000270 01  ()DAYSHW           PIC  X(1).
000280 01  ()DEMTYP           PIC  X(1).
000290 01  ()ITMNAM           PIC  N(20).
000300 01  ()REMARK           PIC  N(40).
000310 01  ()REMAR2           PIC  N(40).
000320 01  ()PAYCNT           PIC S9(3) COMP-3.
000330 01  ()TOTCNT           PIC S9(3) COMP-3.
000340 01  ()DEMCNT           PIC S9(3) COMP-3.
000350 01  ()TAXRAT           PIC S9(2)V9(2) COMP-3.
000360 01  ()LEAAMT           PIC S9(13) COMP-3.
000370 01  ()LEAAMB           PIC S9(13) COMP-3.
000380 01  ()MNTCHG           PIC S9(13) COMP-3.
000390 01  ()LEATAX           PIC S9(13) COMP-3.
000400 01  ()LEATXB           PIC S9(13) COMP-3.
000410 01  ()MNTTAX           PIC S9(13) COMP-3.
000420 01  ()CNTNM2           PIC  X(9).
000430 01  ()PAYBG2           PIC  X(8).
000440 01  ()APPLI2           PIC  N(10).
000450 01  ()ITMNM2           PIC  N(20).
000460 01  ()PAYCN2           PIC S9(3) COMP-3.
000470 01  ()DEMCN2           PIC S9(3) COMP-3.
000480 01  ()LEAAM2           PIC S9(13) COMP-3.
000490 01  ()MNTCH2           PIC S9(13) COMP-3.
000500 01  ()LEATX2           PIC S9(13) COMP-3.
000510 01  ()MNTTX2           PIC S9(13) COMP-3.
000520 01  ()CNTNM3           PIC  X(9).
000530 01  ()PAYBG3           PIC  X(8).
000540 01  ()APPLI3           PIC  N(10).
000550 01  ()ITMNM3           PIC  N(20).
000560 01  ()PAYCN3           PIC S9(3) COMP-3.
000570 01  ()DEMCN3           PIC S9(3) COMP-3.
000580 01  ()LEAAM3           PIC S9(13) COMP-3.
000590 01  ()MNTCH3           PIC S9(13) COMP-3.
000600 01  ()LEATX3           PIC S9(13) COMP-3.
000610 01  ()MNTTX3           PIC S9(13) COMP-3.
000620 01  ()CNTNM4           PIC  X(9).
000630 01  ()PAYBG4           PIC  X(8).
000640 01  ()APPLI4           PIC  N(10).
000650 01  ()ITMNM4           PIC  N(20).
000660 01  ()PAYCN4           PIC S9(3) COMP-3.
000670 01  ()DEMCN4           PIC S9(3) COMP-3.
000680 01  ()LEAAM4           PIC S9(13) COMP-3.
000690 01  ()MNTCH4           PIC S9(13) COMP-3.
000700 01  ()LEATX4           PIC S9(13) COMP-3.
000710 01  ()MNTTX4           PIC S9(13) COMP-3.
000720 01  ()CNTNM5           PIC  X(9).
000730 01  ()PAYBG5           PIC  X(8).
000740 01  ()APPLI5           PIC  N(10).
000750 01  ()ITMNM5           PIC  N(20).
000760 01  ()PAYCN5           PIC S9(3) COMP-3.
000770 01  ()DEMCN5           PIC S9(3) COMP-3.
000780 01  ()LEAAM5           PIC S9(13) COMP-3.
000790 01  ()MNTCH5           PIC S9(13) COMP-3.
000800 01  ()LEATX5           PIC S9(13) COMP-3.
000810 01  ()MNTTX5           PIC S9(13) COMP-3.
