000010************************************************
000020* (SKY_ISUNAM)
000030************************************************
000040 01  ()ISUTYP           PIC  X(1).
000050 01  ()ISUNAM           PIC  N(20).
