000010************************************************
000020* (SOSIN_JIGYO)
000030************************************************
000040 01  ()送信事業所キー         PIC  X(2).
000050 01  ()送信事業所コード       PIC  X(4).
