000010************************************************
000020* (SSF_WK_ITIRAN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()第１回リース料入金日   PIC  X(8).
000060 01  ()第２回リース料入金日   PIC  X(8).
000070 01  ()検収日                 PIC  X(8).
000080 01  ()取引先名               PIC  N(30).
000090 01  ()金庫支店コード         PIC  X(5).
000100 01  ()リース期間             PIC S9(3) COMP-3.
000110 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000120 01  ()担当者                 PIC  X(4).
000130 01  ()社内金利               PIC S9(-1)V9(3) COMP-3.
000140 01  ()勘定コード             PIC  X(2).
000150 01  ()物件金額               PIC S9(13) COMP-3.
000160 01  ()仕入れ消費税           PIC S9(13) COMP-3.
000170 01  ()そうしん初回リース料   PIC S9(13) COMP-3.
000180 01  ()当社初回リース料       PIC S9(13) COMP-3.
000190 01  ()当社初回消費税等       PIC S9(13) COMP-3.
000200 01  ()そうしん定額リース料   PIC S9(13) COMP-3.
000210 01  ()当社定額リース料       PIC S9(13) COMP-3.
000220 01  ()当社定額消費税等額     PIC S9(13) COMP-3.
000230 01  ()そうしん契約金額       PIC S9(13) COMP-3.
000240 01  ()当社契約金額           PIC S9(13) COMP-3.
000250 01  ()一括消費税等額         PIC S9(13) COMP-3.
000260 01  ()そうしん前受リース料   PIC S9(13) COMP-3.
000270 01  ()当社前受リース料       PIC S9(13) COMP-3.
000280 01  ()当社前受消費税等額     PIC S9(13) COMP-3.
000290 01  ()粗利益                 PIC S9(13) COMP-3.
000300 01  ()実質利回               PIC S9(2)V9(8) COMP-3.
