000010************************************************
000020* (SWP_BNKMST)
000030************************************************
000040 01  ()BNKCOD           PIC  X(4).
000050 01  ()BRCCOD           PIC  X(3).
000060 01  ()BNKNAM           PIC  X(30).
000070 01  ()BRCNAM           PIC  X(20).
000080 01  ()PRTSEQ           PIC  X(3).
000090 01  ()LBLTYP           PIC  X(1).
000100 01  ()DIVCOD           PIC  X(4).
000110 01  ()ZIPCOD           PIC  X(7).
000120 01  ()ADRES1           PIC  X(50).
000130 01  ()ADRES2           PIC  X(50).
