000010************************************************
000020* (TDB_RECSEC)
000030************************************************
000040 01  ()FRMCOD           PIC  X(9).
000050 01  ()GENFLD           PIC  N(595.5).
