000010************************************************
000020* 自動車リース管理(XINCARTS)
000030************************************************
000040    03  ()契約ＮＯ               PIC  X(9).
000050    03  ()物件ＮＯ               PIC  X(3).
000060    03  ()事業所コード           PIC  X(4).
000070    03  ()ユーザーコード         PIC  X(8).
000080    03  ()請求先コード           PIC  X(8).
000090    03  ()ユーザー名称           PIC  X(25).
000100    03  ()残価額１               PIC S9(13).
000110    03  ()登録番号               PIC  X(30).
000120    03  ()検収日－世紀           PIC  X(1).
000130    03  ()検収日－年月日         PIC  X(6).
000140    03  ()リース終了日－世紀     PIC  X(1).
000150    03  ()リース終了日－年月日   PIC  X(6).
000160    03  ()リース期間             PIC  X(3).
000170    03  ()再リースコード         PIC  X(1).
000180    03  ()自動車契約形態         PIC  X(1).
000190    03  ()車検満了日世紀１       PIC  X(1).
000200    03  ()車検満了日１           PIC  X(6).
000210    03  ()車検満了日世紀２       PIC  X(1).
000220    03  ()車検満了日２           PIC  X(6).
000230    03  ()車検満了日世紀３       PIC  X(1).
000240    03  ()車検満了日３           PIC  X(6).
000250    03  ()車検満了日世紀４       PIC  X(1).
000260    03  ()車検満了日４           PIC  X(6).
000270    03  ()車検満了日世紀５       PIC  X(1).
000280    03  ()車検満了日５           PIC  X(6).
000290    03  ()自税負担コード         PIC  X(1).
000300    03  ()自動車税額             PIC S9(13).
000310    03  ()自賠責保険コード       PIC  X(1).
000320    03  ()任保負担コード         PIC  X(1).
000330    03  ()任保代理店コード       PIC  X(2).
000340    03  ()任保付保先コード       PIC  X(2).
000350    03  ()任保満了日世紀１       PIC  X(1).
000360    03  ()任保満了日１           PIC  X(6).
000370    03  ()任保満了日世紀２       PIC  X(1).
000380    03  ()任保満了日２           PIC  X(6).
000390    03  ()任保満了日世紀３       PIC  X(1).
000400    03  ()任保満了日３           PIC  X(6).
000410    03  ()任保満了日世紀４       PIC  X(1).
000420    03  ()任保満了日４           PIC  X(6).
000430    03  ()任保満了日世紀５       PIC  X(1).
000440    03  ()任保満了日５           PIC  X(6).
000450    03  ()Ｍ契約先コード         PIC  X(2).
000460    03  ()月額メンテ料           PIC S9(13).
000470    03  ()設定残価               PIC S9(13).
000480    03  ()備考１                 PIC  X(60).
000490    03  ()備考２                 PIC  X(30).
000500    03  ()削除フラグ             PIC  X(1).
