000010************************************************
000020* —^M(Šî–{)(YOSHINKIHON)
000030************************************************
000040    03  ()ŠÇ——^MæƒR[ƒh       PIC  X(8).
000050    03  ()ŠÇ——^M‹æ•ª           PIC  X(1).
000060    03  ()Ž©“®—^M‹æ•ª           PIC  X(1).
000070    03  ()Ž–ŒÌ“ú                 PIC  X(8).
000080    03  ()‰ð–ñ‹æ•ª               PIC  X(1).
000090    03  ()ŠÇ——^Mæ–¼           PIC  X(80).
000100    03  ()—L“ÁŠ¨Ï—§             PIC S9(13).
000110    03  ()–³“ÁŠ¨Ï—§             PIC S9(13).
000120    03  ()‚w‚x‚y‹æ•ª             PIC  X(1).
000130    03  ()•¶Œ¾‚P                 PIC  X(112).
000140    03  ()•¶Œ¾‚Q                 PIC  X(112).
000150    03  ()•¶Œ¾‚R                 PIC  X(112).
000160    03  ()•¶Œ¾‚S                 PIC  X(112).
000170    03  ()•¶Œ¾‚T                 PIC  X(112).
000180    03  ()•¶Œ¾‚U                 PIC  X(112).
000190    03  ()’S•Û‚P                 PIC  X(10).
000200    03  ()’S•Û‚Q                 PIC  X(10).
000210    03  ()’S•Û‚R                 PIC  X(10).
