000010************************************************
000020* (ZJK_OVRTIM)
000030************************************************
000040 01  ()BASYER           PIC  X(4).
000050 01  ()UPDMON           PIC  X(2).
000060 01  ()PSNCOD           PIC  X(7).
000070 01  ()PSNNAM           PIC  N(9).
000080 01  ()SEXTYP           PIC  X(1).
000090 01  ()DIVCOD           PIC  X(4).
000100 01  ()PRTSEQ           PIC  X(3).
000110 01  ()MONATM           PIC S9(4) COMP-3.
000120 01  ()MONBTM           PIC S9(4) COMP-3.
000130 01  ()MONCTM           PIC S9(4) COMP-3.
000140 01  ()MONDTM           PIC S9(4) COMP-3.
000150 01  ()MONETM           PIC S9(4) COMP-3.
000160 01  ()MONVAC           PIC S9(2) COMP-3.
000170 01  ()MONHOL           PIC S9(2) COMP-3.
000180 01  ()YERATM           PIC S9(6) COMP-3.
000190 01  ()YERBTM           PIC S9(6) COMP-3.
000200 01  ()YERCTM           PIC S9(6) COMP-3.
000210 01  ()YERDTM           PIC S9(6) COMP-3.
000220 01  ()YERETM           PIC S9(6) COMP-3.
000230 01  ()YERVAC           PIC S9(3) COMP-3.
000240 01  ()YERHOL           PIC S9(3) COMP-3.
000250 01  ()ATMHOR           PIC S9(3) COMP-3.
000260 01  ()ATMMIN           PIC S9(2) COMP-3.
000270 01  ()BTMHOR           PIC S9(3) COMP-3.
000280 01  ()BTMMIN           PIC S9(2) COMP-3.
000290 01  ()CTMHOR           PIC S9(3) COMP-3.
000300 01  ()CTMMIN           PIC S9(2) COMP-3.
000310 01  ()DTMHOR           PIC S9(3) COMP-3.
000320 01  ()DTMMIN           PIC S9(2) COMP-3.
000330 01  ()ETMHOR           PIC S9(3) COMP-3.
000340 01  ()ETMMIN           PIC S9(2) COMP-3.
