000010************************************************
000020* (ZJK_TIMTBL)
000030************************************************
000040 01  ()BASBGN           PIC  X(4).
000050 01  ()BASEND           PIC  X(4).
000060 01  ()BASNGT           PIC  X(4).
000070 01  ()BASRST           PIC S9(4) COMP-3.
000080 01  ()BASWRK           PIC S9(4) COMP-3.
000090 01  ()BASAFT           PIC S9(4) COMP-3.
000100 01  ()BASATM           PIC S9(4) COMP-3.
000110 01  ()BASBTM           PIC S9(4) COMP-3.
000120 01  ()BASCTM           PIC S9(4) COMP-3.
