000010************************************************
000020* 手形管理（受取手形）(CPBIS062)
000030************************************************
000040    03  ()契約ＮＯ               PIC  X(9).
000050    03  ()ＳＥＱＮＯ.
000060     05  ()束数                   PIC S9(2).
000070     05  ()枚数                   PIC S9(3).
000080    03  ()共通部.
000090     05  ()取引日.
000100      07  ()取引日－世紀           PIC S9(1).
000110      07  ()取引日－年月日         PIC  X(6).
000120     05  ()手形枚数               PIC S9(4)  SIGN LEADING SEPARATE.
000130     05  ()束合計金額             PIC S9(13)  SIGN LEADING SEPARATE.
000140     05  ()期日基準日.
000150      07  ()期日基準日－世紀       PIC S9(1).
000160      07  ()期日基準日－年月日     PIC  X(6).
000170     05  ()期日サイクル           PIC S9(2)  SIGN LEADING SEPARATE.
000180     05  ()伝票発行日.
000190      07  ()伝票発行日－世紀       PIC S9(1).
000200      07  ()伝票発行日－年月日     PIC  X(6).
000210     05  ()備考欄                 PIC  X(20).
000220    03  ()手形区分               PIC  X(1).
000230    03  ()手形種類               PIC  X(1).
000240    03  ()手形ＮＯ               PIC  X(10).
000250    03  ()期日.
000260     05  ()期日－世紀             PIC S9(1).
000270     05  ()期日－年月日           PIC  X(6).
000280    03  ()金額                   PIC S9(13)  SIGN LEADING SEPARATE.
000290    03  ()取立依頼銀行コード     PIC  X(7).
000300    03  ()支払銀行コード         PIC  X(7).
000310    03  ()支払人コード           PIC  X(8).
000320    03  ()支払人名.
000330     05  ()名称漢字               PIC  X(40).
000340     05  ()名称カナ               PIC  X(40).
000350    03  FILLER           PIC  X(28).
000360    03  ()共通情報               PIC  X(35).
