      *****************************************************************
      *   ŽóŽæŽèŒ`(D642UTG_TBL)
      *****************************************************************
       01  ŽóŽæŽèŒ`.
           03  ‚c‚U‚S‚Q|‘ã•\Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚U‚S‚Q|‘©”        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚S‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚S‚Q|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚S‚Q|Œ_–ñæ–¼Ì  PIC  X(040).
           03  ‚c‚U‚S‚Q|Œ_–ñæ–¼ÌƒJƒi
                                     PIC  X(040).
           03  ‚c‚U‚S‚Q|•”“XƒR[ƒh  PIC  X(004).
           03  ‚c‚U‚S‚Q|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚U‚S‚Q|ŽèŒ`ó‘Ô    PIC  X(001).
           03  ‚c‚U‚S‚Q|Žæˆø“ú      PIC  X(008).
           03  ‚c‚U‚S‚Q|“`•[”­s“ú  PIC  X(008).
           03  ‚c‚U‚S‚Q|ŽèŒ`Ží—Þ    PIC  X(001).
           03  ‚c‚U‚S‚Q|Šú“úŠî€“ú  PIC  X(008).
           03  ‚c‚U‚S‚Q|Šú“úƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚S‚Q|‘©‡Œv‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚S‚Q|ŽèŒ`–‡”    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚S‚Q|Žæ—§‹âsƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚U‚S‚Q|Žx•¥‹âsƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚P  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚Q  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚R  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚S  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚T  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚U  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚V  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚W  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚X  PIC  X(010).
           03  ‚c‚U‚S‚Q|Œ_–ñ”Ô†‚P‚O
                                     PIC  X(010).
           03  ‚c‚U‚S‚Q|”õl—“      PIC  X(040).
           03  ‚c‚U‚S‚Q|ŽèŒ`“à—eŽí•Ê
                                     PIC  X(001).
           03  ‚c‚U‚S‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚S‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚S‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚S‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚S‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚S‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚S‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚S‚Q|”„‹p‘ã‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚S‚Q|UolŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚S‚Q|UolŒ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚S‚Q|Uol–¼Ì  PIC  X(040).
           03  ‚c‚U‚S‚Q|Uol–¼ÌƒJƒi
                                     PIC  X(040).
