      *****************************************************************   
      *程序ID         ：SCRSINFO                                           
      *程序名         ：学籍信息屏幕                                  
      *日期           作成者            概要                              
      *2007/03/18     张丽娟            作成                              
      *                                                                   
      *                                                                   
      *                                                                   
      *****************************************************************   
000040 01 ERRORKEY.
           03 ERRPOINT                PIC 999.
000050     03 EMSGSQLCD               PIC S9(9).
000060 
000070 
000080 
000090 
000100 
000110 
000120 
000130 
000140 
000150 
