000010*****************************************************************
000020*程序ID         ：REPSUB13
000030*程序名         ：学生信息报表
000040*处理概要       ：根据要求生成报表
000050*
000060*
000070*变量           IO       变量名
000080*
000090*
000100*
000110*日期           作成者            概要
000120*2007/04/18     张丽娟            作成
000130*
000140*
000150*
000160*****************************************************************
000170*
000180*-----------------------------------------------------------------
000190*报表头
000200*-----------------------------------------------------------------
000210 01 REPHEAD   TYPE IS REPORT HEADING
000220        NEXT  GROUP IS NEXT PAGE.
000230     03 LINE 15 COLUMN 40 PIC X(50)
000240           VALUE is " 报表封皮".
000250     03 LINE 30 COLUMN 45 PIC X(40)
000260           VALUE is "2007".
000270* 
000280*-----------------------------------------------------------------
000290*页眉
000300*-----------------------------------------------------------------
000310 01 PAGEHEAD  TYPE is  PAGE HEADING.
000320     03 LINE 4 COLUMN 50 PIC X(30) 
000330           VALUE IS "STUDENT     " .
000340     03 LINE 5 COLUMN 45 PIC X(50)
000350           VALUE IS "THE ".
000360     03 LINE 6 COLUMN 60 PIC X(4)
000370           VALUE IS "PAGE".
000380*    03        COLUMN 66 PIC ZZ9 SOURCE PAGE-COUNTER.
000390*
000400*-----------------------------------------------------------------
000410*
000420*-----------------------------------------------------------------
000430* 01 DEPTRTHEAD TYPE IS CONTROL HEADING DEPT 
000440*        NEXT GROUP PLUS 1.
000450*     03 LINE PLUS 2
000460*     03 PIC X(20) SOURCE IS DEPT-NAME(DEPT)  COLUMN 1.
000470*
000480*-----------------------------------------------------------------
000490*表头
000500*-----------------------------------------------------------------
000510 01 CLASSHEAD TYPE IS CONTROL HEADING SCOLLEGIAN
000520        NEXT GROUP PLUS 2.
000530     03 LINE PLUS 1 COLUMN 1 PIC X(80) 
000540           VALUE ALL "-".
000550     03 LINE PLUS 1.
000560        05 COLUMN  2  PIC X(6) VALUE "NAME". 
000570        05 COLUMN 16  PIC X(5) VALUE "AGE".
000580*
000590*-----------------------------------------------------------------
000600*明细行
000610*-----------------------------------------------------------------
000620 01 DETAILLINE TYPE IS DETAIL.
000630     03 LINE PLUS 1.
000640        05 COLUMN  2  PIC X(6)  SOURCE SNO.
000650        05 COLUMN 12  PIC X(6)  SOURCE SCOLLEGIAN .
000660*
000670*-----------------------------------------------------------------
000680*表尾
000690*-----------------------------------------------------------------
000700 01  CLASSCOUNT TYPE IS CONTROL FOOTING SCOLLEGIAN
000710        NEXT GROUP PLUS 3.
000720     03 LINE PLUS 2 COLUMN 1 PIC X(80) VALUE ALL "-".
000730     03 LINE PLUS 1.
000740        05 PIC X(30) VALUE "DEPARTMENT" COLUMN 10.
000750*
000760*-----------------------------------------------------------------
000770*组小计
000780*-----------------------------------------------------------------
000790* 01  DEPARTCOUNT TYPE IS CONTROL FOOTING DEPART
000800*        NEXT GROUP NEXT PAGE.
000810*     03 LINE 53 COLUMN 2 PIC X(80) VALUE "-".
000820*     03 LINE PLUS 2 COLUMN 10 PIC X(25) VALUE "THE".
000830*     03 LINE PLUS 2.
000840*        05 COLUMN 2 PIC X(6) VALUE "DEPT".
000850*
000860*-----------------------------------------------------------------
000870*总计
000880*-----------------------------------------------------------------
000890 01  allCOUNT TYPE IS CONTROL FOOTING final
000900        NEXT GROUP NEXT PAGE.
000910     03 LINE 53 COLUMN 2 PIC X(80) VALUE "-".
000920     03 LINE PLUS 2 COLUMN 10 PIC X(25) VALUE "THE".
000930     03 LINE PLUS 2.
000940        05 COLUMN 2 PIC X(6) VALUE "DEPT".
000950
000960*
000970*-----------------------------------------------------------------
000980*封底
000990*-----------------------------------------------------------------
001000 01 RDEND TYPE IS REPORT FOOTING.
001010     03 LINE 25 NEXT PAGE.
              05 COLUMN 50 PIC X(14) VALUE "REPORT   END".
001010     03 LINE 35.
              05 COLUMN 50 PIC X(10) VALUE "WRITTER".
