000010*****************************************************************   
000020*程序ID         ：SCRDBOK                                             
000030*程序名         ：数据库更新成功确认画面                                  
000040*日期           作成者            概要                              
000050*2007/04/12     张丽娟            作成                              
000060*                                                                   
000070*                                                                   
000080*                                                                   
000090*****************************************************************   
000100* 
000110 01 SCRPUB.          
000140     03 LINE 16 COLUMN 10 PIC X(70) From   WKCLUE.
000140     03 LINE 18 COLUMN 10 VALUE "按任意键确认返回主菜单：".
000140     03         COLUMN 40 PIC X    USING  WKTURN AUTO.