000010************************************************
000020* (ALM_ACCMST)
000030************************************************
000040 01  TESTA PIC 9.          
