      *****************************************************************
      *程序ID         ：Sub22SCS                                       
      *程序名         ：学习成绩查询屏幕                                 
      *日期           作成者            概要                            
      *2007/03/18     张丽娟            作成                            
      *                                                                
      *                                                                
      *                                                                
      *****************************************************************
000040* 
       01 Sub22SCS.          
000170     03 LINE 08 COLUMN 20 VALUE "请输入您要查询的学生号码：".
000090     03         COLUMN 60 PIC 9(06) USING SNO.
000170     03 LINE 10 COLUMN 20 VALUE "请输入您要查询的课程号码：".
000090     03         COLUMN 60 PIC 9(06) USING Scourse.
