      *****************************************************************
      *程序ID         ：Sub32SCS                                       
      *程序名         ：奖惩信息查询屏幕                                 
      *日期           作成者            概要                            
      *2007/03/18     张丽娟            作成                            
      *                                                                
      *                                                                
      *                                                                
      *****************************************************************
000040* 
       01 Sub32SCS.          
000170     03 LINE 08 COLUMN 20 VALUE "请输入您要查询的奖惩序号：".
000090     03         COLUMN 60 PIC 9(05) USING SSERIAL.
000170     03 LINE 10 COLUMN 20 VALUE "请输入您要查询的奖惩类别：".
000090     03         COLUMN 60 PIC 9     USING SSIGN.
