000010*****************************************************************   
000020*程序ID         ：WKSCRLine                                             
000030*程序名         ：屏幕线型定义                                  
000040*日期           作成者            概要                              
000050*2007/03/18     张丽娟            作成                              
000060*                                                                   
000070*                                                                   
000080*                                                                   
000090*****************************************************************   
000100* 
000110*Work屏幕线型
000120 01 WKSCRLine.
000130     03 WorkSrcDoubleLine pic x(80)  VALUE ALL "=".
000140     03 WorkSrcSingleLine pic x(80)  VALUE ALL "-".
000150
