000010 IDENTIFICATION                   DIVISION.
000020 PROGRAM-ID.                      99MAIN.
000030 ENVIRONMENT                      DIVISION.
000040 DATA                             DIVISION.
000050 WORKING-STORAGE                  SECTION.
000053 01 LIST-TAB. 
000054  02 LIST-TABLE OCCURS 3 TIMES PIC 9.
000090 01 DATA-SET.
000100  02 MULTI-NUM          PIC       9.
000110  02 MULTI-MARK         PIC       X VALUE "*".
000120  02 MULTIED-NUM        PIC       9.
000130  02 EQUAL-MARK         PIC       X VALUE "=".
000140  02 RESULT             PIC       99.
000141  02 FILLER             PIC       X VALUE " ".
000150 01 TABLE-99.
000160  02 L OCCURS 9 TIMES.
000170   03 R OCCURS 9 TIMES PIC 9(7) BLANK WHEN ZERO.
000180 77 NUM                 PIC       X.
000181 77 LIST-NUM            PIC       X.
000182 PROCEDURE                        DIVISION.
000191 BEGIN.
000193     INITIALIZE LIST-TAB.
000194      DISPLAY "PLEASE INPUT A NUMBER BETWEEN 1 TO 9".
000195     ACCEPT NUM.
000196     IF NUM > 9 OR NUM < 1 
000197       DISPLAY "WRONG OPREATION!"
000198       GO TO BEGIN.
000199 
000200 S.
000201     DISPLAY "0  EXIT.".
000202*    DISPLAY LIST-TABLE(2).
000203     IF LIST-TABLE(2) = 0
000204     DISPLAY "1  SUB1.".
000205     IF LIST-TABLE(3) = 0
000206     DISPLAY "2  SUB2.". 
000207     ACCEPT LIST-NUM.
000208     IF LIST-NUM > 2 OR LIST-NUM < 0 
000209       GO TO A.
000211 
000212 PRG-BEGIN.
000213     INITIALIZE TABLE-99.
000214     DISPLAY "LIST-NUM IS " LIST-NUM.
000215     IF LIST-NUM = 0 
000216     GO TO PRG-END.
000217     IF LIST-NUM = 1
000218       IF LIST-TABLE(2) = 1
000219         GO TO A
000220       ELSE 
000221         CALL "99SUB1" USING TABLE-99 NUM
000222         MOVE 1 TO LIST-TABLE(2).
000223     IF LIST-NUM = 2 CALL "99SUB2" USING TABLE-99 NUM
000224     MOVE 1 TO LIST-TABLE(3).
000225     GO TO S.
000226 PRG-END.
000227     IF LIST-NUM = 0 GO TO BEGIN.
000228     DISPLAY "OK!".
000229     STOP RUN.
000230 A.
000231     DISPLAY "WRONG OPREATION!".
000232     GO TO S.
000233
000234
000235         
000236   
000237      
