000010 IDENTIRCATION DIVISION.
000020 PROGRAM-ID. CH52.
000030 ENVIRONMENT DIVKI. ON.
000040 INPUT-OUTPUT SECTION.
000050 PILE-CONTROL.
000060     SELECT PRT-IULE ASSIGN TO DISK.
000070     SELECT PRINT-FILE ASSIGN TO PRINTER.
000080 DATA DIVISION.
000090 PILE SECTION.
000100 FD PRT-FILE LABEL RECORD IS STANDARD
000110             VALUE OF FILE-ID IS "PRT. DAT".
000120 01 PRT-REC.
000130   03 NUMBERS PIC 9(4).
000140   03 0-YEAR  PIC 9(4).
000150   03 O-PRICE PIC 9(6)V99.
000160   03 YEARS     PIC 9(3).
000170   03 S-PRICE  PIC 9(5)V99.
000180 FD PRINT-FILE LABEL RECORD IS OMITTED.
000190 01 PRINT-REC PIC X(80).
000200 WORKING-STORAGE SECTION.
000210 77 P-YEAR PIC 9(4).
000220 77 TOTAL PIC 9(8)V99 VALUE ZERO.
000230 77 P-PRICE PIC 9<6)V99.
000240 01 FRINT-RBC-W.
000250   03 NUMBERS-W  PIC 9<4).
000260   03 FILLER     PIC X(5) VALUE IS SPACE.
000270   03 O-YEAR-W   PIC 9(4).
000280   03 PILUER     PIC X(5> VALUE 1S SPACE.
000290   03 O-PRICE-W  PIC Z(6).99.
000300   03 FILLER     PIC X(5) VALUE IS SPACE.
000310   03 P-PRICE-W  PTC Z(6). 99.
000320 O1 PRINT-HEAD.
000330   03 FILLER    PIC X(9) VALUE "NUMBERS"
000340   03 FILLER    PIC X(9) VALUE "YEAR".
000350   03 FILLER    PIC X(16) VALUE "ORIGINAL PRICE".
000360   03 FILLER    PIC X(16) VALUE "FKESENT PRICE".
000370 01 PRINT-T.
000380   03 FttiER PIC X(34) VALUE "TOTAL".
000390   03 TOTAL-W PIC Z(2),Z(3),Z(3). 99.
000400 PROCEDURE DIVISION.
000410 BEGIN.
000420   OPEN INPUT TOT-FILE OUTPUT PRINT-FJLE.
000430   WRITE PRINT-RBC FROM PRINT-HEAD.
000440   DISPLAY "INPUT PRESENT YEAR".
000450   ACCEPT P-YEAR.
000460   PERFORM PRESSING 100 TIMES
000470   MOVE TOTAL TO TOTAL-W.
000480   WRITE PRINT-REC FROM PRINT-T.
000490   CLOSE PRT-FILE PRINT-FILE.
000500   STOP RUN.
000510 PRESSING.
000520    READ PRT-FILE.
000530    MOVE NUMBERS TO NUMBERS-W.
000540    MOVB O-YEAR TO O-YEAR W.
000550    MOVE O-PRICE TO O-PRICE-W.
000560    COMPUTE P-PRICE = 0-PRICE -(0-PRICE @-S-PRICfe)/
000570           YEARS *8(P-YEAR -0-YEAR).
000580    MOVE P-PRICE TO P-PRICE-W.
000590    WRITE PRINT-REC FROM PRINT-REC-W.
000600             ADD P-PRICE TO TOTAL.