 TEST1:PROC OPTIONS(MAIN);
 DCL A CHAR(5);
 DCL B CHAR(1) DEF A;
 DCL C CHAR(2) DEF A POS(2);
 DCL D CHAR(2) DEF A POS(4);
 A = "12345";
 PUT SKIP EDIT(A);
 PUT SKIP EDIT(B);
 PUT SKIP EDIT(C);
 END TEST1;
