//SYSUT2    DD    DSN=ST002.TEST.DATA.REC,DISP=(NEW,CATLG,CATLG),
// DCB=(LRECL=80,RECFM=FB,BLKSIZE=3200),SPACE=(TRK,(3,2),RLSE),
// UNIT=SYSDA
//SYSUT2    DD    DSN=&&ZHANG,DISP=(NEW,PASS),
// DCB=(LRECL=80,RECFM=FB,BLKSIZE=3200),SPACE=(TRK,(3,2),RLSE)
//SORTIN    DD   DSN=&&ZHANG,DISP=(OLD,DELETE,DELETE)
//SORTOUT   DD   DSN=ST002.TEST.DATA.DEC,DISP=SHR            