000010************************************************
000020* (ALM_ALMTR3)
000030************************************************
000040 01  ()DATTYP           PIC  X(1).
000050 01  ()CNTNUM           PIC  X(10).
000060 01  ()CNTDET           PIC  X(2).
000070 01  ()COLDAY           PIC  X(8).
000080 01  ()COLAMT           PIC S9(13) COMP-3.
000090 01  ()CONTAX           PIC S9(13) COMP-3.
000100 01  ()FINEND           PIC  X(8).
000110 01  ()ACCCOD           PIC  X(2).
000120 01  ()TIECOD           PIC  X(2).
000130 01  ()PAYCNT           PIC S9(3) COMP-3.
000140 01  ()BASRAT           PIC S9(2)V9(8) COMP-3.
000150 01  ()ACTRAT           PIC S9(2)V9(8) COMP-3.
000160 01  ()PAYCYC           PIC S9(2) COMP-3.
000170 01  ()FRZTRM           PIC S9(3) COMP-3.
000180 01  ()BGNCNT           PIC S9(1) COMP-3.
000190 01  ()CALTYP           PIC  X(1).
000200 01  ()ERRFLG           PIC  X(5).
