000010************************************************
000020* (ALM_DEPMST)
000030************************************************
000040 01  ()CTLNUM           PIC  X(6).
000050 01  ()CLTNAM           PIC  N(20).
000060 01  ()BALCAP           PIC S9(13) COMP-3.
000070 01  ()COLAMT           PIC S9(13) COMP-3.
000080 01  ()ISUDAY           PIC  X(8).
000090 01  ()DUEDAY           PIC  X(8).
000100 01  ()UPDCYC           PIC  X(2).
000110 01  ()AVEBAL           PIC S9(13) COMP-3.
000120 01  ()COLRAT           PIC S9(2)V9(5) COMP-3.
000130 01  ()CHARGE           PIC S9(2)V9(5) COMP-3.
000140 01  ()REFNUM           PIC  N(10).
000150 01  ()FIXFLT           PIC  X(1).
000160 01  ()TRMTYP           PIC  X(1).
