000010************************************************
000020* (ALM_CSHMST)
000030************************************************
000040 01  ()REGNUM           PIC  X(4).
000050 01  ()ASTLIA           PIC  X(1).
000060 01  ()ALMDET           PIC  X(2).
000070 01  ()FIXFLT           PIC  X(1).
000080 01  ()ACCCOD           PIC  X(5).
000090 01  ()DUECOD           PIC  X(2).
000100 01  ()MONCNT           PIC S9(3) COMP-3.
000110 01  ()FISYER           PIC  X(4).
000120 01  ()BASYER           PIC  X(4).
000130 01  ()BASMON           PIC  X(2).
000140 01  ()COLAMT           PIC S9(13) COMP-3.
000150 01  ()COLRAT           PIC S9(2)V9(2) COMP-3.
000160 01  ()BALCAP           PIC S9(13) COMP-3.
000170 01  ()AVEBAL           PIC S9(13) COMP-3.
000180 01  ()AVEINT           PIC S9(13) COMP-3.
000190 01  ()AVERAT           PIC S9(2)V9(2) COMP-3.
000200 01  ()DIVCOD           PIC  X(1).
000210 01  ()GAPFLG           PIC  X(1).
000220 01  ()JOBTYP           PIC  X(3).
