000010************************************************
000020* (ANK_WORK007)
000030************************************************
000040 01  ()KEY                 PIC  X(1).
000050 01  ()見積書提出先           PIC  N(30).
000060 01  ()住所                   PIC  N(50).
000070 01  ()担当部店               PIC  N(10).
000080 01  ()電話番号               PIC  N(10).
000090 01  ()ＦＡＸ番号             PIC  N(10).
000100 01  ()テキスト１             PIC  N(30).
000110 01  ()テキスト２             PIC  N(30).
000120 01  ()テキスト３             PIC  N(30).
000130 01  ()テキスト４             PIC  N(30).
000140 01  ()テキスト５             PIC  N(30).
000150 01  ()テキスト６             PIC  N(30).
000160 01  ()登録日                 PIC  X(8).
000170 01  ()登録時刻               PIC  X(6).
000180 01  ()登録担当者コード       PIC  X(4).
000190 01  ()更新日                 PIC  X(8).
000200 01  ()更新時刻               PIC  X(6).
000210 01  ()更新担当者コード       PIC  X(4).
