000010************************************************
000020* (ANK_KIHON)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()顧客コード             PIC  X(6).
000080 01  ()取引先名               PIC  N(30).
000090 01  ()見積日                 PIC  X(8).
000100 01  ()見積有効期限           PIC  X(8).
000110 01  ()取引形態コード         PIC  X(2).
000120 01  ()見積書提出先           PIC  N(30).
000130 01  ()コメント               PIC  N(30).
000140 01  ()検収予定日             PIC  X(8).
000150 01  ()リース料支払い方法１   PIC  N(20).
000160 01  ()リース料支払い方法２   PIC  N(20).
000170 01  ()納入場所               PIC  N(30).
000180 01  ()保守契約先名           PIC  N(30).
000190 01  ()再リース料             PIC  N(30).
000200 01  ()連帯保証人             PIC  N(30).
000210 01  ()見積附随条項番号       PIC  N(40).
000220 01  ()見積附随条項           PIC  N(250).
000230 01  ()案件リファレンス１     PIC  N(10).
000240 01  ()案件リファレンス２     PIC  N(10).
000250 01  ()登録日                 PIC  X(8).
000260 01  ()登録時刻               PIC  X(6).
000270 01  ()登録担当者コード       PIC  X(4).
000280 01  ()更新日                 PIC  X(8).
000290 01  ()更新時刻               PIC  X(6).
000300 01  ()更新担当者コード       PIC  X(4).
