000010************************************************
000020* (ANK_LPWK_SIHARAI)
000030************************************************
000040 01  ()案件番号               PIC  X(10).
000050 01  ()見積枝番               PIC  X(2).
000060 01  ()ページ                 PIC S9(1) COMP-3.
000070 01  ()支払連番               PIC S9(3) COMP-3.
000080 01  ()端末番号               PIC  N(8).
000090 01  ()支払連番１             PIC S9(3) COMP-3.
000100 01  ()支払日１               PIC  X(8).
000110 01  ()リース料１             PIC S9(13) COMP-3.
000120 01  ()残高１                 PIC S9(13) COMP-3.
000130 01  ()支払連番２             PIC S9(3) COMP-3.
000140 01  ()支払日２               PIC  X(8).
000150 01  ()リース料２             PIC S9(13) COMP-3.
000160 01  ()残高２                 PIC S9(13) COMP-3.
000170 01  ()リース期間             PIC S9(3) COMP-3.
000180 01  ()前受月数               PIC S9(2) COMP-3.
000190 01  ()契約総額               PIC S9(13) COMP-3.
000200 01  ()残価額                 PIC S9(13) COMP-3.
