000010************************************************
000020* (APR_LPWK_PROOF)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()契約番号               PIC  X(9).
000060 01  ()物件ＮＯ               PIC  X(3).
000070 01  ()設置場所名             PIC  N(10).
000080 01  ()アポロ商品コード       PIC  X(4).
000090 01  ()物件名                 PIC  N(15).
000100 01  ()解約後リース料         PIC S9(13) COMP-3.
