000010************************************************
000020* (APR_LPWK_CHUMON)
000030************************************************
000040 01  ()リース割賦区分         PIC  X(1).
000050 01  ()ディーラーコード       PIC  X(5).
000060 01  ()帳票作成区分           PIC  X(1).
000070 01  ()契約番号ＦＲＯＭ       PIC  X(9).
000080 01  ()契約番号ＴＯ           PIC  X(9).
000090 01  ()契約日                 PIC  X(8).
000100 01  ()検収予定日             PIC  X(8).
000110 01  ()検収日                 PIC  X(8).
000120 01  ()売主名                 PIC  N(30).
000130 01  ()支払条件               PIC  N(20).
000140 01  ()購入金額合計           PIC S9(13) COMP-3.
000150 01  ()消費税等額合計         PIC S9(13) COMP-3.
