000010************************************************
000020* (APR_LPWK_ERROR)
000030************************************************
000040 01  ()端末番号               PIC  X(16).
000050 01  ()アポロ契約番号         PIC  X(6).
000060 01  ()契約番号               PIC  X(9).
000070 01  ()メッセージ             PIC  N(30).
