000010************************************************
000020* (BANK_CHANGE)
000030************************************************
000040 01  ()旧銀行コード           PIC  X(4).
000050 01  ()旧支店コード           PIC  X(3).
000060 01  ()新銀行コード           PIC  X(4).
000070 01  ()新支店コード           PIC  X(3).
000080 01  ()新銀行名＿漢字         PIC  N(10).
000090 01  ()新銀行名＿カナ         PIC  N(7.5).
000100 01  ()新支店名＿漢字         PIC  N(10).
000110 01  ()新支店名＿カナ         PIC  N(7.5).
