000010************************************************
000020* 支払種類算出パラメータ(CISPF002)
000030************************************************
000040    03   ()リターンコード         PIC  X(0001).
000050    03   ()勘定処理コード         PIC  X(0002).
000060    03   ()前払リース料           PIC S9(0013)   SIGN LEADING SEPARATE.
000070    03   ()貸付種類               PIC S9(0001)   SIGN LEADING SEPARATE.
000080    03   ()業務区分               PIC S9(0001)   SIGN LEADING SEPARATE.
000090    03   ()取得区分               PIC  X(0001).
000100    03   ()支払種類               PIC  X(0002).
