000010************************************************
000020* BTM支社マスタ入力パラメータ(CISPF003)
000030************************************************
000040    03   ()支社コード             PIC  X(0006).
000050    03   ()支社名                 PIC  N(0040).
000060    03   ()支社名カナ             PIC  N(0040).
000070    03   ()点質コード             PIC  X(0002).
000080    03   ()点質                   PIC  N(0020).
000090    03   ()エリアコード           PIC  X(0002).
000100    03   ()エリア                 PIC  N(0020).
