000010************************************************
000020* 処理パラメータ(CISPF004)
000030************************************************
000040    03   ()処理区分               PIC  X(0001).
000050    03   ()余白                   PIC  X(0079).
