000010************************************************
000020* 車両物件ﾌｧｲﾙ(CISUF381)
000030************************************************
000040    03   ()契約番号               PIC  X(10).
000050    03   ()契約種類               PIC  X(3).
000060    03   ()物件番号               PIC S9(4)  SIGN LEADING SEPARATE.
000070    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000080    03   ()登録番号               PIC  X(20).
000090    03   ()車検満了日             PIC  X(8).
000100    03   ()設定残価               PIC S9(13)  SIGN LEADING SEPARATE.
000110    03   ()自動車税負担コード     PIC  X(1).
000120    03   ()自動車税額             PIC S9(13)  SIGN LEADING SEPARATE.
000130    03   ()自賠責負担コード       PIC  X(1).
000140    03   ()自賠責金額             PIC S9(13)  SIGN LEADING SEPARATE.
000150    03   ()重量税負担コード       PIC  X(1).
000160    03   ()重量税額               PIC S9(13)  SIGN LEADING SEPARATE.
000170    03   ()任意保険負担コード     PIC  X(1).
000180    03   ()任意保険代理店コード   PIC  X(2).
000190    03   ()任意保険付保先コード   PIC S9(2)  SIGN LEADING SEPARATE.
000200    03   ()任意保険満了日         PIC  X(8).
000210    03   ()メンテナンス契約先     PIC  X(9).
000220    03   ()月額メンテナンス料     PIC S9(13)  SIGN LEADING SEPARATE.
000230    03   ()走行距離               PIC S9(7)  SIGN LEADING SEPARATE.
000240    03   ()タイヤ本数             PIC S9(2)  SIGN LEADING SEPARATE.
000250    03   ()コメント               PIC  X(40).
000260    03   ()備考１                 PIC  X(40).
000270    03   ()備考２                 PIC  X(40).
000280    03   ()登録年月日             PIC  X(8).
000290    03   ()登録時間               PIC  X(8).
000300    03   ()登録担当者             PIC  X(8).
000310    03   ()更新年月日             PIC  X(8).
000320    03   ()更新時間               PIC  X(8).
000330    03   ()更新者                 PIC  X(8).
000340    03   ()入力担当者コード       PIC  X(8).
