000010************************************************
000020* 指示パラメータファイル(CISUF342)
000030************************************************
000040    03   ()ＤＢ区分               PIC  X(1).
000050    03   ()ダミー                 PIC  X(79).
