000010************************************************
000020* (CISUF001)
000030************************************************
000040    03   ()Œ_–ñ‚m‚n               PIC  X(9).
000050    03   ()•¨Œ‚m‚n               PIC  X(3).
000060    03   ()Œ_–ñŠJŽn“ú.
000070     05  ()”N                     PIC  X(4).
000080     05  ()ŒŽ                     PIC  X(2).
000090     05  ()“ú                     PIC  X(2).
000100    03   ()—š—ðî•ñ                          OCCURS 5.
000110     05  ()“ú•t                   PIC  X(8).
000120     05  ()‹àŠz                   PIC S9(13).
