000010************************************************
000020* 金融展開ファイル(CISUF473)
000030************************************************
000040    03   ()契約番号               PIC  X(10).
000050    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()契約種類               PIC  X(3).
000070    03   ()連番                   PIC S9(3)  SIGN LEADING SEPARATE.
000080    03   ()売上年月               PIC  X(6).
000090    03   ()展開年月日             PIC  X(8).
000100    03   ()利息月数               PIC S9(1)V9(2)  SIGN LEADING SEPARATE.
000110    03   ()請求額                 PIC S9(13)  SIGN LEADING SEPARATE.
000120    03   ()元本                   PIC S9(13)  SIGN LEADING SEPARATE.
000130    03   ()利息                   PIC S9(13)  SIGN LEADING SEPARATE.
000140    03   ()諸費用                 PIC S9(13)  SIGN LEADING SEPARATE.
000150    03   ()元本残高               PIC S9(13)  SIGN LEADING SEPARATE.
000160    03   ()利回り                 PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000170    03   ()元本調整額             PIC S9(13)  SIGN LEADING SEPARATE.
000180    03   ()自社請求額             PIC S9(13)  SIGN LEADING SEPARATE.
000190    03   ()自社元本               PIC S9(13)  SIGN LEADING SEPARATE.
000200    03   ()自社利息               PIC S9(13)  SIGN LEADING SEPARATE.
000210    03   ()自社諸費用             PIC S9(13)  SIGN LEADING SEPARATE.
000220    03   ()自社元本残高           PIC S9(13)  SIGN LEADING SEPARATE.
000230    03   ()自社社内金利利息適用   PIC S9(13)  SIGN LEADING SEPARATE.
000240    03   ()自社社内金利利息一般   PIC S9(13)  SIGN LEADING SEPARATE.
000250    03   ()当月利息               PIC S9(13)  SIGN LEADING SEPARATE.
000260    03   ()自社利回り             PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000270    03   ()自社元本調整額         PIC S9(13)  SIGN LEADING SEPARATE.
000280    03   ()登録年月日             PIC  X(8).
000290    03   ()登録時間               PIC  X(8).
000300    03   ()登録担当者             PIC  X(8).
000310    03   ()入力担当者コード       PIC  X(8).
000320    03   ()更新年月日             PIC  X(8).
000330    03   ()更新時間               PIC  X(8).
000340    03   ()更新者                 PIC  X(8).
