000010************************************************
000020* 契約種類等変換テーブルWK(CISUF923)
000030************************************************
000040    03   ()契約ＮＯ               PIC  X(9).
000050    03   ()再リースコード         PIC S9(1)  SIGN LEADING SEPARATE.
000060    03   ()勘定処理コード         PIC S9(2)  SIGN LEADING SEPARATE.
000070    03   ()取得区分               PIC  X(1).
000080    03   ()物件ＮＯ               PIC S9(3)  SIGN LEADING SEPARATE.
000090    03   ()請求コード             PIC S9(2)  SIGN LEADING SEPARATE.
000100    03   ()解約区分               PIC  X(1).
000110    03   ()税区分                 PIC S9(1)  SIGN LEADING SEPARATE.
000120    03   ()再リース周回コード     PIC S9(1)  SIGN LEADING SEPARATE.
000130    03   ()資産コード             PIC S9(7)  SIGN LEADING SEPARATE.
000140    03   ()債務協調コード         PIC  X(2).
000150    03   ()貸付種類               PIC S9(1)  SIGN LEADING SEPARATE.
000160    03   ()業務区分               PIC S9(1)  SIGN LEADING SEPARATE.
000170    03   ()債務勘定処理コード     PIC S9(2)  SIGN LEADING SEPARATE.
000180    03   ()回収手順               PIC  X(1).
