000010************************************************
000020* 売却履歴ファイル(CISUF591)
000030************************************************
000040    03   ()契約番号               PIC  X(10).
000050    03   ()再リース回数           PIC S9(2)  SIGN LEADING SEPARATE.
000060    03   ()申請連番               PIC S9(2)  SIGN LEADING SEPARATE.
000070    03   ()売却連番               PIC S9(3)  SIGN LEADING SEPARATE.
000080    03   ()契約種類               PIC  X(3).
000090    03   ()取引先コード           PIC  X(9).
000100    03   ()処分先コード           PIC  X(5).
000110    03   ()売却日                 PIC  X(8).
000120    03   ()売却理由               PIC  X(2).
000130    03   ()売却区分               PIC  X(1).
000140    03   ()売却代                 PIC S9(13)  SIGN LEADING SEPARATE.
000150    03   ()売却代消費税           PIC S9(13)  SIGN LEADING SEPARATE.
000160    03   ()売却代消費税率         PIC S9(2)V9(8)  SIGN LEADING SEPARATE.
000170    03   ()売却代消費税率区分     PIC  X(2).
000180    03   ()売却代回収日           PIC  X(8).
000190    03   ()売却エントリ日         PIC  X(8).
000200    03   ()売却処理年月           PIC  X(6).
000210    03   ()回収額                 PIC S9(13)  SIGN LEADING SEPARATE.
000220    03   ()回収額消費税           PIC S9(13)  SIGN LEADING SEPARATE.
000230    03   ()回収年月日             PIC  X(8).
000240    03   ()回収方法               PIC  X(1).
000250    03   ()未回収額               PIC S9(13)  SIGN LEADING SEPARATE.
000260    03   ()売却経費               PIC S9(13)  SIGN LEADING SEPARATE.
000270    03   ()状態フラグ             PIC  X(1).
000280    03   ()処分ルート             PIC  X(1).
000290    03   ()満了売却フラグ         PIC  X(1).
000300    03   ()請求書番号             PIC S9(7)  SIGN LEADING SEPARATE.
000310    03   ()請求書発行済フラグ     PIC  X(1).
000320    03   ()取消請求書発行済フラグ PIC  X(1).
000330    03   ()申請エントリ日         PIC  X(8).
000340    03   ()申請処理年月           PIC  X(6).
000350    03   ()申請書出力年月日       PIC  X(8).
000360    03   ()申請取消区分           PIC  X(1).
000370    03   ()申請取消日             PIC  X(8).
000380    03   ()申請取消エントリ日     PIC  X(8).
000390    03   ()申請取消処理年月       PIC  X(6).
000400    03   ()売買契約番号           PIC  X(15).
000410    03   ()売買契約日             PIC  X(8).
000420    03   ()決裁エントリ日         PIC  X(8).
000430    03   ()決裁処理年月           PIC  X(6).
000440    03   ()決裁ランク             PIC  X(1).
000450    03   ()決裁年月日             PIC  X(8).
000460    03   ()決裁者コード           PIC  X(8).
000470    03   ()承認区分               PIC  X(1).
000480    03   ()決裁取消区分           PIC  X(1).
000490    03   ()決裁取消日             PIC  X(8).
000500    03   ()決裁取消エントリ日     PIC  X(8).
000510    03   ()決裁取消処理年月       PIC  X(6).
000520    03   ()確定エントリ日         PIC  X(8).
000530    03   ()確定処理年月           PIC  X(6).
000540    03   ()確定取消区分           PIC  X(1).
000550    03   ()確定取消日             PIC  X(8).
000560    03   ()確定取消エントリ日     PIC  X(8).
000570    03   ()確定取消処理年月       PIC  X(6).
000580    03   ()更新年月日             PIC  X(8).
000590    03   ()更新時間               PIC  X(8).
000600    03   ()更新者                 PIC  X(8).
000610    03   ()入力担当者コード       PIC  X(8).
000620    03   ()自社売却代             PIC S9(13)  SIGN LEADING SEPARATE.
000630    03   ()自社売却代消費税       PIC S9(13)  SIGN LEADING SEPARATE.
000640    03   ()他社回収額             PIC S9(13)  SIGN LEADING SEPARATE.
000650    03   ()管理債権レベル         PIC  X(1).
000660    03   ()貸倒損失金             PIC S9(13)  SIGN LEADING SEPARATE.
000670    03   ()貸倒損失金合計         PIC S9(13)  SIGN LEADING SEPARATE.
000680    03   ()貸倒損失金回収額       PIC S9(13)  SIGN LEADING SEPARATE.
000690    03   ()貸倒損失金未回収額     PIC S9(13)  SIGN LEADING SEPARATE.
000700    03   ()引渡先区分             PIC  X(1).
000710    03   ()売却委託手数料         PIC S9(13)  SIGN LEADING SEPARATE.
000720    03   ()引取負担区分           PIC  X(1).
000730    03   ()引取費用               PIC S9(13)  SIGN LEADING SEPARATE.
000740    03   ()諸費用消費税           PIC S9(13)  SIGN LEADING SEPARATE.
000750    03   ()請求内訳コード         PIC  X(3).
000760    03   ()消込通番               PIC  X(11).
000770    03   ()物件処分申請条件区分   PIC  X(2).
000780    03   ()登録年月日             PIC  X(8).
000790    03   ()登録時間               PIC  X(8).
000800    03   ()登録担当者             PIC  X(8).
000810    03   ()初回入金日             PIC  X(8).
000820    03   ()消込年月日             PIC  X(8).
000830    03   ()解約申請連番           PIC S9(3)  SIGN LEADING SEPARATE.
000840    03   ()代表物件番号           PIC S9(4)  SIGN LEADING SEPARATE.
000850    03   ()元再リースコード１     PIC  X(1).
000860    03   ()元請求内訳コード１     PIC  X(3).
000870    03   ()元回収予定日１         PIC  X(7).
000880    03   ()債務協調ＣＤ           PIC  X(2).
