000010************************************************
000020* 入金ファイル(CISUF611)
000030************************************************
000040    03   ()入金通番               PIC  X(11).
000050    03   ()入金日                 PIC  X(8).
000060    03   ()ＳＥＱ番号             PIC S9(6)  SIGN LEADING SEPARATE.
000070    03   ()請求担当者             PIC  X(8).
000080    03   ()照会番号               PIC S9(8)  SIGN LEADING SEPARATE.
000090    03   ()勘定日                 PIC  X(8).
000100    03   ()預入－払出日           PIC  X(8).
000110    03   ()請求書番号             PIC S9(7)  SIGN LEADING SEPARATE.
000120    03   ()入払区分               PIC  X(1).
000130    03   ()取引区分               PIC  X(2).
000140    03   ()取引金額               PIC S9(12)  SIGN LEADING SEPARATE.
000150    03   ()手形－小切手区分       PIC  X(1).
000160    03   ()手形－小切手番号       PIC  X(7).
000170    03   ()僚店番号               PIC  X(3).
000180    03   ()振込依頼人コード       PIC  X(10).
000190    03   ()振込依頼人名           PIC  X(48).
000200    03   ()仕向銀行名             PIC  X(40).
000210    03   ()仕向支店名             PIC  X(40).
000220    03   ()適用内容               PIC  X(30).
000230    03   ()入金区分               PIC  X(2).
000240    03   ()取引先コード           PIC  X(9).
000250    03   ()一括入金コード         PIC  X(5).
000260    03   ()名寄せコード           PIC  X(40).
000270    03   ()入金先名称             PIC  X(160).
000280    03   ()取消区分               PIC  X(1).
000290    03   ()取消日                 PIC  X(8).
000300    03   ()消込区分               PIC  X(1).
000310    03   ()消込金額               PIC S9(13)  SIGN LEADING SEPARATE.
000320    03   ()消込日                 PIC  X(8).
000330    03   ()消込通番               PIC  X(11).
000340    03   ()振替理由               PIC  X(160).
000350    03   ()振替区分               PIC  X(1).
000360    03   ()振替先コード           PIC  X(1).
000370    03   ()振替日                 PIC  X(8).
000380    03   ()振替金額               PIC S9(13)  SIGN LEADING SEPARATE.
000390    03   ()銀行コード             PIC  X(4).
000400    03   ()銀行名                 PIC  X(15).
000410    03   ()支店コード             PIC  X(3).
000420    03   ()支店名                 PIC  X(15).
000430    03   ()預金種目               PIC  X(1).
000440    03   ()口座番号               PIC  X(10).
000450    03   ()口座名                 PIC  X(40).
000460    03   ()更新年月日             PIC  X(8).
000470    03   ()更新時間               PIC  X(8).
000480    03   ()更新者                 PIC  X(8).
000490    03   ()消込残高               PIC S9(13)  SIGN LEADING SEPARATE.
000500    03   ()当月年月               PIC  X(6).
000510    03   ()当月消込金額           PIC S9(13)  SIGN LEADING SEPARATE.
000520    03   ()当月振替金額－預り金   PIC S9(13)  SIGN LEADING SEPARATE.
000530    03   ()当月振替金額－その他   PIC S9(13)  SIGN LEADING SEPARATE.
000540    03   ()振込手数料             PIC S9(13)  SIGN LEADING SEPARATE.
000550    03   ()入力担当者コード       PIC  X(8).
000560    03   ()処理回数               PIC S9(3)  SIGN LEADING SEPARATE.
000570    03   ()入金仕訳短縮コード     PIC  X(2).
000580    03   ()銀行短縮コード         PIC  X(2).
000590    03   ()リファレンス番号       PIC  X(16).
000600    03   ()登録担当者             PIC  X(8).
000610    03   ()登録時間               PIC  X(8).
000620    03   ()登録年月日             PIC  X(8).
000630    03   ()勘定科目コード         PIC  X(6).
000640    03   ()細目コード             PIC  X(10).
