000010************************************************
000020* 支払先ファイル(CISUF041)
000030************************************************
000040    03   ()取引先コード           PIC  X(9).
000050    03   ()支払先コード           PIC  X(5).
000060    03   ()支払先名称             PIC  X(80).
000070    03   ()支払先短名称           PIC  X(16).
000080    03   ()部門名称               PIC  X(60).
000090    03   ()郵便番号               PIC  X(7).
000100    03   ()納付先コード           PIC  X(11).
000110    03   ()住所２                 PIC  X(60).
000120    03   ()住所３                 PIC  X(60).
000130    03   ()電話番号               PIC  X(15).
000140    03   ()支払日                 PIC S9(2)  SIGN LEADING SEPARATE.
000150    03   ()支払方法               PIC  X(1).
000160    03   ()銀行コード             PIC  X(4).
000170    03   ()支店コード             PIC  X(3).
000180    03   ()口座種類               PIC  X(1).
000190    03   ()口座番号               PIC  X(10).
000200    03   ()名義人                 PIC  X(30).
000210    03   ()本店コード             PIC  X(3).
000220    03   ()一括支払先コード       PIC  X(5).
000230    03   ()更新日時               PIC  X(16).
000240    03   ()更新者                 PIC  X(8).
000250    03   ()手数料負担区分         PIC  X(1).
000260    03   ()部門カナ名称           PIC  X(30).
000270    03   ()顧客使用不可フラグ     PIC  X(1).
000280    03   ()相殺フラグ             PIC  X(1).
000290    03   ()コメント欄             PIC  X(60).
000300    03   ()前回支払サイト         PIC S9(3)  SIGN LEADING SEPARATE.
000310    03   ()前回更新年月日         PIC  X(8).
000320    03   ()前々回支払サイト       PIC S9(3)  SIGN LEADING SEPARATE.
000330    03   ()前々回更新年月日       PIC  X(8).
000340    03   ()前々々回支払サイト     PIC S9(3)  SIGN LEADING SEPARATE.
000350    03   ()前々々回更新年月日     PIC  X(8).
000360    03   ()入力担当者コード       PIC  X(8).
000370    03   ()部課コード             PIC  X(4).
000380    03   ()担当者コード           PIC  X(8).
000390    03   ()地区ブロック           PIC  X(1).
000400    03   ()保守料自動承認区分     PIC  X(1).
000410    03   ()インターガイド自動承認区分 PIC  X(1).
000420    03   ()担当者名称             PIC  X(20).
000430    03   ()住所１                 PIC  X(60).
000440    03   ()住所カナ名称           PIC  X(60).
000450    03   ()ＦＡＸ番号             PIC  X(15).
000460    03   ()休日対応区分           PIC  X(1).
000470    03   ()請求書回収確認区分     PIC  X(1).
000480    03   ()入金確認区分           PIC  X(1).
000490    03   ()登録年月日             PIC  X(8).
000500    03   ()登録時間               PIC  X(8).
000510    03   ()登録担当者             PIC  X(8).
000520    03   ()更新年月日             PIC  X(8).
000530    03   ()更新時間               PIC  X(8).
000540    03   ()旧購入先コード         PIC  X(5).
000550    03   ()仕入消費税免税区分     PIC S9(1)  SIGN LEADING SEPARATE.
