000010************************************************
000020* (COM_MSG)
000030************************************************
000040 01  ()メッセージＩＤ         PIC  X(6).
000050 01  ()メッセージ             PIC  N(50).
