000010****************************************************************
000020* プログラム名  ：経過月数・経過日数算出処理コピー句           *
000050* プログラムID　：CPHA01                                       *
000040* 作成日付      ：2001.11.20　                                 *
000050****************************************************************
000060* 変更履歴                                                     *
000070* <識別>  <変更日付>  < 担当者 >  <変更内容>                   *
000080*  新規   2001/11/20   FM:小須田   新規作成                    *
000090****************************************************************
000100*
000100 01  CPHA01.                                
000100     03  CPHA01-DATE          PIC   9(08).  
000100     03  CPHA01-KA-TANI       PIC   X(01).  
000100     03  CPHA01-KA-SU         PIC  S9(03).  
000100     03  CPHA01-T-LAST        PIC   9(02).  
000100     03  CPHA01-K-DATE        PIC   9(08).  
000100     03  CPHA01-K-LAST        PIC   9(02).  
000100     03  CPHA01-MSG           PIC   X(40).  
000100     03  CPHA01-RET           PIC   9(01).  
