000100*       CPHA02              LEVEL=1        DATE=98.08.07
000200**************************************************************
000300*      èCê≥ì˙ÅF  1998/07/29  FFC)ç≤ì°                        *
000400**************************************************************
000500*************  FLHCOB50  (π≤∂¬∑Ω≥:π≤∂∆¬Ω≥ ª›º’¬) *************
000600 01  CPHA02.
000700     03  CPHA02-DATE1         PIC   9(08).
000800     03  CPHA02-DATE2         PIC   9(08).
000900     03  CPHA02-TUKI          PIC  S9(04).
001000     03  CPHA02-HI            PIC  S9(04).
001100     03  CPHA02-MSG           PIC   X(40).
001200     03  CPHA02-RET           PIC   9(01).
