      *****************************************************************
      *   変更履歴_買掛(D377HIK_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()買掛連番            PIC S9(003).
           03  ()連番                PIC S9(003).
           03  ()変更申請連番
                                     PIC S9(002).
           03  ()内容変更日          PIC  X(008).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()支払先コード
                                     PIC  X(005).
           03  ()支払取引先コード
                                     PIC  X(009).
           03  ()支払支払先コード
                                     PIC  X(005).
           03  ()支払方法            PIC  X(001).
           03  ()前渡金区分          PIC  X(001).
           03  ()支払サイト          PIC S9(002).
           03  ()支払日              PIC S9(002).
           03  ()実支払日            PIC  X(008).
           03  ()手形振出サイト
                                     PIC S9(002).
           03  ()手形振出日          PIC S9(002).
           03  ()手形受渡方法
                                     PIC  X(001).
           03  ()定価                PIC S9(013).
           03  ()ユーザ向値引額
                                     PIC S9(013).
           03  ()自社向値引額
                                     PIC S9(013).
           03  ()ユーザ向購入額
                                     PIC S9(013).
           03  ()自社向購入額
                                     PIC S9(013).
           03  ()自社向購入額消費税
                                     PIC S9(013).
           03  ()相殺種類            PIC  X(001).
           03  ()相殺区分            PIC  X(001).
           03  ()相殺額              PIC S9(013).
           03  ()相殺金額消費税
                                     PIC S9(013).
           03  ()相殺契約番号
                                     PIC  X(010).
           03  ()支払金額            PIC S9(013).
           03  ()支払金額消費税
                                     PIC S9(013).
           03  ()支払金額消費税補正額
                                     PIC S9(013).
           03  ()前渡金金利          PIC S9(002)V9(008).
           03  ()購入区分            PIC  X(001).
           03  ()見積物件番号
                                     PIC S9(004).
           03  ()貴社見積番号
                                     PIC  X(020).
           03  ()注文書番号          PIC S9(002).
           03  ()支払条件            PIC  X(060).
           03  ()残価設定額          PIC S9(013).
           03  ()他社購入額          PIC S9(013).
           03  ()他社残価設定額
                                     PIC S9(013).
           03  ()ソフト当社向購入額
                                     PIC S9(013).
           03  ()ソフト当社向購入額消費税
                                     PIC S9(013).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()手数料相殺区分
                                     PIC  X(001).
           03  ()手数料相殺金額
                                     PIC S9(013).
           03  ()手数料相殺金額消費税
                                     PIC S9(013).
