      *****************************************************************
      *   決裁(D328KES_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()決裁種類            PIC  X(001).
           03  ()申請連番            PIC S9(002).
           03  ()決裁受付年月日
                                     PIC  X(008).
           03  ()決裁ランク          PIC  X(002).
           03  ()決裁年月日          PIC  X(008).
           03  ()決裁者コード
                                     PIC  X(008).
           03  ()承認区分            PIC  X(001).
           03  ()決裁条件１          PIC  X(060).
           03  ()決裁条件２          PIC  X(060).
           03  ()決裁条件３          PIC  X(060).
           03  ()決裁条件４          PIC  X(060).
           03  ()決裁条件５          PIC  X(060).
           03  ()審査部意見欄１
                                     PIC  X(060).
           03  ()審査部意見欄２
                                     PIC  X(060).
           03  ()審査部意見欄３
                                     PIC  X(060).
           03  ()審査部意見欄４
                                     PIC  X(060).
           03  ()審査部意見欄５
                                     PIC  X(060).
           03  ()決裁取消日          PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()部店長承認日
                                     PIC  X(008).
           03  ()営業部意見欄１
                                     PIC  X(060).
           03  ()営業部意見欄２
                                     PIC  X(060).
           03  ()営業部意見欄３
                                     PIC  X(060).
           03  ()営業部意見欄４
                                     PIC  X(060).
           03  ()営業部意見欄５
                                     PIC  X(060).
           03  ()申請書印刷済フラグ
                                     PIC  X(001).
           03  ()ロンコミ付議№
                                     PIC  X(006).
           03  ()別紙区分            PIC  X(001).
           03  ()物件チェック区分
                                     PIC  X(001).
