      *****************************************************************
      *   信用保険料率パターンマスタ(D95SHP_TBL)
      *****************************************************************
           03  ()主契約区分          PIC  X(001).
           03  ()信用保険料率パターン
                                     PIC  X(001).
           03  ()保険期間            PIC S9(003).
           03  ()適用開始日          PIC  X(008).
           03  ()料率                PIC S9(002)V9(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
