      *****************************************************************
      *   契約継続費用支払(D352KHS_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()費用種類            PIC  X(003).
           03  ()繰延月数            PIC  X(003).
           03  ()費用区分            PIC  X(001).
           03  ()費用金額            PIC S9(013).
           03  ()初回支払予定年月
                                     PIC  X(004).
           03  ()支払間隔            PIC S9(002).
           03  ()支払回数            PIC S9(003).
           03  ()支払種類            PIC  X(002).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
