      *****************************************************************
      *   担保受付(D336TPU_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()担保受付作成区分
                                     PIC  X(001).
           03  ()連番                PIC S9(003).
           03  ()条件指示区分
                                     PIC  X(001).
           03  ()条件指示番号
                                     PIC S9(003).
           03  ()条件指示内容
                                     PIC  X(120).
           03  ()担保受付日          PIC  X(008).
           03  ()受付者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
