      *****************************************************************
      *   包括異例条件マスタ(D098HKJ_TBL)
      *****************************************************************
           03  ()包括異例条件コード
                                     PIC S9(003).
           03  ()主管部店コード
                                     PIC  X(004).
           03  ()包括異例条件名称
                                     PIC  X(040).
           03  ()管理レベル区分
                                     PIC  X(001).
           03  ()包括条件有効区分
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
