      *****************************************************************
      *   見積協調(D265MKC_TBL)
      *****************************************************************
           03  ()見積番号－連番
                                     PIC S9(007).
           03  ()見積番号枝番
                                     PIC S9(002).
           03  ()協調取引先コード
                                     PIC  X(009).
           03  ()取得価額            PIC S9(013).
           03  ()物件回収サイト
                                     PIC S9(002).
           03  ()物件回収日          PIC S9(002).
           03  ()月額料金            PIC S9(013).
           03  ()他社購入区分
                                     PIC  X(001).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()持分比率            PIC S9(000)V9(003).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
