      *****************************************************************
      *   保険料率マスタ(D10HKR_TBL)
      *****************************************************************
           03  ()保険会社区分        PIC  X(004).
           03  ()適用開始日          PIC  X(008).
           03  ()保険料率            PIC S9(002)V9(008).
           03  ()保険会社区分名称
                                     PIC  X(080).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()圏内区分            PIC  X(001).
           03  ()文言連番            PIC S9(003).
           03  ()保険会社識別コード
                                     PIC  X(002).
           03  ()特定取引先コード
                                     PIC  X(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
