      *****************************************************************
      *   エラーメッセージマスタ(D16EMG_TBL)
      *****************************************************************
           03  ()エラーコード        PIC  X(006).
           03  ()エラータイトル
                                     PIC  X(020).
           03  ()エラーメッセージ
                                     PIC  X(060).
           03  ()エラーアイコン
                                     PIC S9(001).
           03  ()エラーボタン        PIC S9(001).
           03  ()エラーデフォルト
                                     PIC S9(001).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
