      *****************************************************************
      *   売却履歴(D55BKD_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数        PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()売却連番            PIC S9(003).
           03  ()契約種類            PIC  X(003).
           03  ()取引先コード        PIC  X(009).
           03  ()処分先コード        PIC  X(005).
           03  ()売却日              PIC  X(008).
           03  ()売却理由            PIC  X(002).
           03  ()売却区分            PIC  X(001).
           03  ()売却代              PIC S9(013).
           03  ()売却代消費税        PIC S9(013).
           03  ()売却代消費税率
                                     PIC S9(002)V9(008).
           03  ()売却代消費税率区分
                                     PIC  X(002).
           03  ()売却代回収日        PIC  X(008).
           03  ()売却エントリ日
                                     PIC  X(008).
           03  ()売却処理年月        PIC  X(006).
           03  ()回収額              PIC S9(013).
           03  ()回収額消費税        PIC S9(013).
           03  ()回収年月日          PIC  X(008).
           03  ()回収方法            PIC  X(001).
           03  ()未回収額            PIC S9(013).
           03  ()売却経費            PIC S9(013).
           03  ()状態フラグ          PIC  X(001).
           03  ()処分ルート          PIC  X(001).
           03  ()満了売却フラグ
                                     PIC  X(001).
           03  ()請求書番号          PIC S9(007).
           03  ()請求書発行済フラグ
                                     PIC  X(001).
           03  ()取消請求書発行済フラグ
                                     PIC  X(001).
           03  ()申請エントリ日
                                     PIC  X(008).
           03  ()申請処理年月        PIC  X(006).
           03  ()申請書出力年月日
                                     PIC  X(008).
           03  ()申請取消区分        PIC  X(001).
           03  ()申請取消日          PIC  X(008).
           03  ()申請取消エントリ日
                                     PIC  X(008).
           03  ()申請取消処理年月
                                     PIC  X(006).
           03  ()売買契約番号        PIC  X(015).
           03  ()売買契約日          PIC  X(008).
           03  ()決裁エントリ日
                                     PIC  X(008).
           03  ()決裁処理年月        PIC  X(006).
           03  ()決裁ランク          PIC  X(002).
           03  ()決裁年月日          PIC  X(008).
           03  ()決裁者コード        PIC  X(008).
           03  ()承認区分            PIC  X(001).
           03  ()決裁取消区分        PIC  X(001).
           03  ()決裁取消日          PIC  X(008).
           03  ()決裁取消エントリ日
                                     PIC  X(008).
           03  ()決裁取消処理年月
                                     PIC  X(006).
           03  ()確定エントリ日
                                     PIC  X(008).
           03  ()確定処理年月        PIC  X(006).
           03  ()確定取消区分        PIC  X(001).
           03  ()確定取消日          PIC  X(008).
           03  ()確定取消エントリ日
                                     PIC  X(008).
           03  ()確定取消処理年月
                                     PIC  X(006).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()自社売却代          PIC S9(013).
           03  ()自社売却代消費税
                                     PIC S9(013).
           03  ()他社回収額          PIC S9(013).
           03  ()管理債権レベル
                                     PIC  X(001).
           03  ()貸倒損失金          PIC S9(013).
           03  ()貸倒損失金合計
                                     PIC S9(013).
           03  ()貸倒損失金回収額
                                     PIC S9(013).
           03  ()貸倒損失金未回収額
                                     PIC S9(013).
           03  ()引渡先区分          PIC  X(001).
           03  ()売却委託手数料
                                     PIC S9(013).
           03  ()引取負担区分        PIC  X(001).
           03  ()引取費用            PIC S9(013).
           03  ()諸費用消費税        PIC S9(013).
           03  ()請求内訳コード
                                     PIC  X(003).
           03  ()消込通番            PIC  X(011).
           03  ()物件処分申請条件区分
                                     PIC  X(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()初回入金日          PIC  X(008).
           03  ()消込年月日          PIC  X(008).
