      *****************************************************************
      *   注文書約款(D650TYK_TBL)
      *****************************************************************
           03  ()約款パターン
                                     PIC  X(001).
           03  ()行番号              PIC S9(003).
           03  ()文字種              PIC  X(001).
           03  ()フォントサイズ
                                     PIC  X(002).
           03  ()文面                PIC  X(110).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
