      *****************************************************************
      *   Œ©ÏŽx•¥“à—e(D261MSN_TBL)
      *****************************************************************
           03  ()Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007).
           03  ()Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002).
           03  ()Œ_–ñŽí—Þ            PIC  X(003).
           03  ()Žx•¥Ží—Þ            PIC  X(002).
           03  ()ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ()•¨Œ”Ô†            PIC S9(003).
           03  ()Œ©Ï”Ô†|’S“–ŽÒ
                                     PIC  X(002).
           03  ()‰ñŽû‹àŠz            PIC S9(013).
           03  ()Žx•¥‹àŠz            PIC S9(013).
           03  ()Žx•¥‘Šz            PIC S9(013).
           03  ()–³žŠúŠÔ            PIC S9(002).
           03  ()XV”NŒŽ“ú          PIC  X(008).
           03  ()XVŽžŠÔ            PIC  X(008).
           03  ()XVŽÒ              PIC  X(008).
           03  ()“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ()Žx•¥ŠÔŠu            PIC S9(002).
           03  ()Žx•¥ƒTƒCƒg          PIC S9(002).
           03  ()Žx•¥“ú              PIC S9(002).
           03  ()‰‰ñŽx•¥‰ñ”
                                     PIC S9(003).
           03  ()ˆÈ~Žx•¥ŒŽŠz
                                     PIC S9(013).
           03  ()‰‰ñ‰ñŽû‰ñ”
                                     PIC S9(003).
           03  ()ˆÈ~‰ñŽû‹àŠz
                                     PIC S9(013).
           03  ()ˆêŠ‡•ªŠ„‹æ•ª
                                     PIC  X(001).
           03  ()ŒJ‰„ŠúŠÔ            PIC S9(002)V9(002).
           03  ()•¡”ŒJ‰„Žx•¥‹æ•ª
                                     PIC  X(001).
           03  ()“o˜^”NŒŽ“ú          PIC  X(008).
           03  ()“o˜^ŽžŠÔ            PIC  X(008).
           03  ()“o˜^’S“–ŽÒ          PIC  X(008).
