      *****************************************************************
      *   入金(D57KUK_TBL)
      *****************************************************************
           03  ()入金通番            PIC  X(011).
           03  ()入金日              PIC  X(008).
           03  ()ＳＥＱ番号          PIC S9(006).
           03  ()請求担当者          PIC  X(008).
           03  ()照会番号            PIC S9(008).
           03  ()勘定日              PIC  X(008).
           03  ()預入－払出日        PIC  X(008).
           03  ()請求書番号          PIC S9(007).
           03  ()入払区分            PIC  X(001).
           03  ()取引区分            PIC  X(002).
           03  ()取引金額            PIC S9(012).
           03  ()手形－小切手区分
                                     PIC  X(001).
           03  ()手形－小切手番号
                                     PIC  X(007).
           03  ()僚店番号            PIC  X(003).
           03  ()振込依頼人コード
                                     PIC  X(010).
           03  ()振込依頼人名        PIC  X(048).
           03  ()仕向銀行名          PIC  X(015).
           03  ()仕向支店名          PIC  X(015).
           03  ()適用内容            PIC  X(030).
           03  ()入金区分            PIC  X(002).
           03  ()取引先コード        PIC  X(009).
           03  ()一括入金コード
                                     PIC  X(005).
           03  ()名寄せコード        PIC  X(040).
           03  ()入金先名称          PIC  X(080).
           03  ()取消区分            PIC  X(001).
           03  ()取消日              PIC  X(008).
           03  ()消込区分            PIC  X(001).
           03  ()消込金額            PIC S9(013).
           03  ()消込日              PIC  X(008).
           03  ()消込通番            PIC  X(011).
           03  ()振替理由            PIC  X(080).
           03  ()振替区分            PIC  X(001).
           03  ()振替先コード        PIC  X(001).
           03  ()振替日              PIC  X(008).
           03  ()振替金額            PIC S9(013).
           03  ()銀行コード          PIC  X(004).
           03  ()銀行名              PIC  X(015).
           03  ()支店コード          PIC  X(003).
           03  ()支店名              PIC  X(015).
           03  ()預金種目            PIC  X(001).
           03  ()口座番号            PIC  X(010).
           03  ()口座名              PIC  X(040).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()消込残高            PIC S9(013).
           03  ()当月年月            PIC  X(006).
           03  ()当月消込金額        PIC S9(013).
           03  ()当月振替金額－預り金
                                     PIC S9(013).
           03  ()当月振替金額－その他
                                     PIC S9(013).
           03  ()振込手数料          PIC S9(013).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()処理回数            PIC S9(003).
           03  ()入金仕訳短縮コード
                                     PIC  X(002).
           03  ()銀行短縮コード
                                     PIC  X(002).
           03  ()リファレンス番号
                                     PIC  X(016).
           03  ()登録時間            PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録担当者          PIC  X(008).
