      *****************************************************************
      *   消費税率マスタ(D11SHR_TBL)
      *****************************************************************
           03  ()消費税率区分        PIC  X(002).
           03  ()適用開始日          PIC  X(008).
           03  ()消費税率            PIC S9(002)V9(008).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()税率区分            PIC  X(002).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()経過措置適用開始日
                                     PIC  X(008).
           03  ()経過措置適用終了日
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
