      *****************************************************************
      *   処分履歴(D811BSR_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()申請連番            PIC S9(002).
           03  ()処分連番            PIC S9(003).
           03  ()契約種類            PIC  X(003).
           03  ()売廃理由            PIC  X(002).
           03  ()保管先              PIC  X(060).
           03  ()処分日              PIC  X(008).
           03  ()保管予定年月
                                     PIC  X(006).
           03  ()処分区分            PIC  X(001).
           03  ()状態フラグ          PIC  X(001).
           03  ()処分ルート          PIC  X(001).
           03  ()申請エントリ日
                                     PIC  X(008).
           03  ()申請処理年月
                                     PIC  X(006).
           03  ()申請書出力年月日
                                     PIC  X(008).
           03  ()申請取消区分
                                     PIC  X(001).
           03  ()申請取消日          PIC  X(008).
           03  ()申請取消エントリ日
                                     PIC  X(008).
           03  ()申請取消処理年月
                                     PIC  X(006).
           03  ()決裁エントリ日
                                     PIC  X(008).
           03  ()決裁処理年月
                                     PIC  X(006).
           03  ()決裁ランク          PIC  X(002).
           03  ()決裁年月日          PIC  X(008).
           03  ()決裁者コード
                                     PIC  X(008).
           03  ()承認区分            PIC  X(001).
           03  ()決裁取消区分
                                     PIC  X(001).
           03  ()決裁取消日          PIC  X(008).
           03  ()決裁取消エントリ日
                                     PIC  X(008).
           03  ()決裁取消処理年月
                                     PIC  X(006).
           03  ()確定エントリ日
                                     PIC  X(008).
           03  ()確定処理年月
                                     PIC  X(006).
           03  ()確定取消区分
                                     PIC  X(001).
           03  ()確定取消日          PIC  X(008).
           03  ()確定取消エントリ日
                                     PIC  X(008).
           03  ()確定取消処理年月
                                     PIC  X(006).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()引渡先区分          PIC  X(001).
           03  ()引取負担区分
                                     PIC  X(001).
           03  ()引取費用            PIC S9(013).
           03  ()諸費用消費税
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
