      *****************************************************************
      *   部店マスタ(D06BKA_TBL)
      *****************************************************************
           03  ()部課コード          PIC  X(004).
           03  ()サーバ番号          PIC  X(002).
           03  ()部課名称            PIC  X(040).
           03  ()更新日時            PIC  X(016).
           03  ()更新者              PIC  X(008).
           03  ()郵便番号            PIC  X(007).
           03  ()市町村コード        PIC  X(011).
           03  ()住所２              PIC  X(060).
           03  ()住所３              PIC  X(060).
           03  ()電話番号            PIC  X(015).
           03  ()部所長名            PIC  X(020).
           03  ()役職１              PIC  X(030).
           03  ()役職２              PIC  X(030).
           03  ()会計部門コード
                                     PIC  X(002).
           03  ()売上計上区分        PIC  X(001).
           03  ()コンスーマ法人区分
                                     PIC  X(001).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()業務区分            PIC S9(002).
           03  ()部課パスワード
                                     PIC  X(015).
           03  ()インプット区分
                                     PIC  X(002).
           03  ()ＦＡＸ番号          PIC  X(015).
           03  ()部課名称カナ        PIC  X(040).
           03  ()部課略称            PIC  X(016).
           03  ()部課略称カナ        PIC  X(012).
           03  ()住所１              PIC  X(040).
           03  ()書信番号            PIC  X(002).
           03  ()適用年月日          PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
