      *****************************************************************
      *   再リース付保率マスタ(D185SFR_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()請求先コード
                                     PIC  X(005).
           03  ()対象資産コード
                                     PIC  X(007).
           03  ()適用年月日          PIC  X(008).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()付保率              PIC S9(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
