      *****************************************************************
      *   契約番号関連ＤＢ(D395KBD_TBL)
      *****************************************************************
           03  ()先契約番号          PIC  X(010).
           03  ()先再リース回数
                                     PIC S9(002).
           03  ()元契約番号          PIC  X(010).
           03  ()元再リース回数
                                     PIC S9(002).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
