      *****************************************************************
      *   シャープ支店コードマスタ(D073SHS_TBL)
      *****************************************************************
           03  ()包括エリアコード
                                     PIC  X(001).
           03  ()エリアコード
                                     PIC  X(002).
           03  ()シャープ支店コード
                                     PIC  X(002).
           03  ()適用年月日          PIC  X(008).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()支店名              PIC  X(060).
           03  ()支店名カナ          PIC  X(020).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
