      *****************************************************************
      *   最新取引先コード(D012STK_TBL)
      *****************************************************************
           03  ()サーバ番号          PIC  X(002).
           03  ()最新取引先コード
                                     PIC S9(009).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
