      *****************************************************************
      *   購入先コード変換マスタ(D071KHN_TBL)
      *****************************************************************
           03  ()転リース提携先コード
                                     PIC  X(003).
           03  ()先方購入先コード
                                     PIC  X(006).
           03  ()取引先コード－購入先
                                     PIC  X(009).
           03  ()支払先コード－購入先
                                     PIC  X(005).
           03  ()取引先コード－支払先
                                     PIC  X(009).
           03  ()支払先コード－支払先
                                     PIC  X(005).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
