      *****************************************************************
      *   見積変則支払(D263MNS_TBL)
      *****************************************************************
           03  ()見積番号－連番
                                     PIC S9(007).
           03  ()見積番号枝番
                                     PIC S9(002).
           03  ()契約種類            PIC  X(003).
           03  ()支払種類            PIC  X(002).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()開始回              PIC S9(003).
           03  ()開始年月            PIC  X(006).
           03  ()終了回              PIC S9(003).
           03  ()終了年月            PIC  X(006).
           03  ()金額                PIC S9(013).
           03  ()消費税              PIC S9(013).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()受取手数料          PIC S9(013).
