      *****************************************************************
      *   権限集約テーブル(D069KNS_TBL)
      *****************************************************************
           03  ()担当者コード
                                     PIC  X(008).
           03  ()メニューボタンＩＤ
                                     PIC  X(008).
           03  ()実行権限有無フラグ
                                     PIC  X(001).
           03  ()メニュー画面ＩＤ
                                     PIC  X(008).
           03  ()タグＩＤ            PIC  X(003).
           03  ()照会更新区分
                                     PIC  X(001).
           03  ()提供時間判定フラグ
                                     PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()更新者              PIC  X(008).
