      *****************************************************************
      *   解約履歴＿総合採算(D481SSM_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()申請連番            PIC S9(002).
           03  ()主契約区分          PIC  X(001).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()原契約年月日
                                     PIC  X(008).
           03  ()検収年月日          PIC  X(008).
           03  ()原契約期間          PIC  X(008).
           03  ()通期契約期間
                                     PIC S9(003).
           03  ()段階区分            PIC  X(001).
           03  ()採算状態区分
                                     PIC  X(001).
           03  ()最新採算更新日
                                     PIC  X(008).
           03  ()終結年月日          PIC  X(008).
           03  ()承継原契約番号
                                     PIC  X(010).
           03  ()承継前契約番号
                                     PIC  X(010).
           03  ()協調転区分          PIC  X(001).
           03  ()解約回数            PIC S9(002).
           03  ()最大再リース回数
                                     PIC S9(002).
           03  ()適用金利区分
                                     PIC  X(001).
           03  ()社内金利            PIC S9(002)V9(008).
           03  ()一般社内金利
                                     PIC S9(002)V9(008).
           03  ()前渡金金利          PIC S9(002)V9(008).
           03  ()一般前渡金金利
                                     PIC S9(002)V9(008).
           03  ()基本元本金額
                                     PIC S9(013).
           03  ()繰延メリット
                                     PIC S9(013).
           03  ()一般繰延メリット
                                     PIC S9(013).
           03  ()前受月数            PIC S9(002).
           03  ()前受メリット
                                     PIC S9(013).
           03  ()一般前受メリット
                                     PIC S9(013).
           03  ()固定資産税総額
                                     PIC S9(013).
           03  ()動総保険料総額
                                     PIC S9(013).
           03  ()保守料総額          PIC S9(013).
           03  ()固定資産税現価
                                     PIC S9(013).
           03  ()一般固定資産税現価
                                     PIC S9(013).
           03  ()動総保険料現価
                                     PIC S9(013).
           03  ()一般動総保険料現価
                                     PIC S9(013).
           03  ()保守料現価          PIC S9(013).
           03  ()一般保守料現価
                                     PIC S9(013).
           03  ()初期費用            PIC S9(013).
           03  ()期中費用            PIC S9(013).
           03  ()期中費用現価
                                     PIC S9(013).
           03  ()一般期中費用現価
                                     PIC S9(013).
           03  ()回収総額            PIC S9(013).
           03  ()回収総額現価
                                     PIC S9(013).
           03  ()一般回収総額現価
                                     PIC S9(013).
           03  ()解約請求総額
                                     PIC S9(013).
           03  ()解約請求額現価
                                     PIC S9(013).
           03  ()一般解約請求額現価
                                     PIC S9(013).
           03  ()売却代金総額
                                     PIC S9(013).
           03  ()売却代金現価
                                     PIC S9(013).
           03  ()一般売却代金現価
                                     PIC S9(013).
           03  ()処分費用総合
                                     PIC S9(013).
           03  ()処分費用現価
                                     PIC S9(013).
           03  ()一般処分費用現価
                                     PIC S9(013).
           03  ()当初残価金額
                                     PIC S9(013).
           03  ()未実現残価          PIC S9(013).
           03  ()未実現残価現価
                                     PIC S9(013).
           03  ()一般未実現残価現価
                                     PIC S9(013).
           03  ()実質利回り          PIC S9(013).
           03  ()一般実質利回り
                                     PIC S9(013).
           03  ()粗利益              PIC S9(013).
           03  ()一般粗利益          PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
