      *****************************************************************
      *   取引先格付履歴マスタ(D089TRK_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()格付承認日          PIC  X(008).
           03  ()格付ランク          PIC  X(003).
           03  ()スコアリング評点
                                     PIC S9(003).
           03  ()帝国評点            PIC S9(003).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
