      *****************************************************************
      *   入金消込管理＿入金明細(D57NKM_TBL)
      *****************************************************************
           03  ()消込通番            PIC  X(011).
           03  ()入金通番            PIC  X(011).
           03  ()消込対象額          PIC S9(013).
           03  ()消込取消区分        PIC  X(001).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
