      *****************************************************************
      *   動総保険証券番号マスタ(D112HSB_TBL)
      *****************************************************************
           03  ()保険会社識別コード
                                     PIC  X(002).
           03  ()適用年月日          PIC  X(008).
           03  ()動総保険証券番号
                                     PIC  X(011).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
