      *****************************************************************
      *   保証人取引先(D102HOT_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()保証人取引先コード
                                     PIC  X(009).
           03  ()保証人関係区分
                                     PIC  X(001).
           03  ()入力順              PIC S9(002).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
