      *****************************************************************
      *   車両物件(D333SRB_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()契約種類            PIC  X(000).
           03  ()物件番号            PIC S9(004).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()登録番号            PIC  X(020).
           03  ()車検満了日          PIC  X(008).
           03  ()設定残価            PIC S9(013).
           03  ()自動車税負担コード
                                     PIC  X(001).
           03  ()自動車税額          PIC S9(013).
           03  ()自賠責負担コード
                                     PIC  X(001).
           03  ()自賠責金額          PIC S9(013).
           03  ()重量税負担コード
                                     PIC  X(001).
           03  ()重量税額            PIC S9(013).
           03  ()任意保険負担コード
                                     PIC  X(001).
           03  ()任意保険代理店コード
                                     PIC  X(002).
           03  ()任意保険付保先コード
                                     PIC S9(002).
           03  ()任意保険満了日
                                     PIC  X(008).
           03  ()メンテナンス契約先
                                     PIC  X(009).
           03  ()月額メンテナンス料
                                     PIC S9(013).
           03  ()走行距離            PIC S9(007).
           03  ()タイヤ本数          PIC S9(002).
           03  ()コメント            PIC  X(040).
           03  ()備考１              PIC  X(040).
           03  ()備考２              PIC  X(040).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
