      *****************************************************************
      *   取引先債務残高情報履歴マスタ(D014TSR_TBL)
      *****************************************************************
           03  ()取引先コード
                                     PIC  X(009).
           03  ()処理年月            PIC  X(006).
           03  ()債務残高区分
                                     PIC  X(001).
           03  ()債務残件数          PIC S9(006).
           03  ()債務残高            PIC S9(013).
           03  ()債務残高消費税
                                     PIC S9(013).
           03  ()債務未払件数
                                     PIC S9(006).
           03  ()債務未払残高
                                     PIC S9(013).
           03  ()債務未払残高消費税
                                     PIC S9(013).
           03  ()債務残確定年月日
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
