      *****************************************************************
      *   冠頭未表示マスタ(D991KAN_TBL)
      *****************************************************************
           03  ()連番                PIC S9(003).
           03  ()冠頭                PIC  X(010).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
