      *****************************************************************
      *   非稼動資産回収振替(D856HSK_TBL)
      *****************************************************************
           03  ()与信管理先コード
                                     PIC  X(009).
           03  ()契約先コード
                                     PIC  X(005).
           03  ()契約番号            PIC  X(010).
           03  ()取引年月日          PIC  X(008).
           03  ()連番                PIC S9(004).
           03  ()主契約区分          PIC  X(001).
           03  ()回収振替区分
                                     PIC  X(002).
           03  ()回収振替備考
                                     PIC  X(040).
           03  ()回収振替金額
                                     PIC S9(013).
           03  ()回収振替消費税
                                     PIC S9(013).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
