      *****************************************************************
      *   解約申請＿支払内容(D517KSN_TBL)
      *****************************************************************
           03  ()契約番号            PIC  X(010).
           03  ()再リース回数
                                     PIC S9(002).
           03  ()支払種類            PIC  X(002).
           03  ()契約種類            PIC  X(003).
           03  ()取引先コード
                                     PIC  X(009).
           03  ()支払先コード
                                     PIC  X(005).
           03  ()初回支払金額
                                     PIC S9(013).
           03  ()初回支払消費税
                                     PIC S9(013).
           03  ()支払総額            PIC S9(013).
           03  ()支払総額消費税
                                     PIC S9(013).
           03  ()無償期間            PIC S9(002).
           03  ()支払間隔            PIC S9(002).
           03  ()支払日パターン
                                     PIC  X(001).
           03  ()支払サイト          PIC S9(002).
           03  ()支払日              PIC S9(002).
           03  ()支払方法            PIC  X(001).
           03  ()変更日              PIC  X(008).
           03  ()解約年月日          PIC  X(008).
           03  ()解約分料金累計
                                     PIC S9(013).
           03  ()解約分消費税累計
                                     PIC S9(013).
           03  ()他社契約番号
                                     PIC  X(020).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()支払手数料          PIC S9(013).
           03  ()次回支払額          PIC S9(013).
           03  ()次回支払手数料
                                     PIC S9(013).
           03  ()二回目以降支払金額
                                     PIC S9(013).
           03  ()二回目以降支払消費税
                                     PIC S9(013).
           03  ()前受月数            PIC S9(002).
           03  ()頭金                PIC S9(013).
           03  ()頭金消費税          PIC S9(013).
           03  ()手形振出サイト
                                     PIC S9(002).
           03  ()手形振出日          PIC S9(002).
           03  ()月額料金            PIC S9(013).
           03  ()月額料金消費税
                                     PIC S9(013).
           03  ()支払回数            PIC S9(003).
           03  ()支払済金額          PIC S9(013).
           03  ()支払済金額消費税
                                     PIC S9(013).
           03  ()初回支払回数
                                     PIC S9(003).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
           03  ()解約分契約総額
                                     PIC S9(013).
           03  ()持分比率            PIC S9(003).
           03  ()請求書確認区分
                                     PIC  X(001).
           03  ()入金確認区分
                                     PIC  X(001).
           03  ()振込料負担区分
                                     PIC  X(001).
           03  ()ソフト支払総額
                                     PIC S9(013).
           03  ()ソフト支払総額消費税
                                     PIC S9(013).
           03  ()支払基準月          PIC S9(002).
           03  ()再リース支払額
                                     PIC S9(013).
           03  ()基本利回り          PIC S9(002)V9(008).
           03  ()実質利回り          PIC S9(002)V9(008).
           03  ()以降支払サイト
                                     PIC S9(002).
           03  ()以降支払日          PIC S9(002).
