      *****************************************************************
      *   請求書番号管理(D752SQB_TBL)
      *****************************************************************
           03  ()請求書番号ＩＤ
                                     PIC  X(008).
           03  ()請求書番号          PIC S9(007).
           03  ()更新年月日          PIC  X(008).
           03  ()更新時間            PIC  X(008).
           03  ()更新者              PIC  X(008).
           03  ()入力担当者コード
                                     PIC  X(008).
           03  ()登録年月日          PIC  X(008).
           03  ()登録時間            PIC  X(008).
           03  ()登録担当者          PIC  X(008).
