000010************************************************
000020* 当日支払承認F（支払承認明細)(CPBIS093)
000030************************************************
000040    03  ()債務契約ＮＯ           PIC  X(10).
000050    03  ()再リースコード         PIC S9(1).
000060    03  ()契約明細ＮＯ           PIC S9(2).
000070    03  ()承認残価承認区分       PIC S9(1).
000080    03  ()処理時刻時分秒         PIC S9(6).
000090    03  ()処理区分               PIC S9(1).
000100    03  ()債務取引先コード       PIC  X(8).
000110    03  ()当日支払金額           PIC S9(13)  SIGN LEADING SEPARATE.
000120    03  ()総支払金額             PIC S9(13)  SIGN LEADING SEPARATE.
000130    03  ()登録件数               PIC S9(5).
000140    03  FILLER           PIC  X(17).
000150    03  ()共通情報               PIC  X(35).
