000010************************************************
000020* 保険事故マスタ（保険金請求入金)(CPBIS109)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()物件枝番               PIC S9(3).
000070     05  ()再リースコード         PIC S9(1).
000080     05  ()事故日付.
000090      07  ()事故日付－世紀         PIC S9(1).
000100      07  ()事故日付－日付         PIC  X(6).
000110      07  ()事故日付－時刻ＨＨＭＭ PIC  X(4).
000120    03  ()物件情報.
000130     05  ()物件名                 PIC  X(30).
000140     05  ()リース開始日.
000150      07  ()リース開始日－世紀     PIC S9(1).
000160      07  ()リース開始日－日付     PIC  X(6).
000170     05  ()リース終了日.
000180      07  ()リース終了日－世紀     PIC S9(1).
000190      07  ()リース終了日－日付     PIC  X(6).
000200     05  ()期間                   PIC S9(3).
000210     05  ()購入金額               PIC S9(13)  SIGN LEADING SEPARATE.
000220     05  ()ユーザーコード         PIC  X(8).
000230     05  ()ユーザーリファレンス   PIC  X(12).
000240     05  ()設置場所               PIC  X(20).
000250     05  ()転リース提携先コード   PIC  X(2).
000260     05  ()継続リース償却対象額   PIC S9(13)  SIGN LEADING SEPARATE.
000270     05  ()勘定処理コード         PIC  X(2).
000280     05  ()管理ＮＯ               PIC  X(15).
000290    03  ()付保情報.
000300    03  ()動総保険コード         PIC  X(4).
000310     05  ()保険会社コード.
000320     05  ()保険料種別.
000330     05  ()責任期間自.
000340      07  ()責任期間自－世紀       PIC S9(1).
000350      07  ()責任期間自－日付       PIC  X(6).
000360     05  ()責任期間至.
000370      07  ()責任期間至－世紀       PIC S9(1).
000380      07  ()責任期間至－日付       PIC  X(6).
000390     05  ()保険証券番号           PIC  X(11).
000400     05  ()動総保険価格           PIC S9(13)  SIGN LEADING SEPARATE.
000410     05  ()再リース付保率         PIC S9(2).
000420     05  FILLER           PIC  X(12).
000430    03  ()被災情報.
000440     05  ()事故請求登録日.
000450      07  ()事故請求登録日－世紀   PIC S9(1).
000460      07  ()事故請求登録日－日付   PIC  X(6).
000470     05  ()事故区分               PIC  X(1).
000480     05  ()事故原因               PIC  X(1).
000490     05  ()被災物件金額           PIC S9(13)  SIGN LEADING SEPARATE.
000500     05  ()被災物件残価額         PIC S9(13)  SIGN LEADING SEPARATE.
000510     05  FILLER           PIC  X(17).
000520    03  ()保険金請求情報.
000530     05  ()請求年月日.
000540      07  ()請求年月日－世紀       PIC S9(1).
000550      07  ()請求年月日－日付       PIC  X(6).
000560     05  ()請求ＲＥＦＮＯ         PIC  X(8).
000570     05  ()請求保険金             PIC S9(13)  SIGN LEADING SEPARATE.
000580     05  ()臨時費用保険金         PIC S9(13)  SIGN LEADING SEPARATE.
000590     05  ()保険金請求額           PIC S9(13)  SIGN LEADING SEPARATE.
000600     05  FILLER           PIC  X(14).
000610    03  ()保険金入送金情報.
000620     05  ()入送金登録日.
000630      07  ()入送金登録日－世紀     PIC S9(1).
000640      07  ()入送金登録日－日付     PIC  X(6).
000650     05  ()入金日.
000660      07  ()入金日－世紀           PIC S9(1).
000670      07  ()入金日－日付           PIC  X(6).
000680     05  ()入金額                 PIC S9(13)  SIGN LEADING SEPARATE.
000690     05  ()保険金処理区分         PIC  X(1).
000700     05  ()送金                              OCCURS 3.
000710      07  ()送金先コード           PIC S9(2).
000720      07  ()送金先名               PIC  X(40).
000730      07  ()送金額                 PIC S9(13)  SIGN LEADING SEPARATE.
000740     05  FILLER           PIC  X(11).
000750    03  FILLER           PIC  X(21).
000760    03  ()共通情報               PIC  X(35).
