000010************************************************
000020* 提携コードマスタ(三洋納付先コード)(CPBIS090)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()三洋納付先コード       PIC  X(6).
000070     05  FILLER           PIC  X(5).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用年月日ＦＲＯＭ.
000100      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000110      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000120     05  ()納付先コード           PIC  X(6).
000130     05  FILLER           PIC  X(17).
000140    03  ()共通情報               PIC  X(35).
