000010************************************************
000020* ＳＦＣ満了予定(ＢＯＴＬ基本)(CPBIS001)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()ＢＯＴＬ契約ＮＯ       PIC  X(9).
000060    03  FILLER           PIC  X(7).
000070    03  ()事業所コード           PIC S9(4).
000080    03  ()事業所名               PIC  X(20).
000090    03  ()ユーザーコード         PIC  X(8).
000100    03  ()ユーザー名             PIC  X(20).
000110    03  FILLER           PIC  X(28).
000120    03  ()担当者コード           PIC S9(4).
000130    03  FILLER           PIC  X(2).
000140    03  ()ＳＦＣレコード件数     PIC S9(3).
000150    03  ()共通情報               PIC  X(35).
