000010************************************************
000020* コードマスタ(換算相場)(CPBIS006)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()幣種                   PIC  X(3).
000070     05  FILLER           PIC  X(8).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用年月日ＦＲＯＭ.
000100      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000110      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000120     05  ()月末.
000130      07  ()月末換算相場           PIC S9(3)V9(2)  SIGN LEADING SEPARATE.
000140      07  ()月末基準日.
000150       09  ()月末基準日－世紀       PIC S9(1).
000160       09  ()月末基準日－年月日     PIC  X(6).
000170     05  ()前期末.
000180      07  ()前期末換算相場         PIC S9(3)V9(2)  SIGN LEADING SEPARATE.
000190      07  ()前期末基準日.
000200       09  ()前期末基準日－世紀     PIC S9(1).
000210       09  ()前期末基準日－年月日   PIC  X(6).
000220     05  FILLER           PIC  X(7).
000230    03  ()共通情報               PIC  X(35).
