000010************************************************
000020* 仕訳マスタ(CPBIS044)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()仕訳コード.
000060      07  ()業務コード             PIC  X(1).
000070      07  ()パターンＮＯ           PIC  X(3).
000080    03  ()フラグ.
000090     05  ()登録削除               PIC  X(1).
000100     05  FILLER           PIC  X(4).
000110    03  ()個数.
000120     05  ()借方個数               PIC S9(3)  SIGN LEADING SEPARATE.
000130     05  ()貸方個数               PIC S9(3)  SIGN LEADING SEPARATE.
000140    03  ()仕訳情報1                        OCCURS 81.
000150     05  ()ログタイプ             PIC  X(1).
000160     05  ()ＳＥＱＮＯ             PIC S9(2).
000170     05  ()勘定科目               PIC  X(5).
000180     05  ()口座番号               PIC  X(8).
000190     05  ()課税コード             PIC S9(3).
000200     05  ()口座主管事業所         PIC S9(4).
000210    03  FILLER           PIC  X(87).
000220    03  ()共通情報               PIC  X(35).
