000010************************************************
000020* 名称マスタ（シャープ支店名）(CPBIS110)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()支店コード             PIC  X(2).
000100      07  FILLER           PIC  X(9).
000110    03  ()会社名漢字             PIC  X(30).
000120    03  ()会社名カナ             PIC  X(20).
000130    03  ()支店名漢字             PIC  X(20).
000140    03  ()支店名カナ             PIC  X(20).
000150    03  FILLER           PIC  X(60).
000160    03  ()共通情報               PIC  X(35).
