000010************************************************
000020* コードマスタ(再リース料計算率)(CPBIS008)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()ＫＥＹ項目部.
000070      07  ()請求先コード           PIC  X(8).
000080      07  FILLER           PIC  X(3).
000090    03  FILLER           PIC  X(150).
000100    03  ()共通情報               PIC  X(35).
