000010************************************************
000020* 照査ファイル(科目口座残高レコード)(CPBIS078)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()勘定科目.
000060      07  ()科目コード             PIC  X(3).
000070      07  ()取引コード             PIC  X(2).
000080     05  ()幣種                   PIC  X(3).
000090     05  ()口座番号               PIC  X(8).
000100    03  ()フラグ.
000110     05  ()登録削除               PIC  X(1).
000120     05  ()口座タイプ             PIC  X(1).
000130     05  FILLER           PIC  X(3).
000140    03  ()口座名称               PIC  X(32).
000150    03  ()口座主管事業所         PIC  X(4).
000160    03  ()個別明細数             PIC S9(5)  SIGN LEADING SEPARATE.
000170    03  ()残高情報.
000180     05  ()借方合計.
000190      07  ()借方合計－外貨金額     PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000200      07  ()借方合計－円貨金額     PIC S9(15)  SIGN LEADING SEPARATE.
000210     05  ()貸方合計.
000220      07  ()貸方合計－外貨金額     PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000230      07  ()貸方合計－円貨金額     PIC S9(15)  SIGN LEADING SEPARATE.
000240     05  ()残高.
000250      07  ()残高－外貨金額         PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000260      07  ()残高－円貨金額         PIC S9(15)  SIGN LEADING SEPARATE.
000270    03  FILLER           PIC  X(20).
000280    03  ()適用日.
000290     05  ()適用日－世紀           PIC S9(1).
000300     05  ()適用日－年月日         PIC S9(6).
000310    03  ()共通情報               PIC  X(35).
