000010************************************************
000020* 履歴アンマッチ債権基本(CPBIS160)
000030************************************************
000040    03  ()解約履歴ＫＥＹ.
000050     05  ()ＫＥＹ－解約日         PIC  X(7).
000060    03  ()ＫＥＹ項目契約番号.
000070     05  ()契約番号               PIC  X(9).
000080    03  ()事業所コード           PIC S9(4).
000090    03  ()ユーザコード           PIC  X(8).
000100    03  ()担当者コード           PIC S9(4).
000110    03  ()契約状態区分.
000120     05  ()原契約                 PIC  X(1).
000130     05  ()継続リース             PIC  X(1).
000140     05  ()再リース               PIC  X(1).
000150     05  ()割賦                   PIC  X(1).
000160     05  ()手数料                 PIC  X(1).
000170     05  ()ファクタリング         PIC  X(1).
000180     05  ()金消                   PIC  X(1).
000190     05  ()支払保証               PIC  X(1).
000200    03  ()検収集計表対象外区分   PIC  X(1).
000210    03  FILLER           PIC  X(4).
000220    03  ()転リース提携先コード   PIC  X(2).
000230    03  ()否認区分               PIC  X(1).
000240    03  FILLER           PIC  X(27).
000250    03  ()地位継承元情報.
000260     05  ()元事業所コード         PIC S9(4).
000270     05  ()元ユーザコード         PIC  X(8).
000280    03  ()処理年月度.
000290     05  ()処理年月度－世紀       PIC S9(1).
000300     05  ()処理年月度－年月       PIC  X(4).
000310    03  ()共通情報               PIC  X(35).
