000010************************************************
000020* 入金消込プルーフＦ（消込基本)(CPBIS097)
000030************************************************
000040    03  ()入金消込データ         PIC  X(250).
000050    03  ()入金消込データ         PIC  X(250).
