000010************************************************
000020* 名称マスタ（機械類名：リース）(CPBIS114)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()機械区分               PIC  X(2).
000100      07  FILLER           PIC  X(9).
000110    03  ()機械類の区分名称リース PIC  X(70).
000120    03  FILLER           PIC  X(80).
000130    03  ()共通情報               PIC  X(35).
