000010************************************************
000020* コードマスタ(連動金利)(CPBIS023)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()キー項目部.
000070      07  ()連動金利区分           PIC  X(2).
000080      07  ()ＳＥＱＮＯ             PIC  X(2).
000090     05  FILLER           PIC  X(7).
000100    03  ()適用範囲                          OCCURS 5.
000110     05  ()適用年月日ＦＲＯＭ.
000120      07  ()適用年月日ＦＲＯＭ－世紀 PIC S9(1).
000130      07  ()適用年月日ＦＲＯＭ－年月日 PIC  X(6).
000140     05  ()金利                   PIC S9(3)V9(7)  SIGN LEADING SEPARATE.
000150     05  ()登録日.
000160      07  ()登録日－世紀           PIC S9(1).
000170      07  ()登録日－年月日         PIC S9(6).
000180     05  ()更新日.
000190      07  ()更新日－世紀           PIC S9(1).
000200      07  ()更新日－年月日         PIC S9(6).
000210     05  FILLER           PIC  X(4).
000220    03  ()共通情報               PIC  X(35).
