000010************************************************
000020* 借入金取引Ｆ（借入金取引DB）(CPBIS056)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()処理通番.
000060      07  ()ＫＥＹ処理通番一連番号 PIC S9(3).
000070      07  ()ＫＥＹ処理通番枝番     PIC S9(1).
000080    03  ()フラグ.
000090     05  FILLER           PIC  X(5).
000100    03  ()管理ＮＯ－枝番.
000110     05  ()管理ＮＯ               PIC  X(7).
000120     05  ()枝番                   PIC S9(2).
000130    03  ()残高キー.
000140     05  ()借入先コード           PIC  X(7).
000150     05  ()幣種                   PIC  X(3).
000160     05  ()借入勘定コード         PIC  X(1).
000170    03  ()勘定科目.
000180     05  ()科目コード             PIC S9(3).
000190     05  ()取引コード             PIC S9(2).
000200    03  ()ログタイプ             PIC  X(1).
000210    03  ()取引日.
000220     05  ()取引日－世紀           PIC S9(1).
000230     05  ()取引日－年月日         PIC S9(6).
000240    03  ()ＶＡＬＵＥ日.
000250     05  ()ＶＡＬＵＥ日－世紀     PIC S9(1).
000260     05  ()ＶＡＬＵＥ日－年月日   PIC S9(6).
000270    03  ()取引情報.
000280     05  ()元本額                 PIC S9(14)V9(2)  SIGN LEADING SEPARATE.
000290     05  ()ＥＸ区分               PIC  X(4).
000300     05  ()換算相場               PIC S9(4)V9(6)  SIGN LEADING SEPARATE.
000310     05  ()円貨金額               PIC S9(13)  SIGN LEADING SEPARATE.
000320     05  ()対価ＦＩＸ             PIC  X(1).
000330    03  FILLER           PIC  X(5).
000340    03  ()処理通番.
000350     05  ()処理通番業務識別コード PIC  X(4).
000360     05  ()処理通番一連番号       PIC S9(5).
000370     05  ()処理通番枝番           PIC S9(1).
000380    03  FILLER           PIC  X(26).
000390    03  ()共通情報               PIC  X(35).
