000010************************************************
000020* 債務（債務基本）(CPBIS041)
000030************************************************
000040    03  ()キー.
000050     05  ()債務契約ＮＯ           PIC  X(10).
000060     05  ()再リースコード         PIC S9(1).
000070    03  ()事業所コード           PIC S9(4).
000080    03  ()担当者コード           PIC S9(4).
000090    03  ()債務契約情報.
000100     05  ()契約情報                          OCCURS 10.
000110      07  ()契約情報－回収物件金額 PIC S9(13)  SIGN LEADING SEPARATE.
000120      07  ()契約情報－契約金額     PIC S9(13)  SIGN LEADING SEPARATE.
000130    03  ()債務勘定処理コード     PIC S9(2).
000140    03  ()全部解約日.
000150     05  ()全部解約日－世紀       PIC S9(1).
000160     05  ()全部解約日－年月日     PIC  X(6).
000170    03  ()全部解約年月.
000180     05  ()全部解約年月－世紀     PIC S9(1).
000190     05  ()全部解約年月－年月     PIC  X(4).
000200    03  ()旧債務契約ＮＯ         PIC  X(10).
000210    03  ()新債務契約ＮＯ         PIC  X(10).
000220    03  ()最新明細レコードシーケンス.
000230     05  ()レコードシーケンス－Ｇ            OCCURS 10.
000240      07  ()レコードシーケンス     PIC S9(1).
000250    03  FILLER           PIC  X(22).
000260    03  ()共通情報               PIC  X(35).
