000010************************************************
000020* 入金消込取消プルーフＦ（消込取消基本)(CPBIS100)
000030************************************************
000040    03  ()消込取消データ         PIC  X(200).
000050    03  ()消込取消データ         PIC  X(200).
