000010************************************************
000020* 名称マスタ（担当者マスタ)(CPBIS127)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()担当者コード           PIC  X(4).
000100      07  FILLER           PIC  X(7).
000110    03  ()所属事業所コード       PIC S9(4).
000120    03  ()個人番号               PIC S9(7).
000130    03  ()氏名.
000140     05  ()姓                     PIC  X(8).
000150     05  ()名                     PIC  X(6).
000160     05  ()姓カナ                 PIC  X(10).
000170    03  ()経営フラグ             PIC  X(1).
000180    03  FILLER           PIC  X(114).
000190    03  ()共通情報               PIC  X(35).
