000010************************************************
000020* 提携コードマスタ(ポッカ機械分類区分)(CPBIS087)
000030************************************************
000040    03  ()エントリーキー部.
000050     05  ()識別コード             PIC  X(4).
000060     05  ()機械分類区分           PIC  X(1).
000070     05  FILLER           PIC  X(10).
000080    03  ()適用範囲                          OCCURS 5.
000090     05  ()適用日付.
000100      07  ()適用日付－世紀         PIC S9(1).
000110      07  ()適用日付－年月日       PIC  X(6).
000120     05  ()資産コード             PIC  X(7).
000130     05  ()動総保険コード         PIC  X(4).
000140     05  ()信用保険コード         PIC  X(6).
000150     05  FILLER           PIC  X(6).
000160    03  ()共通情報               PIC  X(35).
