000010************************************************
000020* 履歴マッチ資産基本(CPBIS173)
000030************************************************
000040    03  ()解約履歴ＫＥＹ.
000050     05  ()ＫＥＹ－解約日         PIC  X(7).
000060    03  ()ＫＥＹ項目.
000070     05  ()契約ＮＯ               PIC  X(9).
000080    03  ()事業所コード           PIC S9(4).
000090    03  ()ユーザコード           PIC  X(8).
000100    03  ()担当者コード           PIC S9(4).
000110    03  ()契約状態区分.
000120     05  ()原契約                 PIC  X(1).
000130     05  ()継続                   PIC  X(1).
000140     05  ()再リース               PIC  X(1).
000150     05  ()割賦                   PIC  X(1).
000160     05  ()手数料                 PIC  X(1).
000170     05  ()ファクタリング         PIC  X(1).
000180     05  ()金消                   PIC  X(1).
000190     05  ()支払保証               PIC  X(1).
000200    03  FILLER           PIC  X(5).
000210    03  ()契約情報.
000220     05  ()契約日.
000230      07  ()契約日－世紀           PIC S9(1).
000240      07  ()契約日－年月日         PIC  X(6).
000250     05  ()検収日.
000260      07  ()検収日－世紀           PIC S9(1).
000270      07  ()検収日－年月日         PIC  X(6).
000280     05  ()残価回収日.
000290      07  ()残価回収日－世紀       PIC S9(1).
000300      07  ()残価回収日－年月日     PIC  X(6).
000310     05  ()購入金額合計           PIC S9(13)  SIGN LEADING SEPARATE.
000320     05  ()残価合計額             PIC S9(13)  SIGN LEADING SEPARATE.
000330     05  ()物件枝番号             PIC S9(3)  SIGN LEADING SEPARATE.
000340     05  ()数量合計               PIC S9(5)  SIGN LEADING SEPARATE.
000350     05  ()単年度契約             PIC  X(2).
000360     05  ()転リース提携先コード   PIC  X(2).
000370     05  ()債権協調コード         PIC  X(2).
000380     05  ()仕入消費税額合計       PIC S9(13)  SIGN LEADING SEPARATE.
000390     05  ()案件発生区分           PIC  X(1).
000400     05  ()稟議区分               PIC  X(1).
000410    03  ()最終物件ＮＯ           PIC S9(3).
000420    03  ()協調区分.
000430     05  ()幹事非幹事区分         PIC  X(1).
000440     05  ()ＯＰＥＮＣＬＯＳＥ区分 PIC  X(1).
000450     05  ()回収手順               PIC  X(1).
000460    03  ()否認区分               PIC  X(1).
000470    03  FILLER           PIC  X(33).
000480    03  ()地位継承元情報.
000490     05  ()元契約ＮＯ             PIC  X(9).
000500     05  ()元最終物件ＮＯ         PIC S9(3).
000510     05  ()元事業所コード         PIC S9(4).
000520     05  ()元ユーザコード         PIC  X(8).
000530    03  ()処理年月度.
000540     05  ()処理年月度－世紀       PIC S9(1).
000550     05  ()処理年月度－年月       PIC  X(4).
000560    03  ()共通情報               PIC  X(35).
