000010************************************************
000020* 債務（債務明細）(CPBIS043)
000030************************************************
000040    03  ()キー.
000050     05  ()債務契約ＮＯ           PIC  X(10).
000060     05  ()再リースコード         PIC S9(1).
000070    03  ()契約明細ＮＯ           PIC S9(2).
000080    03  ()レコードシーケンス     PIC S9(1).
000090    03  ()債務取引コード         PIC  X(8).
000100    03  ()債務協調コード         PIC  X(2).
000110    03  ()ＲＥＦ番号             PIC  X(16).
000120    03  ()契約日.
000130     05  ()契約日－世紀           PIC S9(1).
000140     05  ()契約日－年月日         PIC  X(6).
000150    03  ()検収日.
000160     05  ()検収日－世紀           PIC S9(1).
000170     05  ()検収日－年月日         PIC  X(6).
000180    03  ()部分解約日.
000190     05  ()部分解約日－世紀       PIC S9(1).
000200     05  ()部分解約日－年月日     PIC  X(6).
000210    03  ()内容変更日.
000220     05  ()内容変更日－世紀       PIC S9(1).
000230     05  ()内容変更日－年月日     PIC  X(6).
000240    03  ()部分解約年月度.
000250     05  ()部分解約年月度－世紀   PIC S9(1).
000260     05  ()部分解約年月度－年月   PIC  X(4).
000270    03  FILLER           PIC  X(10).
000280    03  ()債務回収情報.
000290     05  ()回収物件金額           PIC S9(13)  SIGN LEADING SEPARATE.
000300     05  ()売上消費税             PIC S9(13)  SIGN LEADING SEPARATE.
000310     05  ()物件代金回収日.
000320      07  ()物件代金回収日－世紀   PIC S9(1).
000330      07  ()物件代金回収日－年月日 PIC  X(6).
000340     05  ()回収方式コード         PIC S9(1).
000350     05  ()売上消費税相殺区分     PIC S9(1).
000360     05  ()請求データ作成日.
000370      07  ()請求データ作成日－世紀 PIC S9(1).
000380      07  ()請求データ作成日－年月日 PIC  X(6).
000390     05  FILLER           PIC  X(10).
000400    03  ()債務支払情報.
000410     05  ()リース開始日.
000420      07  ()リース開始日－世紀     PIC S9(1).
000430      07  ()リース開始日－年月日   PIC  X(6).
000440     05  ()リース終了日.
000450      07  ()リース終了日－世紀     PIC S9(1).
000460      07  ()リース終了日－年月日   PIC  X(6).
000470     05  ()リース期間             PIC S9(3)  SIGN LEADING SEPARATE.
000480     05  ()ファイナンス開始日.
000490      07  ()ファイナンス開始日－世紀 PIC S9(1).
000500      07  ()ファイナンス開始日－年月日 PIC  X(6).
000510     05  ()ファイナンス終了日.
000520      07  ()ファイナンス－世紀     PIC S9(1).
000530      07  ()ファイナンス－年月日   PIC  X(6).
000540     05  ()ファイナンス期間       PIC S9(3)  SIGN LEADING SEPARATE.
000550     05  ()債務勘定処理コード     PIC S9(2).
000560     05  ()リース料               PIC S9(13)  SIGN LEADING SEPARATE.
000570     05  ()支払サイクル           PIC S9(2)  SIGN LEADING SEPARATE.
000580     05  ()支払回数               PIC S9(3)  SIGN LEADING SEPARATE.
000590     05  ()毎月支払日             PIC S9(2)  SIGN LEADING SEPARATE.
000600     05  ()計算方式               PIC S9(1).
000610     05  ()据置期間               PIC S9(3)  SIGN LEADING SEPARATE.
000620     05  ()ＢＥＧＩＮ回数         PIC S9(1).
000630     05  ()第１回リース料約定支払日.
000640      07  ()第１回リース料約定支払日世紀 PIC S9(1).
000650      07  ()第１回リース料約定支払日年月日 PIC  X(6).
000660     05  ()第１回リース料支払日.
000670      07  ()第１回リース料支払日－世紀 PIC S9(1).
000680      07  ()第１回リース料支払日－年月日 PIC  X(6).
000690     05  ()前払情報.
000700      07  ()前払リース料支払日.
000710       09  ()前払リース料支払日－世紀 PIC S9(1).
000720       09  ()前払リース料支払日－年月日 PIC  X(6).
000730      07  ()前払リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000740      07  ()前払リース料消費税     PIC S9(13)  SIGN LEADING SEPARATE.
000750      07  ()前払リース料実支払額   PIC S9(13)  SIGN LEADING SEPARATE.
000760      07  ()前払リース料諸費用     PIC S9(13)  SIGN LEADING SEPARATE.
000770      07  ()前払リース料充当開始年月.
000780       09  ()前払リース料充当開始年月世紀 PIC S9(1).
000790       09  ()前払リース料充当開始年月年月日 PIC  X(4).
000800      07  ()前払リース料充当終了年月.
000810       09  ()前払リース料充当終了年月世紀 PIC S9(1).
000820       09  ()前払リース料充当終了年月年月日 PIC  X(4).
000830      07  ()前払充当月数           PIC S9(3)  SIGN LEADING SEPARATE.
000840     05  ()利回り.
000850      07  ()利回り基本             PIC S9(2)V9(9)  SIGN LEADING SEPARATE.
000860      07  ()利回り実質             PIC S9(2)V9(9)  SIGN LEADING SEPARATE.
000870     05  ()総支払金額             PIC S9(13)  SIGN LEADING SEPARATE.
000880     05  ()利息合計               PIC S9(13)  SIGN LEADING SEPARATE.
000890     05  ()粗利益                 PIC S9(13)  SIGN LEADING SEPARATE.
000900     05  ()消費税額.
000910      07  ()消費税総額             PIC S9(13)  SIGN LEADING SEPARATE.
000920      07  ()消費税支払区分         PIC S9(1).
000930      07  ()消費税税率             PIC S9(2)V9(1)  SIGN LEADING SEPARATE.
000940      07  ()消費税コード           PIC S9(2).
000950     05  ()諸費用.
000960      07  ()諸費用固定資産税       PIC S9(13)  SIGN LEADING SEPARATE.
000970      07  ()諸費用保険料           PIC S9(13)  SIGN LEADING SEPARATE.
000980      07  ()諸費用保守料           PIC S9(13)  SIGN LEADING SEPARATE.
000990      07  ()諸費用そのた１         PIC S9(13)  SIGN LEADING SEPARATE.
001000      07  ()諸費用そのた２         PIC S9(13)  SIGN LEADING SEPARATE.
001010      07  ()諸費用区分             PIC S9(1).
001020     05  ()支払先口座情報.
001030      07  ()支払先コード           PIC  X(4).
001040      07  ()銀行コード             PIC  X(7).
001050      07  ()口座番号               PIC  X(7).
001060      07  ()預金種類               PIC  X(1).
001070     05  ()支払確定情報.
001080      07  ()支払確定日.
001090       09  ()支払確定日－世紀       PIC S9(1).
001100       09  ()支払確定日－年月日     PIC  X(6).
001110      07  ()支払確定年月度.
001120       09  ()支払確定年月度－世紀   PIC S9(1).
001130       09  ()支払確定年月度－年月   PIC  X(4).
001140      07  ()担当者コード           PIC  X(4).
001150     05  ()支払承認情報.
001160      07  ()支払承認情報承認ＮＯ.
001170       09  ()支払承認情報サブシステム区分 PIC  X(1).
001180       09  ()支払承認情報シーケンス PIC S9(5).
001190      07  ()支払承認情報支払承認日.
001200       09  ()支払承認情報支払承認日－世紀 PIC S9(1).
001210       09  ()支払承認情報支払承認日－年月日 PIC  X(6).
001220      07  ()支払承認情報担当者コード PIC S9(4).
001230     05  ()残価支払承認.
001240      07  ()残価支払承認承認ＮＯ.
001250       09  ()残価支払承認サブシステム区分 PIC  X(1).
001260       09  ()残価支払承認シーケンス PIC S9(5).
001270      07  ()残価支払承認支払承認日.
001280       09  ()残価支払承認支払承認日－世紀 PIC S9(1).
001290       09  ()残価支払承認支払承認日－年月日 PIC  X(6).
001300      07  ()残価支払承認担当者コード PIC S9(4).
001310     05  ()前月末債務残高         PIC S9(13)  SIGN LEADING SEPARATE.
001320     05  ()前月末元本残高         PIC S9(13)  SIGN LEADING SEPARATE.
001330     05  ()前期末消費税残高       PIC S9(13)  SIGN LEADING SEPARATE.
001340     05  ()残価額                 PIC S9(13)  SIGN LEADING SEPARATE.
001350     05  ()残価支払日.
001360      07  ()残価支払日－世紀       PIC S9(1).
001370      07  ()残価支払日－年月日     PIC  X(6).
001380     05  FILLER           PIC  X(24).
001390     05  ()初回情報.
001400      07  ()初回情報実リース料     PIC S9(13)  SIGN LEADING SEPARATE.
001410      07  ()初回情報ＮＥＴリース料 PIC S9(13)  SIGN LEADING SEPARATE.
001420      07  ()初回情報利息           PIC S9(13)  SIGN LEADING SEPARATE.
001430      07  ()初回情報元本支払額     PIC S9(13)  SIGN LEADING SEPARATE.
001440      07  ()初回情報元本残高       PIC S9(13)  SIGN LEADING SEPARATE.
001450      07  ()初回情報債務残高       PIC S9(13)  SIGN LEADING SEPARATE.
001460      07  ()初回情報消費税額       PIC S9(13)  SIGN LEADING SEPARATE.
001470      07  ()初回情報消費税残高     PIC S9(13)  SIGN LEADING SEPARATE.
001480      07  ()初回情報諸費用         PIC S9(13)  SIGN LEADING SEPARATE.
001490      07  ()初回情報実支払額       PIC S9(13)  SIGN LEADING SEPARATE.
001500      07  ()初回情報消費税率       PIC S9(2)V9(1)  SIGN LEADING SEPARATE.
001510      07  ()初回情報ダミー         PIC  X(14).
001520      07  ()初回情報支払データ作成日.
001530       09  ()支払データ作成日－世紀 PIC S9(1).
001540       09  ()支払データ作成日－年月日 PIC  X(6).
001550      07  ()初回情報請求データ作成日.
001560       09  ()請求データ作成日－世紀２ PIC S9(1).
001570       09  ()請求データ作成日－年月日２ PIC  X(6).
001580      07  ()初回情報仕訳データ作成日.
001590       09  ()仕訳データ作成日－世紀 PIC S9(1).
001600       09  ()仕訳データ作成日－年月日 PIC  X(6).
001610    03  FILLER           PIC  X(18).
001620    03  ()共通情報               PIC  X(35).
