000010************************************************
000020* 解約履歴債権ファイル(再リース展開)(CPBIS159)
000030************************************************
000040    03  ()ＫＥＹ項目.
000050     05  ()ＫＥＹ－契約番号       PIC  X(9).
000060     05  ()ＫＥＹ－物件番号       PIC  X(3).
000070     05  ()ＫＥＹ－解約区分       PIC  X(1).
000080     05  ()ＫＥＹ－解約日.
000090      07  ()ＫＥＹ－解約日－世紀   PIC S9(1).
000100      07  ()ＫＥＹ－解約日－年月日 PIC S9(6).
000110     05  ()ＫＥＹ－請求コード     PIC S9(2).
000120     05  ()ＫＥＹ－再リースコード PIC S9(1).
000130     05  ()ＫＥＹ－レコード区分   PIC  X(2).
000140    03  ()ＫＥＹ－１.
000150     05  ()契約番号               PIC  X(9).
000160    03  ()ＫＥＹ－２.
000170     05  ()再リースコード         PIC S9(1).
000180     05  ()物件番号               PIC S9(3).
000190     05  ()請求コード             PIC S9(2).
000200     05  ()勘定処理コード         PIC S9(2).
000210     05  ()解約区分               PIC  X(1).
000220    03  ()キー年度.
000230     05  ()年度－世紀             PIC  X(1).
000240     05  ()年度－年月             PIC  X(4).
000250    03  ()支払回数番号           PIC S9(4)  SIGN LEADING SEPARATE.
000260    03  ()請求金額               PIC S9(13) SIGN LEADING SEPARATE.
000270    03  ()債権残高               PIC S9(13) SIGN LEADING SEPARATE.
000280    03  ()消費税.
000290     05  ()消費税－額             PIC S9(11) SIGN LEADING SEPARATE.
000300     05  ()消費税－回収方式コード PIC  X(1).
000310    03  ()回収方式コード         PIC  X(1).
000320    03  ()回収済表示             PIC S9(1).
000330    03  ()前受充当表示           PIC  X(1).
000340    03  ()消費税率               PIC S9(2)V9(1)
000345                                             SIGN LEADING SEPARATE.
000350    03  FILLER           PIC  X(24).
