000010************************************************
000020* 名称マスタ（三菱自工設置場所名）(CPBIS120)
000030************************************************
000040    03  ()エントリーＫＥＹ部.
000050     05  ()識別コード.
000060      07  ()レコード種別           PIC  X(3).
000070      07  ()当月翌月区分           PIC  X(1).
000080     05  ()ＫＥＹ項目部.
000090      07  ()所在場所コード         PIC  X(5).
000100      07  FILLER           PIC  X(6).
000110    03  ()納付先コード           PIC  X(6).
000120    03  ()設置場所名漢字         PIC  X(40).
000130    03  ()設置場所名カナ         PIC  X(20).
000140    03  ()設置場所郵便番号       PIC  X(7).
000150    03  ()設置場所住所漢字       PIC  X(60).
000160    03  FILLER           PIC  X(17).
000170    03  ()共通情報               PIC  X(35).
