000010************************************************
000020* 納付先マスタ（納付先基本)(CPBIS103)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()納付先コード           PIC  X(6).
000060    03  ()市町村情報.
000070     05  ()都道府県名漢字         PIC  X(8).
000080     05  ()市区名郡町村名漢字     PIC  X(30).
000090     05  ()市区名郡町村名カナ     PIC  X(30).
000100    03  FILLER           PIC  X(1).
000110    03  ()納付先情報.
000120     05  ()郵便ＮＯ.
000130      07  ()親                     PIC  X(3).
000140      07  ()子                     PIC  X(4).
000150     05  ()住所名市郡名番地号漢字 PIC  X(60).
000160     05  ()住所名都道府県名番地号カナ PIC  X(60).
000170     05  ()納付先名漢字           PIC  X(20).
000180     05  ()納付先名カナ           PIC  X(20).
000190     05  ()報奨金支払区分         PIC  X(1).
000200     05  ()納付方法               PIC  X(1).
000210     05  ()償却資産税率           PIC S9(2)V9(3)  SIGN LEADING SEPARATE.
000220     05  ()納付銀行コード         PIC  X(4).
000230    03  FILLER           PIC  X(13).
000240    03  ()共通情報               PIC  X(35).
