000010************************************************
000020* 履歴アンマッチ債権再リース展開(CPBIS163)
000030************************************************
000040    03  ()解約履歴ＫＥＹ.
000050     05  ()ＫＥＹ－解約日         PIC  X(7).
000060    03  ()ＫＥＹ項目契約番号.
000070     05  ()契約番号               PIC  X(9).
000080    03  ()キー.
000090     05  ()再リースコード         PIC S9(1).
000100     05  ()物件ＮＯ               PIC S9(3).
000110     05  ()請求コード             PIC S9(2).
000120     05  ()勘定処理コード         PIC S9(2).
000130     05  ()解約区分               PIC  X(1).
000140    03  ()キー年月度.
000150     05  ()年月度－世紀           PIC S9(1).
000160     05  ()年月度－年月           PIC  X(4).
000170    03  ()支払回数番号           PIC S9(4)  SIGN LEADING SEPARATE.
000180    03  ()請求金額               PIC S9(13)  SIGN LEADING SEPARATE.
000190    03  ()債権残高               PIC S9(13)  SIGN LEADING SEPARATE.
000200    03  ()消費税.
000210     05  ()消費税－額             PIC S9(11)  SIGN LEADING SEPARATE.
000220     05  ()消費税－回収方式コード PIC S9(1).
000230    03  ()回収方式コード         PIC S9(1).
000240    03  ()回収済表示             PIC S9(1).
000250    03  ()前受充当表示           PIC S9(1).
000260    03  ()消費税率               PIC S9(2)V9(1)  SIGN LEADING SEPARATE.
000270    03  FILLER           PIC  X(24).
