000010************************************************
000020* 解約履歴債権ファイル(CPBIS131)
000030************************************************
000040    03  ()ＫＥＹ.
000050     05  ()契約ＮＯ               PIC  X(9).
000060     05  ()物件ＮＯ               PIC S9(3).
000070     05  ()解約区分               PIC  X(1).
000080     05  ()解約日.
000090      07  ()解約日－世紀           PIC  X(1).
000100      07  ()解約日－年月日         PIC  X(6).
000110     05  ()請求コード             PIC S9(2).
000120     05  ()再リースコード         PIC S9(1).
000130     05  ()レコード区分           PIC  X(2).
000140    03  ()データ１               PIC  X(200).
000150    03  ()データ２               PIC  X(1000).
