000010************************************************
000020* 債権抽出ファイル(CPBIS179)
000030************************************************
000040    03  ()契約ＮＯ               PIC  X(9).
000050    03  ()再リースコード         PIC  X(1).
000060    03  ()物件ＮＯ               PIC  X(3).
000070    03  ()請求コード             PIC  X(2).
000080    03  ()勘定処理コード         PIC  X(2).
000090    03  ()解約区分               PIC  X(1).
000100    03  ()ユーザーコード         PIC  X(8).
000110    03  ()名寄せコード           PIC  X(8).
000120    03  ()グループコード         PIC  X(8).
000130    03  ()クラス                 PIC  X(2).
000140    03  ()事業所コード           PIC  X(4).
000150    03  ()ユーザ名称.
000160     05  ()ユーザ名称－漢字カナ区分 PIC  X(1).
000170     05  ()ユーザ名称－略称       PIC  X(26).
000180    03  ()名寄せ名称.
000190     05  ()名寄せ名称－漢字カナ区分 PIC  X(1).
000200     05  ()名寄せ名称－略称       PIC  X(30).
000210    03  ()与信限度額             PIC S9(13) SIGN LEADING SEPARATE.
000220    03  ()物件枝番数             PIC S9(3)  SIGN LEADING SEPARATE.
000230    03  ()数量                   PIC S9(5)  SIGN LEADING SEPARATE.
000240    03  FILLER           PIC  X(1).
000250    03  ()物件名                 PIC  X(30).
000260    03  FILLER           PIC  X(1).
000270    03  ()設置場所名             PIC  X(20).
000280    03  ()請求先コード           PIC  X(8).
000290    03  ()請求先名称.
000300     05  ()請求先名称－漢字カナ区分 PIC  X(1).
000310     05  ()請求先名称－略称       PIC  X(26).
000320    03  ()請求サイクル           PIC S9(2)  SIGN LEADING SEPARATE.
000330    03  ()入金日                 PIC S9(2)  SIGN LEADING SEPARATE.
000340    03  ()請求書発行様式         PIC  X(1).
000350    03  ()請求書発行月区分       PIC  X(1).
000360    03  ()入金情報.
000370     05  ()入金情報－銀行コード   PIC  X(7).
000380     05  ()入金情報－銀行名称－漢字カナ区分 PIC  X(1).
000390     05  ()入金情報－銀行名称－略称 PIC  X(30).
000400     05  ()入金情報－口座番号     PIC  X(7).
000410     05  ()入金情報－預金種類     PIC  X(1).
000420    03  ()自動引落.
000430     05  ()自動引落－銀行コード   PIC  X(7).
000440     05  ()自動引落－銀行名称－漢字カナ区分 PIC  X(1).
000450     05  ()自動引落－銀行名称－略称 PIC  X(30).
000460     05  ()自動引落－口座番号     PIC  X(7).
000470     05  ()自動引落－預金種類     PIC  X(1).
000480    03  ()業種コード             PIC  X(2).
000490    03  ()大企業コード           PIC  X(1).
000500    03  ()リース料入金単位       PIC  X(1).
000510    03  ()振込手数料単位         PIC  X(1).
000520    03  ()検収日.
000530     05  ()検収日－世紀           PIC  X(1).
000540     05  ()検収日－年月日         PIC  X(6).
000550    03  ()リース開始日.
000560     05  ()リース開始日－世紀     PIC  X(1).
000570     05  ()リース開始日－年月日   PIC  X(6).
000580    03  ()リース終了日.
000590     05  ()リース終了日－世紀     PIC  X(1).
000600     05  ()リース終了日－年月日   PIC  X(6).
000610    03  ()リース期間             PIC S9(3)  SIGN LEADING SEPARATE.
000620    03  ()第１回リース料入金日.
000630     05  ()第１回リース料入金日－世紀 PIC  X(1).
000640     05  ()第１回リース料入金日－年月日 PIC  X(6).
000650    03  ()残価回収日.
000660     05  ()残価回収日－世紀       PIC  X(1).
000670     05  ()残価回収日－年月日     PIC  X(6).
000680    03  ()解約日.
000690     05  ()解約日－世紀           PIC  X(1).
000700     05  ()解約日－年月日         PIC  X(6).
000710    03  ()残価保証区分           PIC  X(1).
000720    03  ()据置期間               PIC S9(3)  SIGN LEADING SEPARATE.
000730    03  ()ＢＥＧＩＮ回数         PIC S9(1)  SIGN LEADING SEPARATE.
000740    03  ()計算方式               PIC  X(1).
000750    03  ()前受リース料入金日.
000760     05  ()前受リース料入金日－世紀 PIC  X(1).
000770     05  ()前受リース料入金日－年月日 PIC  X(6).
000780    03  ()前受リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000790    03  ()前受充当開始日.
000800     05  ()前受充当開始日－世紀   PIC  X(1).
000810     05  ()前受充当開始日－年月   PIC  X(4).
000820    03  ()前受充当終了日.
000830     05  ()前受充当終了日－世紀   PIC  X(1).
000840     05  ()前受充当終了日－年月   PIC  X(4).
000850    03  ()前受充当月数           PIC S9(3)  SIGN LEADING SEPARATE.
000860    03  ()一部充当額             PIC S9(13)  SIGN LEADING SEPARATE.
000870    03  ()前受金利息額           PIC S9(13)  SIGN LEADING SEPARATE.
000880    03  ()月次リース料           PIC S9(13)  SIGN LEADING SEPARATE.
000890    03  ()契約金額               PIC S9(13)  SIGN LEADING SEPARATE.
000900    03  ()購入金額合計           PIC S9(13)  SIGN LEADING SEPARATE.
000910    03  ()利息合計               PIC S9(13)  SIGN LEADING SEPARATE.
000920    03  ()月額固定資産税         PIC S9(13)  SIGN LEADING SEPARATE.
000930    03  ()月額保険料             PIC S9(13)  SIGN LEADING SEPARATE.
000940    03  ()月額保守料             PIC S9(13)  SIGN LEADING SEPARATE.
000950    03  ()月額その他１           PIC S9(13)  SIGN LEADING SEPARATE.
000960    03  ()月額その他２           PIC S9(13)  SIGN LEADING SEPARATE.
000970    03  ()諸費用合計             PIC S9(13)  SIGN LEADING SEPARATE.
000980    03  ()残価額合計             PIC S9(13)  SIGN LEADING SEPARATE.
000990    03  ()基本利回り             PIC S9(2)V9(8)  
000995                                             SIGN LEADING SEPARATE.
001000    03  ()実質利回り             PIC S9(2)V9(8)
001005                                             SIGN LEADING SEPARATE.
001010    03  ()粗利                   PIC S9(13)  SIGN LEADING SEPARATE.
001020    03  ()基準金利               PIC S9(2)V9(7)
001025                                             SIGN LEADING SEPARATE.
001030    03  ()担当者コード           PIC  X(4).
001040    03  ()支払回数               PIC S9(3)  SIGN LEADING SEPARATE.
001050    03  ()請求書発行済回数       PIC S9(3)  SIGN LEADING SEPARATE.
001060    03  ()ファイナンス期間       PIC S9(3)  SIGN LEADING SEPARATE.
001070    03  ()ファイナンス開始日.
001080     05  ()ファイナンス開始日－世紀 PIC  X(1).
001090     05  ()ファイナンス開始日－年月 PIC  X(4).
001100    03  ()ファイナンス終了日.
001110     05  ()ファイナンス終了日－世紀 PIC  X(1).
001120     05  ()ファイナンス終了日－年月 PIC  X(4).
001130    03  ()契約日.
001140     05  ()契約日－世紀           PIC  X(1).
001150     05  ()契約日－年月日         PIC  X(6).
001160    03  ()一部解約日.
001170     05  ()一部解約日－世紀       PIC  X(1).
001180     05  ()一部解約日－年月日     PIC  X(6).
001190    03  ()請求区分.
001200     05  ()当月                   PIC  X(1).
001210     05  ()翌月                   PIC  X(1).
001220     05  ()翌々月                 PIC  X(1).
001230    03  ()担保区分               PIC  X(1).
001240    03  ()担保銀行コード         PIC  X(7).
001250    03  ()担保差入日.
001260     05  ()担保差入日－世紀       PIC  X(1).
001270     05  ()担保差入日－年月日     PIC  X(6).
001280    03  ()担保処理月度.
001290     05  ()担保処理月度－世紀     PIC  X(1).
001300     05  ()担保処理月度－年月     PIC  X(4).
001310    03  ()協調コード             PIC  X(2).
001320    03  ()斡旋リース判定区分     PIC  X(1).
001330    03  ()消費税徴収区分         PIC  X(1).
001340    03  ()消費税－税率           PIC S9(2)V9(1)
001345                                             SIGN LEADING SEPARATE.
001350    03  ()仕入消費税             PIC S9(13)  SIGN LEADING SEPARATE.
001360    03  ()単年度契約             PIC  X(2).
001370    03  ()消費税コード           PIC  X(2).
001380    03  ()転リース提携先コード   PIC  X(2).
001390    03  ()処理日.
001400     05  ()処理日－世紀           PIC  X(1).
001410     05  ()処理日－年月           PIC  X(4).
001420    03  ()検収集計表対象外区分   PIC  X(1).
001430    03  ()初回請求情報.
001440     05  ()初回請求情報－初回年月.
001450      07  ()初回年月－世紀         PIC  X(1).
001460      07  ()初回年月－年月         PIC  X(4).
001470     05  ()初回請求情報－支払回数番号 PIC S9(4)
001475                                             SIGN LEADING SEPARATE.
001480     05  ()初回請求情報－実リース料 PIC S9(13)
001485                                             SIGN LEADING SEPARATE.
001490     05  ()初回請求情報－ネットリース料 PIC S9(13)
001495                                             SIGN LEADING SEPARATE.
001500     05  ()初回請求情報－諸費用   PIC S9(13) SIGN LEADING SEPARATE.
001510     05  ()初回請求情報－利息     PIC S9(13) SIGN LEADING SEPARATE.
001520     05  ()初回請求情報－元本     PIC S9(13) SIGN LEADING SEPARATE.
001530     05  ()初回請求情報－元本内入 PIC S9(13) SIGN LEADING SEPARATE.
001540     05  ()初回請求情報－元本残高 PIC S9(13) SIGN LEADING SEPARATE.
001550     05  ()初回請求情報－債権残高 PIC S9(13) SIGN LEADING SEPARATE.
001560     05  ()初回請求情報－消費税額 PIC S9(11) SIGN LEADING SEPARATE.
001570     05  ()初回請求情報－消費税回収方式コード PIC  X(1).
001580     05  ()初回請求情報－消費税率 PIC S9(2)V9(1)
001585                                             SIGN LEADING SEPARATE.
001590     05  ()ダミー                 PIC  X(7).
001600     05  ()初回請求情報－回収方式コード PIC  X(1).
001610     05  ()初回請求情報－回収済コード PIC  X(1).
001620     05  ()初回請求情報－前受充当表示 PIC  X(1).
001630     05  ()初回請求情報－残価充当表示 PIC  X(1).
001640    03  ()ユーザリファレンスＮＯ PIC  X(12).
001650    03  ()当月翌月区分           PIC  X(1).
001660    03  ()オペレーティング判定フラグ PIC  X(1).
001670    03  ()最新入力消費税率       PIC S9(2)V9(1)
001675                                             SIGN LEADING SEPARATE.
001680    03  ()前受リース料残高       PIC S9(13)  SIGN LEADING SEPARATE.
001690    03  ()否認区分               PIC  X(1).
001700    03  ()充当相殺区分           PIC  X(1).
001710    03  FILLER           PIC  X(75).
001720    03  ()貸付種類               PIC  X(1).
001730    03  ()展開部                            OCCURS 5.
001740     05  ()世紀                   PIC  X(1).
001750     05  ()年月                   PIC S9(4).
001760     05  ()支払回数番号           PIC S9(4)  SIGN LEADING SEPARATE.
001770     05  ()実リース料             PIC S9(13) SIGN LEADING SEPARATE.
001780     05  ()ネットリース料         PIC S9(13) SIGN LEADING SEPARATE.
001790     05  ()諸費用                 PIC S9(13) SIGN LEADING SEPARATE.
001800     05  ()利息                   PIC S9(13) SIGN LEADING SEPARATE.
001810     05  ()元本                   PIC S9(13) SIGN LEADING SEPARATE.
001820     05  ()元本内入               PIC S9(13) SIGN LEADING SEPARATE.
001830     05  ()元本残高               PIC S9(13) SIGN LEADING SEPARATE.
001840     05  ()債権残高               PIC S9(13) SIGN LEADING SEPARATE.
001850     05  ()消費税額               PIC S9(11) SIGN LEADING SEPARATE.
001860     05  ()消費税回収方式コード   PIC S9(1).
001870     05  ()消費税率               PIC S9(2)V9(1)
001875                                             SIGN LEADING SEPARATE.
001880     05  FILLER           PIC  X(7).
001890     05  ()回収方式コード         PIC  X(1).
001900     05  ()回収済コード           PIC  X(1).
001910     05  ()前受充当表示           PIC  X(1).
001920     05  ()残価充当表示           PIC  X(1).
