000010************************************************
000020* 保険事故取引Ｆ（保険事故取引)(CPBIS108)
000030************************************************
000040    03  ()制御データ項目         PIC  X(1).
000050    03  ()制御情報.
000060     05  ()取引コード             PIC S9(1).
000070     05  ()事業所コード           PIC  X(4).
000080     05  ()ワークステーション名   PIC  X(8).
000090     05  ()システム日付.
000100      07  ()システム日付－世紀     PIC S9(1).
000110      07  ()システム日付－年月日   PIC  X(6).
000120     05  ()システム時刻           PIC S9(8).
000130     05  ()担当者コード           PIC  X(4).
000140     05  ()パスワード             PIC  X(5).
000150     05  ()処理区分               PIC S9(1).
000160     05  ()業務日付               PIC  X(7).
000170     05  FILLER           PIC  X(10).
000180    03  ()物件情報.
000190     05  ()契約ＮＯ               PIC  X(9).
000200     05  ()物件枝番               PIC S9(3).
000210     05  ()再リースコード         PIC S9(1).
000220     05  ()物件名                 PIC  X(30).
000230     05  ()リース開始日.
000240      07  ()リース開始日－世紀     PIC S9(1).
000250      07  ()リース開始日－年月日   PIC  X(6).
000260     05  ()リース終了日.
000270      07  ()リース終了日－世紀     PIC S9(1).
000280      07  ()リース終了日－年月日   PIC  X(6).
000290     05  ()期間                   PIC S9(3).
000300     05  ()購入金額               PIC S9(13)  SIGN LEADING SEPARATE.
000310     05  ()ユーザーコード         PIC  X(8).
000320     05  ()ユーザーリファレンス   PIC  X(12).
000330     05  ()設置場所               PIC  X(20).
000340     05  ()転リース提携先コード   PIC  X(2).
000350     05  ()継続リース償却対象額   PIC S9(13)  SIGN LEADING SEPARATE.
000360     05  ()勘定処理コード         PIC  X(2).
000370     05  ()管理ＮＯ               PIC  X(15).
000380    03  ()付保情報.
000390     05  ()動総保険コード.
000400      07  ()保険会社コード         PIC  X(1).
000410      07  ()保険料種別             PIC  X(3).
000420     05  ()責任期間自.
000430      07  ()責任期間自－世紀       PIC S9(1).
000440      07  ()責任期間自－年月日     PIC  X(6).
000450     05  ()責任期間至.
000460      07  ()責任期間至－世紀       PIC S9(1).
000470      07  ()責任期間至－年月日     PIC  X(6).
000480     05  ()保険証券番号           PIC  X(11).
000490     05  ()動総保険価額           PIC S9(13)  SIGN LEADING SEPARATE.
000500     05  ()再リース付保率         PIC S9(2).
000510     05  FILLER           PIC  X(10).
000520    03  ()被災情報.
000530     05  ()事故請求登録日.
000540      07  ()事故請求登録日－世紀   PIC S9(1).
000550      07  ()事故請求登録日－年月日 PIC  X(6).
000560     05  ()事故日付.
000570      07  ()事故日付－世紀         PIC S9(1).
000580      07  ()事故日付－年月日       PIC  X(6).
000590      07  ()事故日付－時刻         PIC  X(4).
000600     05  ()事故区分               PIC  X(1).
000610     05  ()事故原因               PIC  X(1).
000620     05  ()被災物件金額           PIC S9(13)  SIGN LEADING SEPARATE.
000630     05  ()被災物件残価額         PIC S9(13)  SIGN LEADING SEPARATE.
000640     05  FILLER           PIC  X(10).
000650    03  ()保険請求情報.
000660     05  ()請求年月日.
000670      07  ()請求年月日－世紀       PIC S9(1).
000680      07  ()請求年月日－年月日     PIC  X(6).
000690     05  ()請求ＲＥＦＮＯ         PIC  X(8).
000700     05  ()請求保険金             PIC S9(13)  SIGN LEADING SEPARATE.
000710     05  ()臨時費用保険金         PIC S9(13)  SIGN LEADING SEPARATE.
000720     05  ()保険金請求額           PIC S9(13)  SIGN LEADING SEPARATE.
000730     05  FILLER           PIC  X(13).
000740    03  ()保険金入送金情報.
000750     05  ()入送金登録日.
000760      07  ()入送金登録日－世紀     PIC S9(1).
000770      07  ()入送金登録日－年月日   PIC  X(6).
000780     05  ()入金日.
000790      07  ()入金日－世紀           PIC S9(1).
000800      07  ()入金日－年月日         PIC  X(6).
000810     05  ()入金額                 PIC S9(13)  SIGN LEADING SEPARATE.
000820     05  ()保険金処理区分         PIC  X(1).
000830     05  ()送金                              OCCURS 3.
000840      07  ()送金先コード           PIC S9(2).
000850      07  ()送金先名               PIC  X(40).
000860      07  ()送金額                 PIC S9(13)  SIGN LEADING SEPARATE.
000870    03  FILLER           PIC  X(11).
