000010************************************************
000020* ŽèŒ`ŠÇ—iŽèŒ`Šî–{j(CPBIS061)
000030************************************************
000040    03  ()Œ_–ñ‚m‚n               PIC  X(9).
000050    03  ()Œ_–ñ‚m‚nî•ñ.
000060     05  ()Œ_–ñ‚m‚n‚P             PIC  X(9).
000070     05  ()Œ_–ñ‚m‚n‚Q             PIC  X(9).
000080     05  ()Œ_–ñ‚m‚n‚R             PIC  X(9).
000090     05  ()Œ_–ñ‚m‚n‚S             PIC  X(9).
000100     05  ()Œ_–ñ‚m‚n‚T             PIC  X(9).
000110     05  ()Œ_–ñ‚m‚n‚U             PIC  X(9).
000120     05  ()Œ_–ñ‚m‚n‚V             PIC  X(9).
000130     05  ()Œ_–ñ‚m‚n‚W             PIC  X(9).
000140     05  ()Œ_–ñ‚m‚n‚X             PIC  X(9).
000150     05  ()Œ_–ñ‚m‚n‚P‚O           PIC  X(9).
000160    03  ()ŽæˆøæƒR[ƒh           PIC  X(8).
000170    03  ()–¼ÌŠ¿Žš               PIC  X(40).
000180    03  ()–¼ÌƒJƒi               PIC  X(40).
000190    03  ()Ž–‹ÆŠƒR[ƒh           PIC  X(4).
000200    03  ()Œ_–ñŠz                 PIC S9(13)  SIGN LEADING SEPARATE.
000210    03  ()‘‡Œv‹àŠz             PIC S9(13)  SIGN LEADING SEPARATE.
000220    03  FILLER           PIC  X(60).
000230    03  ()‹¤’Êî•ñ               PIC  X(35).
