000010************************************************
000020* (CPM_CLTMST)
000030************************************************
000040 01  ()CLTCOD           PIC  X(7).
000050 01  ()CLTNAM           PIC  N(20).
000060 01  ()BNKCOD           PIC  X(4).
000070 01  ()BRCCOD           PIC  X(3).
000080 01  ()DEPKND           PIC  X(1).
000090 01  ()DEPNUM           PIC  X(7).
000100 01  ()DEPNAM           PIC  N(20).
