000010*****                            *  セイレキ <--> ワレキ ヘンカン  LD-AREA  *
000020*
000030 01  WS020-AREA.
000040     03  WS020-M.
000050         05  WS020-M-SEIREKI.
000060*             07  WS020-M-SC                  PIC  9(01).
000070             07  WS020-M-SY                  PIC  9(04).
000080             07  WS020-M-SM                  PIC  9(02).
000090         05  WS020-M-WAREKI.
000100             07  WS020-M-WG                  PIC  X(01).
000110             07  WS020-M-WY                  PIC  9(02).
000120             07  WS020-M-WM                  PIC  9(02).
000130*
000140     03  WS020-P.
000150         05  WS020-P-GENGO                   PIC  N(02).
000160         05  WS020-P-RTNCD                   PIC  X(02).
000170
