000010************************************************
000020* (DFS_ERRLST)
000030************************************************
000040 01  ()DATTYP           PIC  X(1).
000050 01  ()BNKCOD           PIC  X(4).
000060 01  ()BNKNAM           PIC  X(15).
000070 01  ()BRCCOD           PIC  X(3).
000080 01  ()BRCNAM           PIC  X(15).
000090 01  ()PAYDAY           PIC  X(4).
000100 01  ()DEPKND           PIC  X(1).
000110 01  ()DEPNUM           PIC  X(7).
000120 01  ()CSTNAM           PIC  X(30).
000130 01  ()TRNAMT           PIC S9(10) COMP-3.
000140 01  ()TRNTYP           PIC  X(1).
000150 01  ()PAYNUM           PIC  X(8).
000160 01  ()CSTNUM           PIC  X(12).
000170 01  ()RESULT           PIC  X(1).
000180 01  ()CONTAX           PIC S9(8) COMP-3.
000190 01  ()REGDAY           PIC  X(8).
000200 01  ()REGTIM           PIC  X(6).
000210 01  ()REGPSN           PIC  X(4).
000220 01  ()MODDAY           PIC  X(8).
000230 01  ()MODTIM           PIC  X(6).
000240 01  ()MODPSN           PIC  X(4).
000250 01  ()ERRFLG           PIC  X(5).
000260 01  ()DBLFLG           PIC  X(1).
