000010************************************************
000020* (DFS_CNVMOD)
000030************************************************
000040 01  ()JOBTYP           PIC  X(4).
000050 01  ()REGTIM           PIC  X(6).
000060 01  ()PAYNUM           PIC  X(8).
000070 01  ()CSTNAM           PIC  X(30).
000080 01  ()CSTNAM_O       PIC  X(30).
000090 01  ()CSTNAM_M       PIC  X(1).
