000010************************************************
000020* (EMC_WK_HOMEN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件名                 PIC  X(30).
000060 01  ()保守料                 PIC S9(13) COMP-3.
000070 01  ()消費税                 PIC S9(13) COMP-3.
000080 01  ()税率                   PIC S9(2)V9(1) COMP-3.
000090 01  ()区分                   PIC  X(1).
000100 01  ()チェック１             PIC  X(1).
000110 01  ()チェック２             PIC  X(1).
000120 01  ()チェック３             PIC  X(1).
000130 01  ()チェック４             PIC  X(1).
