000010************************************************
000020* (EMC_MEISAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()明細ＮＯ               PIC  X(4).
000060 01  ()請求コード             PIC  X(2).
000070 01  ()物件名                 PIC  X(30).
000080 01  ()数量                   PIC S9(4) COMP-3.
000090 01  ()購入金額               PIC S9(13) COMP-3.
000100 01  ()残価                   PIC S9(13) COMP-3.
000110 01  ()個別リース料           PIC S9(13) COMP-3.
000120 01  ()設置場所名             PIC  X(20).
000130 01  ()ユーザーリファレンス１ PIC  X(10).
000140 01  ()ユーザーリファレンス２ PIC  X(10).
000150 01  ()ユーザーリファレンス３ PIC  X(10).
000160 01  ()ユーザーリファレンス４ PIC  X(10).
