000010************************************************
000020* (EMC_WK_JUMEN)
000030************************************************
000040 01  ()ユーザーコード         PIC  X(8).
000050 01  ()郵便番号               PIC  X(7).
000060 01  ()住所１                 PIC  N(20).
000070 01  ()住所２                 PIC  N(10).
000080 01  ()取引先名               PIC  N(20).
000090 01  ()部署名                 PIC  N(20).
000100 01  ()区分                   PIC  X(1).
000110 01  ()チェック１             PIC  X(1).
000120 01  ()チェック２             PIC  X(1).
000130 01  ()チェック３             PIC  X(1).
000140 01  ()チェック４             PIC  X(1).
000150 01  ()チェック５             PIC  X(1).
