000010************************************************
000020* (EXP_SIMBUD)
000030************************************************
000040 01  ()DIVCOD           PIC  X(4).
000050 01  ()FISYER           PIC  X(4).
000060 01  ()ACCCOD           PIC  X(5).
000070 01  ()BUDAMT           PIC S9(13) COMP-3.
000080 01  ()BUDBAL           PIC S9(13) COMP-3.
