000010************************************************
000020* (EXP_SIMCLT)
000030************************************************
000040 01  ()CLTCOD           PIC  X(8).
000050 01  ()FRMNAM           PIC  N(25).
