000010************************************************
000020* (EXP_SIMPRT)
000030************************************************
000040 01  ()TRNNUM           PIC  X(4).
000050 01  ()EXTNUM           PIC  X(2).
000060 01  ()DIVCOD           PIC  X(4).
000070 01  ()CNTNUM           PIC  X(7).
000080 01  ()PAYDAY           PIC  X(8).
000090 01  ()PAYBGN           PIC  X(6).
000100 01  ()PAYEND           PIC  X(6).
000110 01  ()FISYER           PIC  X(4).
000120 01  ()ACCCOD           PIC  X(5).
000130 01  ()ACCEXT           PIC  X(2).
000140 01  ()PAYTYP           PIC  X(1).
000150 01  ()PAYCYC           PIC  X(2).
000160 01  ()CLTCOD           PIC  X(8).
000170 01  ()FRMNAM           PIC  N(25).
000180 01  ()ITMNAM           PIC  N(25).
000190 01  ()PRTTYP           PIC  X(1).
000200 01  ()ITMCNT           PIC S9(3) COMP-3.
000210 01  ()PAYCNT           PIC S9(3) COMP-3.
000220 01  ()UNTPRC           PIC S9(13) COMP-3.
000230 01  ()PAYAMT           PIC S9(13) COMP-3.
000240 01  ()PAYFIS           PIC S9(13) COMP-3.
000250 01  ()ACTAMT           PIC S9(13) COMP-3.
000260 01  ()PLNAMT           PIC S9(13) COMP-3.
000270 01  ()TOTAMT           PIC S9(13) COMP-3.
000280 01  ()BUDAMT           PIC S9(13) COMP-3.
000290 01  ()PAY_04           PIC S9(13) COMP-3.
000300 01  ()PAY_05           PIC S9(13) COMP-3.
000310 01  ()PAY_06           PIC S9(13) COMP-3.
000320 01  ()PAY_07           PIC S9(13) COMP-3.
000330 01  ()PAY_08           PIC S9(13) COMP-3.
000340 01  ()PAY_09           PIC S9(13) COMP-3.
000350 01  ()PAY_10           PIC S9(13) COMP-3.
000360 01  ()PAY_11           PIC S9(13) COMP-3.
000370 01  ()PAY_12           PIC S9(13) COMP-3.
000380 01  ()PAY_01           PIC S9(13) COMP-3.
000390 01  ()PAY_02           PIC S9(13) COMP-3.
000400 01  ()PAY_03           PIC S9(13) COMP-3.
