000010************************************************
000020* (EXP_SIMTRN)
000030************************************************
000040 01  ()TRNNUM           PIC  X(4).
000050 01  ()EXTNUM           PIC  X(2).
000060 01  ()RECNUM           PIC  X(4).
000070 01  ()DIVCOD           PIC  X(4).
000080 01  ()ACCCOD           PIC  X(5).
000090 01  ()CLTCOD           PIC  X(8).
000100 01  ()PLNDAY           PIC  X(8).
000110 01  ()TRNDAY           PIC  X(8).
000120 01  ()RCVFLG           PIC  X(1).
000130 01  ()PAYFLG           PIC  X(1).
000140 01  ()UPDFLG           PIC  X(1).
000150 01  ()PAYAMT           PIC S9(13) COMP-3.
000160 01  ()CONTAX           PIC S9(13) COMP-3.
000170 01  ()TOTAMT           PIC S9(13) COMP-3.
