000010************************************************
000020* (FCT_HOSHO)
000030************************************************
000040 01  ()契約番号               PIC  X(7).
000050 01  ()契約番号枝番           PIC  X(2).
000060 01  ()実行日                 PIC  X(8).
000070 01  ()手形振出日             PIC  X(8).
000080 01  ()手形期日               PIC  X(8).
000090 01  ()手形決済日             PIC  X(8).
000100 01  ()手形決済確認日         PIC  X(8).
000110 01  ()手形額面金額           PIC S9(13) COMP-3.
000120 01  ()手形保証金額           PIC S9(13) COMP-3.
000130 01  ()手形保証日数           PIC S9(4) COMP-3.
000140 01  ()保証料率               PIC S9(2)V9(8) COMP-3.
000150 01  ()保証料                 PIC S9(13) COMP-3.
000160 01  ()手形保証期間初め       PIC  X(8).
000170 01  ()手形保証期間終わり     PIC  X(8).
000180 01  ()保証料支払日           PIC  X(8).
000190 01  ()保証料回収方式         PIC  X(1).
000200 01  ()銀行短縮コード         PIC  X(2).
000210 01  ()銀行コード             PIC  X(7).
000220 01  ()口座名称               PIC  N(30).
000230 01  ()口座番号               PIC  X(7).
000240 01  ()銀行名                 PIC  X(60).
000250 01  ()確認先                 PIC  N(10).
000260 01  ()確認内容               PIC  N(40).
000270 01  ()原債務者コード         PIC  X(8).
000280 01  ()手形NO               PIC  X(10).
000290 01  ()手形種類               PIC  X(1).
000300 01  ()裏書方法               PIC  X(1).
000310 01  ()支払人名               PIC  N(30).
000320 01  ()支払場所               PIC  N(30).
000330 01  ()取引銀行コード         PIC  X(7).
000340 01  ()原債務者情報１         PIC  N(20).
000350 01  ()原債務者情報２         PIC  N(20).
000360 01  ()原債務者情報３         PIC  N(20).
000370 01  ()登録日                 PIC  X(8).
000380 01  ()登録時刻               PIC  X(6).
000390 01  ()登録担当者コード       PIC  X(4).
000400 01  ()更新日                 PIC  X(8).
000410 01  ()更新時刻               PIC  X(6).
000420 01  ()更新担当者コード       PIC  X(4).
