000010************************************************
000020* (FCT_V_URIKAKE_510_1_COPY)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(7).
000050 01  ()‘ã—‰ñŽû‹æ•ª           PIC  X(1).
