000010************************************************
000020* (IBS_PASSCODE)
000030************************************************
000040 01  ()暗証コード             PIC  X(10).
000050 01  ()有効フラグ             PIC  X(1).
000060 01  ()登録日                 PIC  X(8).
000070 01  ()登録時刻               PIC  X(6).
000080 01  ()登録担当者コード       PIC  X(4).
000090 01  ()更新日                 PIC  X(8).
000100 01  ()更新時刻               PIC  X(6).
000110 01  ()更新担当者コード       PIC  X(4).
