000010************************************************
000020* (IBS_TRANS_GUARANTEE)
000030************************************************
000040 01  ()案件№                 PIC  X(12).
000050 01  ()被保証先コード         PIC  X(8).
000060 01  ()負担割合分子           PIC S9(14)V9(2) COMP-3.
000070 01  ()負担割合分母           PIC S9(14)V9(2) COMP-3.
