000010************************************************
000020* (JOM_FORM_0001)
000030************************************************
000040 01  ()JOBCOD           PIC S9(2) COMP-3.
000050 01  ()SHTNUM           PIC S9(2) COMP-3.
000060 01  ()契約日                 PIC  X(8).
000070 01  ()契約番号               PIC  X(9).
000080 01  ()最終枝番               PIC  X(2).
000090 01  ()第１回入金日           PIC  X(8).
000100 01  ()入金基準日             PIC  X(4).
000110 01  ()初回リース料           PIC S9(13) COMP-3.
000120 01  ()初回消費税額           PIC S9(13) COMP-3.
000130 01  ()リース料               PIC S9(13) COMP-3.
000140 01  ()前受月数               PIC S9(2) COMP-3.
000150 01  ()前受リース料           PIC S9(13) COMP-3.
000160 01  ()月額消費税額           PIC S9(13) COMP-3.
000170 01  ()契約金額               PIC S9(13) COMP-3.
000180 01  ()端末番号               PIC  N(8).
