000010************************************************
000020* (JOM_SJYOKEN_MST)
000030************************************************
000040 01  ()ジョモ支払条件コード   PIC  X(2).
000050 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000060 01  ()支払条件文言           PIC  N(20).
