000010************************************************
000020* (JOM_FORM_0019)
000030************************************************
000040 01  ()JOBCOD           PIC S9(2) COMP-3.
000050 01  ()契約番号               PIC  X(9).
000060 01  ()契約日                 PIC  X(8).
000070 01  ()検収日                 PIC  X(8).
000080 01  ()リース期間             PIC S9(3) COMP-3.
000090 01  ()充当回                 PIC S9(3) COMP-3.
000100 01  ()総支払回数             PIC S9(3) COMP-3.
000110 01  ()第１回入金日           PIC  X(8).
000120 01  ()入金日                 PIC  X(4).
000130 01  ()当月リース料           PIC S9(13) COMP-3.
000140 01  ()当月債権残高           PIC S9(13) COMP-3.
000150 01  ()税率                   PIC S9(2)V9(1) COMP-3.
000160 01  ()ジョモ商品コード       PIC  X(4).
000170 01  ()物件名                 PIC  N(15).
000180 01  ()設置場所名             PIC  N(10).
