000010************************************************
000020* (JOM_MEISAI)
000030************************************************
000040 01  ()ジョモ支店コード       PIC  X(2).
000050 01  ()ジョモ契約番号         PIC  X(9).
000060 01  ()ジョモ物件ＮＯ         PIC  X(3).
000070 01  ()契約番号               PIC  X(9).
000080 01  ()物件ＮＯ               PIC  X(3).
000090 01  ()ジョモ商品コード       PIC  X(4).
000100 01  ()物件名＿漢字           PIC  N(20).
000110 01  ()物件名                 PIC  N(10).
000120 01  ()機種名                 PIC  N(10).
000130 01  ()数量                   PIC S9(4) COMP-3.
000140 01  ()購入金額               PIC S9(13) COMP-3.
000150 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000160 01  ()個別リース料           PIC S9(13) COMP-3.
000170 01  ()動総保険コード         PIC  X(4).
000180 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000190 01  ()資産コード             PIC  X(7).
000200 01  ()耐用年数               PIC  X(2).
000210 01  ()信用保険コード         PIC  X(6).
000220 01  ()税区分                 PIC  X(1).
000230 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000240 01  ()設置場所郵便番号       PIC  X(7).
000250 01  ()設置場所住所           PIC  N(50).
000260 01  ()設置場所名＿漢字       PIC  N(20).
000270 01  ()設置場所名＿カナ       PIC  N(10).
000280 01  ()納付先コード           PIC  X(6).
000290 01  ()登録日                 PIC  X(8).
000300 01  ()登録時刻               PIC  X(6).
000310 01  ()登録担当者コード       PIC  X(4).
000320 01  ()更新日                 PIC  X(8).
000330 01  ()更新時刻               PIC  X(6).
000340 01  ()更新担当者コード       PIC  X(4).
