000010************************************************
000020* (JOM_FORM_0002)
000030************************************************
000040 01  ()SHTNUM           PIC S9(2) COMP-3.
000050 01  ()ジョモ支払条件コード   PIC  X(2).
000060 01  ()支払条件文言           PIC  N(20).
000070 01  ()事業所名_１           PIC  N(10).
000080 01  ()契約日                 PIC  X(8).
000090 01  ()検収日                 PIC  X(8).
000100 01  ()設置場所名＿漢字       PIC  N(20).
000110 01  ()ジョモ契約番号         PIC  X(9).
000120 01  ()契約番号               PIC  X(7).
000130 01  ()開始枝番               PIC  X(2).
000140 01  ()最終枝番               PIC  X(2).
000150 01  ()受取手数料             PIC S9(13) COMP-3.
