000010************************************************
000020* (JOM_FORM_0013)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()ÅIŽ}”Ô               PIC  X(2).
000060 01  ()Œ_–ñŒ”               PIC S9(3) COMP-3.
000070 01  ()w“ü‹àŠz‡Œv           PIC S9(13) COMP-3.
000080 01  ()Žd“üÁ”ïÅ“™Šz‡Œv     PIC S9(13) COMP-3.
000090 01  ()Œ_–ñ‹àŠz               PIC S9(13) COMP-3.
000100 01  ()‘OŽóƒŠ[ƒX—¿           PIC S9(13) COMP-3.
000110 01  ()‘OŽóƒŠ[ƒX—¿Á”ïÅ     PIC S9(13) COMP-3.
000120 01  ()ƒŠ[ƒX—¿               PIC S9(13) COMP-3.
000130 01  ()ƒŠ[ƒX—¿Á”ïÅ         PIC S9(13) COMP-3.
000140 01  ()Žx•¥ðŒ‚P             PIC  X(2).
000150 01  ()Žx•¥ðŒ‚Q             PIC  X(2).
000160 01  ()Žx•¥ðŒ‚R             PIC  X(2).
000170 01  ()Žx•¥ðŒ‚S             PIC  X(2).
000180 01  ()Žx•¥ðŒ‚T             PIC  X(2).
000190 01  ()Žx•¥ðŒ•¶Œ¾‚P         PIC  N(20).
000200 01  ()Žx•¥ðŒ•¶Œ¾‚Q         PIC  N(20).
000210 01  ()Žx•¥ðŒ•¶Œ¾‚R         PIC  N(20).
000220 01  ()Žx•¥ðŒ•¶Œ¾‚S         PIC  N(20).
000230 01  ()Žx•¥ðŒ•¶Œ¾‚T         PIC  N(20).
000240 01  ()Žx•¥‹àŠz‚P             PIC S9(13) COMP-3.
000250 01  ()Žx•¥‹àŠz‚Q             PIC S9(13) COMP-3.
000260 01  ()Žx•¥‹àŠz‚R             PIC S9(13) COMP-3.
000270 01  ()Žx•¥‹àŠz‚S             PIC S9(13) COMP-3.
000280 01  ()Žx•¥‹àŠz‚T             PIC S9(13) COMP-3.
000290 01  ()Á”ïÅ‚P               PIC S9(13) COMP-3.
000300 01  ()Á”ïÅ‚Q               PIC S9(13) COMP-3.
000310 01  ()Á”ïÅ‚R               PIC S9(13) COMP-3.
000320 01  ()Á”ïÅ‚S               PIC S9(13) COMP-3.
000330 01  ()Á”ïÅ‚T               PIC S9(13) COMP-3.
