000010************************************************
000020* (JYO_PRTINP)
000030************************************************
000040 01  ()基準日                 PIC  X(8).
000050 01  ()資産番号               PIC  X(9).
000060 01  ()資産種類               PIC  X(1).
000070 01  ()資産コード             PIC  X(6).
000080 01  ()資産名                 PIC  N(20).
000090 01  ()事業所コード           PIC  X(4).
000100 01  ()事業所名               PIC  N(10).
000110 01  ()償却方法               PIC  X(6).
000120 01  ()増加理由               PIC  X(6).
000130 01  ()減少理由               PIC  X(6).
000140 01  ()事業供用日             PIC  X(8).
000150 01  ()取得年月               PIC  X(6).
000160 01  ()増加日                 PIC  X(8).
000170 01  ()減少日                 PIC  X(8).
000180 01  ()納付先                 PIC  X(6).
000190 01  ()耐用年数               PIC S9(3) COMP-3.
000200 01  ()経過月数               PIC S9(2) COMP-3.
000210 01  ()償却率                 PIC S9(2)V9(3) COMP-3.
000220 01  ()取得価額               PIC S9(13) COMP-3.
000230 01  ()償却限度               PIC S9(13) COMP-3.
000240 01  ()前期末簿価             PIC S9(13) COMP-3.
000250 01  ()当期取得額             PIC S9(13) COMP-3.
000260 01  ()当期除却額             PIC S9(13) COMP-3.
000270 01  ()当期償却額             PIC S9(13) COMP-3.
000280 01  ()当期末簿価             PIC S9(13) COMP-3.
