000010************************************************
000020* (JYO_ASTMST)
000030************************************************
000040 01  ()基準年                 PIC  X(4).
000050 01  ()資産番号               PIC  X(9).
000060 01  ()取得日                 PIC  X(8).
000070 01  ()取得年度               PIC  X(1).
000080 01  ()取得年月               PIC  X(4).
000090 01  ()資産名                 PIC  N(15).
000100 01  ()数量                   PIC S9(4) COMP-3.
000110 01  ()資産種類               PIC  X(1).
000120 01  ()資産コード             PIC  X(6).
000130 01  ()耐用年数               PIC S9(2) COMP-3.
000140 01  ()償却率                 PIC S9(2)V9(3) COMP-3.
000150 01  ()取得価額               PIC S9(13) COMP-3.
000160 01  ()納付先                 PIC  X(6).
000170 01  ()残存率                 PIC S9(2)V9(3) COMP-3.
000180 01  ()評価額                 PIC S9(13) COMP-3.
000190 01  ()帳簿価額               PIC S9(13) COMP-3.
