000010************************************************
000020* (KAI_WK_SYUKEI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件NO               PIC  X(3).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()事業所名               PIC  N(10).
000080 01  ()勘定処理コード         PIC  X(2).
000090 01  ()解約日                 PIC  X(8).
000100 01  ()解約対象区分           PIC S9(1) COMP-3.
000110 01  ()解約仕訳コード         PIC  X(3).
000120 01  ()規定損害金額           PIC S9(13) COMP-3.
000130 01  ()解約物件金額           PIC S9(13) COMP-3.
000140 01  ()取引先名カナ           PIC  N(15).
000150 01  ()当月月度               PIC  X(8).
