000010************************************************
000020* (KAI_IREI)
000030************************************************
000040 01  ()名寄せコード           PIC  X(8).
000050 01  ()取引先名漢字           PIC  N(30).
000060 01  ()承認番号               PIC  X(5).
000070 01  ()包括期限開始           PIC  X(8).
000080 01  ()包括期限終了           PIC  X(8).
000090 01  ()異例内容               PIC  N(200).
000100 01  ()事業所コード           PIC  X(4).
000110 01  ()登録日                 PIC  X(8).
000120 01  ()登録時刻               PIC  X(6).
000130 01  ()登録担当者コード       PIC  X(4).
000140 01  ()更新日                 PIC  X(8).
000150 01  ()更新時刻               PIC  X(6).
000160 01  ()更新担当者コード       PIC  X(4).
