000010************************************************
000020* (KAI_WK_BUKKEN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件番号               PIC  X(3).
000060 01  ()設置場所名             PIC  X(40).
000070 01  ()物件名                 PIC  X(40).
000080 01  ()物件処分方法           PIC  X(50).
000090 01  ()リース料               PIC S9(13) COMP-3.
000100 01  ()リース料消費税         PIC S9(13) COMP-3.
000110 01  ()前払リース料           PIC S9(13) COMP-3.
000120 01  ()前払消費税             PIC S9(13) COMP-3.
000130 01  ()物件金額               PIC S9(13) COMP-3.
000140 01  ()物件消費税             PIC S9(13) COMP-3.
000150 01  ()特約                   PIC  N(300).
000160 01  ()連番                   PIC S9(3) COMP-3.
000170 01  ()直転区分               PIC  X(1).
