000010************************************************
000020* (KAI_BUKKEN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件NO               PIC  X(3).
000060 01  ()物件名漢字             PIC  N(20).
000070 01  ()物件名カナ             PIC  N(10).
000080 01  ()仕様製造番号           PIC  N(10).
000090 01  ()数量                   PIC S9(4) COMP-3.
000100 01  ()購入金額               PIC S9(13) COMP-3.
000110 01  ()資産コード             PIC  X(7).
000120 01  ()税区分                 PIC  X(1).
000130 01  ()耐用年数               PIC S9(2) COMP-3.
000140 01  ()中古品コード           PIC  X(1).
000150 01  ()動総保険コード         PIC  X(4).
000160 01  ()残価額                 PIC S9(13) COMP-3.
000170 01  ()残価保証区分           PIC  X(1).
000180 01  ()購入先コード           PIC  X(8).
000190 01  ()納付先コード           PIC  X(6).
000200 01  ()設置場所名漢字         PIC  N(20).
000210 01  ()設置場所名カナ         PIC  N(10).
000220 01  ()設置場所住所           PIC  N(50).
000230 01  ()個別リース料           PIC S9(13) COMP-3.
000240 01  ()変更個別リース料       PIC S9(13) COMP-3.
000250 01  ()特例率分子             PIC S9(2) COMP-3.
000260 01  ()特例率分母             PIC S9(2) COMP-3.
000270 01  ()ﾕｰｻﾞｰﾘﾌｧﾚﾝｽNO1 PIC  N(6).
000280 01  ()ﾕｰｻﾞｰﾘﾌｧﾚﾝｽNO2 PIC  N(6).
000290 01  ()ﾕｰｻﾞｰﾘﾌｧﾚﾝｽNO3 PIC  N(6).
000300 01  ()ﾕｰｻﾞｰﾘﾌｧﾚﾝｽNO4 PIC  N(6).
000310 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000320 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000330 01  ()社内金利               PIC S9(2)V9(3) COMP-3.
000340 01  ()会社前期末簿価         PIC S9(13) COMP-3.
000350 01  ()理論前期末簿価         PIC S9(13) COMP-3.
000360 01  ()税負担コード           PIC  X(1).
000370 01  ()物件代金相殺区分       PIC  X(1).
000380 01  ()解約対象区分           PIC S9(1) COMP-3.
000390 01  ()解約日                 PIC  X(8).
000400 01  ()解約理由               PIC  X(1).
000410 01  ()解約物件金額           PIC S9(13) COMP-3.
000420 01  ()解約数量               PIC S9(4) COMP-3.
000430 01  ()解約リース料           PIC S9(13) COMP-3.
000440 01  ()解約固定資産税         PIC S9(13) COMP-3.
000450 01  ()解約保険料             PIC S9(13) COMP-3.
000460 01  ()解約保守料             PIC S9(13) COMP-3.
000470 01  ()解約その他１           PIC S9(13) COMP-3.
000480 01  ()解約その他２           PIC S9(13) COMP-3.
000490 01  ()解約初期費用           PIC S9(13) COMP-3.
000500 01  ()解約残価               PIC S9(13) COMP-3.
000510 01  ()解約前受リース料       PIC S9(13) COMP-3.
000520 01  ()解約債権残             PIC S9(13) COMP-3.
000530 01  ()解約分当月入金リース料 PIC S9(13) COMP-3.
000540 01  ()前受充当額             PIC S9(13) COMP-3.
000550 01  ()入金停止リース料       PIC S9(13) COMP-3.
000560 01  ()規定損害金額           PIC S9(13) COMP-3.
000570 01  ()最低損害額             PIC S9(13) COMP-3.
000580 01  ()解約規定損害金利回り   PIC S9(2)V9(8) COMP-3.
000590 01  ()解約初回リース料       PIC S9(13) COMP-3.
000600 01  ()解約終回リース料       PIC S9(13) COMP-3.
000610 01  ()規定損害金支払日       PIC S9(8) COMP-3.
000620 01  ()直転区分               PIC  X(1).
000630 01  ()規定損害金支払者       PIC  X(1).
000640 01  ()前受リース料処理       PIC  X(1).
000650 01  ()規定損害金消費税率     PIC S9(2)V9(1) COMP-3.
000660 01  ()前受預かり消費税等     PIC S9(13) COMP-3.
000670 01  ()変更後消費税率         PIC S9(2)V9(1) COMP-3.
000680 01  ()変更後前受消費税等差額 PIC S9(13) COMP-3.
000690 01  ()規定損害金消費税等     PIC S9(13) COMP-3.
000700 01  ()売却代金規損金充当金額 PIC S9(13) COMP-3.
000710 01  ()規定損害金第３者支払先名 PIC  X(30).
000720 01  ()第３者払い規定損害金   PIC S9(13) COMP-3.
000730 01  ()規定損害金回収方式     PIC  X(1).
000740 01  ()解約仕訳コード         PIC  X(3).
000750 01  ()物件確定FLG         PIC  X(1).
000760 01  ()登録日                 PIC  X(8).
000770 01  ()登録時刻               PIC  X(6).
000780 01  ()登録担当者コード       PIC  X(4).
000790 01  ()更新日                 PIC  X(8).
000800 01  ()更新時刻               PIC  X(6).
000810 01  ()更新担当者コード       PIC  X(4).
