000010************************************************
000020* (KAI_SHOBUN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件NO               PIC  X(3).
000060 01  ()資産処分区分           PIC  X(1).
000070 01  ()処分先識別番号         PIC  X(1).
000080 01  ()売却先引渡先名漢字     PIC  N(30).
000090 01  ()売却先引渡先名カナ     PIC  N(15).
000100 01  ()設置場所名             PIC  N(20).
000110 01  ()設置場所名カナ         PIC  N(10).
000120 01  ()設置場所住所           PIC  N(50).
000130 01  ()売却引渡先区分         PIC  X(1).
000140 01  ()物件名漢字             PIC  N(20).
000150 01  ()物件名カナ             PIC  N(10).
000160 01  ()仕様製造番号           PIC  N(10).
000170 01  ()数量                   PIC S9(4) COMP-3.
000180 01  ()単価                   PIC S9(13) COMP-3.
000190 01  ()売却金額               PIC S9(13) COMP-3.
000200 01  ()売却税率               PIC S9(2)V9(1) COMP-3.
000210 01  ()売却金額入金先コード   PIC  X(8).
000220 01  ()売却金額入金予定日     PIC  X(8).
000230 01  ()引取費用               PIC S9(13) COMP-3.
000240 01  ()登録日                 PIC  X(8).
000250 01  ()登録時刻               PIC  X(6).
000260 01  ()登録担当者コード       PIC  X(4).
000270 01  ()更新日                 PIC  X(8).
000280 01  ()更新時刻               PIC  X(6).
000290 01  ()更新担当者コード       PIC  X(4).
000300 01  ()支払条件               PIC  N(86).
