000010************************************************
000020* (KAI_WK_KEIYAKU)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()展開連番               PIC S9(3) COMP-3.
000060 01  ()契約先名               PIC  X(60).
000070 01  ()解約日年               PIC  X(4).
000080 01  ()解約日月               PIC  X(2).
000090 01  ()解約日日               PIC  X(2).
000100 01  ()契約金額               PIC S9(13) COMP-3.
000110 01  ()リース料               PIC S9(13) COMP-3.
000120 01  ()支払回数               PIC S9(3) COMP-3.
000130 01  ()消費税等               PIC S9(13) COMP-3.
000140 01  ()合計                   PIC S9(13) COMP-3.
