000010************************************************
000020* (KEI_BUNKATU_WORK)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()分割数                 PIC S9(3) COMP-3.
000070 01  ()数量                   PIC S9(4) COMP-3.
000080 01  ()購入金額均等割フラグ   PIC  X(1).
000090 01  ()個別リース料均等割フラグ PIC  X(1).
000100 01  ()数量均等割フラグ       PIC  X(1).
000110 01  ()分割後購入金額         PIC S9(13) COMP-3.
000120 01  ()分割後個別リース料     PIC S9(13) COMP-3.
000130 01  ()分割後数量             PIC S9(4) COMP-3.
