000010************************************************
000020* (KEI_WK_YOTEI1)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()’[––”Ô†               PIC  N(8).
000060 01  ()Žæˆøæ“s“¹•{Œ§–¼       PIC  X(22).
000070 01  ()ŽæˆøæZŠ‚P           PIC  X(40).
000080 01  ()ŽæˆøæZŠ‚Q           PIC  X(40).
000090 01  ()Žæˆøæ–¼               PIC  X(60).
000100 01  ()“Œ‹âŽ–‹ÆŠ–¼           PIC  X(20).
000110 01  ()“Œ‹âŽ–‹ÆŠZŠ         PIC  X(90).
000120 01  ()“Œ‹â’S“–ŽÒ–¼           PIC  X(20).
000130 01  ()“Œ‹âŽ–‹ÆŠ“d˜b         PIC  X(15).
