000010************************************************
000020* (KEI_LPWK_EDA_THUMON2)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()ディーラーコード       PIC  X(5).
000060 01  ()端末番号               PIC  N(8).
000070 01  ()番号                   PIC S9(3) COMP-3.
000080 01  ()事業所コード           PIC  X(4).
000090 01  ()取引先名               PIC  N(30).
000100 01  ()契約日                 PIC  X(8).
000110 01  ()検収予定日             PIC  X(8).
000120 01  ()充当_相殺区分         PIC  X(1).
000130 01  ()前渡金区分             PIC  X(1).
000140 01  ()購入先名               PIC  N(30).
000150 01  ()購入先住所             PIC  N(50).
000160 01  ()購入金額合計           PIC S9(13) COMP-3.
000170 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000180 01  ()都道府県               PIC  N(5).
000190 01  ()住所１                 PIC  N(20).
000200 01  ()住所２                 PIC  N(20).
