000010************************************************
000020* (KEI_LPWK_EDA_THUMON1)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()端末番号               PIC  N(8).
000060 01  ()ディーラーコード       PIC  X(5).
000070 01  ()番号                   PIC S9(3) COMP-3.
000080 01  ()購入先名               PIC  N(30).
000090 01  ()購入先住所             PIC  N(50).
000100 01  ()購入金額合計           PIC S9(13) COMP-3.
000110 01  ()仕入消費税等額         PIC S9(13) COMP-3.
