000010************************************************
000020* (KEI_BUKKEN_MST)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()物件コード             PIC  X(3).
000060 01  ()物件名_漢字           PIC  N(20).
000070 01  ()物件名_カナ           PIC  N(10).
000080 01  ()仕様製造番号           PIC  N(10).
000090 01  ()製造業者               PIC  N(30).
000100 01  ()動総付保区分           PIC  X(1).
000110 01  ()動総保険コード         PIC  X(4).
000120 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000130 01  ()資産コード             PIC  X(7).
000140 01  ()耐用年数               PIC S9(2) COMP-3.
000150 01  ()信用保険コード         PIC  X(6).
000160 01  ()型式番号               PIC  N(7.5).
000170 01  ()税区分                 PIC  X(1).
000180 01  ()税負担コード           PIC  X(1).
000190 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000200 01  ()指定電子計算機         PIC  N(20).
000210 01  ()使用権設定者           PIC  N(30).
000220 01  ()登録日                 PIC  X(8).
000230 01  ()登録時刻               PIC  X(6).
000240 01  ()登録担当者コード       PIC  X(4).
000250 01  ()更新日                 PIC  X(8).
000260 01  ()更新時刻               PIC  X(6).
000270 01  ()更新担当者コード       PIC  X(4).
