000010************************************************
000020* (KEI_LPWK_BACKDATE)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()取引先名               PIC  N(30).
000070 01  ()ユーザーコード         PIC  X(8).
000080 01  ()検収日                 PIC  X(8).
000090 01  ()リース期間             PIC S9(3) COMP-3.
000100 01  ()勘定処理コード         PIC  X(2).
000110 01  ()契約金額               PIC S9(13) COMP-3.
000120 01  ()購入金額合計           PIC S9(13) COMP-3.
000130 01  ()仕入消費税合計         PIC S9(13) COMP-3.
000140 01  ()前受リース料           PIC S9(13) COMP-3.
000150 01  ()充当_相殺区分         PIC  X(1).
000160 01  ()計算方式               PIC  X(1).
000170 01  ()請求サイクル           PIC S9(2) COMP-3.
000180 01  ()第１回リース料入金日   PIC  X(8).
000190 01  ()第１回リース料         PIC S9(13) COMP-3.
000200 01  ()第２回リース料入金日   PIC  X(8).
000210 01  ()第２回リース料         PIC S9(13) COMP-3.
000220 01  ()ＢＥＧＩＮ回数         PIC  X(1).
000230 01  ()粗利益                 PIC S9(13) COMP-3.
000240 01  ()処理日                 PIC  X(8).
