000010************************************************
000020* (KEI_LPWK_RINGI_KONYU)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()w“üæŽ¯•Ê‚m‚n         PIC  X(2).
000060 01  ()‚v‚j˜A”Ô               PIC S9(3) COMP-3.
000070 01  ()’[––”Ô†               PIC  N(8).
000080 01  ()w“üæƒR[ƒh           PIC  X(8).
000090 01  ()w“üæ–¼               PIC  N(30).
000100 01  ()w“üæZŠ             PIC  N(50).
000110 01  ()w“üæ’S“–ŽÒ           PIC  N(10).
000120 01  ()“d˜b”Ô†               PIC  N(7.5).
000130 01  ()w“ü‹àŠz‡Œv           PIC S9(13) COMP-3.
000140 01  ()Žd“üÁ”ïÅ“™Šz         PIC S9(13) COMP-3.
000150 01  ()Žx•¥ŒJ‰„‹àŠz1         PIC S9(13) COMP-3.
000160 01  ()Žx•¥ŒJ‰„ŒŽ”1         PIC S9(2)V9(2) COMP-3.
000170 01  ()Žx•¥ðŒ•¶Œ¾1         PIC  N(20).
000180 01  ()Žx•¥ŒJ‰„‹àŠz2         PIC S9(13) COMP-3.
000190 01  ()Žx•¥ŒJ‰„ŒŽ”2         PIC S9(2)V9(2) COMP-3.
000200 01  ()Žx•¥ðŒ•¶Œ¾2         PIC  N(20).
000210 01  ()Žx•¥ŒJ‰„‹àŠz3         PIC S9(13) COMP-3.
000220 01  ()Žx•¥ŒJ‰„ŒŽ”3         PIC S9(2)V9(2) COMP-3.
000230 01  ()Žx•¥ðŒ•¶Œ¾3         PIC  N(20).
000240 01  ()Žx•¥ŒJ‰„‹àŠz4         PIC S9(13) COMP-3.
000250 01  ()Žx•¥ŒJ‰„ŒŽ”4         PIC S9(2)V9(2) COMP-3.
000260 01  ()Žx•¥ðŒ•¶Œ¾4         PIC  N(20).
000270 01  ()Žx•¥ŒJ‰„‹àŠz5         PIC S9(13) COMP-3.
000280 01  ()Žx•¥ŒJ‰„ŒŽ”5         PIC S9(2)V9(2) COMP-3.
000290 01  ()Žx•¥ðŒ•¶Œ¾5         PIC  N(20).
000300 01  ()ŽèŒ`Žó“n•û–@‚P         PIC  X(1).
000310 01  ()ŽèŒ`Žó“n•û–@‚Q         PIC  X(1).
000320 01  ()ŽèŒ`Žó“n•û–@‚R         PIC  X(1).
000330 01  ()ŽèŒ`Žó“n•û–@‚S         PIC  X(1).
000340 01  ()ŽèŒ`Žó“n•û–@‚T         PIC  X(1).
000350 01  ()Žæˆøæ–¼               PIC  N(30).
000360 01  ()Œ_–ñ“ú                 PIC  X(8).
