000010************************************************
000020* (KEI_KAKUNIN)
000030************************************************
000040 01  ()ï®åèämîFäÓèÄ           PIC  X(1).
000050 01  ()ì‡óe                   PIC  N(10).
