000010************************************************
000020* (KEI_WK_EDA_KONYU)
000030************************************************
000040 01  ()Œ_–ñ”Ô†               PIC  X(9).
000050 01  ()ƒfƒB[ƒ‰[ƒR[ƒh       PIC  X(5).
000060 01  ()w“üæŽ¯•Ê‚m‚n         PIC  X(1).
000070 01  ()w“üæƒR[ƒh           PIC  X(8).
000080 01  ()w“üæ–¼               PIC  N(30).
000090 01  ()w“ü‹àŠz‡Œv           PIC S9(13) COMP-3.
000100 01  ()Žd“üÁ”ïÅ“™Šz         PIC S9(13) COMP-3.
000110 01  ()Žx•¥ŒJ‰„‹àŠz1         PIC S9(13) COMP-3.
000120 01  ()Žx•¥ŒJ‰„ŒŽ”1         PIC S9(2)V9(2) COMP-3.
000130 01  ()Žx•¥ðŒ•¶Œ¾1         PIC  N(20).
000140 01  ()Žx•¥ŒJ‰„‹àŠz2         PIC S9(13) COMP-3.
000150 01  ()Žx•¥ŒJ‰„ŒŽ”2         PIC S9(2)V9(2) COMP-3.
000160 01  ()Žx•¥ðŒ•¶Œ¾2         PIC  N(20).
000170 01  ()Žx•¥ŒJ‰„‹àŠz3         PIC S9(13) COMP-3.
000180 01  ()Žx•¥ŒJ‰„ŒŽ”3         PIC S9(2)V9(2) COMP-3.
000190 01  ()Žx•¥ðŒ•¶Œ¾3         PIC  N(20).
000200 01  ()Žx•¥ŒJ‰„‹àŠz4         PIC S9(13) COMP-3.
000210 01  ()Žx•¥ŒJ‰„ŒŽ”4         PIC S9(2)V9(2) COMP-3.
000220 01  ()Žx•¥ðŒ•¶Œ¾4         PIC  N(20).
000230 01  ()Žx•¥ŒJ‰„‹àŠz5         PIC S9(13) COMP-3.
000240 01  ()Žx•¥ŒJ‰„ŒŽ”5         PIC S9(2)V9(2) COMP-3.
000250 01  ()Žx•¥ðŒ•¶Œ¾5         PIC  N(20).
