000010************************************************
000020* (KEI_ANKEN_KBN)
000030************************************************
000040 01  ()案件発生区分           PIC  X(1).
000050 01  ()案件発生内容           PIC  N(10).
000060 01  ()登録日                 PIC  X(8).
000070 01  ()登録時刻               PIC  X(6).
000080 01  ()登録担当者コード       PIC  X(4).
000090 01  ()更新日                 PIC  X(8).
000100 01  ()更新時刻               PIC  X(6).
000110 01  ()更新担当者コード       PIC  X(4).
