000010************************************************
000020* (KEI_TOKUYAKU_TAIHI)
000030************************************************
000040 01  ()å_ñÒî‘çÜ               PIC  X(9).
000050 01  ()ì¡ñÒ                   PIC  N(400).
