000010************************************************
000020* (KOK_SOUKI_WKFD)
000030************************************************
000040 01  ()取引先名カナ           PIC  N(35).
000050 01  ()取引先名漢字           PIC  N(70).
000060 01  ()住所                   PIC  N(50).
000070 01  ()生年月日               PIC  X(7).
000080 01  ()代表者氏名             PIC  N(15).
