000010************************************************
000020* (KOK_WKSETTEI)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()担当者コード           PIC  X(4).
000070 01  ()取引先名漢字           PIC  N(30).
000080 01  ()取引先名カナ           PIC  N(30).
000090 01  ()請求先部署名カナ       PIC  N(30).
000100 01  ()請求先部署名           PIC  N(30).
000110 01  ()郵便番号３桁           PIC  X(3).
000120 01  ()郵便番号４桁           PIC  X(4).
000130 01  ()住所カナ               PIC  N(30).
000140 01  ()都道府県               PIC  N(5).
000150 01  ()住所１                 PIC  N(20).
000160 01  ()住所２                 PIC  N(20).
000170 01  ()大企業コード           PIC  X(1).
000180 01  ()ＢＴＭ取引区分         PIC  X(1).
000190 01  ()ＢＴＭ担当部店         PIC  N(15).
000200 01  ()支店コード             PIC  X(3).
000210 01  ()業種コード             PIC  X(2).
000220 01  ()業種                   PIC  N(15).
000230 01  ()名寄せコード           PIC  X(8).
000240 01  ()ユーザーコード         PIC  X(8).
000250 01  ()帝国コード             PIC  X(10).
000260 01  ()銀行名                 PIC  N(15).
000270 01  ()銀行支店名             PIC  N(15).
000280 01  ()銀行コード             PIC  X(7).
000290 01  ()銀行口座番号           PIC  X(7).
000300 01  ()預金種類               PIC  X(1).
000310 01  ()銀行信金               PIC  X(1).
000320 01  ()再リース料             PIC  X(1).
000330 01  ()登録先名               PIC  N(30).
000340 01  ()登録先名２             PIC  N(30).
000350 01  ()事業所名               PIC  N(10).
000360 01  ()丸ユーザー             PIC  X(1).
000370 01  ()丸請求先               PIC  X(1).
000380 01  ()丸購入先               PIC  X(1).
000390 01  ()丸残価保証先           PIC  X(1).
000400 01  ()丸その他               PIC  X(1).
000410 01  ()丸名寄せコード         PIC  X(1).
000420 01  ()丸ユーザーコード       PIC  X(1).
000430 01  ()再リース自動           PIC  X(1).
000440 01  ()転リース提携先         PIC  X(2).
000450 01  ()グループコード         PIC  X(8).
000460 01  ()丸グループ             PIC  X(1).
000470 01  ()丸グループコード       PIC  X(1).
000480 01  ()登録先名３             PIC  N(30).
000490 01  ()帝国区分               PIC  X(1).
