000010************************************************
000020* (KOK_KIHON)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()サーバー番号           PIC  X(2).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()担当者コード           PIC  X(4).
000080 01  ()取引先名漢字           PIC  N(30).
000090 01  ()取引先名カナ           PIC  N(15).
000100 01  ()親会社名               PIC  N(30).
000110 01  ()取引先部署名           PIC  N(20).
000120 01  ()郵便番号３桁           PIC  X(3).
000130 01  ()郵便番号４桁           PIC  X(4).
000140 01  ()都道府県               PIC  N(5).
000150 01  ()住所１                 PIC  N(20).
000160 01  ()住所２                 PIC  N(20).
000170 01  ()電話番号               PIC  X(15).
000180 01  ()ＦＡＸ番号             PIC  X(15).
000190 01  ()ホームページアドレス   PIC  N(20).
000200 01  ()上場区分               PIC  X(1).
000210 01  ()大企業コード           PIC  X(1).
000220 01  ()従業員数               PIC S9(6) COMP-3.
000230 01  ()ＢＴＭ取引区分         PIC  X(1).
000240 01  ()ＢＴＭ担当部店         PIC  N(15).
000250 01  ()利用リース会社         PIC  N(35).
000260 01  ()本社郵便番号３桁       PIC  X(3).
000270 01  ()本社郵便番号４桁       PIC  X(4).
000280 01  ()本社都道府県           PIC  N(5).
000290 01  ()本社住所１             PIC  N(20).
000300 01  ()本社住所２             PIC  N(20).
000310 01  ()本社電話番号           PIC  X(15).
000320 01  ()本社ＦＡＸ番号         PIC  X(15).
000330 01  ()業種                   PIC  N(15).
000340 01  ()資本金                 PIC S9(6) COMP-3.
000350 01  ()取引開始日             PIC  X(8).
000360 01  ()取引種類               PIC  N(15).
000370 01  ()設立年月日             PIC  X(8).
000380 01  ()決算月                 PIC  X(2).
000390 01  ()クレライン期限年月     PIC  X(2).
000400 01  ()決算年月               PIC  X(6).
000410 01  ()売上高                 PIC S9(13) COMP-3.
000420 01  ()経常利益               PIC S9(13) COMP-3.
000430 01  ()当期利益               PIC S9(13) COMP-3.
000440 01  ()申告所得               PIC S9(13) COMP-3.
000450 01  ()自己資本               PIC S9(13) COMP-3.
000460 01  ()総資産                 PIC S9(13) COMP-3.
000470 01  ()名寄せコード           PIC  X(8).
000480 01  ()ユーザーコード         PIC  X(8).
000490 01  ()帝国コード             PIC  X(10).
000500 01  ()帝国点数               PIC  X(3).
000510 01  ()業種コード             PIC  X(2).
000520 01  ()変更フラグ             PIC  X(1).
000530 01  ()顧客区分               PIC  X(1).
000540 01  ()登録日                 PIC  X(8).
000550 01  ()登録時刻               PIC  X(6).
000560 01  ()登録担当者コード       PIC  X(4).
000570 01  ()更新日                 PIC  X(8).
000580 01  ()更新時刻               PIC  X(6).
000590 01  ()更新担当者コード       PIC  X(4).
000600 01  ()グループコード         PIC  X(8).
