000010************************************************
000020* (KOK_SIHARAI)
000030************************************************
000040 01  ()顧客コード             PIC  X(6).
000050 01  ()銀行コード             PIC  X(4).
000060 01  ()銀行名                 PIC  N(15).
000070 01  ()支店コード             PIC  X(3).
000080 01  ()支店名                 PIC  N(15).
000090 01  ()預金種類               PIC  X(1).
000100 01  ()口座番号               PIC  X(7).
000110 01  ()口座名義人             PIC  N(30).
000120 01  ()支払先コード           PIC  X(4).
000130 01  ()登録日                 PIC  X(8).
000140 01  ()登録時刻               PIC  X(6).
000150 01  ()登録担当者コード       PIC  X(4).
000160 01  ()更新日                 PIC  X(8).
000170 01  ()更新時刻               PIC  X(6).
000180 01  ()更新担当者コード       PIC  X(4).
