000010************************************************
000020* (KOK_SEIKYU)
000030************************************************
000040 01  ()請求先コード           PIC  X(8).
000050 01  ()請求先名称             PIC  N(30).
000060 01  ()請求先部門名           PIC  N(20).
000070 01  ()請求先郵便番号３桁     PIC  X(3).
000080 01  ()請求先郵便番号４桁     PIC  X(4).
000090 01  ()都道府県               PIC  N(5).
000100 01  ()請求先住所１           PIC  N(20).
000110 01  ()請求先住所２           PIC  N(20).
000120 01  ()請求先電話番号         PIC  X(15).
000130 01  ()請求先ＦＡＸ番号       PIC  X(15).
000140 01  ()短縮コード初回         PIC  X(2).
000150 01  ()銀行コード初回         PIC  X(7).
000160 01  ()預金種類初回           PIC  X(1).
000170 01  ()口座番号初回           PIC  X(7).
000180 01  ()回収方式初回           PIC  X(1).
000190 01  ()短縮コード２回目以降   PIC  X(2).
000200 01  ()銀行コード２回目以降   PIC  X(7).
000210 01  ()預金種類２回目以降     PIC  X(1).
000220 01  ()口座番号２回目以降     PIC  X(7).
000230 01  ()回収方式２回目以降     PIC  X(1).
000240 01  ()入金基準日             PIC  X(2).
000250 01  ()顧客コード             PIC  X(6).
000260 01  ()ユーザーコード         PIC  X(8).
000270 01  ()銀行支店名初回         PIC  N(15).
000280 01  ()銀行支店名２回目以降   PIC  N(15).
000290 01  ()登録日                 PIC  X(8).
000300 01  ()登録時刻               PIC  X(6).
000310 01  ()登録担当者コード       PIC  X(4).
000320 01  ()更新日                 PIC  X(8).
000330 01  ()更新時刻               PIC  X(6).
000340 01  ()更新担当者コード       PIC  X(4).
