000010************************************************
000020* (KOK_SOUKI)
000030************************************************
000040 01  ()顧客コード             PIC  X(8).
000050 01  ()取引先名カナ           PIC  N(35).
000060 01  ()取引先名漢字           PIC  N(50).
000070 01  ()住所                   PIC  N(50).
000080 01  ()生年月日               PIC  X(7).
000090 01  ()代表者氏名             PIC  N(15).
000100 01  ()登録日                 PIC  X(8).
000110 01  ()登録時刻               PIC  X(6).
000120 01  ()登録担当者コード       PIC  X(4).
000130 01  ()更新日                 PIC  X(8).
000140 01  ()更新時刻               PIC  X(6).
000150 01  ()更新担当者コード       PIC  X(4).
000160 01  ()削除区分               PIC  X(1).
