000010************************************************
000020* (KSL_WK_ERR2)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()内容                   PIC  N(30).
000060 01  ()物件ＮＯ               PIC  X(4).
000070 01  ()個別リース料           PIC S9(13) COMP-3.
000080 01  ()ＲＥＦＮＯ１           PIC S9(13) COMP-3.
000090 01  ()チェック               PIC  X(1).
