000010************************************************
000020* (KSL_WK_ERR1)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()内容                   PIC  N(30).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()取引先名               PIC  N(30).
000080 01  ()勘定処理コード         PIC  X(2).
000090 01  ()契約日                 PIC  X(8).
000100 01  ()検収日                 PIC  X(8).
000110 01  ()リース期間             PIC S9(3) COMP-3.
000120 01  ()リース料               PIC S9(13) COMP-3.
000130 01  ()金庫支店コード         PIC  X(5).
