000010************************************************
000020* (KSL_KEI_LPWK_TORIHIKI1)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()端末番号               PIC  N(8).
000060 01  ()事業所コード           PIC  X(4).
000070 01  ()稟議ＮＯ               PIC  X(10).
000080 01  ()稟議区分               PIC  X(1).
000090 01  ()取引先区分             PIC  X(1).
000100 01  ()ユーザーコード         PIC  X(8).
000110 01  ()顧客コード             PIC  X(6).
000120 01  ()取引先名               PIC  N(30).
000130 01  ()担当者コード           PIC  X(4).
000140 01  ()勘定処理コード         PIC  X(2).
000150 01  ()債務協調コード         PIC  X(2).
000160 01  ()取引形態コード         PIC  X(2).
000170 01  ()案件発生区分           PIC  X(1).
000180 01  ()物件確認基準           PIC  X(1).
000190 01  ()物件数                 PIC S9(3) COMP-3.
000200 01  ()購入先数               PIC S9(1) COMP-3.
000210 01  ()契約日                 PIC  X(8).
000220 01  ()検収予定日             PIC  X(8).
000230 01  ()検収日                 PIC  X(8).
000240 01  ()計算方式               PIC  X(1).
000250 01  ()リース期間             PIC S9(3) COMP-3.
000260 01  ()請求サイクル           PIC S9(2) COMP-3.
000270 01  ()支払回数               PIC S9(3) COMP-3.
000280 01  ()据置月数               PIC S9(2)V9(2) COMP-3.
000290 01  ()前受月数               PIC S9(2) COMP-3.
000300 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000310 01  ()月額平均保守料         PIC S9(13) COMP-3.
000320 01  ()その他諸費用総額       PIC S9(13) COMP-3.
000330 01  ()前渡金利息             PIC S9(13) COMP-3.
000340 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000350 01  ()消費税徴収区分         PIC  X(1).
000360 01  ()リース料               PIC S9(13) COMP-3.
000370 01  ()前受リース料           PIC S9(13) COMP-3.
000380 01  ()転リース提携先コード   PIC  X(2).
000390 01  ()単年度契約             PIC  X(2).
000400 01  ()充当_相殺区分         PIC  X(1).
000410 01  ()前渡金区分             PIC  X(1).
000420 01  ()再リース料表示区分     PIC  X(1).
000430 01  ()再リース料             PIC S9(13) COMP-3.
000440 01  ()保守契約先名           PIC  N(30).
000450 01  ()特約                   PIC  N(400).
000460 01  ()購入金額合計           PIC S9(13) COMP-3.
000470 01  ()残価額合計             PIC S9(13) COMP-3.
000480 01  ()実質利回り             PIC S9(2)V9(8) COMP-3.
000490 01  ()基本利回り             PIC S9(2)V9(8) COMP-3.
000500 01  ()粗利益                 PIC S9(13) COMP-3.
000510 01  ()契約金額               PIC S9(13) COMP-3.
000520 01  ()リース料率             PIC S9(2)V9(8) COMP-3.
000530 01  ()基本リース料率         PIC S9(2)V9(8) COMP-3.
000540 01  ()固定資産税総額         PIC S9(13) COMP-3.
000550 01  ()動総保険料総額         PIC S9(13) COMP-3.
000560 01  ()規定損失金１           PIC S9(13) COMP-3.
000570 01  ()規定損失金２           PIC S9(13) COMP-3.
000580 01  ()規定損失金３           PIC S9(13) COMP-3.
000590 01  ()規定損失金４           PIC S9(13) COMP-3.
000600 01  ()規定損失金５           PIC S9(13) COMP-3.
000610 01  ()規定損失金６           PIC S9(13) COMP-3.
000620 01  ()規定損失金７           PIC S9(13) COMP-3.
000630 01  ()規定損失金８           PIC S9(13) COMP-3.
000640 01  ()規定損失金９           PIC S9(13) COMP-3.
000650 01  ()規定損失金１０         PIC S9(13) COMP-3.
000660 01  ()規定損失金１１         PIC S9(13) COMP-3.
000670 01  ()規定損失金１２         PIC S9(13) COMP-3.
000680 01  ()規定損失金物件金額     PIC S9(13) COMP-3.
000690 01  ()計算方法_規定損失金   PIC  X(2).
000700 01  ()ロンコミ付議ＮＯ       PIC  X(7).
000710 01  ()決済区分               PIC  X(1).
000720 01  ()営業部意見             PIC  N(170).
000730 01  ()事務連絡事項           PIC  N(100).
000740 01  ()請求先コード           PIC  X(8).
000750 01  ()請求先名               PIC  N(30).
000760 01  ()請求先郵便番号         PIC  X(7).
000770 01  ()請求先住所             PIC  N(50).
000780 01  ()請求先電話番号         PIC  N(7.5).
000790 01  ()請求先部門名称         PIC  N(20).
000800 01  ()請求区分１             PIC  X(1).
000810 01  ()請求区分２             PIC  X(1).
000820 01  ()第１回リース料受取り条件 PIC  N(10).
000830 01  ()第２回目以降リース料受取条件 PIC  N(10).
000840 01  ()手形枚数               PIC S9(3) COMP-3.
000850 01  ()入金基準日             PIC  X(2).
000860 01  ()預金種類               PIC  X(1).
000870 01  ()銀行コード             PIC  X(7).
000880 01  ()口座番号               PIC  X(7).
000890 01  ()第１回リース料入金日   PIC  X(8).
000900 01  ()第２回リース料入金日   PIC  X(8).
000910 01  ()前受リース料入金日     PIC  X(8).
000920 01  ()残価回収日             PIC  X(8).
000930 01  ()顧客基本都道府県       PIC  N(5).
000940 01  ()顧客基本住所１         PIC  N(20).
000950 01  ()顧客基本住所２         PIC  N(20).
000960 01  ()顧客基本電話番号       PIC  X(15).
000970 01  ()金庫支店コード         PIC  X(5).
000980 01  ()県コード               PIC  X(1).
000990 01  ()共同自営区分           PIC  X(1).
001000 01  ()南北区分               PIC  X(1).
001010 01  ()物件コード             PIC  X(1).
001020 01  ()連帯保証人数           PIC  X(1).
001030 01  ()業種コード             PIC  X(2).
001040 01  ()弊社リース料           PIC S9(13) COMP-3.
001050 01  ()弊社初回リース料       PIC S9(13) COMP-3.
