000010************************************************
000020* (KTK_WK_TENKAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()データ区分             PIC  X(1).
000060 01  ()展開番号               PIC S9(3) COMP-3.
000070 01  ()金額                   PIC S9(13) COMP-3.
000080 01  ()回数                   PIC S9(3) COMP-3.
000090 01  ()利率                   PIC S9(2)V9(8) COMP-3.
000100 01  ()社内金利               PIC S9(2)V9(8) COMP-3.
000110 01  ()回収方式＿元本         PIC  X(1).
000120 01  ()回収方式＿利息         PIC  X(1).
000130 01  ()登録日                 PIC  X(8).
000140 01  ()登録時刻               PIC  X(6).
000150 01  ()登録担当者コード       PIC  X(4).
000160 01  ()更新日                 PIC  X(8).
000170 01  ()更新時刻               PIC  X(6).
000180 01  ()更新担当者コード       PIC  X(4).
