000010************************************************
000020* (LCF_PAYTRN)
000030************************************************
000040 01  ()CTLNUM           PIC  X(6).
000050 01  ()RECNUM           PIC  X(4).
000060 01  ()PLNDAY           PIC  X(8).
000070 01  ()CAPTYP           PIC  X(1).
000080 01  ()PAYAMT           PIC S9(13) COMP-3.
000090 01  ()PAYCAP           PIC S9(13) COMP-3.
000100 01  ()CAPBAL           PIC S9(13) COMP-3.
000110 01  ()BNKINT           PIC S9(13) COMP-3.
000120 01  ()REGDAY           PIC  X(8).
000130 01  ()REGTIM           PIC  X(6).
000140 01  ()REGPSN           PIC  X(4).
000150 01  ()MODDAY           PIC  X(8).
000160 01  ()MODTIM           PIC  X(6).
000170 01  ()MODPSN           PIC  X(4).
