000010************************************************
000020* 履歴アンマッチ資産保険情報(LTRSIH_U)
000030************************************************
000040    03  ()解約履歴ＫＥＹ.
000050     05  ()ＫＥＹ－解約日         PIC  X(7).
000060    03  ()物件番号.
000070     05  ()契約ＮＯ               PIC  X(9).
000080     05  ()物件ＮＯ               PIC S9(3).
000090     05  ()解約区分               PIC  X(1).
000100     05  ()再生区分               PIC  X(1).
000110    03  ()動産保険コード.
000120     05  ()保険会社コード         PIC  X(1).
000130     05  ()保険料種別             PIC  X(3).
000140    03  ()保険新規継続区分       PIC  X(1).
000150    03  ()事故有無区分           PIC  X(1).
000160    03  ()付保日.
000170     05  ()付保日－世紀           PIC S9(1).
000180     05  ()付保日－年月日         PIC  X(6).
000190    03  ()事故日.
000200     05  ()事故日－世紀           PIC S9(1).
000210     05  ()事故日－年月日         PIC  X(6).
000220    03  ()無事故戻し日.
000230     05  ()無事故戻し日－世紀     PIC S9(1).
000240     05  ()無事故戻し日－年月日   PIC  X(6).
000250    03  ()規定損害金ＵＰ率        PIC S9(3)V9(7).
000260    03  ()動総保険価格            PIC S9(13)
000265                                  SIGN LEADING SEPARATE.
000270    03  ()動総保険料              PIC S9(13)
000275                                  SIGN LEADING SEPARATE.
000280    03  ()動総払戻し保険料        PIC S9(13)
000285                                  SIGN LEADING SEPARATE.
000290    03  ()動総無事故戻し料        PIC S9(13)
000295                                  SIGN LEADING SEPARATE.
000300    03  ()動総申込明細情報.
000310     05  ()当年度.
000320      07  ()当年度ページ          PIC S9(5)
000325                                  SIGN LEADING SEPARATE.
000330      07  ()当年度桁数            PIC S9(2).
000340     05  ()前年度.
000350      07  ()前年度ページ          PIC S9(5)
000455                                  SIGN LEADING SEPARATE.
000360      07  ()前年度桁数            PIC S9(2).
000370     05  FILLER                   PIC  X(8).
000380    03  ()再リース付保率          PIC S9(2).
000390    03  ()動総保険料率            PIC S9(4)V9(6)
000495                                  SIGN LEADING SEPARATE.
000400    03  FILLER                    PIC  X(10).
000410    03  ()信用保険コード.
000420     05  ()リース割賦区分         PIC  X(1).
000430     05  ()機械区分               PIC  X(2).
000440     05  ()機種名番号             PIC  X(2).
000450    03  ()型式番号                PIC  X(15).
000460    03  ()通知書送付日.
000470     05  ()通知書送付日－世紀     PIC S9(1).
000480     05  ()通知書送付日－年月日   PIC  X(6).
000490    03  ()符号一連番号            PIC  X(5).
000500    03  ()信用保険料              PIC S9(13)
000505                                  SIGN LEADING SEPARATE.
000510    03  ()動総保険証券番号        PIC  X(11).
000520    03  FILLER                    PIC  X(15).
000530    03  ()処理年月度.
000540     05  ()処理年月度－世紀       PIC S9(1).
000550     05  ()処理年月度－年月       PIC  X(4).
000560    03  ()共通情報                PIC  X(35).
