000010************************************************
000020* 履歴マッチ債権リース展開(LTRSAL_M)
000030************************************************
000040    03  ()解約履歴ＫＥＹ.
000050     05  ()ＫＥＹ－解約日         PIC  X(7).
000060    03  ()ＫＥＹ項目.
000070     05  ()契約番号               PIC  X(9).
000080    03  ()キー.
000090     05  ()再リースコード         PIC S9(1).
000100     05  ()物件ＮＯ               PIC S9(3).
000110     05  ()請求コード             PIC S9(2).
000120     05  ()勘定処理コード         PIC S9(2).
000130     05  ()解約区分               PIC  X(1).
000140    03  ()キー年度.
000150     05  ()年度－世紀             PIC S9(1).
000160     05  ()年度－年               PIC S9(2).
000170     05  ()年度－月               PIC S9(2).
000180    03  ()支払回数番号            PIC S9(4).
000190    03  ()実リース料.
000200     05  ()実リース料－基本       PIC S9(13)
000205                                  SIGN LEADING SEPARATE.
000210     05  ()実リース料－実質       PIC S9(13)
000215                                  SIGN LEADING SEPARATE.
000220    03  ()ＮＥＴ－リース料.
000230     05  ()ＮＥＴ－リース料－基本 PIC S9(13)
000235                                  SIGN LEADING SEPARATE.
000240     05  ()ＮＥＴ－リース料－実質 PIC S9(13)
000245                                  SIGN LEADING SEPARATE.
000250    03  ()利息.
000260     05  ()利息－基本             PIC S9(13)
000265                                  SIGN LEADING SEPARATE.
000270     05  ()利息－実質             PIC S9(13)
000275                                  SIGN LEADING SEPARATE.
000280    03  ()元本内入                PIC S9(13)
000285                                  SIGN LEADING SEPARATE.
000290    03  ()元本残高                PIC S9(13)
000295                                  SIGN LEADING SEPARATE.
000300    03  ()債権残高.
000310     05  ()債権残高－基本         PIC S9(13)
000315                                  SIGN LEADING SEPARATE.
000320     05  ()債権残高－実質         PIC S9(13)
000325                                  SIGN LEADING SEPARATE.
000330    03  ()消費税.
000340     05  ()消費税－額             PIC S9(13)
000345                                  SIGN LEADING SEPARATE.
000350     05  ()消費税－回収方式コード PIC S9(1).
000360    03  ()諸費用                  PIC S9(13)
000365                                  SIGN LEADING SEPARATE.
000370    03  ()消費税率                PIC S9(3)V9(1).
000380    03  FILLER                    PIC  X(4).
000390    03  ()回収方式コード          PIC S9(1).
000400    03  ()回収済表示              PIC S9(1).
000410    03  ()前受充当表示            PIC S9(1).
000420    03  ()残価回収表示            PIC S9(1).
