000010************************************************
000020* 履歴マッチ資産固定資産申告(LTRSIZ_M)
000030************************************************
000040    03  ()解約履歴ＫＥＹ.
000050     05  ()ＫＥＹ－解約日         PIC  X(7).
000060    03  ()物件番号.
000070     05  ()契約ＮＯ               PIC  X(9).
000080     05  ()物件ＮＯ               PIC S9(3).
000090     05  ()解約区分               PIC  X(1).
000100     05  ()再生区分               PIC  X(1).
000110    03  ()納付先コード            PIC  X(6).
000120    03  ()税区分                  PIC S9(1).
000130    03  ()税負担区分              PIC  X(1).
000140    03  ()耐用年数短縮区分        PIC  X(1).
000150    03  ()移動情報.
000160     05  ()移動情報－移動区分     PIC  X(1).
000170     05  ()移動情報－世紀         PIC S9(1).
000180     05  ()移動情報－年月日       PIC  X(6).
000190    03  FILLER                    PIC  X(10).
000200    03  ()償却資産税申告.
000210     05  ()特例.
000220      07  ()特例－期間            PIC S9(2).
000230      07  ()特例－率.
000240       09  ()特例－分子           PIC S9(2).
000250       09  ()特例－分母           PIC S9(3).
000260     05  ()年税額                 PIC S9(13)
000265                                  SIGN LEADING SEPARATE.
000270     05  ()前年度評価額           PIC S9(13)
000275                                  SIGN LEADING SEPARATE.
000280     05  ()前年度理論簿価         PIC S9(13)
000285                                  SIGN LEADING SEPARATE.
000290     05  ()当年度評価額           PIC S9(13)
000295                                  SIGN LEADING SEPARATE.
000300     05  ()当年度理論簿価         PIC S9(13)
000305                                  SIGN LEADING SEPARATE.
000310     05  ()特別課税標準額         PIC S9(13)
000315                                  SIGN LEADING SEPARATE.
000320    03  ()前回申告先              PIC  X(6).
000330    03  ()設置場所名漢字          PIC  X(40).
000340    03  ()設置場所名カナ          PIC  X(20).
000350    03  ()設置場所郵便番号.
000360     05  ()設置場所郵便番号－親   PIC  X(3).
000370     05  ()設置場所郵便番号－子   PIC  X(4).
000380    03  ()設置場所住所漢字        PIC  X(100).
000390    03  FILLER                    PIC  X(11).
000400    03  ()処理年月度.
000410     05  ()処理年月度－世紀       PIC S9(1).
000420     05  ()処理年月度－年月       PIC  X(4).
000430    03  ()共通情報                PIC  X(35).
