000010************************************************
000020* (MAN_MISYORI_KEI)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()ユーザーコード         PIC  X(8).
000070 01  ()契約件数合計           PIC S9(5) COMP-3.
000080 01  ()物件金額合計           PIC S9(13) COMP-3.
000090 01  ()残価額合計             PIC S9(13) COMP-3.
000100 01  ()契約金額合計           PIC S9(13) COMP-3.
