000010************************************************
000020* (MAN_WK_APL_SEIKYU)
000030************************************************
000040 01  ()キー                   PIC  X(16).
000050 01  ()契約番号               PIC  X(9).
000060 01  ()物件ＮＯ               PIC  X(3).
000070 01  ()請求日                 PIC  X(8).
000080 01  ()再リース料             PIC S9(13) COMP-3.
000090 01  ()再リース料＿消費税額   PIC S9(13) COMP-3.
000100 01  ()売却金額               PIC S9(13) COMP-3.
000110 01  ()売却金額＿消費税額     PIC S9(13) COMP-3.
000120 01  ()更新日                 PIC  X(8).
000130 01  ()更新時刻               PIC  X(6).
000140 01  ()更新担当者コード       PIC  X(4).
