000010************************************************
000020* (MAN_DOSO_RITU)
000030************************************************
000040 01  ()請求先コード           PIC  X(8).
000050 01  ()対象資産コード         PIC  X(7).
000060 01  ()付保率１               PIC S9(2) COMP-3.
000070 01  ()付保率２               PIC S9(2) COMP-3.
000080 01  ()付保率３               PIC S9(2) COMP-3.
000090 01  ()付保率４               PIC S9(2) COMP-3.
000100 01  ()付保率５               PIC S9(2) COMP-3.
000110 01  ()付保率６               PIC S9(2) COMP-3.
000120 01  ()付保率７               PIC S9(2) COMP-3.
000130 01  ()付保率８               PIC S9(2) COMP-3.
000140 01  ()付保率９               PIC S9(2) COMP-3.
000150 01  ()登録日                 PIC  X(8).
000160 01  ()登録時刻               PIC  X(6).
000170 01  ()登録担当者コード       PIC  X(4).
000180 01  ()更新日                 PIC  X(8).
000190 01  ()更新時刻               PIC  X(6).
000200 01  ()更新担当者コード       PIC  X(4).
