000010************************************************
000020* (MAN_WK_SEIKYU)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()請求先コード           PIC  X(8).
000060 01  ()取引先名漢字           PIC  N(30).
000070 01  ()取引先名カナ           PIC  N(15).
000080 01  ()請求先部門名           PIC  N(20).
