000010************************************************
000020* (MAN_JIKO_JUSIN)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()金型番号               PIC  X(13).
000070 01  ()再リース料             PIC S9(13) COMP-3.
000080 01  ()再残価額               PIC S9(13) COMP-3.
000090 01  ()登録日                 PIC  X(8).
000100 01  ()登録時刻               PIC  X(6).
000110 01  ()登録担当者コード       PIC  X(4).
000120 01  ()更新日                 PIC  X(8).
000130 01  ()更新時刻               PIC  X(6).
000140 01  ()更新担当者コード       PIC  X(4).
