000010************************************************
000020* (MAN_DUMMY)
000030************************************************
000040 01  ()ÉiÉìÉoÅ[               PIC S9(2) COMP-3.
