000010************************************************
000020* (MAN_TENKAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()勘定処理コード         PIC  X(2).
000070 01  ()連番                   PIC S9(3) COMP-3.
000080 01  ()リース料_請求金額     PIC S9(13) COMP-3.
000090 01  ()支払回数               PIC S9(3) COMP-3.
000100 01  ()登録日                 PIC  X(8).
000110 01  ()登録時刻               PIC  X(6).
000120 01  ()登録担当者コード       PIC  X(4).
000130 01  ()更新日                 PIC  X(8).
000140 01  ()更新時刻               PIC  X(6).
000150 01  ()更新担当者コード       PIC  X(4).
