000010************************************************
000020* (MAN_KEISAN_RITU)
000030************************************************
000040 01  ()請求先コード           PIC  X(8).
000050 01  ()適用年月日             PIC  X(8).
000060 01  ()再リースコード         PIC  X(2).
000070 01  ()計算単位               PIC  X(1).
000080 01  ()端数処理区分           PIC  X(1).
000090 01  ()分子                   PIC S9(3) COMP-3.
000100 01  ()分母                   PIC S9(4) COMP-3.
000110 01  ()登録日                 PIC  X(8).
000120 01  ()登録時刻               PIC  X(6).
000130 01  ()登録担当者コード       PIC  X(4).
000140 01  ()更新日                 PIC  X(8).
000150 01  ()更新時刻               PIC  X(6).
000160 01  ()更新担当者コード       PIC  X(4).
