000010************************************************
000020* (MFS_LIST)
000030************************************************
000040 01  ()請求先コード           PIC  X(8).
000050 01  ()データ区分             PIC  X(1).
000060 01  ()銀行コード             PIC  X(4).
000070 01  ()銀行名                 PIC  X(15).
000080 01  ()支店コード             PIC  X(3).
000090 01  ()支店名                 PIC  X(15).
000100 01  ()ダミー                 PIC  X(4).
000110 01  ()預金種類               PIC  X(1).
000120 01  ()口座番号               PIC  X(7).
000130 01  ()預金者名               PIC  X(30).
000140 01  ()請求金額               PIC S9(10) COMP-3.
000150 01  ()新規コード             PIC  X(1).
000160 01  ()ＭＦＳ欄               PIC  X(8).
000170 01  ()顧客番号               PIC  X(12).
000180 01  ()振替結果               PIC  X(1).
000190 01  ()ダミー２               PIC  X(8).
000200 01  ()登録日                 PIC  X(8).
000210 01  ()登録時刻               PIC  X(6).
000220 01  ()登録担当者コード       PIC  X(4).
000230 01  ()更新日                 PIC  X(8).
000240 01  ()更新時刻               PIC  X(6).
000250 01  ()更新担当者コード       PIC  X(4).
