000010************************************************
000020* (MFS_KOBETU)
000030************************************************
000040 01  ()請求先コード           PIC  X(8).
000050 01  ()銀行コード             PIC  X(4).
000060 01  ()支店コード             PIC  X(3).
000070 01  ()預金種類               PIC  X(1).
000080 01  ()口座番号               PIC  X(7).
000090 01  ()口座名義人名           PIC  X(30).
000100 01  ()請求金額               PIC S9(10) COMP-3.
000110 01  ()新規コード             PIC  X(1).
000120 01  ()顧客番号               PIC  X(12).
000130 01  ()登録日                 PIC  X(8).
000140 01  ()登録時刻               PIC  X(6).
000150 01  ()登録担当者コード       PIC  X(4).
000160 01  ()更新日                 PIC  X(8).
000170 01  ()更新時刻               PIC  X(6).
000180 01  ()更新担当者コード       PIC  X(4).
000190 01  ()入金日                 PIC  X(2).
