000010************************************************
000020* (MST_KIHON)
000030************************************************
000040 01  ()個人ＩＤ               PIC  X(4).
000050 01  ()個人名_漢字           PIC  N(10).
000060 01  ()個人名_仮名           PIC  N(15).
000070 01  ()所属事業所コード       PIC  X(4).
000080 01  ()兼務事業所コード_１   PIC  X(4).
000090 01  ()兼務事業所コード_２   PIC  X(4).
000100 01  ()兼務事業所コード_３   PIC  X(4).
000110 01  ()兼務事業所コード_４   PIC  X(4).
000120 01  ()兼務事業所コード_５   PIC  X(4).
000130 01  ()登録日                 PIC  X(8).
000140 01  ()登録時刻               PIC  X(6).
000150 01  ()登録担当者コード       PIC  X(4).
000160 01  ()更新日                 PIC  X(8).
000170 01  ()更新時刻               PIC  X(6).
000180 01  ()更新担当者コード       PIC  X(4).
000190 01  ()ワーク                 PIC  X(1).
