000010************************************************
000020* (MST_GYOSHU)
000030************************************************
000040 01  ()業種コード             PIC  X(2).
000050 01  ()業種名                 PIC  N(15).
000060 01  ()業種名_略称           PIC  N(5).
000070 01  ()登録日                 PIC  X(8).
000080 01  ()登録時刻               PIC  X(6).
000090 01  ()登録担当者コード       PIC  X(4).
000100 01  ()更新日                 PIC  X(8).
000110 01  ()更新時刻               PIC  X(6).
000120 01  ()更新担当者コード       PIC  X(4).
000130 01  ()主要業種内容           PIC  N(1000).
