000010************************************************
000020* (MST_NENGETU)
000030************************************************
000040 01  ()処理年月管理ＩＤ       PIC  X(8).
000050 01  ()当日処理日             PIC  X(8).
000060 01  ()当月月度               PIC  X(8).
000070 01  ()前月月度               PIC  X(8).
000080 01  ()翌月月度               PIC  X(8).
000090 01  ()当月検収分送信締日     PIC  X(8).
000100 01  ()貸付金ファクタリング送信締日 PIC  X(8).
000110 01  ()中途解約送信締日       PIC  X(8).
000120 01  ()成約送信締日           PIC  X(8).
000130 01  ()満了再リース継続リース送信締日 PIC  X(8).
000140 01  ()ＳＦＣ送信締日_１     PIC  X(8).
000150 01  ()ＳＦＣ送信締日_２     PIC  X(8).
000160 01  ()登録日                 PIC  X(8).
000170 01  ()登録時刻               PIC  X(6).
000180 01  ()登録担当者コード       PIC  X(4).
000190 01  ()更新日                 PIC  X(8).
000200 01  ()更新時刻               PIC  X(6).
000210 01  ()更新担当者コード       PIC  X(4).
