000010************************************************
000020* (MST_JIGYO)
000030************************************************
000040 01  ()事業所コード           PIC  X(4).
000050 01  ()事業所名_１           PIC  N(10).
000060 01  ()事業所名_２           PIC  N(10).
000070 01  ()事業所名略称_１       PIC  N(5).
000080 01  ()事業所名略称_２       PIC  N(6).
000090 01  ()事業所住所             PIC  N(45).
000100 01  ()事業所電話番号         PIC  X(15).
000110 01  ()事業所ＦＡＸ番号       PIC  X(15).
000120 01  ()支払先コード上一桁エリア PIC  X(1).
000130 01  ()適用日                 PIC  X(8).
000140 01  ()登録日                 PIC  X(8).
000150 01  ()登録時刻               PIC  X(6).
000160 01  ()登録担当者コード       PIC  X(4).
000170 01  ()更新日                 PIC  X(8).
000180 01  ()更新時刻               PIC  X(6).
000190 01  ()更新担当者コード       PIC  X(4).
000200 01  ()ワーク                 PIC  X(1).
