000010************************************************
000020* (MST_DOSO_TANKI)
000030************************************************
000040 01  ()既経過期間_月数       PIC  X(2).
000050 01  ()既経過期間_日数       PIC  X(3).
000060 01  ()動総保険短期料率_１   PIC S9(2)V9(8) COMP-3.
000070 01  ()適用日_１             PIC  X(8).
000080 01  ()動総保険短期料率_２   PIC S9(2)V9(8) COMP-3.
000090 01  ()適用日_２             PIC  X(8).
000100 01  ()登録日                 PIC  X(8).
000110 01  ()登録時刻               PIC  X(6).
000120 01  ()登録担当者コード       PIC  X(4).
000130 01  ()更新日                 PIC  X(8).
000140 01  ()更新時刻               PIC  X(6).
000150 01  ()更新担当者コード       PIC  X(4).
