000010************************************************
000020* (NTL_MANTSUS_CSV)
000030************************************************
000040 01  ()レコード種別           PIC  N(1.5).
000050 01  ()リース会社ＩＤ         PIC  N(4).
000060 01  ()契約ＩＤ               PIC  N(12).
000070 01  ()資産番号キー           PIC  N(14).
000080 01  ()送付先コード           PIC  N(11).
000090 01  ()資産番号               PIC  N(4).
000100 01  ()物件個数               PIC  N(4).
000110 01  ()物件個数単位           PIC  N(3).
000120 01  ()物件名                 PIC  N(41).
000130 01  ()物件設置場所名         PIC  N(46).
000140 01  ()ＳＰ顧客ＩＤ           PIC  N(7).
000150 01  ()ソート専用項目         PIC  N(16).
000160 01  ()備忘情報               PIC  N(31).
000170 01  ()作成ＩＤ               PIC  N(6).
000180 01  ()作成日                 PIC  N(6).
000190 01  ()更新ＩＤ               PIC  N(6).
000200 01  ()更新日                 PIC  N(6).
