000010************************************************
000020* (NTL_SISAN)
000030************************************************
000040 01  ()レコード種別           PIC  X(1).
000050 01  ()リース会社ＩＤ         PIC  X(6).
000060 01  ()契約ＩＤ               PIC  X(22).
000070 01  ()資産番号               PIC  X(6).
000080 01  ()物件個数               PIC S9(6) COMP-3.
000090 01  ()物件個数単位           PIC  X(4).
000100 01  ()物件名                 PIC  X(80).
000110 01  ()物件設置場所名         PIC  X(90).
000120 01  ()ＳＰ顧客ＩＤ           PIC  X(12).
000130 01  ()平均月額リース料       PIC S9(13) COMP-3.
000140 01  ()次回約定回収額         PIC S9(12) COMP-3.
000150 01  ()物件備忘情報           PIC  X(60).
000160 01  ()画面用備忘情報         PIC  X(60).
000170 01  ()ソート専用項目         PIC  X(30).
000180 01  ()作成ＩＤ               PIC  X(10).
000190 01  ()作成日                 PIC  X(10).
000200 01  ()更新ＩＤ               PIC  X(10).
000210 01  ()更新日                 PIC  X(10).
