000010************************************************
000020* (NTT_WK_MEISAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()明細ＮＯ               PIC  X(4).
000060 01  ()物件名                 PIC  X(30).
000070 01  ()先方参照番号           PIC  X(10).
000080 01  ()個別リース料           PIC S9(13) COMP-3.
000090 01  ()請求コード             PIC  X(2).
