000010************************************************
000020* (NTT_WK_KIHON)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()検収日                 PIC  X(8).
000060 01  ()請求先コード           PIC  X(8).
000070 01  ()当月リース料           PIC S9(13) COMP-3.
000080 01  ()日付                   PIC  X(4).
000090 01  ()充当回                 PIC  X(3).
000100 01  ()総支払回数             PIC  X(3).
000110 01  ()消費税額               PIC S9(11) COMP-3.
000120 01  ()請求コード             PIC  X(2).
000130 01  ()税率                   PIC S9(2)V9(1) COMP-3.
