000010************************************************
000020* (NYU_AUTOAPPL)
000030************************************************
000040 01  ()OPEDAY           PIC  X(8).
000050 01  ()BNKCOD           PIC  X(4).
000060 01  ()BNKKNJ           PIC  X(16).
000070 01  ()FLPCNT           PIC  X(1).
000080 01  ()TOTCNT           PIC S9(5) COMP-3.
000090 01  ()TOTAMT           PIC S9(10) COMP-3.
000100 01  ()PAYDAY           PIC  X(4).
