000010************************************************
000020* (NYU_BANKMAST)
000030************************************************
000040 01  ()BNKCOD           PIC  X(4).
000050 01  ()BRCCOD           PIC  X(3).
000060 01  ()BNKNAM           PIC  X(15).
000070 01  ()BRCNAM           PIC  X(15).
000080 01  ()DEPKND           PIC  X(1).
000090 01  ()DEPNUM           PIC  X(7).
000100 01  ()CONSIG           PIC  X(10).
000110 01  ()FILNAM           PIC  X(8).
000120 01  ()BNKKNJ           PIC  X(16).
