000010************************************************
000020* (PAY_BNSCLM)
000030************************************************
000040 01  ()JOBTYP           PIC  X(1).
000050 01  ()JOBTIM           PIC  X(6).
000060 01  ()CNTNUM           PIC  X(9).
000070 01  ()RELEAS           PIC  X(1).
000080 01  ()PLNDAY           PIC  X(8).
000090 01  ()PAYDAY           PIC  X(8).
000100 01  ()PAYCLT           PIC  X(8).
000110 01  ()PAYNAM           PIC  N(30).
000120 01  ()TRNAMT           PIC S9(13) COMP-3.
000130 01  ()DEMFLG           PIC  X(1).
000140 01  ()DEMFLG_O       PIC  X(1).
000150 01  ()REGDAY           PIC  X(8).
000160 01  ()REGTIM           PIC  X(6).
000170 01  ()REGPSN           PIC  X(4).
000180 01  ()MODDAY           PIC  X(8).
000190 01  ()MODTIM           PIC  X(6).
000200 01  ()MODPSN           PIC  X(4).
