000010************************************************
000020* (PAY_PRTWR2)
000030************************************************
000040 01  ()OFCCOD           PIC  X(4).
000050 01  ()OPEDAY           PIC  X(4).
000060 01  ()PAYDAY           PIC  X(4).
000070 01  ()OFCNAM           PIC  X(30).
000080 01  ()DEPKND           PIC  X(1).
000090 01  ()DEPNUM           PIC  X(7).
000100 01  ()PAYCNT           PIC S9(5) COMP-3.
000110 01  ()PAYAMT           PIC S9(11) COMP-3.
000120 01  ()CHGAMT           PIC S9(5) COMP-3.
000130 01  ()TAXAMT           PIC S9(5) COMP-3.
000140 01  ()CHGTOT           PIC S9(5) COMP-3.
000150 01  ()SNDCNT           PIC S9(5) COMP-3.
