000010************************************************
000020* (PAY_EXPJOB)
000030************************************************
000040 01  ()OPEDAY           PIC  X(8).
000050 01  ()PAYDAY           PIC  X(8).
000060 01  ()GETTXT           PIC  X(1).
000070 01  ()DATMAK           PIC  X(1).
000080 01  ()LSTPRT           PIC  X(1).
000090 01  ()PUTFDD           PIC  X(1).
000100 01  ()SNDDAT           PIC  X(1).
