000010************************************************
000020* (PAY_GAFCOD)
000030************************************************
000040 01  ()EXPCOD           PIC  X(3).
000050 01  ()EXPNAM           PIC  N(15).
