000010************************************************
000020* (POK_KEIYAKU_KONYUM)
000030************************************************
000040 01  ()メーカーコード         PIC  X(2).
000050 01  ()購入先名               PIC  N(30).
000060 01  ()購入先住所             PIC  N(50).
000070 01  ()ディーラーコード       PIC  X(5).
000080 01  ()支払条件文言           PIC  N(25).
