000010************************************************
000020* (SFC_SITEN)
000030************************************************
000040 01  ()包括エリアコード       PIC  X(1).
000050 01  ()エリアコード           PIC  X(2).
000060 01  ()支店コード             PIC  X(2).
000070 01  ()包括エリア名           PIC  N(30).
000080 01  ()エリア名               PIC  N(30).
000090 01  ()支店名                 PIC  N(30).
000100 01  ()登録日                 PIC  X(8).
000110 01  ()登録時刻               PIC  X(6).
000120 01  ()登録担当者コード       PIC  X(4).
000130 01  ()更新日                 PIC  X(8).
000140 01  ()更新時刻               PIC  X(6).
000150 01  ()更新担当者コード       PIC  X(4).
