000010************************************************
000020* (SFC_MEISAI)
000030************************************************
000040 01  ()シャープ契約番号       PIC  X(12).
000050 01  ()シャープ商品連番       PIC  X(3).
000060 01  ()契約番号               PIC  X(9).
000070 01  ()物件ＮＯ               PIC  X(3).
000080 01  ()シャープ商品コード     PIC  X(4).
000090 01  ()物件名                 PIC  X(15).
000100 01  ()機種名                 PIC  X(15).
000110 01  ()数量                   PIC S9(4) COMP-3.
000120 01  ()購入金額               PIC S9(13) COMP-3.
000130 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000140 01  ()個別リース料           PIC S9(13) COMP-3.
000150 01  ()動総保険コード         PIC  X(4).
000160 01  ()動総保険料率           PIC S9(2)V9(3) COMP-3.
000170 01  ()資産コード             PIC  X(7).
000180 01  ()耐用年数               PIC  X(2).
000190 01  ()信用保険コード         PIC  X(6).
000200 01  ()税区分                 PIC  X(1).
000210 01  ()固定資産税率           PIC S9(2)V9(2) COMP-3.
000220 01  ()納付先コード           PIC  X(6).
000230 01  ()登録日                 PIC  X(8).
000240 01  ()登録時刻               PIC  X(6).
000250 01  ()登録担当者コード       PIC  X(4).
000260 01  ()更新日                 PIC  X(8).
000270 01  ()更新時刻               PIC  X(6).
000280 01  ()更新担当者コード       PIC  X(4).
