000010************************************************
000020* (SFC_WK_KEIYAKU)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()シャープ契約番号       PIC  X(12).
000060 01  ()シャープ商品連番       PIC  X(3).
000070 01  ()包括エリアコード       PIC  X(1).
000080 01  ()包括エリア名           PIC  N(30).
000090 01  ()エリアコード           PIC  X(2).
000100 01  ()支店コード             PIC  X(2).
000110 01  ()ユーザーコード         PIC  X(8).
000120 01  ()取引先名               PIC  N(30).
000130 01  ()契約日                 PIC  X(8).
000140 01  ()契約番号               PIC  X(9).
000150 01  ()据置期間               PIC S9(3) COMP-3.
000160 01  ()リース期間             PIC S9(3) COMP-3.
000170 01  ()前受月数               PIC S9(2) COMP-3.
000180 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000190 01  ()消費税率               PIC S9(2)V9(1) COMP-3.
000200 01  ()購入金額_計           PIC S9(14) COMP-3.
000210 01  ()リース料_計           PIC S9(14) COMP-3.
000220 01  ()総リース料_計         PIC S9(14) COMP-3.
000230 01  ()前受リース料_計       PIC S9(14) COMP-3.
000240 01  ()購入金額消費税_計     PIC S9(13) COMP-3.
000250 01  ()リース料消費_計       PIC S9(13) COMP-3.
000260 01  ()前受リース料消費_計   PIC S9(13) COMP-3.
000270 01  ()購入金額_合計         PIC S9(15) COMP-3.
000280 01  ()リース料_合計         PIC S9(15) COMP-3.
000290 01  ()前受リース料_合計     PIC S9(15) COMP-3.
000300 01  ()物件数                 PIC S9(3) COMP-3.
000310 01  ()納付先コード           PIC  X(6).
000320 01  ()設置場所名             PIC  X(25).
000330 01  ()物件名                 PIC  X(15).
000340 01  ()数量                   PIC S9(4) COMP-3.
000350 01  ()耐用年数               PIC  X(2).
000360 01  ()購入金額               PIC S9(13) COMP-3.
000370 01  ()仕入消費税等額         PIC S9(13) COMP-3.
000380 01  ()総リース料             PIC S9(13) COMP-3.
000390 01  ()個別リース料           PIC S9(13) COMP-3.
000400 01  ()前受リース料           PIC S9(13) COMP-3.
000410 01  ()連番                   PIC S9(13) COMP-3.
