000010************************************************
000020* (SFC_WK_SAISAN)
000030************************************************
000040 01  ()端末番号               PIC  N(8).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()担当者コード           PIC  X(4).
000070 01  ()取引先コード           PIC  X(8).
000080 01  ()顧客名                 PIC  N(30).
000090 01  ()社内金利               PIC S9(2)V9(2) COMP-3.
000100 01  ()契約日                 PIC  X(8).
000110 01  ()検収日                 PIC  X(8).
000120 01  ()第１回入金日           PIC  X(8).
000130 01  ()入金基準日             PIC  X(2).
000140 01  ()シャープ契約番号       PIC  X(12).
000150 01  ()契約番号               PIC  X(9).
000160 01  ()リース期間             PIC S9(3) COMP-3.
000170 01  ()前受月数               PIC S9(2) COMP-3.
000180 01  ()購入金額               PIC S9(13) COMP-3.
000190 01  ()繰延月数               PIC S9(2)V9(2) COMP-3.
000200 01  ()リース料               PIC S9(13) COMP-3.
000210 01  ()契約金額               PIC S9(13) COMP-3.
000220 01  ()前受リース料           PIC S9(13) COMP-3.
000230 01  ()耐用年数               PIC S9(3)V9(3) COMP-3.
000240 01  ()月額固定資産税         PIC S9(13) COMP-3.
000250 01  ()保険料率               PIC S9(3)V9(3) COMP-3.
000260 01  ()月額保険料             PIC S9(13) COMP-3.
000270 01  ()基本リース料           PIC S9(13) COMP-3.
000280 01  ()実質利回り             PIC S9(4)V9(6) COMP-3.
000290 01  ()基本利回り             PIC S9(4)V9(6) COMP-3.
000300 01  ()粗利益                 PIC S9(13) COMP-3.
