000010************************************************
000020* (SIN_SEIKYU)
000030************************************************
000040 01  ()稟議ＮＯ               PIC  X(10).
000050 01  ()第１回リース料受取条件 PIC  N(10).
000060 01  ()第２回目以降リース料受取条件 PIC  N(10).
000070 01  ()請求区分１             PIC  X(1).
000080 01  ()請求区分２             PIC  X(1).
000090 01  ()銀行短縮コード         PIC  X(2).
000100 01  ()銀行名                 PIC  N(15).
000110 01  ()手形枚数               PIC S9(3) COMP-3.
000120 01  ()登録日                 PIC  X(8).
000130 01  ()登録時刻               PIC  X(6).
000140 01  ()登録担当者コード       PIC  X(4).
000150 01  ()更新日                 PIC  X(8).
000160 01  ()更新時刻               PIC  X(6).
000170 01  ()更新担当者コード       PIC  X(4).
