000010************************************************
000020* (SIN_YOSINSAKI)
000030************************************************
000040 01  ()稟議ＮＯ               PIC  X(10).
000050 01  ()名寄せコード１         PIC  X(8).
000060 01  ()与信先名１             PIC  N(30).
000070 01  ()保証担保内容１         PIC  X(2).
000080 01  ()保全範囲１             PIC  X(2).
000090 01  ()負担割合１             PIC S9(3) COMP-3.
000100 01  ()名寄せコード２         PIC  X(8).
000110 01  ()与信先名２             PIC  N(30).
000120 01  ()保証担保内容２         PIC  X(2).
000130 01  ()保全範囲２             PIC  X(2).
000140 01  ()負担割合２             PIC S9(3) COMP-3.
000150 01  ()名寄せコード３         PIC  X(8).
000160 01  ()与信先名３             PIC  N(30).
000170 01  ()保証担保内容３         PIC  X(2).
000180 01  ()保全範囲３             PIC  X(2).
000190 01  ()負担割合３             PIC S9(3) COMP-3.
000200 01  ()名寄せコード４         PIC  X(8).
000210 01  ()与信先名４             PIC  N(30).
000220 01  ()保証担保内容４         PIC  X(2).
000230 01  ()保全範囲４             PIC  X(2).
000240 01  ()負担割合４             PIC S9(3) COMP-3.
000250 01  ()名寄せコード５         PIC  X(8).
000260 01  ()与信先名５             PIC  N(30).
000270 01  ()保証担保内容５         PIC  X(2).
000280 01  ()保全範囲５             PIC  X(2).
000290 01  ()負担割合５             PIC S9(3) COMP-3.
000300 01  ()リース残高１           PIC S9(6) COMP-3.
000310 01  ()割賦残高１             PIC S9(6) COMP-3.
000320 01  ()貸付金他残高１         PIC S9(6) COMP-3.
000330 01  ()未検収残高１           PIC S9(6) COMP-3.
000340 01  ()未徴収金１             PIC S9(6) COMP-3.
000350 01  ()リース残高２           PIC S9(6) COMP-3.
000360 01  ()割賦残高２             PIC S9(6) COMP-3.
000370 01  ()貸付金他残高２         PIC S9(6) COMP-3.
000380 01  ()未検収残高２           PIC S9(6) COMP-3.
000390 01  ()未徴収金２             PIC S9(6) COMP-3.
000400 01  ()リース残高３           PIC S9(6) COMP-3.
000410 01  ()割賦残高３             PIC S9(6) COMP-3.
000420 01  ()貸付金他残高３         PIC S9(6) COMP-3.
000430 01  ()未検収残高３           PIC S9(6) COMP-3.
000440 01  ()未徴収金３             PIC S9(6) COMP-3.
000450 01  ()リース残高４           PIC S9(6) COMP-3.
000460 01  ()割賦残高４             PIC S9(6) COMP-3.
000470 01  ()貸付金他残高４         PIC S9(6) COMP-3.
000480 01  ()未検収残高４           PIC S9(6) COMP-3.
000490 01  ()未徴収金４             PIC S9(6) COMP-3.
000500 01  ()リース残高５           PIC S9(6) COMP-3.
000510 01  ()割賦残高５             PIC S9(6) COMP-3.
000520 01  ()貸付金他残高５         PIC S9(6) COMP-3.
000530 01  ()未検収残高５           PIC S9(6) COMP-3.
000540 01  ()未徴収金５             PIC S9(6) COMP-3.
000550 01  ()登録日                 PIC  X(8).
000560 01  ()登録時刻               PIC  X(6).
000570 01  ()登録担当者コード       PIC  X(4).
000580 01  ()更新日                 PIC  X(8).
000590 01  ()更新時刻               PIC  X(6).
000600 01  ()更新担当者コード       PIC  X(4).
