000010************************************************
000020* (SIN_KEY)
000030************************************************
000040 01  ()稟議ＮＯ               PIC  X(10).
000050 01  ()事業所コード           PIC  X(4).
000060 01  ()担当者コード           PIC  X(4).
000070 01  ()処理ステータス         PIC  X(1).
000080 01  ()削除区分               PIC  X(1).
000090 01  ()案件番号               PIC  X(10).
000100 01  ()見積枝番               PIC  X(2).
000110 01  ()物件明細別紙フラグ     PIC  X(1).
000120 01  ()購入先明細別紙フラグ   PIC  X(1).
000130 01  ()保証先明細別紙フラグ   PIC  X(1).
000140 01  ()登録日                 PIC  X(8).
000150 01  ()登録時刻               PIC  X(6).
000160 01  ()登録担当者コード       PIC  X(4).
000170 01  ()更新日                 PIC  X(8).
000180 01  ()更新時刻               PIC  X(6).
000190 01  ()更新担当者コード       PIC  X(4).
