000010************************************************
000020* (SIN_BUKKEN)
000030************************************************
000040 01  ()稟議ＮＯ               PIC  X(10).
000050 01  ()物件ＮＯ               PIC  X(3).
000060 01  ()資産コード             PIC  X(7).
000070 01  ()資産名                 PIC  N(15).
000080 01  ()製造業者               PIC  N(30).
000090 01  ()物件名＿漢字           PIC  N(20).
000100 01  ()購入金額               PIC S9(13) COMP-3.
000110 01  ()残価保証区分           PIC  X(1).
000120 01  ()残価額                 PIC S9(13) COMP-3.
000130 01  ()残価保証先コード       PIC  X(8).
000140 01  ()残価保証先名           PIC  N(30).
000150 01  ()耐用年数               PIC S9(5) COMP-3.
000160 01  ()数量                   PIC S9(4) COMP-3.
000170 01  ()信用保険付保区分       PIC  X(1).
000180 01  ()信用保険コード         PIC  X(6).
000190 01  ()設置場所名＿漢字       PIC  N(20).
000200 01  ()設置場所郵便番号       PIC  X(7).
000210 01  ()設置場所住所           PIC  N(20).
000220 01  ()納付先コード           PIC  X(6).
000230 01  ()ディーラーコード       PIC  X(5).
000240 01  ()購入先名               PIC  N(30).
000250 01  ()登録日                 PIC  X(8).
000260 01  ()登録時刻               PIC  X(6).
000270 01  ()登録担当者コード       PIC  X(4).
000280 01  ()更新日                 PIC  X(8).
000290 01  ()更新時刻               PIC  X(6).
000300 01  ()更新担当者コード       PIC  X(4).
