000010************************************************
000020* (SIN_CHOHYO_WK)
000030************************************************
000040 01  ()’[––‚h‚c               PIC  X(8).
000050 01  ()’ •[‚P                 PIC  X(1).
000060 01  ()’ •[‚Q                 PIC  X(1).
000070 01  ()’ •[‚R                 PIC  X(1).
000080 01  ()’ •[‚S                 PIC  X(1).
000090 01  ()’ •[‚T                 PIC  X(1).
000100 01  ()’ •[‚U                 PIC  X(1).
000110 01  ()’ •[‚V                 PIC  X(1).
000120 01  ()’ •[‚W                 PIC  X(1).
000130 01  ()’ •[‚X                 PIC  X(1).
000140 01  ()’ •[‚P‚O               PIC  X(1).
