000010************************************************
000020* (SSF_LPWK_KEI_TENKAI)
000030************************************************
000040 01  ()契約番号               PIC  X(9).
000050 01  ()連番                   PIC S9(3) COMP-3.
000060 01  ()月数                   PIC S9(3) COMP-3.
000070 01  ()リース料               PIC S9(13) COMP-3.
000080 01  ()消費税等額             PIC S9(13) COMP-3.
000090 01  ()合計支払額             PIC S9(14) COMP-3.
000100 01  ()損害賠償金             PIC S9(17) COMP-3.
000110 01  ()取引先名               PIC  N(30).
000120 01  ()契約金額               PIC S9(13) COMP-3.
000130 01  ()購入金額合計           PIC S9(13) COMP-3.
000140 01  ()前渡金利息             PIC S9(13) COMP-3.
000150 01  ()計算方法_規定損失金   PIC  X(2).
000160 01  ()端末番号               PIC  N(8).
