000010************************************************
000020* (SWP_EXCSWP)
000030************************************************
000040 01  ()管理番号               PIC  X(4).
000050 01  ()銀行コード             PIC  X(4).
000060 01  ()支店コード             PIC  X(3).
000070 01  ()銀行名                 PIC  N(25).
000080 01  ()締結日                 PIC  X(8).
000090 01  ()幣種コード             PIC  X(3).
000100 01  ()想定元本               PIC S9(13) COMP-3.
000110 01  ()元本残高               PIC S9(13) COMP-3.
000120 01  ()約定弁済額             PIC S9(13) COMP-3.
000130 01  ()最終弁済額             PIC S9(13) COMP-3.
000140 01  ()弁済回数               PIC S9(3) COMP-3.
000150 01  ()受取固定変動区分       PIC  X(1).
000160 01  ()受取利率基数           PIC  X(3).
000170 01  ()受取金利               PIC S9(2)V9(6) COMP-3.
000180 01  ()支払固定変動区分       PIC  X(1).
000190 01  ()支払利率基数           PIC  X(3).
000200 01  ()支払金利               PIC S9(2)V9(6) COMP-3.
000210 01  ()マージン               PIC S9(2)V9(6) COMP-3.
000220 01  ()休日処理区分           PIC  X(1).
000230 01  ()月末固定区分           PIC  X(1).
000240 01  ()端数処理区分           PIC  X(1).
000250 01  ()円換算相場             PIC S9(4)V9(2) COMP-3.
000260 01  ()計算開始日             PIC  X(8).
000270 01  ()最終期日               PIC  X(8).
000280 01  ()契約月数               PIC S9(3) COMP-3.
000290 01  ()利払サイクル           PIC  X(2).
000300 01  ()利払据置月数           PIC  X(2).
000310 01  ()資金原価区分           PIC  X(1).
000320 01  ()備考                   PIC  N(25).
000330 01  ()更新標識               PIC  X(1).
