000010************************************************
000020* (TDB_20020719)
000030************************************************
000040 01  ()名寄せコード           PIC  X(8).
000050 01  ()帝国企業コード         PIC  X(9).
