000010************************************************
000020* 与信(入金情報)(YOSHINNYUKIN)
000030************************************************
000040    03  ()管理与信先コード       PIC  X(8).
000050    03  ()管理与信区分           PIC  X(1).
000060    03  ()自動与信区分           PIC  X(1).
000070    03  ()事故日                 PIC  X(8).
000080    03  ()契約ＮＯ               PIC  X(9).
000090    03  ()勘定コード             PIC  X(2).
000100    03  ()入金予定日             PIC  X(8).
000110    03  ()請求内コード           PIC  X(3).
000120    03  ()消込通番               PIC  X(9).
000130    03  ()請求金額               PIC S9(13).
