000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. T-SEARCH.
000030 ENVIRONMENT DIVISION.
000070 DATA DIVISION.                               
000110 WORKING-STORAGE SECTION.
000120 77 NUMBERS      PIC 999.
000130 77 T-F          PIC 9 VALUE 1.
000140 77 SEARCH-N     PIC 9.
000220 01 STOCK-TABLE.
000230   03 FILLER PIC X(9) VALUE "OO1000325".
000240   03 FILLER PIC X(9) VALUE "003000827".
000250   03 FILLER PIC X(9) VALUE "006000625".
000260   03 FILLER PIC X(9) VALUE "008001856".
000270   03 FILLER PIC X(9) VALUE "010004850".
000280   03 FILLER PIC X(9) VALUE "999080000".
000290 01 S-P-T REDEFINES STOCK-TABLE.
000300   02 S-P OCCURS 6  
000301        ASCENDING KEY N-T 
000302        INDEXED I.
000310     03 N-T PIC 9(3) .
000320     03 P-T PIC 9(4)V99.
000330 PROCEDURE DIVISION.
000331*   L-1
000340 MAIN.
000371*
000380     PERFORM T-SEARCH UNTIL T-F = 0.
000390*
000400     STOP RUN.
000401*   L-2
000402 T-SEARCH.
000403     DISPLAY "0 ACCEPT NUMBERS"
000404     DISPLAY "1 SEARCH1".
000405     DISPLAY "2 SEARCH2".
000406     DISPLAY "ELSE EXIT."
000407     DISPLAY "ACCEPT SEARCH-N = " WITH NO ADVANCING.
000408     ACCEPT SEARCH-N.
000409     EVALUATE SEARCH-N 
000410          WHEN 0    DISPLAY "INPUT NUMBERS PIC 999"
000411                    ACCEPT NUMBERS
000412          WHEN 1 PERFORM T-SEARCH-1
000413		WHEN 2 PERFORM T-SEARCH-2    	
000414		WHEN OTHER MOVE 0 TO T-F
000415     END-EVALUATE.
000416
000417*  L-3
000418 T-SEARCH-1.       
000420     DISPLAY "SEARCH 1 ".
000430     SET I TO 1.
000441     SEARCH S-P VARYING I 
000442          AT END  DISPLAY "1 NO OK!"
000443          WHEN NUMBERS = N-T(I)
000445               DISPLAY "1 OK!".
000446*    
000447  T-SEARCH-2.       
000448     DISPLAY "SEARCH 2 ".
000449     SET I TO 1.
000451     SEARCH ALL S-P 
000452          AT END  DISPLAY "2 NO OK!"
000454          WHEN NUMBERS = N-T(I)
000455               DISPLAY "2 OK!".
