000100 IDENTIFICATION DIVISION.                                         00010000
000200*                                                                 00020000
000300 PROGRAM-ID. COPY1.                                               00030005
000400*                                                                 00040000
000500 ENVIRONMENT DIVISION.                                            00050000
000600*                                                                 00060000
000700 INPUT-OUTPUT SECTION.                                            00070000
000800*                                                                 00080000
000900 FILE-CONTROL.                                                    00090000
001000*                                                                 00100000
001100      SELECT CUSTMAST ASSIGN TO UT-S-CUSTMAST.                    00110000
001200*                                                                 00120000
001300 DATA DIVISION.                                                   00130000
001400*                                                                 00140000
001500 FILE SECTION.                                                    00150000
001600 FD  CUSTMAST.                                                    00160000
001700*                                                                 00170000
001970     COPY CUST1.                                                  00197004
001980                                                                  00198003
002000*                                                                 00200000
002100 WORKING-STORAGE SECTION.                                         00210000
002200*                                                                 00220000
002300 01  SWITCHES.                                                    00230000
002400     05  CUSTMAST-EOF-SWITCH     PIC X    VALUE "N".              00240000
002500                                                                  00250000
002600 01  TOTAL-FIELDS.                                                00260000
002700     05  GRAND-TOTAL-THIS-YTD   PIC S9(7)V99   VALUE ZERO.        00270000
002800     05  GRAND-TOTAL-LAST-YTD   PIC S9(7)V99   VALUE ZERO.        00280000
002900     05  DISP-1                 PIC -Z(7)9.99.                    00290000
003000     05  DISP-2                 PIC -Z(7)9.99.                    00300000
003100     05  DISP-3                 PIC -Z(7)9.99.                    00310000
003200*                                                                 00320000
003300 PROCEDURE DIVISION.                                              00330000
003400*                                                                 00340000
003500 000-CONTROL.                                                     00350000
003600*                                                                 00360000
003700     OPEN INPUT  CUSTMAST                                         00370000
003800     PERFORM 100-READ                                             00380000
003900                UNTIL CUSTMAST-EOF-SWITCH = "Y".                  00390000
004000     MOVE GRAND-TOTAL-THIS-YTD TO DISP-1                          00400000
004100     MOVE GRAND-TOTAL-LAST-YTD TO DISP-2                          00410000
004200                                                                  00420000
004300     DISPLAY 'GRAND-TOTAL-THIS-YTD = ' DISP-1.                    00430000
004400     DISPLAY 'GRAND-TOTAL-LAST-YTD = ' DISP-2.                    00440000
004500     MOVE -5               TO DISP-3.                             00450000
004600     DISPLAY ' DISP-3 = ' DISP-3                                  00460000
004700                                                                  00470000
004800     STOP RUN.                                                    00480000
004900 100-READ.                                                        00490000
005000     READ CUSTMAST                                                00500000
005100                AT END                                            00510000
005200                    MOVE "Y" TO CUSTMAST-EOF-SWITCH.              00520000
005300     IF CUSTMAST-EOF-SWITCH = "N"                                 00530000
005400        ADD CM-SALES-THIS-YTD TO GRAND-TOTAL-THIS-YTD             00540000
005500        ADD CM-SALES-LAST-YTD TO GRAND-TOTAL-LAST-YTD             00550000
005600        DISPLAY ' RECORD : ' CUSTOMER-MASTER-RECORD.              00560000
005700                                                                  00570000
