 01 FILE-RECORD.
   02 NUM        PIC 9(4).
   02 NAME      PIC X(20).
   02 FACULTY  PIC  99.
   02 SCORE1    PIC 999.
   02 SCORE2    PIC 999.
   02 SCORE3    PIC 999.
   02 TOTAL     PIC 9999.   