比较两个PS的数据集
1.//COMPR JOB KING,CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//                       NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBCOMPR
//sysprint dd sysout=*
//SYSUT1 DD DSN=IBMUSER.TEST.GA01.PS01,DISP=OLD
//SYSUT2 DD DSN=IBMUSER.TEST.GA02.PS02,DISP=OLD
//SYSIN DD *
       COMPARE TYPORG=PS
/*

比较两个分区数据集
//COMPR JOB KING,CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//                       NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBCOMPR
//sysprint dd sysout=*
//SYSUT1 DD DSN=IBMUSER.TEST.GA01.PDS01,DISP=OLD
//SYSUT2 DD DSN=IBMUSER.TEST.GA02.PDS02,DISP=OLD
//SYSIN DD *
       COMPARE TYPORG=PO
/*

单个数据集的比较
//COMPR JOB KING,CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//                       NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBCOMPR
//sysprint dd sysout=*
//SYSUT1 DD DSN=IBMUSER.TEST.GA01.PS01,DISP=OLD
//SYSIN DD DUMMY
//SYSUT2 DD DATA
COMPARE02
/*





