000010******************************************************************
000020*         ＜海輝軟件(大連)＞                                     *
000030*      1. プログラム名  : 管理与信契約移行処理                   *
000040*      2. プログラムID  : COBIS660                               *
000050*      3. 処理概要      : ①与信(基本・明細)を全件対象として与信 *
000060*                          (明細)単位に管理与信契約を作成        *
000070*                         ②債権より消費税率を取得する。         *
000080*                         ③否認に登録された契約であるか否かを   *
000090*                            契約内容より取得する。              *
000100*      4. 作成者        : 徐宝君                                 *
000110*      5. 作成日        : 2005.4.1                               *
000120******************************************************************
000130*                                                                 
000140******************************************************************
000150*    ＩＤＥＮＴＩＦＩＣＡＴＩＯＮ  ＤＩＶＩＳＩＯＮ              *
000160******************************************************************
000170 IDENTIFICATION                       DIVISION.                   
000180*                                                                 
000190 PROGRAM-ID.                          COBIS660.                   
000200******************************************************************
000210*    ＥＮＶＩＲＯＮＭＥＮＴ        ＤＩＶＩＳＩＯＮ              *
000220******************************************************************
000230 ENVIRONMENT                          DIVISION.                   
000240******************************************************************
000250*    INPUT-OUTPUT                     SECTION                    *
000260******************************************************************
000270 INPUT-OUTPUT                          SECTION.                   
000280*                                                                 
000290 FILE-CONTROL.                                                    
000300     SELECT  出カファイル       ASSIGN     TO       U11           
000310     FILE    STATUS         IS         Ｗ－状態                   
000320     ORGANIZATION           IS         LINE        SEQUENTIAL.    
000330******************************************************************
000340*    ＤＡＴＡ                      ＤＩＶＩＳＩＯＮ              *
000350******************************************************************
000360 DATA                                 DIVISION.                   
000370******************************************************************
000380*            出カファイル                                        *
000390******************************************************************
000400 FILE                                 SECTION.                    
000410 FD  出カファイル                                                 
000420     LABEL     RECORD     IS          STANDARD                    
000430     BLOCK     CONTAINS   0           RECORDS.                    
000440*                                                                 
000450 01  出カーレコード.                                              
000460     COPY   CISUF660   REPLACING   ==()==  BY  ==出カー==.        
000470******************************************************************
000480*  ＷＯＲＫＩＮＧ－ＳＴＯＲＡＧＥ  ＳＥＣＴＩＯＮ                *
000490******************************************************************
000500  WORKING-STORAGE                     SECTION.                    
000510*----------------------------------------------------------------*
000520*    ホスト変数定義エリア                                        *
000530*----------------------------------------------------------------*
000540     EXEC  SQL  BEGIN  DECLARE        SECTION  END-EXEC.          
000550*--<管理与信先コード>                                             
000560 01  ＷＳ－管理与信先                 PIC     X(08).              
000570*                                                                 
000580*--< ＯＲＡＣＬＥ共通変数 >                                       
000590     EXEC  SQL  INCLUDE  SQLCOM.CBL            END-EXEC.          
000600*                                                                 
000610*--< ＯＲＡＣＬＥ  ＳＱＬ実行情報 >                               
000620     EXEC  SQL  INCLUDE  SQLCA.COB             END-EXEC.          
000630*                                                                 
000640*--< 与信(基本)テーブル>                                          
000650     EXEC  SQL  INCLUDE  YOSHINKIHON.CBL       END-EXEC.          
000660*                                                                 
000670*--<与信(明細)テーブル >                                          
000680     EXEC  SQL  INCLUDE  YOSHINMEISAI.CBL      END-EXEC.          
000690*                                                                 
000700*--<契約内容テーブル>                                             
000710     EXEC  SQL  INCLUDE  D31KYK.CBL            END-EXEC.          
000720*--<債権テーブル>                                                 
000730     EXEC  SQL  INCLUDE  D32SAK.CBL            END-EXEC.          
000740*--<契約種類等変換テーブル>                                       
000750     EXEC  SQL  INCLUDE  IKOTBL002.CBL         END-EXEC.          
000760*--<変換テーブル>                                                 
000770     EXEC  SQL  INCLUDE  IKOTBL001.CBL         END-EXEC.          
000780                                                                  
000790     EXEC  SQL  END  DECLARE          SECTION  END-EXEC.          
000800*                                                                 
000810*----------------------------------------------------------------*
000820*    ＷＯＲＫエリア                                              *
000830*----------------------------------------------------------------*
000840 01  ＷＯＲＫ－エリア.                                            
000850*--< エラー判定用 >                                               
000860     03  Ｗ－エラーコード             PIC S9(04).                 
000870     03  Ｗ－状態                     PIC X(02).                  
000880     03  Ｗ－管理与信先状態           PIC X(01).                  
000890*                                                                 
000900*--< フラグアリア >                                               
000910     03  フラグアリア.                                            
000920         05  Ｗ－終了－フラグ         PIC  X(01).                 
000930         05  Ｗ－異常終了－フラグ     PIC  X(01).                 
000940*                                                                 
000950*--< 件数エリア >                                                 
000960     03  件数エリア.                                              
000970         05  Ｗ－与信基本入力－件数   PIC  9(09).                 
000980         05  Ｗ－与信明細入力－件数   PIC  9(09).                 
000990         05  Ｗ－契約内容入力－件数   PIC  9(09).                 
001000         05  Ｗ－債権入力－件数       PIC  9(09).                 
001010         05  Ｗ－出力－件数           PIC  9(09).                 
001020                                                                  
001030*                                                                 
001040*--<消費税率 >                                                    
001050     03 Ｗ－消費税率                  PIC  9V99.                  
001060                                                                  
001070*                                                                 
001080*--< 共通情報 >                                                   
001090 01  Ｗ－共通情報.                                                
001100     03  Ｗ－システム日付.                                        
001110         05  Ｗ－世紀                 PIC  X(02) VALUE  "20".     
001120         05  Ｗ－年月日               PIC  X(06).                 
001130     03  Ｗ－システム時刻             PIC  X(08).                 
001140     03  Ｗ－担当者                   PIC  X(08) VALUE "IKOPG   ".
001150*                                                                 
001160*                                                                 
001170*----------------------------------------------------------------*
001180*    サブルーチン名                                              *
001190*----------------------------------------------------------------*
001200 01  CALL-AREA.                                                   
001210*--< 共通ログサブルーチン >                                       
001220     03  CLOCO001                     PIC  X(08) VALUE "CLOCO001".
001230     03  COBCO001                     PIC  X(08) VALUE "COBCO001".
001240*                                                                 
001250*----------------------------------------------------------------*
001260*    ＣＯＰＹ領域                                                *
001270*----------------------------------------------------------------*
001280*--< 共通ログ用パラメータ >                                       
001290 01  IF-CHOCO001.                                                 
001300     COPY  CHOCO001  REPLACING  ==()==  BY  ==共１－==.           
001310*                                                                 
001320*----------------------------------------------------------------*
001330*    ＩＮＩファイル読込サブルーチン用パラメタ領域                *
001340*----------------------------------------------------------------*
001350 01  PARA-AREA.                                                   
001360     COPY CPBCO001.                                               
001370******************************************************************
001380*    定数用データ定義エリア                                      *
001390******************************************************************
001400 CONSTANT                             SECTION.                    
001410 01  定数領域.                                                    
001420     03  定数－プログラムＩＤ         PIC  X(08) VALUE "COBIS660".
001430     03  定数－プログラム名           PIC  X(80)                  
001440                             VALUE  "管理与信契約移行処理".       
001450     03  定数－ＳＱＬＯＫ             PIC S9(04)  VALUE  ZERO.    
001460     03  定数－ＳＱＬＥＮＤ           PIC S9(04)  VALUE  0100.    
001470     03  定数－正常状態               PIC S9(04)  VALUE  ZERO.    
001480     03  定数－異常状態               PIC S9(04)  VALUE  0009.    
001490                                                                  
001500******************************************************************
001510*    ＰＲＯＣＥＤＵＲＥ            ＤＩＶＩＳＩＯＮ              *
001520******************************************************************
001530 PROCEDURE                            DIVISION.                   
001540*                                                                 
001550     PERFORM  初期処理.                                           
001560*                                                                 
001570     PERFORM  主処理  UNTIL  Ｗ－終了－フラグ  =  "Y".            
001580*                                                                 
001590     PERFORM  終了処理.                                           
001600*                                                                 
001610     STOP     RUN.                                                
001620*                                                                 
001630******************************************************************
001640*    初期処理                                                    *
001650******************************************************************
001660 初期処理                             SECTION.                    
001670 初期処理－ＳＴＡＲＴ.                                            
001680*                                                                 
001690*----------------------------------------------------------------*
001700*    開始メッセージ出力処理                                      *
001710*----------------------------------------------------------------*
001720     INITIALIZE                       IF-CHOCO001.                
001730     MOVE  "3"                        TO  共１－イベント種別.     
001740     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
001750     MOVE  "0"                        TO  共１－復帰コード.       
001760     MOVE  "START"                    TO  共１－処理識別.         
001770     MOVE  定数－プログラム名         TO  共１－その他メッセージ. 
001780     CALL  CLOCO001                USING  IF-CHOCO001.            
001790*                                                                 
001800*----------------------------------------------------------------*
001810*    作業領域の初期値処理                                        *
001820*----------------------------------------------------------------*
001830     MOVE                SPACE        TO  ＷＯＲＫ－エリア.       
001840     INITIALIZE                           ＷＯＲＫ－エリア.       
001850*                                                                 
001860*--< ＣＰＵ日付を取得 >                                           
001870     ACCEPT  Ｗ－年月日               FROM  DATE.                 
001880*                                                                 
001890*--< ＣＰＵ時刻を取得 >                                           
001900     ACCEPT  Ｗ－システム時刻         FROM  TIME.                 
001910*                                                                 
001920*--< ＯＲＡＣＬＥ接続 >                                           
001930     PERFORM   ＯＲＡＣＬＥ接続.                                  
001940*                                                                 
001950*--< 結合テーブルカーソル宣言 >                                   
001960     PERFORM  結合テーブルカーソル宣言.                           
001970*                                                                 
001980*--<ファイルオープン>                                             
001990     PERFORM  ファイルオープン.                                   
002000*--<結合テーブルカーソル読込>                                     
002010     PERFORM   結合テーブルカーソル読込.                          
002020*                                                                 
002030 初期処理－ＥＸＩＴ.                                              
002040     EXIT.                                                        
002050******************************************************************
002060*    ＯＲＡＣＬＥ接続                                            *
002070******************************************************************
002080 ＯＲＡＣＬＥ接続                     SECTION.                    
002090 ＯＲＡＣＬＥ接続－ＳＴＡＲＴ.                                    
002100*                                                                 
002110*--< ＤＢ接続用情報を取得処理 >                                   
002120     CALL  COBCO001                USING  PARA-AREA.              
002130*                                                                 
002140     MOVE  PARA-DBSTRING              TO  DB-STRING.              
002150     MOVE  PARA-USERNAME              TO  USERNAME.               
002160     MOVE  PARA-PASSWORD              TO  PASSWD.                 
002170*                                                                 
002180*----------------------------------------------------------------*
002190*    開始接続                                                    *
002200*----------------------------------------------------------------*
002210     IF    DB-STRING  =  SPACE                                    
002220        EXEC SQL                                                  
002230           CONNECT  :USERNAME IDENTIFIED BY :PASSWD               
002240        END-EXEC                                                  
002250     ELSE                                                         
002260        EXEC SQL                                                  
002270           CONNECT  :USERNAME IDENTIFIED BY :PASSWD               
002280             USING  :DB-STRING                                    
002290        END-EXEC                                                  
002300     END-IF.                                                      
002310*                                                                 
002320*----------------------------------------------------------------*
002330*    接続確認                                                    *
002340*----------------------------------------------------------------*
002350     EVALUATE  SQLCODE                                            
002360        WHEN   定数－ＳＱＬＯＫ                                   
002370           CONTINUE                                               
002380        WHEN   OTHER                                              
002390*--<       接続エラー >                                           
002400           MOVE     -10               TO  Ｗ－エラーコード        
002410           PERFORM  エラー判定処理                                
002420     END-EVALUATE.                                                
002430*                                                                 
002440 ＯＲＡＣＬＥ接続－ＥＸＩＴ.                                      
002450******************************************************************
002460*        結合テーブルカーソル定義                                *
002470******************************************************************
002480 結合テーブルカーソル宣言             SECTION.                    
002490 結合テーブルカーソル宣言－ＳＴＡＲＴ.                            
002500*                                                                 
002510*----------------------------------------------------------------*
002520*    カーソルＯＰＥＮ処理                                        *
002530*----------------------------------------------------------------*
002540     EXEC SQL                                                     
002550        DECLARE  CUR1  CURSOR FOR                                 
002560           SELECT   NVL(YOSHINKIHON.管理与信先コード,             
002570                                           RPAD(' ',8,' ')),      
002580                    YOSHINMEISAI.契約ＮＯ,                        
002590                    YOSHINMEISAI.勘定コード,                      
002600                    YOSHINMEISAI.事業所コード,                    
002610                    YOSHINMEISAI.事故日,                          
002620                    YOSHINMEISAI.契約日,                          
002630                    YOSHINMEISAI.検収日,                          
002640                    YOSHINMEISAI.満了日,                          
002650                    YOSHINMEISAI.当債権残,                        
002660                    YOSHINMEISAI.貸付金別口,                      
002670                    YOSHINMEISAI.非稼動資産,                      
002680                    YOSHINMEISAI.貯蔵品,                          
002690                    YOSHINMEISAI.信用保険付保区分,                
002700                    YOSHINMEISAI.信用保険求償,                    
002710                    YOSHINMEISAI.契約金額,                        
002720                    YOSHINMEISAI.入金日,                          
002730                    YOSHINMEISAI.開始回数,                        
002740                    YOSHINMEISAI.明細支払回数,                    
002750                    YOSHINMEISAI.計算方式,                        
002760                    YOSHINMEISAI.請求サイクル,                    
002770                    YOSHINMEISAI.延滞開始日,                      
002780                    YOSHINMEISAI.歯抜けフラグ１,                  
002790                    YOSHINMEISAI.歯抜けフラグ２,                  
002800                    YOSHINMEISAI.ヤクベン区分,                    
002810                    YOSHINMEISAI.残価額,                          
002820                    YOSHINMEISAI.月割Ｌ料,                        
002830                    YOSHINMEISAI.事故債権残,                      
002840                    YOSHINMEISAI.事故元本残,                      
002850                    YOSHINMEISAI.当債権残,                        
002860                    YOSHINMEISAI.当元本残,                        
002870                    YOSHINMEISAI.未収元本,                        
002880                    YOSHINMEISAI.未収利息,                        
002890                    YOSHINMEISAI.未徴収金,                        
002900                    YOSHINMEISAI.Ｂ未徴収金,                      
002910                    YOSHINMEISAI.売却金額,                        
002920                    YOSHINMEISAI.固定利率,                        
002930                    YOSHINMEISAI.金利変動区分,                    
002940                    YOSHINMEISAI.スプレッド,                      
002950                    YOSHINMEISAI.連動金利区分,                    
002960                    NVL(YOSHINKIHON.解約区分, RPAD(' ',1,' ')),   
002970                    YOSHINMEISAI.更新日付                         
002980	            FROM  YOSHINMEISAI,YOSHINKIHON                      
002990             WHERE  YOSHINMEISAI.管理与信先コード =               
003000                                 YOSHINKIHON.管理与信先コード( + )
003010               AND  YOSHINMEISAI.管理与信区分 =                   
003020                                 YOSHINKIHON.管理与信区分( + )    
003030		     AND  YOSHINMEISAI.自動与信区分 =                   
003040                                 YOSHINKIHON.自動与信区分( + )	
003050               AND  YOSHINMEISAI.事故日 = YOSHINKIHON.事故日( + ) 
003060                                                                  
003070     END-EXEC.                                                    
003080*                                                                 
003090*----------------------------------------------------------------*
003100*    カーソルＯＰＥＮ処理                                        *
003110*----------------------------------------------------------------*
003120     EXEC SQL                                                     
003130        OPEN  CUR1                                                
003140     END-EXEC.                                                    
003150*                                                                 
003160*----------------------------------------------------------------*
003170*    カーソルＯＰＥＮ確認                                        *
003180*----------------------------------------------------------------*
003190     EVALUATE  SQLCODE                                            
003200        WHEN  定数－ＳＱＬＯＫ                                    
003210*--<       正常 >                                                 
003220           CONTINUE                                               
003230        WHEN  OTHER                                               
003240*--<       カーソルＯＰＥＮエラー >                               
003250           MOVE -20                  TO  Ｗ－エラーコード         
003260           PERFORM  エラー判定処理                                
003270     END-EVALUATE.                                                
003280*                                                                 
003290 結合テーブルカーソル宣言－ＥＸＩＴ.                              
003300     EXIT.                                                        
003310* *************************************************************** 
003320*                   ファイルオープン.                           * 
003330***************************************************************** 
003340 ファイルオープン                     SECTION.                    
003350 ファイルオープン－ＳＴＡＲＴ.                                    
003360     OPEN  OUTPUT  出カファイル.                                  
003370*----------------------------------------------------------------*
003380*   ファイルオープンＯＰＥＮ確認                                 *
003390*----------------------------------------------------------------*
003400     EVALUATE   Ｗ－状態                                          
003410        WHEN  ZERO                                                
003420*--<       正常 >                                                 
003430           CONTINUE                                               
003440        WHEN  OTHER                                               
003450*--<       カーソルＯＰＥＮエラー >                               
003460           MOVE          -30          TO  Ｗ－エラーコード        
003470           PERFORM  エラー判定処理                                
003480     END-EVALUATE.                                                
003490 ファイルオープン－ＥＸＩＴ.                                      
003500     EXIT.                                                        
003510******************************************************************
003520*    結合テーブルカーソル読込                                    *
003530******************************************************************
003540 結合テーブルカーソル読込             SECTION.                    
003550 結合テーブルカーソル読込－ＳＴＡＲＴ.                            
003560*                                                                 
003570*--< 結合テーブルカーソル読込 >                                   
003580     EXEC SQL                                                     
003590         FETCH  CUR1                                              
003600          INTO :ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード,         
003610               :ＹＯＳＨＩＮＭＥＩＳＡＩ－契約ＮＯ,               
003620               :ＹＯＳＨＩＮＭＥＩＳＡＩ－勘定コード,             
003630               :ＹＯＳＨＩＮＭＥＩＳＡＩ－事業所コード,           
003640               :ＹＯＳＨＩＮＭＥＩＳＡＩ－事故日,                 
003650               :ＹＯＳＨＩＮＭＥＩＳＡＩ－契約日,                 
003660               :ＹＯＳＨＩＮＭＥＩＳＡＩ－検収日,                 
003670               :ＹＯＳＨＩＮＭＥＩＳＡＩ－満了日,                 
003680               :ＹＯＳＨＩＮＭＥＩＳＡＩ－当債権残,               
003690               :ＹＯＳＨＩＮＭＥＩＳＡＩ－貸付金別口,             
003700               :ＹＯＳＨＩＮＭＥＩＳＡＩ－非稼動資産,             
003710               :ＹＯＳＨＩＮＭＥＩＳＡＩ－貯蔵品,                 
003720               :ＹＯＳＨＩＮＭＥＩＳＡＩ－信用保険付保区分,       
003730               :ＹＯＳＨＩＮＭＥＩＳＡＩ－信用保険求償,           
003740               :ＹＯＳＨＩＮＭＥＩＳＡＩ－契約金額,               
003750               :ＹＯＳＨＩＮＭＥＩＳＡＩ－入金日,                 
003760               :ＹＯＳＨＩＮＭＥＩＳＡＩ－開始回数,               
003770               :ＹＯＳＨＩＮＭＥＩＳＡＩ－明細支払回数,           
003780               :ＹＯＳＨＩＮＭＥＩＳＡＩ－計算方式,               
003790               :ＹＯＳＨＩＮＭＥＩＳＡＩ－請求サイクル,           
003800               :ＹＯＳＨＩＮＭＥＩＳＡＩ－延滞開始日,             
003810               :ＹＯＳＨＩＮＭＥＩＳＡＩ－歯抜けフラグ１,         
003820               :ＹＯＳＨＩＮＭＥＩＳＡＩ－歯抜けフラグ２,         
003830               :ＹＯＳＨＩＮＭＥＩＳＡＩ－残価額,                 
003840               :ＹＯＳＨＩＮＭＥＩＳＡＩ－月割Ｌ料,               
003850               :ＹＯＳＨＩＮＭＥＩＳＡＩ－ヤクベン区分,           
003860               :ＹＯＳＨＩＮＭＥＩＳＡＩ－事故債権残,             
003870               :ＹＯＳＨＩＮＭＥＩＳＡＩ－事故元本残,             
003880               :ＹＯＳＨＩＮＭＥＩＳＡＩ－当債権残,               
003890               :ＹＯＳＨＩＮＭＥＩＳＡＩ－当元本残,               
003900               :ＹＯＳＨＩＮＭＥＩＳＡＩ－未収元本,               
003910               :ＹＯＳＨＩＮＭＥＩＳＡＩ－未収利息,               
003920               :ＹＯＳＨＩＮＭＥＩＳＡＩ－未徴収金,               
003930               :ＹＯＳＨＩＮＭＥＩＳＡＩ－Ｂ未徴収金,             
003940               :ＹＯＳＨＩＮＭＥＩＳＡＩ－売却金額,               
003950               :ＹＯＳＨＩＮＭＥＩＳＡＩ－固定利率,               
003960               :ＹＯＳＨＩＮＭＥＩＳＡＩ－金利変動区分,           
003970               :ＹＯＳＨＩＮＭＥＩＳＡＩ－スプレッド,             
003980               :ＹＯＳＨＩＮＭＥＩＳＡＩ－連動金利区分,           
003990               :ＹＯＳＨＩＮＫＩＨＯＮ－解約区分,                 
004000               :ＹＯＳＨＩＮＭＥＩＳＡＩ－更新日付                
004010     END-EXEC.                                                    
004020                                                                  
004030                                                                  
004040*----------------------------------------------------------------*
004050*    結合テーブルカーソル読込を確認                              *
004060*----------------------------------------------------------------*
004070     EVALUATE   SQLCODE                                           
004080        WHEN   定数－ＳＱＬＯＫ                                   
004090*--<       正常 >                                                 
004100               COMPUTE Ｗ－与信基本入力－件数 =                   
004110                               Ｗ－与信基本入力－件数 + 1         
004120               COMPUTE Ｗ－与信明細入力－件数 =                   
004130                               Ｗ－与信明細入力－件数 + 1         
004140        WHEN   定数－ＳＱＬＥＮＤ                                 
004150*--<       読込終了 >                                             
004160           MOVE  "Y"                  TO  Ｗ－終了－フラグ        
004170        WHEN   OTHER                                              
004180*--<       読込エラー >                                           
004190           MOVE     -40               TO  Ｗ－エラーコード        
004200           PERFORM  エラー判定処理                                
004210     END-EVALUATE.                                                
004220*                                                                 
004230 結合テーブルカーソル読込－ＥＸＩＴ.                              
004240     EXIT.                                                        
004250******************************************************************
004260*    主処理                                                      *
004270******************************************************************
004280 主処理                               SECTION.                    
004290 主処理－ＳＴＡＲＴ.                                              
004300*--<与信管理先コード処理>                                         
004310     PERFORM  与信管理先コード処理.                               
004320*                                                                 
004330*--<Ｗ－管理与信先状態  = 'N'結合テーブルカーソル読込>            
004340     IF  Ｗ－管理与信先状態  = 'N'                                
004350         PERFORM  結合テーブルカーソル読込.                       
004360*                                                                 
004370*--<再リース回数処理>                                             
004380     PERFORM  再リース回数処理.                                   
004390                                                                  
004400*--<契約種類主契約区分処理>                                       
004410     PERFORM  契約種類主契約区分処理.                             
004420                                                                  
004430*--<契約先コード処理>                                             
004440     PERFORM  契約先コード処理.                                   
004450                                                                  
004460*--<契約内容処理>                                                 
004470     PERFORM  契約内容処理.                                       
004480                                                                  
004490*--<Ｗ－消費税率処理>                                             
004500     PERFORM  Ｗ－消費税率処理.                                   
004510                                                                  
004520*--<信用保険区分処理>                                             
004530     PERFORM  信用保険区分処理.                                   
004540                                                                  
004550*--<計算方式処理>                                                 
004560     PERFORM  計算方式処理.                                       
004570                                                                  
004580*--<出力編集>                                                     
004590     PERFORM  出力編集.                                           
004600                                                                  
004610*--<出力処理>                                                     
004620     PERFORM  出力処理.                                           
004630                                                                  
004640*--<結合テーブル読込（２件目以降）>                               
004650	   PERFORM   結合テーブル読込２件目以降.                        
004660*                                                                 
004670 主処理－ＥＸＩＴ.                                                
004680     EXIT.                                                        
004690                                                                  
004700******************************************************************
004710*    与信管理先コード処理                                        *
004720***************************************************************** 
004730 与信管理先コード処理                        SECTION.             
004740 与信管理先コード処理－ＳＴＡＲＴ.                                
004750     PERFORM  管理与信先コード処理.                               
004760                                                                  
004770 与信管理先コード処理－ＥＸＩＴ.                                  
004780     EXIT.                                                        
004790******************************************************************
004800* 管理与信先コード処理.                                 NO.1     *
004810****************************************************************  
004820 管理与信先コード処理                   SECTION.                  
004830 管理与信先コード処理－ＳＴＡＲＴ.                                
004840        MOVE   ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード           
004850                                  TO           ＷＳ－管理与信先.  
004860      EVALUATE  ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード          
004870         WHEN   '02683250'                                        
004880                MOVE  '02683233'  TO                              
004890                    ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード      
004900         WHEN   'T2677944'                                        
004910                MOVE  'T2672500'  TO                              
004920                    ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード      
004930         WHEN   'S1519455'                                        
004940                MOVE  'S1519684'  TO                              
004950                    ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード      
004960         WHEN   OTHER                                             
004970*--<変換テーブル処理        >                                     
004980                PERFORM  変換テーブル処理                         
004990      END-EVALUATE.                                               
005000 管理与信先コード処理－ＥＸＩＴ.                                  
005010     EXIT.                                                        
005020******************************************************************
005030* 変換テーブル処理.                                              *
005040****************************************************************  
005050 変換テーブル処理                       SECTION.                  
005060 変換テーブル処理－ＳＴＡＲＴ.                                    
005070       EXEC SQL                                                   
005080         SELECT  新取引先コード,                                  
005090                 取引先コード                                     
005100          INTO   :ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード,       
005110                 :ＩＫＯ００１－取引先コード                      
005120          FROM   IKOTBL001                                        
005130          WHERE  取引先コード =                                   
005140                       :ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード  
005150           AND   目的ＣＤ = '2'                                   
005160                                                                  
005170      END-EXEC.                                                   
005180*----------------------------------------------------------------*
005190*   変換テーブル処理                                              
005200*---------------------------------------------------------------- 
005210     EVALUATE  SQLCODE                                            
005220        WHEN  定数－ＳＱＬＯＫ                                    
005230*--<       正常 >                                                 
005240           CONTINUE                                               
005250        WHEN  OTHER                                               
005260*--<       カーソルＯＰＥＮエラー >                               
005270           DISPLAY  "信先コードと目的ＣＤを表示"                  
005280           DISPLAY ＩＫＯ００１－取引先コード, "="                
005290                   ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード,      
005300                   "目的ＣＤ = '2'"                               
005310           MOVE    'N'       TO         Ｗ－管理与信先状態        
005320     END-EVALUATE.                                                
005330 変換テーブル処理－ＥＸＩＴ.                                      
005340     EXIT.                                                        
005350******************************************************************
005360* 再リース回数処理                                        NO.3   *
005370***************************************************************** 
005380 再リース回数処理                     SECTION.                    
005390 再リース回数処理－ＳＴＡＲＴ.                                    
005400     EXEC SQL                                                     
005410      SELECT   MAX(再リース回数)                                  
005420        INTO  :ＩＫＯ００２－再リース回数                         
005430        FROM  IKOTBL002                                           
005440       WHERE   契約ＮＯ = :ＹＯＳＨＩＮＭＥＩＳＡＩ－契約ＮＯ     
005450        AND   旧債権勘定処理コード =                              
005460                           :ＹＯＳＨＩＮＭＥＩＳＡＩ－勘定コード  
005470     END-EXEC.                                                    
005480*----------------------------------------------------------------*
005490*   再リース回数処理                                             *
005500*---------------------------------------------------------------- 
005510     EVALUATE  SQLCODE                                            
005520        WHEN  定数－ＳＱＬＯＫ                                    
005530*--<       正常 >                                                 
005540           CONTINUE                                               
005550        WHEN  OTHER                                               
005560*--<       カーソルＯＰＥＮエラー >                               
005570           MOVE       -60           TO    Ｗ－エラーコード        
005580           PERFORM  エラー判定処理                                
005590           MOVE       ZERO          TO    出カー再リース回数      
005600     END-EVALUATE.                                                
005610 再リース回数処理－ＥＸＩＴ.                                      
005620     EXIT.                                                        
005630                                                                  
005640******************************************************************
005650*         契約種類主契約区分処理                        NO.4 NO.7*
005660***************************************************************** 
005670 契約種類主契約区分処理                 SECTION.                  
005680 契約種類主契約区分処理－ＳＴＡＲＴ.                              
005690     EXEC SQL                                                     
005700      SELECT   MIN( 契約種類 ),                                   
005710               主契約区分                                         
005720        INTO  :ＩＫＯ００２－契約種類,                            
005730              :ＩＫＯ００２－主契約区分                           
005740        FROM  IKOTBL002                                           
005750       WHERE  再リース回数 = :ＩＫＯ００２－再リース回数          
005760       GROUP BY  主契約区分                                       
005770     END-EXEC.                                                    
005780                                                                  
005790*---------------------------------------------------------------- 
005800*   契約種類主契約区分処理                                  *     
005810*---------------------------------------------------------------- 
005820     EVALUATE  SQLCODE                                            
005830        WHEN  定数－ＳＱＬＯＫ                                    
005840*--<       正常 >                                                 
005850           CONTINUE                                               
005860        WHEN  OTHER                                               
005870*--<       カーソルＯＰＥＮエラー >                               
005880           MOVE       -70           TO    Ｗ－エラーコード        
005890           PERFORM  エラー判定処理                                
005900           MOVE       ZERO          TO   ＩＫＯ００２－契約種類   
005910           MOVE       ZERO          TO   ＩＫＯ００２－契約種類   
005920     END-EVALUATE.                                                
005930 契約種類主契約区分処理－ＥＸＩＴ.                                
005940     EXIT.                                                        
005950******************************************************************
005960*        契約先コード処理                       NO.8*            *
005970******************************************************************
005980 契約先コード処理                       SECTION.                  
005990 契約先コード処理－ＳＴＡＲＴ.                                    
006000       EXEC SQL                                                   
006010         SELECT  枝番                                             
006020          INTO   :ＩＫＯ００１－枝番                              
006030          FROM   IKOTBL001                                        
006040          WHERE  取引先コード = :ＷＳ－管理与信先                 
006050           AND   目的ＣＤ = '2'                                   
006060                                                                  
006070      END-EXEC.                                                   
006080                                                                  
006090*---------------------------------------------------------------- 
006100*   契約先コード処理                                              
006110*---------------------------------------------------------------- 
006120     EVALUATE  SQLCODE                                            
006130        WHEN  定数－ＳＱＬＯＫ                                    
006140*--<       正常 >                                                 
006150           CONTINUE                                               
006160        WHEN  OTHER                                               
006170*--<       カーソルＯＰＥＮエラー >                               
006180           MOVE       -80           TO    Ｗ－エラーコード        
006190           PERFORM  エラー判定処理                                
006200           MOVE       ZERO          TO   ＩＫＯ００１－枝番       
006210     END-EVALUATE.                                                
006220 契約先コード処理－ＥＸＩＴ.                                      
006230     EXIT.                                                        
006240******************************************************************
006250*        契約内容         NO.9  NO.66                            *
006260******************************************************************
006270 契約内容処理                       SECTION.                      
006280 契約内容処理－ＳＴＡＲＴ.                                        
006290      EXEC SQL                                                    
006300         SELECT  契約件名,                                        
006310                 否認区分                                         
006320          INTO   :Ｄ３１－契約件名,                               
006330                 :Ｄ３１－否認区分                                
006340          FROM   D31KYK_TBL                                       
006350          WHERE  契約番号 = :ＹＯＳＨＩＮＭＥＩＳＡＩ－契約ＮＯ   
006360           AND   再リース回数 = :ＩＫＯ００２－再リース回数       
006370       END-EXEC.                                                  
006380                                                                  
006390*---------------------------------------------------------------- 
006400*   契約内容処理                                                  
006410*---------------------------------------------------------------- 
006420     EVALUATE  SQLCODE                                            
006430        WHEN  定数－ＳＱＬＯＫ                                    
006440*--<       正常 >                                                 
006450           COMPUTE   Ｗ－契約内容入力－件数  =                    
006460                              Ｗ－契約内容入力－件数   +   1      
006470        WHEN  OTHER                                               
006480*--<       カーソルＯＰＥＮエラー >                               
006490           MOVE       -90           TO    Ｗ－エラーコード        
006500           PERFORM  エラー判定処理                                
006510     END-EVALUATE.                                                
006520 契約内容処理－ＥＸＩＴ.                                          
006530     EXIT.                                                        
006540                                                                  
006550                                                                  
006560******************************************************************
006570*       Ｗ－消費税率処理                                         *
006580******************************************************************
006590 Ｗ－消費税率処理                       SECTION.                  
006600 Ｗ－消費税率処理－ＳＴＡＲＴ.                                    
006610       EXEC SQL                                                   
006620         SELECT  最新消費税区分                                   
006630          INTO   :Ｄ３２－最新消費税区分                          
006640          FROM   D32SAK_TBL                                       
006650          WHERE  契約番号 = :ＹＯＳＨＩＮＭＥＩＳＡＩ－契約ＮＯ   
006660           AND   再リース回数 = :ＩＫＯ００２－再リース回数       
006670           AND   契約種類  = :ＩＫＯ００２－契約種類              
006680                                                                  
006690      END-EXEC.                                                   
006700                                                                  
006710*---------------------------------------------------------------- 
006720*   Ｗ－消費税率処理                                              
006730*---------------------------------------------------------------- 
006740     EVALUATE  SQLCODE                                            
006750        WHEN  定数－ＳＱＬＯＫ                                    
006760*--<       正常 >                                                 
006770              COMPUTE   Ｗ－債権入力－件数       =                
006780                            Ｗ－債権入力－件数      +   1         
006790              EVALUATE  Ｄ３２－最新消費税区分                    
006800                 WHEN   '11'                                      
006810                        MOVE   0.03   TO     Ｗ－消費税率         
006820                 WHEN   '12'                                      
006830                        MOVE   0.05   TO     Ｗ－消費税率         
006840                 WHEN  OTHER                                      
006850                        MOVE   0      TO     Ｗ－消費税率         
006860              END-EVALUATE                                        
006870        WHEN  OTHER                                               
006880*--<       カーソルＯＰＥＮエラー >                               
006890           MOVE       -100           TO    Ｗ－エラーコード       
006900           MOVE       0.05           TO    Ｗ－消費税率           
006910           PERFORM  エラー判定処理                                
006920     END-EVALUATE.                                                
006930 Ｗ－消費税率処理－ＥＸＩＴ.                                      
006940     EXIT.                                                        
006950******************************************************************
006960*       信用保険区分処理                             NO.23       *
006970***************************************************************** 
006980 信用保険区分処理                     SECTION.                    
006990 信用保険区分－ＳＴＡＲＴ.                                        
007000       EVALUATE  ＹＯＳＨＩＮＭＥＩＳＡＩ－信用保険付保区分       
007010        WHEN  '0'                                                 
007020*--<       正常 >                                                 
007030              CONTINUE                                            
007040        WHEN  OTHER                                               
007050*--<       カーソルＯＰＥＮエラー >                               
007060           MOVE          '1'         TO                           
007070                       ＹＯＳＨＩＮＭＥＩＳＡＩ－信用保険付保区分 
007080      END-EVALUATE.                                               
007090 信用保険区分処理－ＥＸＩＴ.                                      
007100     EXIT.                                                        
007110******************************************************************
007120*       計算方式処理                             NO.29           *
007130***************************************************************** 
007140 計算方式処理                         SECTION.                    
007150 計算方式処理－ＳＴＡＲＴ.                                        
007160       EVALUATE  ＹＯＳＨＩＮＭＥＩＳＡＩ－計算方式               
007170        WHEN  '0'                                                 
007180*--<       '0' >                                                  
007190               MOVE       '1'       TO                            
007200                                ＹＯＳＨＩＮＭＥＩＳＡＩ－計算方式
007210        WHEN  '1'                                                 
007220*--<       '1' >                                                  
007230               EVALUATE   ＹＯＳＨＩＮＭＥＩＳＡＩ－請求サイクル  
007240                  WHEN   '012'                                    
007250                          MOVE     '0'       TO                   
007260                            ＹＯＳＨＩＮＭＥＩＳＡＩ－請求サイクル
007270                  WHEN  OTHER                                     
007280                          MOVE     '2'       TO                   
007290                            ＹＯＳＨＩＮＭＥＩＳＡＩ－請求サイクル
007300               END-EVALUATE                                       
007310          WHEN  '2'                                               
007320*--<       '2' >                                                  
007330                 CONTINUE                                         
007340                                                                  
007350      END-EVALUATE.                                               
007360 計算方式処理－ＥＸＩＴ.                                          
007370     EXIT.                                                        
007380******************************************************************
007390*     出力編集	                                               *
007400***************************************************************** 
007410 出力編集                               SECTION.                  
007420 出力編集－ＳＴＡＲＴ.                                            
007430*NO.1                                                             
007440       MOVE   ＹＯＳＨＩＮＫＩＨＯＮ－管理与信先コード     TO     
007450                                      出カー与信管理先コード.     
007460*N0.2                                                             
007470       MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－契約ＮＯ           TO     
007480                                      出カー契約番号.             
007490*NO.3                                                             
007500       MOVE   ＩＫＯ００２－再リース回数                   TO     
007510                                      出カー再リース回数.         
007520*NO.4                                                             
007530       MOVE   ＩＫＯ００２－契約種類                       TO     
007540                                      出カー契約種類.             
007550*NO.5                                                             
007560       MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－勘定コード         TO     
007570                                      出カー勘定処理コード.       
007580*N0.6                                                             
007590       MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－事業所コード       TO     
007600                                      出カー部課コード.           
007610*NO.7                                                             
007620       MOVE   ＩＫＯ００２－主契約区分                     TO     
007630                                      出カー主契約区分.           
007640*NO.8                                                             
007650       MOVE   ＩＫＯ００１－枝番                           TO     
007660                                      出カー契約先コード.         
007670*NO.9                                                             
007680       MOVE   Ｄ３１－契約件名                             TO     
007690                                      出カー契約件名.             
007700*NO.10                                                            
007710       MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－事故日             TO     
007720                                      出カー取引年月日.           
007730*NO.11                                                            
007740       MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－契約日             TO     
007750                                      出カー契約年月日.           
007760*NO.12                                                            
007770       MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－検収日             TO     
007780                                      出カー検収年月日.           
007790*NO.13                                                            
007800       MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－満了日             TO     
007810                                      出カー満了年月日.           
007820*NO.14                                                            
007830       MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－当債権残           TO     
007840                                      出カー対外債権残高.         
007850*NO.15                                                            
007860       COMPUTE   出カー対外債権残高消費税  =  Ｗ－消費税率  *     
007870                              ＹＯＳＨＩＮＭＥＩＳＡＩ－当債権残 .
007880*NO.16                                                            
007890       MOVE            ZERO           TO        出カー前受金残高. 
007900*NO.17                                                            
007910       MOVE            ZERO           TO   出カー前受金残高消費税.
007920*NO.18                                                            
007930       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－貸付金別口       TO      
007940                                      出カー貸付金別口.           
007950*NO.19                                                            
007960       COMPUTE  出カー貸付金別口消費税  =   Ｗ－消費税率     *    
007970                             ＹＯＳＨＩＮＭＥＩＳＡＩ－貸付金別口.
007980*NO.20                                                            
007990       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－非稼動資産,      TO      
008000                                       出カー非稼働資産.          
008010*NO.21                                                            
008020       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－貯蔵品           TO      
008030                                       出カー貯蔵品.              
008040*NO.22                                                            
008050       MOVE            ZERO           TO           出カー担保残高.
008060*NO.23                                                            
008070       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－信用保険付保区分 TO      
008080                                       出カー信用保険区分.        
008090*NO.24                                                            
008100       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－信用保険求償     TO      
008110                                       出カー信用保険求償.        
008120*NO.25                                                            
008130       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－契約金額         TO      
008140                                       出カー契約金額.            
008150*NO.26                                                            
008160       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－入金日           TO      
008170                                       出カー入金日.              
008180*NO.27                                                            
008190       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－開始回数         TO      
008200                                       出カー開始回数.            
008210*NO.28                                                            
008220       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－明細支払回数     TO      
008230                                       出カー明細支払回数.        
008240*NO.29                                                            
008250       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－計算方式,        TO      
008260                                       出カー計算方式.            
008270*NO.30                                                            
008280       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－請求サイクル     TO      
008290                                       出カー請求サイクル.        
008300*NO.31                                                            
008310       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－延滞開始日       TO      
008320                                       出カー延滞開始年月日.      
008330*NO.32                                                            
008340       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－歯抜けフラグ１   TO      
008350                                       出カー歯抜フラグ１.        
008360*NO.33                                                            
008370       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－歯抜けフラグ２   TO      
008380                                       出カー歯抜フラグ２.        
008390*NO.34                                                            
008400       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－残価額           TO      
008410                                       出カー残価額.              
008420*NO.35                                                            
008430       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－月割Ｌ料         TO      
008440                                       出カー月割Ｌ料.            
008450*NO.36                                                            
008460       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－ヤクベン区分     TO      
008470                                       出カー約弁区分.            
008480*NO.37                                                            
008490       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－事故債権残       TO      
008500                                       出カー事故債権残.          
008510*NO.38                                                            
008520       COMPUTE  出カー事故債権残消費税  =  Ｗ－消費税率  *        
008530                            ＹＯＳＨＩＮＭＥＩＳＡＩ－事故債権残. 
008540*NO.39                                                            
008550       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－事故元本残       TO      
008560                                       出カー事故元本残.          
008570*NO.40                                                            
008580       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－当債権残         TO      
008590                                       出カー当月末債権残.        
008600*NO.41                                                            
008610       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－当元本残         TO      
008620                                       出カー当月末元本残.        
008630*NO.42                                                            
008640       MOVE            ZERO           TO    出カーＮ当月末債権残. 
008650*NO.43                                                            
008660       MOVE            ZERO           TO    出カーＮ当月末元本残. 
008670*NO.44                                                            
008680       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－未収元本         TO      
008690                                       出カー未収元本.            
008700*NO.45                                                            
008710       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－未収利息         TO      
008720                                       出カー未収利息.            
008730*NO.46                                                            
008740       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－未徴収金         TO      
008750                                       出カー未徴収金.            
008760*NO.47                                                            
008770       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－Ｂ未徴収金       TO      
008780                                       出カーＢ未徴収金.          
008790*NO.48                                                            
008800       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－売却金額         TO      
008810                                       出カー売却金額.            
008820*NO.49                                                            
008830       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－固定利率         TO      
008840                                       出カー固定利率.            
008850*NO.50                                                            
008860       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－金利変動区分     TO      
008870                                       出カー金利変動区分.        
008880*NO.51                                                            
008890       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－スプレッド       TO      
008900                                       出カースプレッド.          
008910*NO.52                                                            
008920       MOVE    ＹＯＳＨＩＮＭＥＩＳＡＩ－連動金利区分     TO      
008930                                       出カー連動金利区分.        
008940*NO.53                                                            
008950       MOVE           SPACE          TO        出カー備考.        
008960*NO.54                                                            
008970       MOVE           ZERO           TO        出カー対外元本残高.
008980*NO.55                                                            
008990       MOVE   出カー対外債権残高     TO                           
009000                                         出カー前月末対外債権残高.
009010*NO.56                                                            
009020      MOVE  出カー対外債権残高消費税 TO                           
009030                                   出カー前月末対外債権残高消費税.
009040*NO.57                                                            
009050      MOVE  出カー当月末元本残       TO                           
009060                                   出カー前月末対外元本残高.      
009070*NO.58                                                            
009080      MOVE  出カー前受金残高         TO   出カー前月末前受金残高. 
009090*NO.59                                                            
009100      MOVE  出カー前月末前受金残高   TO                           
009110                                    出カー前月末前受金残高消費税. 
009120*NO.60                                                            
009130      MOVE  出カー貸付金別口         TO   出カー前月末貸付金別口. 
009140*NO.61                                                            
009150      MOVE  出カー貸付金別口消費税   TO                           
009160                                     出カー前月末貸付金別口消費税.
009170*NO.62                                                            
009180      MOVE  出カー非稼働資産         TO   出カー前月末非稼働資産. 
009190*NO.63                                                            
009200      MOVE  出カー貯蔵品             TO   出カー前月末貯蔵品.     
009210*NO.64                                                            
009220      MOVE        '9'                TO   出カー解約理由.         
009230*NO.65                                                            
009240      MOVE  ＹＯＳＨＩＮＫＩＨＯＮ－解約区分         TO           
009250                                          出カー解約区分.         
009260*NO.66                                                            
009270      MOVE  Ｄ３１－否認区分         TO   出カー否認区分.         
009280*NO.67                                                            
009290      COMPUTE   出カー当月末債権残高消費税  =  Ｗ－消費税率  *    
009300                             ＹＯＳＨＩＮＭＥＩＳＡＩ－当債権残 . 
009310*NO.68                                                            
009320      COMPUTE   出カー未徴収金消費税        =  Ｗ－消費税率  *    
009330                             ＹＯＳＨＩＮＭＥＩＳＡＩ－未徴収金.  
009340*NO.69                                                            
009350      MOVE   Ｗ－年月日              TO    出カー登録年月日.      
009360*NO.70                                                            
009370      MOVE   Ｗ－システム時刻        TO    出カー登録時間.        
009380*NO.71                                                            
009390      MOVE   Ｗ－担当者              TO    出カー登録担当者.      
009400*NO.72                                                            
009410      MOVE   ＹＯＳＨＩＮＭＥＩＳＡＩ－更新日付       TO          
009420                                           出カー更新年月日.      
009430*NO.73                                                            
009440      MOVE   Ｗ－システム時刻        TO    出カー更新時間.        
009450*NO.74                                                            
009460      MOVE   Ｗ－担当者              TO    出カー更新者.          
009470*NO.75                                                            
009480      MOVE   Ｗ－担当者              TO    出カー入力担当者コード.
009490 出力編集－ＥＸＩＴ.                                              
009500     EXIT.                                                        
009510                                                                  
009520******************************************************************
009530*     出力処理	                                               *
009540***************************************************************** 
009550 出力処理                              SECTION.                   
009560 出力処理－ＳＴＡＲＴ.                                            
009570*                                                                 
009580     WRITE  出カーレコード.                                       
009590*                                                                 
009600*--< 出力処理の状態判定 >                                         
009610     EVALUATE  Ｗ－状態                                           
009620        WHEN  ZERO                                                
009630*--<       出力処理の加算 >                                       
009640           COMPUTE   Ｗ－出力－件数  =  Ｗ－出力－件数  + 1       
009650        WHEN  OTHER                                               
009660*--<       ファイル出力エラー >                                   
009670           MOVE     -110                TO  Ｗ－エラーコード      
009680           PERFORM  エラー判定処理                                
009690     END-EVALUATE.                                                
009700 出力処理－ＥＸＩＴ.                                              
009710     EXIT.                                                        
009720******************************************************************
009730*   結合テーブル読込（２件目以降                                 *
009740******************************************************************
009750 結合テーブル読込２件目以降             SECTION.                  
009760 結合テーブル読込２件目以降－ＳＴＡＲＴ.                          
009770      PERFORM  結合テーブルカーソル読込.                          
009780 結合テーブル読込２件目以降－ＥＸＩＴ.                            
009790     EXIT.                                                        
009800******************************************************************
009810*    終了処理                                                    *
009820******************************************************************
009830 終了処理                             SECTION.                    
009840 終了処理－ＳＴＡＲＴ.                                            
009850*                                                                 
009860     PERFORM  ＤＢクローズ処理.                                   
009870*                                                                 
009880     PERFORM  ファイルクローズ処理.				
009890                                                                  
009900     PERFORM  件数メッセージ出力.					
009910                                                                  
009920*                                                                 
009930     PERFORM  終了メッセージ出力.                                 
009940*                                                                 
009950*--< プログラム正常終了 >                                         
009960     MOVE  定数－正常状態             TO  PROGRAM-STATUS.         
009970*                                                                 
009980 終了処理－ＥＸＩＴ.                                              
009990     EXIT.                                                        
010000******************************************************************
010010*    終了メッセージ出力                                          *
010020******************************************************************
010030 終了メッセージ出力                   SECTION.                    
010040 終了メッセージ出力－ＳＴＡＲＴ.                                  
010050*                                                                 
010060*----------------------------------------------------------------*
010070*    終了メッセージ出力                                          *
010080*----------------------------------------------------------------*
010090     INITIALIZE                       IF-CHOCO001.                
010100     MOVE  "3"                        TO  共１－イベント種別.     
010110     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
010120     MOVE  "ZERO"                     TO  共１－復帰コード.       
010130     MOVE  "END"                      TO  共１－処理識別.         
010140     MOVE  "プログラム処理終了メッセージ"				
010150                                      TO  共１－その他メッセージ. 
010160     CALL  CLOCO001                USING  IF-CHOCO001.            
010170*                                                                 
010180 終了メッセージ出力－ＥＸＩＴ.                                    
010190     EXIT.                                                        
010200******************************************************************
010210*    ＤＢクローズ                                                *
010220******************************************************************
010230 ＤＢクローズ処理                     SECTION.                    
010240 ＤＢクローズ処理－ＳＴＡＲＴ.                                    
010250*                                                                 
010260*--< カーソル クローズ >                                          
010270     EXEC SQL                                                     
010280        CLOSE  CUR1                                               
010290     END-EXEC.                                                    
010300*                                                                 
010310 ＤＢクローズ処理－ＥＸＩＴ.                                      
010320     EXIT.                                                        
010330******************************************************************
010340*       ファイルクローズ処理.                                    *
010350******************************************************************
010360 ファイルクローズ処理                   SECTION.                  
010370 ファイルクローズ処理－ＳＴＡＲＴ.                                
010380      CLOSE  出カファイル.                                        
010390                                                                  
010400 ファイルクローズ処理－ＥＸＩＴ.                                  
010410     EXIT.                                                        
010420******************************************************************
010430*       件数メッセージ出力.                                 *     
010440******************************************************************
010450 件数メッセージ出力                   SECTION.                    
010460 件数メッセージ出力－ＳＴＡＲＴ.                                  
010470*----------------------------------------------------------------*
010480*   与信基本入力 件数メッセージ入力処理                          *
010490*----------------------------------------------------------------*
010500     INITIALIZE                       IF-CHOCO001.                
010510     MOVE  "3"                        TO  共１－イベント種別.     
010520     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
010530     MOVE  "ZERO"                     TO  共１－復帰コード.       
010540     MOVE  "YOSHINON"                 TO  共１－処理テーブルＩＤ. 
010550     MOVE  "COUNT"                    TO  共１－処理識別.         
010560     MOVE  Ｗ－与信基本入力－件数   TO  共１－データ内容.         
010570     MOVE  "与信(基本)読込件数"                                   
010580                                      TO  共１－その他メッセージ. 
010590     CALL  CLOCO001                  USING  IF-CHOCO001.          
010600*----------------------------------------------------------------*
010610*   与信明細入力 件数メッセージ入力処理                          *
010620*---------------------------------------------------------------- 
010630     INITIALIZE                       IF-CHOCO001.                
010640     MOVE  "3"                        TO  共１－イベント種別.     
010650     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
010660     MOVE  "ZERO"                     TO  共１－復帰コード.       
010670     MOVE  "YOSHINAI"                 TO  共１－処理テーブルＩＤ. 
010680     MOVE  "COUNT"                    TO  共１－処理識別.         
010690     MOVE  Ｗ－与信明細入力－件数    TO  共１－データ内容.        
010700     MOVE  "与信(明細)読込件数"                                   
010710                                       TO  共１－その他メッセージ.
010720     CALL  CLOCO001                  USING  IF-CHOCO001.          
010730*----------------------------------------------------------------*
010740*   契約内容入力 件数メッセージ入力処理                          *
010750*---------------------------------------------------------------- 
010760     INITIALIZE                       IF-CHOCO001.                
010770     MOVE  "3"                        TO  共１－イベント種別.     
010780     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
010790     MOVE  "ZERO"                     TO  共１－復帰コード.       
010800     MOVE  "D31KYK"                   TO  共１－処理テーブルＩＤ. 
010810     MOVE  "COUNT"                    TO  共１－処理識別.         
010820     MOVE  Ｗ－契約内容入力－件数     TO  共１－データ内容.       
010830     MOVE  "契約内容読込件数"                                     
010840                                       TO  共１－その他メッセージ.
010850     CALL  CLOCO001                  USING  IF-CHOCO001.          
010860*----------------------------------------------------------------*
010870*   債権入力 件数メッセージ入力処理                              *
010880*---------------------------------------------------------------- 
010890     INITIALIZE                       IF-CHOCO001.                
010900     MOVE  "3"                        TO  共１－イベント種別.     
010910     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
010920     MOVE  "ZERO"                     TO  共１－復帰コード.       
010930     MOVE  "K32SAK"                   TO  共１－処理テーブルＩＤ. 
010940     MOVE  "COUNT"                    TO  共１－処理識別.         
010950     MOVE  Ｗ－債権入力－件数         TO  共１－データ内容.       
010960     MOVE  "債権読込件数"                                         
010970                                       TO  共１－その他メッセージ.
010980     CALL  CLOCO001                  USING  IF-CHOCO001.          
010990*----------------------------------------------------------------*
011000*    件数メッセージ出力処理                                      *
011010*----------------------------------------------------------------*
011020     INITIALIZE                       IF-CHOCO001.                
011030     MOVE  "3"                        TO  共１－イベント種別.     
011040     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
011050     MOVE  "ZERO"                     TO  共１－復帰コード.    
011060     MOVE  "FFUIS660"                 TO  共１－処理テーブルＩＤ. 
011070     MOVE  "COUNT"                    TO  共１－処理識別.         
011080     MOVE  Ｗ－出力－件数             TO  共１－データ内容.       
011090     MOVE  "管理与信契約(PS)出力件数"                             
011100                                      TO  共１－その他メッセージ. 
011110     CALL  CLOCO001                USING  IF-CHOCO001.            
011120 件数メッセージ出力－ＥＸＩＴ.                                    
011130     EXIT.                                                        
011140                                                                  
011150******************************************************************
011160*    エラー処理                                                  *
011170******************************************************************
011180 エラー判定処理                       SECTION.                    
011190 エラー判定処理－ＳＴＡＲＴ.                                      
011200*                                                                 
011210     MOVE  "Y"                        TO Ｗ－異常終了－フラグ.    
011220     INITIALIZE                           IF-CHOCO001.            
011230*                                                                 
011240     EVALUATE  Ｗ－エラーコード                                   
011250        WHEN  -10                                                 
011260*--<       ＯＲＡＣＬＥ接続失敗 >                                 
011270           MOVE  "1"                  TO  共１－イベント種別      
011280           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
011290           MOVE  "9"                  TO  共１－復帰コード        
011300           MOVE  "CONNECT"            TO  共１－処理識別          
011310           MOVE  SQLCODE              TO  共１－データ内容        
011320           MOVE  SQLERRMC             TO  共１－その他メッセージ  
011330           CALL  CLOCO001          USING  IF-CHOCO001             
011340*                                                                 
011350                                                                  
011360                                                                  
011370        WHEN   -20                                                
011380*--<結合テーブルカーソル宣言失敗  >                               
011390           MOVE  "1"                  TO  共１－イベント種別      
011400           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
011410           MOVE  "9"                  TO  共１－復帰コード        
011420           MOVE  "YOSHISAI"           TO  共１－処理テーブルＩＤ  
011430           MOVE  "OPEN"               TO  共１－処理識別          
011440           MOVE  SQLCODE              TO  共１－データ内容        
011450           MOVE  SQLERRMC             TO  共１－その他メッセージ  
011460           CALL  CLOCO001          USING  IF-CHOCO001             
011470*                                                                 
011480        WHEN  -30                                                 
011490*--<   ファイルオープン失敗 >                                     
011500           MOVE  "1"                  TO  共１－イベント種別      
011510           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
011520           MOVE  "9"                  TO  共１－復帰コード        
011530           MOVE  "FFUIS660"           TO  共１－処理テーブルＩＤ  
011540           MOVE  "OPEN"               TO  共１－処理識別          
011550           MOVE   Ｗ－状態            TO  共１－データ内容        
011560           MOVE   "ファイルオープン失敗 "                         
011570                                      TO  共１－その他メッセージ  
011580           CALL  CLOCO001          USING  IF-CHOCO001             
011590*                                                                 
011600        WHEN  -40                                                 
011610*--<  結合テーブルカーソル読込失敗     >                          
011620           MOVE  "1"                  TO  共１－イベント種別      
011630           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
011640           MOVE  "9"                  TO  共１－復帰コード        
011650           MOVE  "YOSHSAI"            TO  共１－処理テーブルＩＤ  
011660           MOVE  "FETCH"              TO  共１－処理識別          
011670           MOVE  SQLCODE              TO  共１－データ内容        
011680           MOVE  SQLERRMC             TO  共１－その他メッセージ  
011690           CALL  CLOCO001          USING  IF-CHOCO001             
011700*                                                                 
011710*                                                                 
011720         WHEN  -60                                                
011730*--<     再リース回数処理失敗 >                                   
011740           MOVE  "2"                  TO  共１－イベント種別      
011750           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
011760           MOVE  "9"                  TO  共１－復帰コード        
011770           MOVE  "IKO002"             TO  共１－処理テーブルＩＤ  
011780           MOVE  "SELECT"             TO  共１－処理識別          
011790           MOVE  SQLCODE              TO  共１－データ内容        
011800           MOVE  SQLERRMC             TO  共１－その他メッセージ  
011810           CALL  CLOCO001          USING  IF-CHOCO001             
011820           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
011830                                                                  
011840*                                                                 
011850         WHEN  -70                                                
011860*--<   契約種類処理処理失敗 >                                     
011870           MOVE  "2"                  TO  共１－イベント種別      
011880           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
011890           MOVE  "9"                  TO  共１－復帰コード        
011900           MOVE  "IKO002"             TO  共１－処理テーブルＩＤ  
011910           MOVE  "SELECT"             TO  共１－処理識別          
011920           MOVE  SQLCODE              TO  共１－データ内容        
011930           MOVE  SQLERRMC             TO  共１－その他メッセージ  
011940           CALL  CLOCO001          USING  IF-CHOCO001             
011950           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
011960*                                                                 
011970         WHEN  -80                                                
011980*--<契約先コード処理失敗 >                                        
011990           MOVE  "2"                  TO  共１－イベント種別      
012000           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
012010           MOVE  "9"                  TO  共１－復帰コード        
012020           MOVE  "IKOTL001"           TO  共１－処理テーブルＩＤ  
012030           MOVE  "SELECT"             TO  共１－処理識別          
012040           MOVE  SQLCODE              TO  共１－データ内容        
012050           MOVE  SQLERRMC             TO  共１－その他メッセージ  
012060           CALL  CLOCO001          USING  IF-CHOCO001             
012070          MOVE  "N"                  TO Ｗ－異常終了－フラグ      
012080                                                                  
012090         WHEN  -90                                                
012100*--<    契約内容 処理失敗 >                                       
012110           MOVE  "2"                  TO  共１－イベント種別      
012120           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
012130           MOVE  "9"                  TO  共１－復帰コード        
012140           MOVE  "D31KYK"             TO  共１－処理テーブルＩＤ  
012150           MOVE  "SELECT"             TO  共１－処理識別          
012160           MOVE  SQLCODE              TO  共１－データ内容        
012170           MOVE  SQLERRMC             TO  共１－その他メッセージ  
012180           CALL  CLOCO001          USING  IF-CHOCO001             
012190           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
012200                                                                  
012210         WHEN  -100                                               
012220*--<    Ｗ－消費税率処理失敗 >                                    
012230           MOVE  "2"                  TO  共１－イベント種別      
012240           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
012250           MOVE  "9"                  TO  共１－復帰コード        
012260           MOVE  "D32SAK"             TO  共１－処理テーブルＩＤ  
012270           MOVE  "SELECT"             TO  共１－処理識別          
012280           MOVE  SQLCODE              TO  共１－データ内容        
012290           MOVE  SQLERRMC             TO  共１－その他メッセージ  
012300           CALL  CLOCO001          USING  IF-CHOCO001             
012310           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
012320                                                                  
012330         WHEN  -110                                               
012340*--< WTITEファイル 処理失敗 >                                     
012350           MOVE  "1"                  TO  共１－イベント種別      
012360           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
012370           MOVE  "9"                  TO  共１－復帰コード        
012380           MOVE  "FFUIS660"           TO  共１－処理テーブルＩＤ  
012390           MOVE  "WRITE"              TO  共１－処理識別          
012400           MOVE   Ｗ－状態            TO  共１－データ内容        
012410           MOVE   "WTITEファイル失敗"                             
012420                                      TO 共１－その他メッセージ   
012430           CALL  CLOCO001          USING  IF-CHOCO001             
012440                                                                  
012450*                                                                 
012460        WHEN  OTHER                                               
012470           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
012480     END-EVALUATE.                                                
012490*                                                                 
012500     IF Ｗ－異常終了－フラグ  =  "Y"                              
012510*                                                                 
012520        PERFORM  件数メッセージ出力				
012530        PERFORM  終了メッセージ出力                               
012540*                                                                 
012550*--<    プログラム異常終了のリターンコード >                      
012560        MOVE  定数－異常状態          TO  PROGRAM-STATUS          
012570*                                                                 
012580        EXIT  PROGRAM                                             
012590     END-IF.                                                      
012600*                                                                 
012610 エラー判定処理－ＥＸＩＴ.                                        
012620     EXIT.                                                        
012630******************************************************************
012640*                  END OF PROGRAM                                *
012650******************************************************************
