000010*****************************************************************
000020* ¥ÌŒÛ–≈œ¢
000030*****************************************************************
000040 01 ERRORMSG.
           03 ERRMSGPOINT               PIC  999.
000050     03 ERRMSGSQLCD               PIC S9(9).
           03 ERRMSG                    PIC X(50).


