      *****************************************************************
      *程序ID         ：STinfo
      *程序名         ：学生学籍信息
      *
      *日期           作成者            概要
      *2007/03/18     张丽娟            作成
      *
      *****************************************************************
000040 01 STinfo.
           03 SNO                           PIC  9(06).
           03 SCOLLEGIAN                    PIC  9(06).
000040     03 SNAME                         PIC  X(10).
000040     03 SSEX                          PIC  X(02).
           03 SAGE                          PIC  9(02).