      *****************************************************************
      *程序ID         ：STscore
      *程序名         ：学生成绩信息
      *
      *日期           作成者            概要
      *2007/03/18     张丽娟            作成
      *
      *****************************************************************
000040 01 STscore.
           03 SNO                           PIC  9(06).
           03 Scourse                       PIC  9(06).
000040     03 SScore                        PIC  9(03).
