 IDENTIFICATION DIVISION.                                                       
*PATTERN-ID.     REPORT  "P".                                                   
 PROGRAM-ID.     JFU225P.                                                       
 AUTHOR.         QNES HAKU.                                                     
 DATE-WRITTEN.     -  -  .                                                      
*UPDATE-WRITTEN.   -  -   REV.                                                  
 DATE-COMPILED.                                                                 
*                                                                               
*    児童扶養手当　受給者台帳                                                   
*                                                                               
 ENVIRONMENT DIVISION.                                                          
 CONFIGURATION SECTION.                                                         
 SOURCE-COMPUTER.    ACOS-77.                                                   
 OBJECT-COMPUTER.    ACOS-77.                                                   
 INPUT-OUTPUT SECTION.                                                          
 FILE-CONTROL.                                                                  
*    受給資格マスタ＋請求者マスタ                                               
     SELECT INP1-FILE  ASSIGN  IND1-DS.                           ｼﾞｭｷｭｳ        
*    住記リンク一時ファイル                                                     
     SELECT INP2-FILE  ASSIGN  IND2-DS                            ｼﾞｭｷ          
                       ORGANIZATION     INDEXED                                 
                       ACCESS           RANDOM                                  
                       RECORD           INP2-KEY                                
                       STATUS         S-INP2-STATUS.                            
*    新金融機関ファイル                                                         
     SELECT INP3-FILE  ASSIGN  IND3-RDB  IND3AP-RDB               ｷﾝﾕｳｷｶﾝ       
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP3-KEY                                 
             ALTERNATE RECORD  KEY     INP3-ACP                                 
                       STATUS        S-INP3-STATUS.                             
*    申請届出マスタ                                                             
     SELECT INP4-FILE  ASSIGN  IND4-RDB  IND4AP-RKEY              ｼﾝｾｲﾄﾄﾞｹ      
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP4-ACP                                 
                       STATUS        S-INP4-STATUS.                             
*    対象児童マスタ                                                             
     SELECT INP5-FILE  ASSIGN  IND5-RDB  IND5AP-RKEY              ｼﾞﾄﾞｳ         
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP5-ACP                                 
                       STATUS        S-INP5-STATUS.                             
*    所得判定マスタ                                                             
     SELECT INP6-FILE  ASSIGN  IND6-RDB  IND6AP1-RKEY             ｼｮﾄｸ          
                                         IND6AP2-RDB                            
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP6-ACP1                                
             ALTERNATE RECORD  KEY     INP6-ACP2                                
                       STATUS        S-INP6-STATUS.                             
*    年度支給マスタ                                                             
     SELECT INP7-FILE  ASSIGN  IND7-RDB  IND7AP-RKEY              ﾈﾝﾄﾞｼｷｭｳ      
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP7-ACP                                 
                       STATUS        S-INP7-STATUS.                             
*    支払履歴マスタ                                                             
     SELECT INP8-FILE ASSIGN  IND8-RDB  IND8AP-RKEY               ﾈﾝﾄﾞｼｷｭｳ      
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP8-ACP                                 
                       STATUS        S-INP8-STATUS.                             
*    コードファイル                                                             
     SELECT INP9-FILE ASSIGN  IND9-RDB  IND9AP-RKEY               ｺｰﾄﾞ          
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP9-ACP                                 
                       STATUS        S-INP9-STATUS.                             
*    手当計算ファイル                                                           
     SELECT INP10-FILE ASSIGN  IND10-RDB                          ﾃｱﾃｹｲｻﾝ       
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP10-KEY                                
                       STATUS        S-INP10-STATUS.                            
*    福祉総合口座情報ファイル                                                   
     SELECT INP11-FILE ASSIGN  IND11-RDB                          ｿｳｺﾞｳ         
                       ORGANIZATION    INDEXED                                  
                       ACCESS  MODE    DYNAMIC                                  
                       RECORD  KEY     INP11-KEY                                
                       STATUS        S-INP11-STATUS.                            
*    受給者台帳                                                                 
     SELECT OUT1-FILE ASSIGN PR01-USEROUT.                        ﾌﾟﾘﾝﾄF        
 I-O-CONTROL .                                                                  
     APPLY SHIFT-CODE ON OUT1-FILE                                              
                         WITH PPR-CONTROL-1.                                    
/                                                                               
 DATA DIVISION.                                                                 
 FILE SECTION.                                                                  
/                                                                               
*    受給資格マスタ＋請求者マスタ                                               
 FD  INP1-FILE                                                                  
         BLOCK    10  RECORDS                                                   
         RECORD  500  CHARACTERS                                                
         LABEL RECORD STANDARD.                                                 
******************************                                                  
* INP1-FILE, INP1-KEY RECORD *                                                  
******************************                                                  
 01  INP1-REC.                                                                  
     02  FIL         PIC X(2).                                                  
     02  INP1-KEY01  PIC 9(10).                                                 
     02  FIL         PIC X(488).                                                
**************************                                                      
* INP1-FILE, DATA RECORD *                                                      
**************************                                                      
 01  INP1-REC1.                                                                 
     COPY JFUJQSK.                                                              
     COPY JFUSEIQ.                                                              
/                                                                               
*    住記リンク一時ファイル                                                     
 FD  INP2-FILE                                                                  
         BLOCK    14 RECORDS                                                    
         RECORD  550 CHARACTERS                                                 
         LABEL RECORD STANDARD.                                                 
******************************                                                  
* INP2-FILE, INP2-KEY RECORD *                                                  
******************************                                                  
 01  INP2-REC.                                                                  
     03  FIL         PIC X(8).                                                  
     03  INP2-KEY    PIC X(7).                                                  
     03  FIL         PIC X(535).                                                
**************************                                                      
* INP2-FILE, DATA RECORD *                                                      
**************************                                                      
 01  INP2-REC1.                                                                 
     COPY YHLB15.                                                               
/                                                                               
*    新金融機関ファイル                                                         
 FD  INP3-FILE                                                                  
         LABEL RECORD STANDARD.                                                 
*****************************                                                   
* INP3-FILE INP3-KEY RECORD *                                                   
*****************************                                                   
 01  INP3-ACP.                                                                  
     COPY ISABANKA.                                                             
**************************                                                      
*    KEY FIELD           *                                                      
**************************                                                      
 01  INP3-REC.                                                                  
     02  FIL         PIC X(2).                                                  
     02  INP3-KEY    PIC X(7).                                                  
     02  FIL         PIC X(141).                                                
**************************                                                      
* INP3-FILE, DATA RECORD *                                                      
**************************                                                      
 01  INP3-REC1.                                                                 
     COPY ISABANK.                                                              
/                                                                               
*    申請届出マスタ                                                             
 FD  INP4-FILE                                                                  
         LABEL RECORD STANDARD.                                                 
*****************************                                                   
* INP4-FILE INP4-KEY RECORD *                                                   
*****************************                                                   
 01  INP4-ACP.                                                                  
     COPY JFUSNTA1.                                                             
**************************                                                      
* INP4-FILE, DATA RECORD *                                                      
**************************                                                      
 01  INP4-REC.                                                                  
     COPY JFUSNTD.                                                              
/                                                                               
*    対象児童マスタ                                                             
 FD  INP5-FILE                                                                  
         LABEL RECORD STANDARD.                                                 
*****************************                                                   
* INP5-FILE INP6-KEY RECORD *                                                   
*****************************                                                   
 01  INP5-ACP.                                                                  
     COPY JFUTJDA1.                                                             
**************************                                                      
* INP5-FILE, DATA RECORD *                                                      
**************************                                                      
 01  INP5-REC.                                                                  
     COPY JFUTJDO.                                                              
/                                                                               
*    所得判定マスタ                                                             
 FD  INP6-FILE                                                                  
         LABEL RECORD STANDARD.                                                 
*****************************                                                   
* INP6-FILE INP6-KEY RECORD *                                                   
*****************************                                                   
 01  INP6-ACP1.                                                                 
     COPY JFUSHTA1.                                                             
 01  INP6-ACP2.                                                                 
     COPY JFUSHTA2.                                                             
**************************                                                      
* INP6-FILE, DATA RECORD *                                                      
**************************                                                      
 01  INP6-REC.                                                                  
     COPY JFUSHTE.                                                              
/                                                                               
*    年度支給マスタ                                                             
 FD  INP7-FILE                                                                  
         LABEL RECORD STANDARD.                                                 
*****************************                                                   
* INP7-FILE INP7-KEY RECORD *                                                   
*****************************                                                   
 01  INP7-ACP.                                                                  
     COPY JFUNDCA1.                                                             
**************************                                                      
* INP7-FILE, DATA RECORD *                                                      
**************************                                                      
 01  INP7-REC.                                                                  
     COPY JFUNDCQ.                                                              
/                                                                               
*    支払履歴マスタ                                                             
 FD  INP8-FILE                                                                  
         LABEL RECORD STANDARD.                                                 
*******************************                                                 
* INP8-FILE INP8-KEY RECORD *                                                   
*******************************                                                 
 01  INP8-ACP.                                                                  
     COPY JFUCHRA1.                                                             
***************************                                                     
* INP8-FILE, DATA RECORD *                                                      
***************************                                                     
 01  INP8-REC.                                                                  
     COPY JFUCHRK.                                                              
/                                                                               
*    コードファイル                                                             
 FD  INP9-FILE                                                                  
         LABEL RECORD STANDARD.                                                 
*******************************                                                 
* INP9-FILE INP9-KEY RECORD *                                                   
*******************************                                                 
 01  INP9-ACP.                                                                  
     COPY JFSCODA1.                                                             
***************************                                                     
* INP9-FILE, DATA RECORD *                                                      
***************************                                                     
 01  INP9-REC.                                                                  
     COPY JFSCODE.                                                              
/                                                                               
*    手当計算ファイル                                                           
 FD  INP10-FILE                                                                 
         LABEL RECORD STANDARD.                                                 
****************************                                                    
* INP10-FILE , DATA RECORD *                                                    
****************************                                                    
 01  INP10-REC.                                                                 
     02  FIL         PIC X(2).                                                  
     02  INP10-KEY   PIC 9(6).                                                  
     02  FIL         PIC X(92).                                                 
***************************                                                     
* INP10-FILE, DATA RECORD *                                                     
***************************                                                     
 01  INP11-REC1.                                                                
     COPY JFSCOMP.                                                              
/                                                                               
*    福祉総合口座情報ファイル                                                   
 FD  INP11-FILE                                                                 
         LABEL RECORD STANDARD.                                                 
****************************                                                    
* INP11-FILE , DATA RECORD *                                                    
****************************                                                    
 01  INP11-REC.                                                                 
     02  FIL         PIC X(2).                                                  
     02  INP11-KEY   PIC X(12).                                                 
     02  FIL         PIC X(86).                                                 
***************************                                                     
* INP11-FILE, DATA RECORD *                                                     
***************************                                                     
 01  INP11-REC1.                                                                
     COPY FKSKOZA.                                                              
/                                                                               
*    受給者台帳                                                                 
 FD  OUT1-FILE                                                                  
         RECORD  200  CHARACTERS                                                
         LABEL RECORD OMITTED                                                   
         LINAGE   62                                                            
         TOP       2                                                            
         BOTTOM    2.                                                           
**************************                                                      
* OUT1-FILE, DATA RECORD *                                                      
**************************                                                      
 01  OUT1-REC1.                                                                 
     02  FIL     PIC X(200).                                                    
/                                                                               
 WORKING-STORAGE SECTION.                                                       
*****************************                                                   
* STANDARD CODING WORK AREA *                                                   
*****************************                                                   
 77  C-DEC1          PIC 9(1)    VALUE 1.                                       
 77  I-TRUE          PIC 9(1)    VALUE 1.                                       
 77  I-FALSE         PIC 9(1)    VALUE 0.                                       
 77  I-SKIPLN        PIC 9(2)    VALUE 2.                                       
*                                                                               
 77  S-INP1-STATUS   PIC X(2).                                                  
 77  S-INP2-STATUS   PIC X(2).                                                  
 77  S-INP2-KEYERR   PIC 9(1).                                                  
 77  S-INP3-STATUS   PIC X(2).                                                  
 77  S-INP3-KEYERR   PIC 9(1).                                                  
 77  S-INP4-STATUS   PIC X(2).                                                  
 77  S-INP4-KEYERR   PIC 9(1).                                                  
 77  S-INP4-END      PIC 9(1).                                                  
 77  S-INP5-STATUS   PIC X(2).                                                  
 77  S-INP5-KEYERR   PIC 9(1).                                                  
 77  S-INP5-END      PIC 9(1).                                                  
 77  S-INP6-STATUS   PIC X(2).                                                  
 77  S-INP6-KEYERR   PIC 9(1).                                                  
 77  S-INP6-END      PIC 9(1).                                                  
 77  S-INP7-STATUS   PIC X(2).                                                  
 77  S-INP7-KEYERR   PIC 9(1).                                                  
 77  S-INP7-END      PIC 9(1).                                                  
 77  S-INP8-STATUS   PIC X(2).                                                  
 77  S-INP8-KEYERR   PIC 9(1).                                                  
 77  S-INP8-END      PIC 9(1).                                                  
 77  S-INP9-STATUS   PIC X(2).                                                  
 77  S-INP9-KEYERR   PIC 9(1).                                                  
 77  S-INP10-STATUS  PIC X(2).                                                  
 77  S-INP10-KEYERR  PIC 9(1).                                                  
 77  S-INP10-END     PIC 9(1).                                                  
 77  S-INP11-STATUS  PIC X(2).                                                  
 77  S-INP11-KEYERR  PIC 9(1).                                                  
 77  S-INP11-END     PIC 9(1).                                                  
*****************************                                                   
* INPUT-OUTPUT RECORD COUNT *                                                   
*****************************                                                   
 01  F-IOREC-CNT.                                                               
     02  F-PROG-NAME     PIC X(8)  VALUE "JFU225P".                             
     02  FILLER          PIC X(10) VALUE " INP1-REC=".                          
     02  F-INP1-CNT      PIC 9(5).                                              
     02  FILLER          PIC X(10) VALUE " ,   PAGE=".                          
     02  F-OUT1-CNT      PIC 9(5).                                              
*************                                                                   
* KEY-FIELD *                                                                   
*************                                                                   
* CURRENT KEY FIELD ON INP1-FILE *                                              
 01  INP1-KEY.                                                                  
     02  INP1-KEY01  PIC 9(10).                                                 
* NEXT KEY FIELD ON INP1-FILE *                                                 
 01  INP1-KEY-NEXT.                                                             
     02  INP1-KEY01  PIC 9(10).                                                 
/*************************                                                      
* USERS CODING WORK AREA *                                                      
**************************                                                      
**************************                                                      
*    帳票出力用ワーク    *                                                      
**************************                                                      
*    見出し                                                                     
*                                                                               
 01  HEAD1.                                                                     
     02  H1-YYMMDD.                                                             
         03  H1-NG     PIC N(2)                                                 
                       CHARACTER TYPE KM-9P     COLUMN 045.                     
         03  H1-YY     PIC ZZ                   COLUMN 050.                     
         03  H1-MM     PIC ZZ                   COLUMN 056.                     
         03  H1-DD     PIC ZZ                   COLUMN 062.                     
     02  H1-DANM       PIC N(3)                                                 
                       CHARACTER TYPE KM-9P     COLUMN 108.                     
*                                                                               
*    リスト１                                                                   
 01  LIST1.                                                                     
*    受給資格者カナ氏名                                                         
     02  L1-SIMEI-K    PIC X(20)                COLUMN 014.                     
*    住所（郵便番号）                                                           
     02  L1-ZIP8       PIC X(8)                 COLUMN 047.                     
*    住所（アドレス）                                                           
     02  L1-ADRS       PIC N(28)                                                
                       CHARACTER TYPE KM-9P     COLUMN 056.                     
*    生年月日                                                                   
     02  L1-SEINENNG   PIC X(1)                 COLUMN 104.                     
     02  L1-SEINENYY   PIC Z(2)                 COLUMN 105.                     
     02  L1-SEINENF1   PIC X(1)                 COLUMN 107.                     
     02  L1-SEINENMM   PIC Z(2)                 COLUMN 108.                     
     02  L1-SEINENF2   PIC X(1)                 COLUMN 110.                     
     02  L1-SEINENDD   PIC Z(2)                 COLUMN 111.                     
*                                                                               
*    リスト２                                                                   
 01  LIST2.                                                                     
*    受給資格者漢字氏名                                                         
     02  L2-SIMEI-N    PIC N(20)                                                
                       CHARACTER TYPE KM-9P     COLUMN 014.                     
*    住所（方書）                                                               
     02  L2-KATA       PIC N(15)                                                
                       CHARACTER TYPE KM-9P     COLUMN 056.                     
*    電話番号                                                                   
     02  L2-TEL        PIC X(13)                COLUMN 079.                     
*    証書番号                                                                   
     02  L2-SHBAN      PIC X(10)                COLUMN 104.                     
*                                                                               
*    リスト３                                                                   
 01  LIST3.                                                                     
*    支給類型区分                                                               
     02  L3-SIKYU      PIC N(6)                                                 
                       CHARACTER TYPE KM-9P     COLUMN 014.                     
*    金融機関（銀行名）                                                         
     02  L3-KINYHO     PIC N(18)                                                
                       CHARACTER TYPE KM-9P     COLUMN 045.                     
*    種別                                                                       
     02  L3-SYUBTU     PIC N(4)                                                 
                       CHARACTER TYPE KM-9P     COLUMN 077.                     
*    口座名義人                                                                 
     02  L3-KOZAME     PIC X(20)                COLUMN 094.                     
*                                                                               
*    リスト４                                                                   
 01  LIST4.                                                                     
*    手当月額                                                                   
     02  L4-TATGK      PIC ZZZ,ZZ9              COLUMN 014.                     
     02  L4-TATGK-N    PIC N(1)                 COLUMN 022.                     
*    金融機関（支店名）                                                         
     02  L4-KINYSI     PIC N(10)                                                
                       CHARACTER TYPE KM-9P     COLUMN 045.                     
*    口座番号                                                                   
     02  L4-KOZABG     PIC 9(7)                 COLUMN 077.                     
*    口座名義人(漢字)                                                           
     02  L4-KOZAME-N   PIC N(10)                                                
                       CHARACTER TYPE KM-9P     COLUMN 094.                     
*                                                                               
*    リスト５                                                                   
 01  LIST5.                                                                     
*    障害父氏名                                                                 
     02  L5-STTSIM     PIC N(10)                                                
                       CHARACTER TYPE KM-9P     COLUMN 101.                     
*                                                                               
*    リスト６                                                                   
 01  LIST6.                                                                     
     02 LIST6A.                                                                 
        03 L6A-REC.                                                             
*          対象児童漢字氏名                                                     
           04 L6A-TJDOMN   PIC N(10)                                            
                           CHARACTER TYPE KM-9P COLUMN 011.                     
*          生年月日                                                             
           04 L6A-JDOSNG   PIC X(1)             COLUMN 026.                     
           04 L6A-JDOSYY   PIC Z(2)             COLUMN 027.                     
           04 L6A-JDOSF1   PIC X(1)             COLUMN 029.                     
           04 L6A-JDOSMM   PIC Z(2)             COLUMN 030.                     
           04 L6A-JDOSF2   PIC X(1)             COLUMN 032.                     
           04 L6A-JDOSDD   PIC Z(2)             COLUMN 033.                     
*          障害                                                                 
           04 L6A-SYOGAI   PIC N(2)                                             
                           CHARACTER TYPE KM-9P COLUMN 038.                     
*          当初該当日                                                           
           04 L6A-JDGTNG   PIC X(1)             COLUMN 050.                     
           04 L6A-JDGTYY   PIC Z(2)             COLUMN 051.                     
           04 L6A-JDGTF1   PIC X(1)             COLUMN 053.                     
           04 L6A-JDGTMM   PIC Z(2)             COLUMN 054.                     
           04 L6A-JDGTF2   PIC X(1)             COLUMN 056.                     
           04 L6A-JDGTDD   PIC Z(2)             COLUMN 057.                     
*          ９条２                                                               
           04 L6A-9JYO2N   PIC N(6)                                             
                           CHARACTER TYPE KM-9P COLUMN 062.                     
*          非該当年月日                                                         
           04 L6A-JDHTNG   PIC X(1)             COLUMN 074.                     
           04 L6A-JDHTYY   PIC Z(2)             COLUMN 075.                     
           04 L6A-JDHTF1   PIC X(1)             COLUMN 077.                     
           04 L6A-JDHTMM   PIC Z(2)             COLUMN 078.                     
           04 L6A-JDHTF2   PIC X(1)             COLUMN 080.                     
           04 L6A-JDHTDD   PIC Z(2)             COLUMN 081.                     
*          障害状態                                                             
           04 L6A-TTJYOK   PIC N(10)                                            
                           CHARACTER TYPE KM-9P COLUMN 101.                     
     02 LIST6B.                                                                 
        03 L6B-REC.                                                             
*          対象児童漢字氏名                                                     
           04 L6B-TJDOMN   PIC N(10)                                            
                           CHARACTER TYPE KM-9P COLUMN 011.                     
*          生年月日                                                             
           04 L6B-JDOSNG   PIC X(1)             COLUMN 026.                     
           04 L6B-JDOSYY   PIC Z(2)             COLUMN 027.                     
           04 L6B-JDOSF1   PIC X(1)             COLUMN 029.                     
           04 L6B-JDOSMM   PIC Z(2)             COLUMN 030.                     
           04 L6B-JDOSF2   PIC X(1)             COLUMN 032.                     
           04 L6B-JDOSDD   PIC Z(2)             COLUMN 033.                     
*          障害                                                                 
           04 L6B-SYOGAI   PIC N(2)                                             
                           CHARACTER TYPE KM-9P COLUMN 038.                     
*          当初該当日                                                           
           04 L6B-JDGTNG   PIC X(1)             COLUMN 050.                     
           04 L6B-JDGTYY   PIC Z(2)             COLUMN 051.                     
           04 L6B-JDGTF1   PIC X(1)             COLUMN 053.                     
           04 L6B-JDGTMM   PIC Z(2)             COLUMN 054.                     
           04 L6B-JDGTF2   PIC X(1)             COLUMN 056.                     
           04 L6B-JDGTDD   PIC Z(2)             COLUMN 057.                     
*          ９条２                                                               
           04 L6B-9JYO2N   PIC N(6)                                             
                           CHARACTER TYPE KM-9P COLUMN 062.                     
*          非該当年月日                                                         
           04 L6B-JDHTNG   PIC X(1)             COLUMN 074.                     
           04 L6B-JDHTYY   PIC Z(2)             COLUMN 075.                     
           04 L6B-JDHTF1   PIC X(1)             COLUMN 077.                     
           04 L6B-JDHTMM   PIC Z(2)             COLUMN 078.                     
           04 L6B-JDHTF2   PIC X(1)             COLUMN 080.                     
           04 L6B-JDHTDD   PIC Z(2)             COLUMN 081.                     
*          終了予定日                                                           
           04 L6B-SRYONG   PIC X(1)             COLUMN 103.                     
           04 L6B-SRYOYY   PIC Z(2)             COLUMN 104.                     
           04 L6B-SRYOF1   PIC X(1)             COLUMN 106.                     
           04 L6B-SRYOMM   PIC Z(2)             COLUMN 107.                     
           04 L6B-SRYOF2   PIC X(1)             COLUMN 109.                     
           04 L6B-SRYODD   PIC Z(2)             COLUMN 110.                     
     02 LIST6C.                                                                 
        03 L6C-REC.                                                             
*          続柄名称                                                             
           04 L6C-ZOKUGR   PIC N(6)                                             
                           CHARACTER TYPE KM-9P COLUMN 011.                     
*          年齢                                                                 
           04 L6C-NENREI   PIC Z9               COLUMN 026.                     
           04 L6C-NENRF1   PIC N(1)                                             
                           CHARACTER TYPE KM-9P COLUMN 029.                     
*          再診年月日                                                           
           04 L6C-SAISNG   PIC X(1)             COLUMN 038.                     
           04 L6C-SAISYY   PIC Z(2)             COLUMN 039.                     
           04 L6C-SAISF1   PIC X(1)             COLUMN 041.                     
           04 L6C-SAISMM   PIC Z(2)             COLUMN 042.                     
           04 L6C-SAISF2   PIC X(1)             COLUMN 044.                     
           04 L6C-SAISDD   PIC Z(2)             COLUMN 045.                     
*          事由発生年月日                                                       
           04 L6C-JYUHNG   PIC X(1)             COLUMN 050.                     
           04 L6C-JYUHYY   PIC Z(2)             COLUMN 051.                     
           04 L6C-JYUHF1   PIC X(1)             COLUMN 053.                     
           04 L6C-JYUHMM   PIC Z(2)             COLUMN 054.                     
           04 L6C-JYUHF2   PIC X(1)             COLUMN 056.                     
           04 L6C-JYUHDD   PIC Z(2)             COLUMN 057.                     
*          非該当予定日(有期認定日)                                             
           04 L6C-YKNBNG   PIC X(1)             COLUMN 062.                     
           04 L6C-YKNBYY   PIC Z(2)             COLUMN 063.                     
           04 L6C-YKNBF1   PIC X(1)             COLUMN 065.                     
           04 L6C-YKNBMM   PIC Z(2)             COLUMN 066.                     
           04 L6C-YKNBF2   PIC X(1)             COLUMN 068.                     
           04 L6C-YKNBDD   PIC Z(2)             COLUMN 069.                     
*          非該当事由                                                           
           04 L6C-HIGTJM   PIC N(3)                                             
                           CHARACTER TYPE KM-9P COLUMN 074.                     
     02 LIST6D.                                                                 
        03 L6D-REC.                                                             
*          対象児童漢字氏名                                                     
           04 L6D-TJDOMN   PIC N(10)                                            
                           CHARACTER TYPE KM-9P COLUMN 011.                     
*          生年月日                                                             
           04 L6D-JDOSNG   PIC X(1)             COLUMN 026.                     
           04 L6D-JDOSYY   PIC Z(2)             COLUMN 027.                     
           04 L6D-JDOSF1   PIC X(1)             COLUMN 029.                     
           04 L6D-JDOSMM   PIC Z(2)             COLUMN 030.                     
           04 L6D-JDOSF2   PIC X(1)             COLUMN 032.                     
           04 L6D-JDOSDD   PIC Z(2)             COLUMN 033.                     
*          障害                                                                 
           04 L6D-SYOGAI   PIC N(2)                                             
                           CHARACTER TYPE KM-9P COLUMN 038.                     
*          当初該当日                                                           
           04 L6D-JDGTNG   PIC X(1)             COLUMN 050.                     
           04 L6D-JDGTYY   PIC Z(2)             COLUMN 051.                     
           04 L6D-JDGTF1   PIC X(1)             COLUMN 053.                     
           04 L6D-JDGTMM   PIC Z(2)             COLUMN 054.                     
           04 L6D-JDGTF2   PIC X(1)             COLUMN 056.                     
           04 L6D-JDGTDD   PIC Z(2)             COLUMN 057.                     
*          ９条２                                                               
           04 L6D-9JYO2N   PIC N(6)                                             
                           CHARACTER TYPE KM-9P COLUMN 062.                     
*          非該当年月日                                                         
           04 L6D-JDHTNG   PIC X(1)             COLUMN 074.                     
           04 L6D-JDHTYY   PIC Z(2)             COLUMN 075.                     
           04 L6D-JDHTF1   PIC X(1)             COLUMN 077.                     
           04 L6D-JDHTMM   PIC Z(2)             COLUMN 078.                     
           04 L6D-JDHTF2   PIC X(1)             COLUMN 080.                     
           04 L6D-JDHTDD   PIC Z(2)             COLUMN 081.                     
*          証書交付日                                                           
           04 L6D-SYOSNG   PIC X(1)             COLUMN 094.                     
           04 L6D-SYOSYY   PIC Z(2)             COLUMN 095.                     
           04 L6D-SYOSF1   PIC X(1)             COLUMN 097.                     
           04 L6D-SYOSMM   PIC Z(2)             COLUMN 098.                     
           04 L6D-SYOSF2   PIC X(1)             COLUMN 100.                     
           04 L6D-SYOSDD   PIC Z(2)             COLUMN 101.                     
           04 L6D-KIGO     PIC X(5)             COLUMN 104.                     
           04 L6D-INKAN    PIC N(1)             COLUMN 111.                     
*                                                                               
     02 LIST6F.                                                                 
        03 L6F-REC.                                                             
*          続柄名称                                                             
           04 L6F-ZOKUGR   PIC N(6)                                             
                           CHARACTER TYPE KM-9P COLUMN 011.                     
*          年齢                                                                 
           04 L6F-NENREI   PIC Z9               COLUMN 026.                     
           04 L6F-NENRF1   PIC N(1)                                             
                           CHARACTER TYPE KM-9P COLUMN 029.                     
*          再診年月日                                                           
           04 L6F-SAISNG   PIC X(1)             COLUMN 038.                     
           04 L6F-SAISYY   PIC Z(2)             COLUMN 039.                     
           04 L6F-SAISF1   PIC X(1)             COLUMN 041.                     
           04 L6F-SAISMM   PIC Z(2)             COLUMN 042.                     
           04 L6F-SAISF2   PIC X(1)             COLUMN 044.                     
           04 L6F-SAISDD   PIC Z(2)             COLUMN 045.                     
*          事由発生年月日                                                       
           04 L6F-JYUHNG   PIC X(1)             COLUMN 050.                     
           04 L6F-JYUHYY   PIC Z(2)             COLUMN 051.                     
           04 L6F-JYUHF1   PIC X(1)             COLUMN 053.                     
           04 L6F-JYUHMM   PIC Z(2)             COLUMN 054.                     
           04 L6F-JYUHF2   PIC X(1)             COLUMN 056.                     
           04 L6F-JYUHDD   PIC Z(2)             COLUMN 057.                     
*          非該当予定日(有期認定日)                                             
           04 L6F-YKNBNG   PIC X(1)             COLUMN 062.                     
           04 L6F-YKNBYY   PIC Z(2)             COLUMN 063.                     
           04 L6F-YKNBF1   PIC X(1)             COLUMN 065.                     
           04 L6F-YKNBMM   PIC Z(2)             COLUMN 066.                     
           04 L6F-YKNBF2   PIC X(1)             COLUMN 068.                     
           04 L6F-YKNBDD   PIC Z(2)             COLUMN 069.                     
*          非該当事由                                                           
           04 L6F-HIGTJM   PIC N(3)                                             
                           CHARACTER TYPE KM-9P COLUMN 074.                     
*          証書交付日                                                           
           04 L6F-SYOSNG   PIC X(1)             COLUMN 094.                     
           04 L6F-SYOSYY   PIC Z(2)             COLUMN 095.                     
           04 L6F-SYOSF1   PIC X(1)             COLUMN 097.                     
           04 L6F-SYOSMM   PIC Z(2)             COLUMN 098.                     
           04 L6F-SYOSF2   PIC X(1)             COLUMN 100.                     
           04 L6F-SYOSDD   PIC Z(2)             COLUMN 101.                     
           04 L6F-KIGO     PIC X(5)             COLUMN 104.                     
           04 L6F-INKAN    PIC N(1)             COLUMN 111.                     
*                                                                               
*    リスト７                                                                   
 01  LIST7.                                                                     
     02 L7-REC.                                                                 
*       年度                                                                    
        03 L7-NENDNG       PIC X(1)             COLUMN 010.                     
        03 L7-NENDYY       PIC Z(2)             COLUMN 011.                     
*       届の有無                                                                
        03 L7-TDARNS       PIC N(1)                                             
                           CHARACTER TYPE KM-9P COLUMN 014.                     
*       所得制限該当                                                            
        03 L7-SYTOKU       PIC N(5)                                             
                           CHARACTER TYPE KM-9P COLUMN 018.                     
*       扶養（受給者）                                                          
        03 L7-JQRHKB       PIC ZZ               COLUMN 025.                     
*       老人（受給者）                                                          
        03 L7-JQRJKB       PIC ZZ               COLUMN 028.                     
*       特定（受給者）                                                          
        03 L7-JQTKKB       PIC ZZ               COLUMN 031.                     
*       総所得額（受給者）                                                      
        03 L7-JQSUTG       PIC ZZ,ZZZ,ZZZ       COLUMN 034.                     
*       控除後所得額（受給者）                                                  
        03 L7-JQKOJG       PIC ZZ,ZZZ,ZZZ       COLUMN 045.                     
*       扶養（配偶者・扶養義務者）                                              
        03 L7-HQRHKB       PIC ZZ               COLUMN 056.                     
*       老人（配偶者・扶養義務者）                                              
        03 L7-HQRJKB       PIC ZZ               COLUMN 059.                     
*       特定（配偶者・扶養義務者）                                              
        03 L7-HQTKKB       PIC ZZ               COLUMN 062.                     
*       総所得額（配偶者・扶養義務者）                                          
        03 L7-HQSUTG       PIC ZZ,ZZZ,ZZZ       COLUMN 065.                     
*       控除後所得額（配偶者・扶養義務者）                                      
        03 L7-HQKOJG       PIC ZZ,ZZZ,ZZZ       COLUMN 076.                     
*       支給停止期間                                                            
        03 L7-KAISNG       PIC X(1)             COLUMN 087.                     
        03 L7-KAISYY       PIC Z(2)             COLUMN 088.                     
        03 L7-KAISF1       PIC X(1)             COLUMN 090.                     
        03 L7-KAISMM       PIC Z(2)             COLUMN 091.                     
*                                                                               
        03 L7-SKTSF1       PIC N(1)                                             
                           CHARACTER TYPE KM-9P COLUMN 094.                     
*                                                                               
        03 L7-SYURNG       PIC X(1)             COLUMN 097.                     
        03 L7-SYURYY       PIC Z(2)             COLUMN 098.                     
        03 L7-SYURF1       PIC X(1)             COLUMN 100.                     
        03 L7-SYURMM       PIC Z(2)             COLUMN 101.                     
*       支給停止月額                                                            
        03 L7-SKYUGK       PIC ZZZ,ZZZ          COLUMN 105.                     
*                                                                               
*    リスト８                                                                   
 01  LIST8.                                                                     
     02 L8-REC.                                                                 
*       年度（支払状況）                                                        
        03 L8-SNENNG       PIC X(1)             COLUMN 010.                     
        03 L8-SNENYY       PIC Z(2)             COLUMN 011.                     
*       支払予定額（１２月期）                                                  
        03 L8-SHYO12       PIC ZZ,ZZZ,ZZZ       COLUMN 014.                     
*       支払済額（１２月期）                                                    
        03 L8-SHSM12       PIC ZZ,ZZZ,ZZZ       COLUMN 025.                     
*       支払日                                                                  
        03 L8-SH12NG       PIC X(1)             COLUMN 037.                     
        03 L8-SH12YY       PIC Z(2)             COLUMN 038.                     
        03 L8-SH12F1       PIC X(1)             COLUMN 040.                     
        03 L8-SH12MM       PIC Z(2)             COLUMN 041.                     
        03 L8-SH12F2       PIC X(1)             COLUMN 043.                     
        03 L8-SH12DD       PIC Z(2)             COLUMN 044.                     
*       支払予定額（４月期）                                                    
        03 L8-SHYO04       PIC ZZ,ZZZ,ZZZ       COLUMN 048.                     
*       支払済額（４月期）                                                      
        03 L8-SHSM04       PIC ZZ,ZZZ,ZZZ       COLUMN 059.                     
*       支払日                                                                  
        03 L8-SH04NG       PIC X(1)             COLUMN 071.                     
        03 L8-SH04YY       PIC Z(2)             COLUMN 072.                     
        03 L8-SH04F1       PIC X(1)             COLUMN 074.                     
        03 L8-SH04MM       PIC Z(2)             COLUMN 075.                     
        03 L8-SH04F2       PIC X(1)             COLUMN 077.                     
        03 L8-SH04DD       PIC Z(2)             COLUMN 078.                     
*       支払予定額（８月期）                                                    
        03 L8-SHYO08       PIC ZZ,ZZZ,ZZZ       COLUMN 082.                     
*       支払済額（８月期）                                                      
        03 L8-SHSM08       PIC ZZ,ZZZ,ZZZ       COLUMN 093.                     
*       支払日                                                                  
        03 L8-SH08NG       PIC X(1)             COLUMN 105.                     
        03 L8-SH08YY       PIC Z(2)             COLUMN 106.                     
        03 L8-SH08F1       PIC X(1)             COLUMN 108.                     
        03 L8-SH08MM       PIC Z(2)             COLUMN 109.                     
        03 L8-SH08F2       PIC X(1)             COLUMN 111.                     
        03 L8-SH08DD       PIC Z(2)             COLUMN 112.                     
*                                                                               
*    リスト９                                                                   
 01  LIST9.                                                                     
     02 L9-REC.                                                                 
*       喪失年月日                                                              
        03 L9-SOSTNG       PIC X(1)             COLUMN 024.                     
        03 L9-SOSTYY       PIC Z(2)             COLUMN 025.                     
        03 L9-SOSTF1       PIC X(1)             COLUMN 027.                     
        03 L9-SOSTMM       PIC Z(2)             COLUMN 028.                     
        03 L9-SOSTF2       PIC X(1)             COLUMN 030.                     
        03 L9-SOSTDD       PIC Z(2)             COLUMN 031.                     
*       喪失事由                                                                
        03 L9-SOSTJU       PIC N(18)                                            
                           CHARACTER TYPE KM-9P COLUMN 045.                     
*       備　考                                                                  
        03 L9-BIKO         PIC N(30)                                            
                           CHARACTER TYPE KM-9P COLUMN 078.                     
*                                                                               
**************************                                                      
*    項目編集用ワーク    *                                                      
**************************                                                      
*                                                                               
*    リスト出力用ワーク                                                         
*                                                                               
 01  LIST              PIC X(200).                                              
*                                                                               
*    システム日付用ワーク                                                       
*                                                                               
     COPY  CMLBDATE.                                              2000-I        
     COPY  CMLB002W.                                                            
*                                                                               
*    年齢計算用ワーク                                                           
*                                                                               
     COPY LIBS010W.                                                             
*                                                                               
*    郵便番号編集ワーク                                                         
*                                                                               
 01  HENSYU-GUB.                                                                
     02  HENSYU-UBN1    PIC X(3).                                               
     02  HENSYU-UBF     PIC X(1).                                               
     02  HENSYU-UBN2    PIC X(4).                                               
*                                                                               
*    続柄編集ワーク                                                             
*                                                                               
 01  WK-ZGR-INPUT.                                                              
     02  WK-ZGR-N1      PIC N(8).                                               
     02  WK-ZGR-F1      PIC N(1).                                               
     02  WK-ZGR-N2      PIC N(8).                                               
     02  WK-ZGR-F2      PIC N(1).                                               
     02  WK-ZGR-N3      PIC N(8).                                               
 01  WK-INPUT-ZGR   REDEFINES WK-ZGR-INPUT.                                     
     02  WK-IN-ZGR  OCCURS 26 TIMES PIC N(1).                                   
*                                                                               
 01  WK-ZGR-OUTPUT      PIC N(26).                                              
 01  WK-OUTPUT-ZGR  REDEFINES WK-ZGR-OUTPUT.                                    
     02  WK-OUT-ZGR OCCURS 26 TIMES PIC N(1).                                   
*                                                                               
 01  INADR              PIC 9(2).                                               
 01  OUTADR             PIC 9(2).                                               
*                                                                               
*    日付編集用ワーク                                                           
*                                                                               
 01  WK-UGP             PIC 9(7).                                               
 01  WK-UGPR REDEFINES WK-UGP.                                                  
     02  WK-JUGG        PIC X(1).                                               
     02  WK-JUGY        PIC 9(2).                                               
     02  WK-JUGM        PIC 9(2).                                               
     02  WK-JUGD        PIC 9(2).                                               
 01  WK-UGP-Z.                                                                  
     02  WK-JUGY-Z      PIC Z(2).                                               
     02  WK-JUGM-Z      PIC Z(2).                                               
     02  WK-JUGD-Z      PIC Z(2).                                               
*                                                                               
 01  WK-DATE            PIC 9(8).                                               
 01  WK-DATER REDEFINES WK-DATE .                                               
     02  WK-YM          PIC 9(6).                                               
     02  WK-YM-R REDEFINES WK-YM.                                               
         03  WK-YY      PIC 9(4).                                               
         03  WK-MM      PIC 9(2).                                               
     02  WK-DD          PIC 9(2).                                               
*                                                                               
 01  WK-WDATE .                                                                 
     02  WK-WNG              PIC X(01).                                         
     02  WK-WYY              PIC 9(02).                                         
     02  WK-WMM              PIC 9(02).                                         
     02  WK-WDD              PIC 9(02).                                         
*                                                                               
*    カウントワーク                                                             
*                                                                               
 01  IDX                PIC 9(2).                                               
 01  IDX1               PIC 9(2).                                               
 01  IDX2               PIC 9(2).                                               
*                                                                               
*    所得判定マスタの項目退避ワーク                                             
*                                                                               
 01  WK-KJG-MAX         PIC 9(5).                                               
*                                                                               
*    年度支給マスタの部分項目退避ワーク                                         
*                                                                               
*    手当月額                                                                   
 01  WK-TATGK-R.                                                                
     02  WK-TATGK1      PIC 9(6).                                               
     02  WK-TATGK2      PIC 9(6).                                               
     02  WK-TATGK3      PIC 9(6).                                               
*                                                                               
*    支払済額                                                                   
 01  WK-SHRGK.                                                                  
     02  WK-SHRGK1      PIC 9(6).                                               
     02  WK-SHRGK2      PIC 9(6).                                               
     02  WK-SHRGK3      PIC 9(6).                                               
*                                                                               
*    支給停止情報ワーク                                                         
*    支給停止年月フラグ                                                         
*                                                                               
 01  WK-SIKYU-FLG.                                                              
     02  WK-SIKYU-FLG1  PIC 9(1).                                               
     02  WK-SIKYU-FLG2  PIC 9(1).                                               
     02  WK-SIKYU-FLG3  PIC 9(1).                                               
*                                                                               
*    支給停止情報を画面に表示フラグ                                             
 01  WK-HYOJI-FLG       PIC 9(1).                                               
*                                                                               
*    支給停止開始、終了年月                                                     
*                                                                               
 01  WK-T-KAISI         PIC 9(6).                                               
 01  WK-T-KAISI-R  REDEFINES   WK-T-KAISI.                                      
     02  WK-T-KYY       PIC 9(4).                                               
     02  WK-T-KMM       PIC 9(2).                                               
*                                                                               
 01  WK-T-SYURYO        PIC 9(6).                                               
 01  WK-T-SYURYO-R  REDEFINES   WK-T-SYURYO.                                    
     02  WK-T-SYY       PIC 9(4).                                               
     02  WK-T-SMM       PIC 9(2).                                               
*                                                                               
*    編集終了判定サイン                                                         
*                                                                               
 01  HENSYU-END         PIC X(1).                                               
 01  WK-SEIGYO-FLG      PIC 9(1).                                               
 01  END-FLG            PIC 9(1).                                               
*                                                                               
*    退避用                                                                     
 01  WK-CQKYM           PIC 9(6).                                               
 01  WK-CQKYM-R    REDEFINES   WK-CQKYM.                                        
     02  WK-CQKYY       PIC 9(4).                                               
     02  WK-CQKMM       PIC 9(2).                                               
*                                                                               
 01  WK-SV-STT          PIC 9(6).                                               
 01  WK-SV-STT-R    REDEFINES   WK-SV-STT.                                      
     02  WK-SV-STYY     PIC 9(4).                                               
     02  WK-SV-STMM     PIC 9(2).                                               
*                                                                               
 01  WK-TAIHI           PIC 9(6).                                               
 01  WK-TAIHI-R  REDEFINES   WK-TAIHI.                                          
     02  WK-TAIHI-YY    PIC 9(4).                                               
     02  WK-TAIHI-MM    PIC 9(2).                                               
*                                                                               
 01  WK-NEW-YM           PIC 9(6).                                              
 01  WK-NEW-YM-R  REDEFINES   WK-NEW-YM.                                        
     02  WK-NEW-NEN     PIC 9(4).                                               
     02  WK-NEW-TUKI    PIC 9(2).                                               
*                                                                               
 01  WK-OLD-YM           PIC 9(6).                                              
 01  WK-OLD-YM-R  REDEFINES   WK-OLD-YM.                                        
     02  WK-OLD-NEN     PIC 9(4).                                               
     02  WK-OLD-TUKI    PIC 9(2).                                               
*                                                                               
*    支給類型区分退避ワーク                                                     
*                                                                               
 01  WK-SV-CQRKB        PIC 9(1).                                               
*                                                                               
*    手当月額の退避ワーク                                                       
*                                                                               
 01  WK-TATGK           PIC 9(6).                                               
 01  WK-SV-TATGK        PIC 9(6).                                               
*                                                                               
*    対象児童数の退避・制御ワーク                                               
*                                                                               
 01  WK-TJDSU           PIC 9(2).                                               
 01  WK-SV-TJDSU        PIC 9(2).                                               
 01  WK-HHKNO           PIC 9(7).                                               
 01  WK-TTKNO           PIC 9(7).                                               
 01  WK-YKNBI           PIC 9(8).                                               
 01  WK-JIDO-FLG        PIC 9(1).                                               
 01  WK-JIDO-FLG1       PIC 9(1).                                               
 01  WK-JIDO-FLG2       PIC 9(1).                                               
 01  WK-JIDO-FLG3       PIC 9(1).                                               
*                                                                               
*    支給停止手当月額退避ワーク用                                               
*                                                                               
 01  WK-ZCQGK           PIC 9(6).                                               
*                                                                               
*    年齢編集用ワーク                                                           
*                                                                               
 01  WK-NR-WDATE .                                                              
     02  WK-NR-WNG      PIC X(01).                                              
     02  WK-NR-WYY      PIC 9(02).                                              
     02  WK-NR-WMM      PIC 9(02).                                              
*                                                                               
*    児童連番                                                                   
*                                                                               
 01  WK-JDONO-01.                                                               
        02 WK-JDONO-02   OCCURS  6.                                             
           03 WK-JDONO   PIC   9(2).                                            
*                                                                               
*    リスト６                                                                   
 01  LIST6W.                                                                    
     02 LIST6AW.                                                                
        03 L6AW-REC    OCCURS  3.                                               
*          対象児童漢字氏名                                                     
           04 L6AW-TJDOMN   PIC N(10).                                          
*          生年月日                                                             
           04 L6AW-JDOSNG   PIC X(1).                                           
           04 L6AW-JDOSYY   PIC Z(2).                                           
           04 L6AW-JDOSF1   PIC X(1).                                           
           04 L6AW-JDOSMM   PIC Z(2).                                           
           04 L6AW-JDOSF2   PIC X(1).                                           
           04 L6AW-JDOSDD   PIC Z(2).                                           
*          障害                                                                 
           04 L6AW-SYOGAI   PIC N(2).                                           
*          当初該当日                                                           
           04 L6AW-JDGTNG   PIC X(1).                                           
           04 L6AW-JDGTYY   PIC Z(2).                                           
           04 L6AW-JDGTF1   PIC X(1).                                           
           04 L6AW-JDGTMM   PIC Z(2).                                           
           04 L6AW-JDGTF2   PIC X(1).                                           
           04 L6AW-JDGTDD   PIC Z(2).                                           
*          ９条２                                                               
           04 L6AW-9JYO2N   PIC N(6).                                           
*          非該当年月日                                                         
           04 L6AW-JDHTNG   PIC X(1).                                           
           04 L6AW-JDHTYY   PIC Z(2).                                           
           04 L6AW-JDHTF1   PIC X(1).                                           
           04 L6AW-JDHTMM   PIC Z(2).                                           
           04 L6AW-JDHTF2   PIC X(1).                                           
           04 L6AW-JDHTDD   PIC Z(2).                                           
*          障害状態                                                             
           04 L6AW-TTJYOK   PIC N(10).                                          
     02 LIST6CW.                                                                
        03 L6CW-REC    OCCURS  3.                                               
*          続柄名称                                                             
           04 L6CW-ZOKUGR   PIC N(6).                                           
*          年齢                                                                 
           04 L6CW-NENREI   PIC Z9.                                             
           04 L6CW-NENRF1   PIC N(1).                                           
*          再診年月日                                                           
           04 L6CW-SAISNG  PIC X(1).                                            
           04 L6CW-SAISYY  PIC Z(2).                                            
           04 L6CW-SAISF1  PIC X(1).                                            
           04 L6CW-SAISMM  PIC Z(2).                                            
           04 L6CW-SAISF2  PIC X(1).                                            
           04 L6CW-SAISDD  PIC Z(2).                                            
*          事由発生年月日                                                       
           04 L6CW-JYUHNG  PIC X(1).                                            
           04 L6CW-JYUHYY  PIC Z(2).                                            
           04 L6CW-JYUHF1  PIC X(1).                                            
           04 L6CW-JYUHMM  PIC Z(2).                                            
           04 L6CW-JYUHF2  PIC X(1).                                            
           04 L6CW-JYUHDD  PIC Z(2).                                            
*          非該当予定日(有期認定日)                                             
           04 L6CW-YKNBNG  PIC X(1).                                            
           04 L6CW-YKNBYY  PIC Z(2).                                            
           04 L6CW-YKNBF1  PIC X(1).                                            
           04 L6CW-YKNBMM  PIC Z(2).                                            
           04 L6CW-YKNBF2  PIC X(1).                                            
           04 L6CW-YKNBDD  PIC Z(2).                                            
*          非該当事由                                                           
           04 L6CW-HIGTJM  PIC N(3).                                            
     02 LIST6DW.                                                                
        03 L6DW-REC    OCCURS  2.                                               
*          対象児童漢字氏名                                                     
           04 L6DW-TJDOMN   PIC N(10).                                          
*          生年月日                                                             
           04 L6DW-JDOSNG   PIC X(1).                                           
           04 L6DW-JDOSYY   PIC Z(2).                                           
           04 L6DW-JDOSF1   PIC X(1).                                           
           04 L6DW-JDOSMM   PIC Z(2).                                           
           04 L6DW-JDOSF2   PIC X(1).                                           
           04 L6DW-JDOSDD   PIC Z(2).                                           
*          障害                                                                 
           04 L6DW-SYOGAI   PIC N(2).                                           
*          当初該当日                                                           
           04 L6DW-JDGTNG   PIC X(1).                                           
           04 L6DW-JDGTYY   PIC Z(2).                                           
           04 L6DW-JDGTF1   PIC X(1).                                           
           04 L6DW-JDGTMM   PIC Z(2).                                           
           04 L6DW-JDGTF2   PIC X(1).                                           
           04 L6DW-JDGTDD   PIC Z(2).                                           
*          ９条２                                                               
           04 L6DW-9JYO2N   PIC N(6).                                           
*          非該当年月日                                                         
           04 L6DW-JDHTNG   PIC X(1).                                           
           04 L6DW-JDHTYY   PIC Z(2).                                           
           04 L6DW-JDHTF1   PIC X(1).                                           
           04 L6DW-JDHTMM   PIC Z(2).                                           
           04 L6DW-JDHTF2   PIC X(1).                                           
           04 L6DW-JDHTDD   PIC Z(2).                                           
*          証書交付日                                                           
           04 L6DW-SYOSNG  PIC X(1).                                            
           04 L6DW-SYOSYY  PIC Z(2).                                            
           04 L6DW-SYOSF1  PIC X(1).                                            
           04 L6DW-SYOSMM  PIC Z(2).                                            
           04 L6DW-SYOSF2  PIC X(1).                                            
           04 L6DW-SYOSDD  PIC Z(2).                                            
           04 L6DW-KIGO    PIC X(5).                                            
           04 L6DW-INKAN   PIC N(1).                                            
     02 LIST6FW.                                                                
        03 L6FW-REC    OCCURS  2.                                               
*          続柄名称                                                             
           04 L6FW-ZOKUGR   PIC N(6).                                           
*          年齢                                                                 
           04 L6FW-NENREI   PIC Z9.                                             
           04 L6FW-NENRF1   PIC N(1).                                           
*          再診年月日                                                           
           04 L6FW-SAISNG  PIC X(1).                                            
           04 L6FW-SAISYY  PIC Z(2).                                            
           04 L6FW-SAISF1  PIC X(1).                                            
           04 L6FW-SAISMM  PIC Z(2).                                            
           04 L6FW-SAISF2  PIC X(1).                                            
           04 L6FW-SAISDD  PIC Z(2).                                            
*          事由発生年月日                                                       
           04 L6FW-JYUHNG  PIC X(1).                                            
           04 L6FW-JYUHYY  PIC Z(2).                                            
           04 L6FW-JYUHF1  PIC X(1).                                            
           04 L6FW-JYUHMM  PIC Z(2).                                            
           04 L6FW-JYUHF2  PIC X(1).                                            
           04 L6FW-JYUHDD  PIC Z(2).                                            
*          非該当予定日(有期認定日)                                             
           04 L6FW-YKNBNG  PIC X(1).                                            
           04 L6FW-YKNBYY  PIC Z(2).                                            
           04 L6FW-YKNBF1  PIC X(1).                                            
           04 L6FW-YKNBMM  PIC Z(2).                                            
           04 L6FW-YKNBF2  PIC X(1).                                            
           04 L6FW-YKNBDD  PIC Z(2).                                            
*          非該当事由                                                           
           04 L6FW-HIGTJM  PIC N(3).                                            
*          証書交付日                                                           
           04 L6FW-SYOSNG  PIC X(1).                                            
           04 L6FW-SYOSYY  PIC Z(2).                                            
           04 L6FW-SYOSF1  PIC X(1).                                            
           04 L6FW-SYOSMM  PIC Z(2).                                            
           04 L6FW-SYOSF2  PIC X(1).                                            
           04 L6FW-SYOSDD  PIC Z(2).                                            
           04 L6FW-KIGO    PIC X(5).                                            
           04 L6FW-INKAN   PIC N(1).                                            
     02 LIST6BW.                                                                
        03 L6BW-REC.                                                            
*          対象児童漢字氏名                                                     
           04 L6BW-TJDOMN   PIC N(10).                                          
*          生年月日                                                             
           04 L6BW-JDOSNG   PIC X(1).                                           
           04 L6BW-JDOSYY   PIC Z(2).                                           
           04 L6BW-JDOSF1   PIC X(1).                                           
           04 L6BW-JDOSMM   PIC Z(2).                                           
           04 L6BW-JDOSF2   PIC X(1).                                           
           04 L6BW-JDOSDD   PIC Z(2).                                           
*          障害                                                                 
           04 L6BW-SYOGAI   PIC N(2).                                           
*          当初該当日                                                           
           04 L6BW-JDGTNG   PIC X(1).                                           
           04 L6BW-JDGTYY   PIC Z(2).                                           
           04 L6BW-JDGTF1   PIC X(1).                                           
           04 L6BW-JDGTMM   PIC Z(2).                                           
           04 L6BW-JDGTF2   PIC X(1).                                           
           04 L6BW-JDGTDD   PIC Z(2).                                           
*          ９条２                                                               
           04 L6BW-9JYO2N   PIC N(6).                                           
*          非該当年月日                                                         
           04 L6BW-JDHTNG   PIC X(1).                                           
           04 L6BW-JDHTYY   PIC Z(2).                                           
           04 L6BW-JDHTF1   PIC X(1).                                           
           04 L6BW-JDHTMM   PIC Z(2).                                           
           04 L6BW-JDHTF2   PIC X(1).                                           
           04 L6BW-JDHTDD   PIC Z(2).                                           
*          終了予定日                                                           
           04 L6BW-SRYONG  PIC X(1).                                            
           04 L6BW-SRYOYY  PIC Z(2).                                            
           04 L6BW-SRYOF1  PIC X(1).                                            
           04 L6BW-SRYOMM  PIC Z(2).                                            
           04 L6BW-SRYOF2  PIC X(1).                                            
           04 L6BW-SRYODD  PIC Z(2).                                            
     02 LIST6EW.                                                                
        03 L6EW-REC.                                                            
*          続柄名称                                                             
           04 L6EW-ZOKUGR   PIC N(6).                                           
*          年齢                                                                 
           04 L6EW-NENREI   PIC Z9.                                             
           04 L6EW-NENRF1   PIC N(1).                                           
*          再診年月日                                                           
           04 L6EW-SAISNG  PIC X(1).                                            
           04 L6EW-SAISYY  PIC Z(2).                                            
           04 L6EW-SAISF1  PIC X(1).                                            
           04 L6EW-SAISMM  PIC Z(2).                                            
           04 L6EW-SAISF2  PIC X(1).                                            
           04 L6EW-SAISDD  PIC Z(2).                                            
*          事由発生年月日                                                       
           04 L6EW-JYUHNG  PIC X(1).                                            
           04 L6EW-JYUHYY  PIC Z(2).                                            
           04 L6EW-JYUHF1  PIC X(1).                                            
           04 L6EW-JYUHMM  PIC Z(2).                                            
           04 L6EW-JYUHF2  PIC X(1).                                            
           04 L6EW-JYUHDD  PIC Z(2).                                            
*          非該当予定日(有期認定日)                                             
           04 L6EW-YKNBNG  PIC X(1).                                            
           04 L6EW-YKNBYY  PIC Z(2).                                            
           04 L6EW-YKNBF1  PIC X(1).                                            
           04 L6EW-YKNBMM  PIC Z(2).                                            
           04 L6EW-YKNBF2  PIC X(1).                                            
           04 L6EW-YKNBDD  PIC Z(2).                                            
*          非該当事由                                                           
           04 L6EW-HIGTJM  PIC N(3).                                            
*                                                                               
*    リスト７                                                                   
 01  LIST7W.                                                                    
     02 L7W-REC    OCCURS  5.                                                   
*       年度                                                                    
        03 L7W-NENDNG  PIC X(1).                                                
        03 L7W-NENDYY  PIC Z(2).                                                
*       届の有無                                                                
        03 L7W-TDARNS  PIC N(1).                                                
*       所得制限該当                                                            
        03 L7W-SYTOKU  PIC N(5).                                                
*       扶養（受給者）                                                          
        03 L7W-JQRHKB  PIC ZZ.                                                  
*       老人（受給者）                                                          
        03 L7W-JQRJKB  PIC ZZ.                                                  
*       特定（受給者）                                                          
        03 L7W-JQTKKB  PIC ZZ.                                                  
*       総所得額（受給者）                                                      
        03 L7W-JQSUTG  PIC  ZZ,ZZZ,ZZZ.                                         
*       控除後所得額（受給者）                                                  
        03 L7W-JQKOJG  PIC  ZZ,ZZZ,ZZZ.                                         
*       扶養（配偶者・扶養義務者）                                              
        03 L7W-HQRHKB  PIC ZZ.                                                  
*       老人（配偶者・扶養義務者）                                              
        03 L7W-HQRJKB  PIC ZZ.                                                  
*       特定（配偶者・扶養義務者）                                              
        03 L7W-HQTKKB  PIC ZZ.                                                  
*       総所得額（配偶者・扶養義務者）                                          
        03 L7W-HQSUTG  PIC  ZZ,ZZZ,ZZZ.                                         
*       控除後所得額（配偶者・扶養義務者）                                      
        03 L7W-HQKOJG  PIC  ZZ,ZZZ,ZZZ.                                         
*       支給停止期間                                                            
        03 L7W-KAISNG  PIC X(1).                                                
        03 L7W-KAISYY  PIC Z(2).                                                
        03 L7W-KAISF1  PIC X(1).                                                
        03 L7W-KAISMM  PIC Z(2).                                                
*                                                                               
        03 L7W-SKTSF1  PIC N(1).                                                
*                                                                               
        03 L7W-SYURNG  PIC X(1).                                                
        03 L7W-SYURYY  PIC Z(2).                                                
        03 L7W-SYURF1  PIC X(1).                                                
        03 L7W-SYURMM  PIC Z(2).                                                
*       支給停止月額                                                            
        03 L7W-SKYUGK  PIC ZZZ,ZZZ.                                             
*                                                                               
*    リスト８                                                                   
 01  LIST8W.                                                                    
     02 L8W-REC    OCCURS  5.                                                   
*       年度（支払状況）                                                        
        03 L8W-SNENNG  PIC X(1).                                                
        03 L8W-SNENYY  PIC Z(2).                                                
*       支払予定額（１２月期）                                                  
        03 L8W-SHYO12  PIC ZZ,ZZZ,ZZZ.                                          
*       支払済額（１２月期）                                                    
        03 L8W-SHSM12  PIC ZZ,ZZZ,ZZZ.                                          
*       支払日                                                                  
        03 L8W-SH12NG  PIC X(1).                                                
        03 L8W-SH12YY  PIC Z(2).                                                
        03 L8W-SH12F1  PIC X(1).                                                
        03 L8W-SH12MM  PIC Z(2).                                                
        03 L8W-SH12F2  PIC X(1).                                                
        03 L8W-SH12DD  PIC Z(2).                                                
*       支払予定額（４月期）                                                    
        03 L8W-SHYO04  PIC ZZ,ZZZ,ZZZ.                                          
*       支払済額（４月期）                                                      
        03 L8W-SHSM04  PIC ZZ,ZZZ,ZZZ.                                          
*       支払日                                                                  
        03 L8W-SH04NG  PIC X(1).                                                
        03 L8W-SH04YY  PIC Z(2).                                                
        03 L8W-SH04F1  PIC X(1).                                                
        03 L8W-SH04MM  PIC Z(2).                                                
        03 L8W-SH04F2  PIC X(1).                                                
        03 L8W-SH04DD  PIC Z(2).                                                
*       支払予定額（８月期）                                                    
        03 L8W-SHYO08  PIC ZZ,ZZZ,ZZZ .                                         
*       支払済額（８月期）                                                      
        03 L8W-SHSM08  PIC ZZ,ZZZ,ZZZ .                                         
*       支払日                                                                  
        03 L8W-SH08NG  PIC X(1).                                                
        03 L8W-SH08YY  PIC Z(2).                                                
        03 L8W-SH08F1  PIC X(1).                                                
        03 L8W-SH08MM  PIC Z(2).                                                
        03 L8W-SH08F2  PIC X(1).                                                
        03 L8W-SH08DD  PIC Z(2).                                                
/                                                                               
 PROCEDURE DIVISION.                                                            
***********      I1SU01--I1SU07, I1PS01, I1EU01--I1ES04                         
* LEVEL 1 *                                                                     
***********                                                                     
 MAIN-PROCESS.                                                                  
     PERFORM MAIN-INIT-PROC.                                      I1SU01        
     MOVE ZERO TO F-INP1-CNT.                                     I1SS02        
     OPEN INPUT INP1-FILE.                                        I1SS03        
     PERFORM INP1-READ-RTN THRU INP1-READ-EXT.                    I1SS04*1      
     OPEN OUTPUT OUT1-FILE.                                       I1SS05        
     PERFORM PR-INIT-PROC.                                        I1SU07        
*                                                                               
     PERFORM EDIT-REPORT                                          I1PS01        
         UNTIL INP1-KEY-NEXT = HIGH-VALUE.                                      
*                                                                               
     COMPUTE F-INP1-CNT = F-INP1-CNT - C-DEC1.                    I1ES04        
     DISPLAY F-IOREC-CNT.                                         I1ES04        
     PERFORM MAIN-FINISH-PROC.                                    I1EU01        
     CLOSE INP1-FILE.                                             I1ES02        
     CLOSE INP2-FILE.                                             I1ES03        
     CLOSE INP3-FILE.                                             I1ES04        
     CLOSE INP4-FILE.                                             I1ES05        
     CLOSE INP5-FILE.                                             I1ES06        
     CLOSE INP6-FILE.                                             I1ES07        
     CLOSE INP7-FILE.                                             I1ES08        
     CLOSE INP8-FILE.                                             I1ES09        
     CLOSE INP9-FILE.                                             I1ES10        
     CLOSE INP10-FILE.                                            I1ES11        
     CLOSE INP11-FILE.                                            I1ES12        
     CLOSE OUT1-FILE.                                             I1ES13        
     STOP RUN.                                                                  
/**********                                                                     
* LEVEL 2 *                                                                     
***********                                                                     
 EDIT-REPORT.                                                                   
     PERFORM WORK-INIT-PROC.                                                    
     MOVE INP1-KEY-NEXT TO INP1-KEY.                                            
     MOVE JFJ-SKJNO TO  INP2-KEY.                                               
     PERFORM CHEK-INP2-PROC.                                                    
*                                                                               
     IF  S-INP2-KEYERR NOT = I-TRUE                                             
         PERFORM FILE-EDIT-PROC                                                 
     ELSE                                                                       
         PERFORM INP1-READ-RTN  THRU  INP1-READ-EXT.                            
***********      I3PU01--I3PS05                                                 
* LEVEL 3 *                                                                     
***********                                                                     
 FILE-EDIT-PROC.                                                                
     PERFORM HEAD-RTN   THRU HEAD-EXT.                                          
     PERFORM SINTD-RTN  THRU SINTD-EXT.                                         
     PERFORM JQSIK-RTN  THRU JQSIK-EXT.                                         
     PERFORM SEIQS-RTN  THRU SEIQS-EXT.                                         
     PERFORM TSJDO-RTN  THRU TSJDO-EXT.                                         
     PERFORM HUKUS-RTN  THRU HUKUS-EXT.                                         
     PERFORM NENSQ-RTN  THRU NENSQ-EXT.                                         
     PERFORM OUT1-WRITE-RTN THRU OUT1-WRITE-EXT.                                
     IF  WK-JIDO-FLG  =  1                                                      
         MOVE  ZERO        TO  IDX  IDX2                                        
         INITIALIZE      LIST6W   WK-JDONO-01 S-INP5-END                        
         PERFORM INP5-KAIPAGE-RTN  THRU INP5-KAIPAGE-EXT                        
                           UNTIL S-INP5-END = I-TRUE                            
         IF  IDX  < 6  AND IDX NOT = ZERO                                       
             PERFORM HEAD-RTN   THRU HEAD-EXT                                   
*            帳票出力                                                           
             PERFORM OUT1-WRITE-RTN THRU OUT1-WRITE-EXT.                        
*                                                                               
     PERFORM INP1-READ-RTN THRU INP1-READ-EXT.                                  
/**************   *1=I1SS04, I3PS05  *2=I3PS04  *3=I3PS02                       
* SUBROUTINES *                                                                 
*  (STANDARD) *                                                                 
***************                                                                 
 INP1-READ-RTN.                                                   *1            
     READ INP1-FILE                                                             
         AT END  MOVE HIGH-VALUE TO INP1-KEY-NEXT                               
                 MOVE CORR INP1-KEY-NEXT TO INP1-REC.                           
     MOVE CORR INP1-REC TO INP1-KEY-NEXT.                                       
     COMPUTE F-INP1-CNT = F-INP1-CNT + C-DEC1.                                  
 INP1-READ-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 INP2-READ-RTN.                                                                 
     INITIALIZE  S-INP2-KEYERR.                                                 
     READ INP2-FILE                                                             
         INVALID KEY  MOVE I-TRUE  TO S-INP2-KEYERR .                           
 INP2-READ-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 INP3-READ-RTN.                                                                 
     INITIALIZE  S-INP3-KEYERR.                                                 
     READ INP3-FILE                                                             
         INVALID KEY  MOVE I-TRUE  TO S-INP3-KEYERR.                            
 INP3-READ-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 INP4-STARTP-RTN.                                                               
     INITIALIZE  S-INP4-KEYERR.                                                 
     START   INP4-FILE KEY > INP4-ACP                                           
         INVALID KEY  MOVE I-TRUE  TO S-INP4-KEYERR.                            
 INP4-STARTP-EXT.                                                               
     EXIT.                                                                      
*                                                                               
 INP4-LAST-RTN.                                                                 
     INITIALIZE  S-INP4-KEYERR.                                                 
     START INP4-FILE LAST RECORD                                                
         INVALID KEY  MOVE I-TRUE  TO S-INP4-KEYERR.                            
 INP4-LAST-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 INP4-READP-RTN.                                                                
     INITIALIZE  S-INP4-END.                                                    
     READ INP4-FILE   PRIOR                                                     
         AT END  MOVE I-TRUE     TO S-INP4-END                                  
                 MOVE I-TRUE     TO END-FLG.                                    
 INP4-READP-EXT.                                                                
     EXIT.                                                                      
*                                                                               
 INP5-START-RTN.                                                                
     INITIALIZE  S-INP5-KEYERR.                                                 
     START   INP5-FILE KEY NOT < INP5-ACP                                       
         INVALID KEY  MOVE I-TRUE  TO S-INP5-KEYERR.                            
 INP5-START-EXT.                                                                
     EXIT.                                                                      
*                                                                               
 INP5-READNE-RTN.                                                               
     INITIALIZE  S-INP5-END.                                                    
     READ    INP5-FILE NEXT                                                     
         AT END  MOVE I-TRUE       TO S-INP5-END.                               
 INP5-READNE-EXT.                                                               
     EXIT.                                                                      
*                                                                               
 INP6-STARTP-RTN.                                                               
     INITIALIZE  S-INP6-KEYERR.                                                 
     START   INP6-FILE KEY > INP6-ACP1                                          
         INVALID KEY  MOVE I-TRUE  TO S-INP6-KEYERR.                            
 INP6-STARTP-EXT.                                                               
     EXIT.                                                                      
*                                                                               
 INP6-LAST-RTN.                                                                 
     INITIALIZE  S-INP6-KEYERR.                                                 
     START INP6-FILE LAST RECORD                                                
         INVALID KEY  MOVE I-TRUE  TO S-INP6-KEYERR.                            
 INP6-LAST-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 INP6-READP-RTN.                                                                
     INITIALIZE  S-INP6-END.                                                    
     READ INP6-FILE   PRIOR                                                     
         AT END  MOVE I-TRUE     TO S-INP6-END.                                 
 INP6-READP-EXT.                                                                
     EXIT.                                                                      
*                                                                               
 INP7-STARTP-RTN.                                                               
     INITIALIZE  S-INP7-KEYERR.                                                 
     START   INP7-FILE KEY > INP7-ACP                                           
         INVALID KEY  MOVE I-TRUE  TO S-INP7-KEYERR.                            
 INP7-STARTP-EXT.                                                               
     EXIT.                                                                      
*                                                                               
 INP7-LAST-RTN.                                                                 
     INITIALIZE  S-INP7-KEYERR.                                                 
     START INP7-FILE LAST RECORD                                                
         INVALID KEY  MOVE I-TRUE  TO S-INP7-KEYERR.                            
 INP7-LAST-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 INP7-READP-RTN.                                                                
     INITIALIZE  S-INP7-END.                                                    
     READ INP7-FILE   PRIOR                                                     
         AT END  MOVE I-TRUE     TO S-INP7-END.                                 
 INP7-READP-EXT.                                                                
     EXIT.                                                                      
*                                                                               
 INP8-STARTP-RTN.                                                               
     INITIALIZE  S-INP8-KEYERR.                                                 
     START   INP8-FILE KEY > INP8-ACP                                           
         INVALID KEY  MOVE I-TRUE  TO S-INP8-KEYERR.                            
 INP8-STARTP-EXT.                                                               
     EXIT.                                                                      
*                                                                               
 INP8-LAST-RTN.                                                                 
     INITIALIZE  S-INP8-KEYERR.                                                 
     START INP8-FILE LAST RECORD                                                
         INVALID KEY  MOVE I-TRUE  TO S-INP8-KEYERR.                            
 INP8-LAST-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 INP8-READP-RTN.                                                                
     INITIALIZE  S-INP8-END.                                                    
     READ INP8-FILE   PRIOR                                                     
         AT END  MOVE I-TRUE     TO S-INP8-END.                                 
 INP8-READP-EXT.                                                                
     EXIT.                                                                      
*                                                                               
 INP9-READ-RTN.                                                                 
     INITIALIZE  S-INP9-KEYERR.                                                 
     READ INP9-FILE   KEY IS  INP9-ACP                                          
         INVALID KEY  MOVE I-TRUE  TO S-INP9-KEYERR.                            
 INP9-READ-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 INP10-STARTP-RTN.                                                              
     INITIALIZE  S-INP10-KEYERR.                                                
     START   INP10-FILE KEY > INP10-KEY                                         
         INVALID KEY  MOVE I-TRUE  TO S-INP10-KEYERR.                           
 INP10-STARTP-EXT.                                                              
     EXIT.                                                                      
*                                                                               
 INP10-LAST-RTN.                                                                
     INITIALIZE  S-INP10-KEYERR.                                                
     START INP10-FILE LAST RECORD                                               
         INVALID KEY  MOVE I-TRUE  TO S-INP10-KEYERR.                           
 INP10-LAST-EXT.                                                                
     EXIT.                                                                      
*                                                                               
 INP10-READP-RTN.                                                               
     INITIALIZE  S-INP10-END.                                                   
     READ INP10-FILE   PRIOR                                                    
         AT END  MOVE I-TRUE     TO S-INP10-END.                                
 INP10-READP-EXT.                                                               
     EXIT.                                                                      
*                                                                               
 INP11-STARTP-RTN.                                                              
     INITIALIZE  S-INP11-KEYERR.                                                
     START   INP11-FILE KEY > INP11-KEY                                         
         INVALID KEY  MOVE I-TRUE  TO S-INP11-KEYERR.                           
 INP11-STARTP-EXT.                                                              
     EXIT.                                                                      
*                                                                               
 INP11-LAST-RTN.                                                                
     INITIALIZE  S-INP11-KEYERR.                                                
     START INP11-FILE LAST RECORD                                               
         INVALID KEY  MOVE I-TRUE  TO S-INP11-KEYERR.                           
 INP11-LAST-EXT.                                                                
     EXIT.                                                                      
*                                                                               
 INP11-READP-RTN.                                                               
     INITIALIZE  S-INP11-END.                                                   
     READ INP11-FILE   PRIOR                                                    
         AT END  MOVE I-TRUE     TO S-INP11-END.                                
 INP11-READP-EXT.                                                               
     EXIT.                                                                      
/*************                                                                  
* USERS PROC *                                                                  
**************                                                                  
*                                                                               
 HEAD-RTN.                                                        *3            
     IF LINAGE-COUNTER = C-DEC1                                                 
        PERFORM HEAD-PRINT-PROC                                                 
     ELSE                                                                       
        NEXT SENTENCE.                                                          
 HEAD-EXT.                                                                      
     EXIT.                                                                      
*                                                                               
 MAIN-INIT-PROC.                                                                
     CALL "CMPDATES" USING  CMLBDATE.                                           
     MOVE CM-WREKIX  TO  WK-NR-WNG.                                             
     MOVE CM-WYYX    TO  WK-NR-WYY.                                             
     MOVE CM-WMMX    TO  WK-NR-WMM.                                             
*                                                                               
     IF  WK-NR-WMM      > 3                                                     
         ADD 1          TO WK-NR-WYY.                                           
*                                                                               
* (FROM I1SU07)                                                                 
 PR-INIT-PROC.                                                                  
     OPEN INPUT INP2-FILE.                                                      
     OPEN INPUT INP3-FILE.                                                      
     OPEN INPUT INP4-FILE.                                                      
     OPEN INPUT INP5-FILE.                                                      
     OPEN INPUT INP6-FILE.                                                      
     OPEN INPUT INP7-FILE.                                                      
     OPEN INPUT INP8-FILE.                                                      
     OPEN INPUT INP9-FILE.                                                      
     OPEN INPUT INP10-FILE.                                                     
     OPEN INPUT INP11-FILE.                                                     
*                                                                               
     INITIALIZE OUT1-REC1.                                                      
*                                                                               
* (FROM I1EU01)                                                                 
 MAIN-FINISH-PROC.                                                              
     MOVE F-IOREC-CNT TO LIST.                                                  
     WRITE OUT1-REC1 FROM LIST  BEFORE 2.                                       
*                                                                               
 WORK-INIT-PROC.                                                                
     INITIALIZE HEAD1  LIST1  LIST2  LIST3   LIST4   LIST5                      
                LIST6  LIST7  LIST8  LIST9   LIST6W  LIST7W                     
                LIST8W IDX    IDX1   WK-TATGK-R      WK-NEW-YM                  
                WK-OLD-YM     WK-TATGK WK-SHRGK      HENSYU-GUB                 
                WK-ZGR-INPUT  WK-ZGR-OUTPUT  INADR   OUTADR                     
                WK-KJG-MAX    WK-TATGK-R     WK-SHRGK WK-SIKYU-FLG              
                WK-HYOJI-FLG  HENSYU-END     WK-CQKYM WK-SV-STT                 
                WK-TAIHI      WK-SV-CQRKB    WK-TATGK WK-SV-TATGK               
                WK-TJDSU      WK-SV-TJDSU    WK-ZCQGK WK-NR-WDATE               
                WK-JDONO-01   IDX2  WK-JIDO-FLG1 WK-JIDO-FLG2                   
                WK-JIDO-FLG3  WK-JIDO-FLG WK-HHKNO WK-TTKNO                     
                WK-YKNBI   .                                                    
*                                                                               
**************                                                                  
*住記チェック*                                                                  
**************                                                                  
 CHEK-INP2-PROC.                                                                
     INITIALIZE S-INP2-KEYERR                .                                  
     PERFORM INP2-READ-RTN THRU INP2-READ-EXT.                                  
     IF  S-INP2-KEYERR NOT = I-TRUE                                             
         NEXT SENTENCE                                                          
     ELSE                                                                       
         DISPLAY "JFU225P 住記リンク一時Ｆ" INP2-KEY.                           
*                                                                               
**************************                                                      
*    申請届出情報編集処理                                                       
**************************                                                      
 SINTD-RTN.                                                                     
     MOVE  ZERO           TO  IDX.                                              
*    申請届出情報チェック処理                                                   
     PERFORM SINSE-CHEK-RTN  THRU SINSE-CHEK-EXT.                               
*                                                                               
*    表示フラグが１、開始　≦　終了の時のみ表示                                 
     IF  WK-HYOJI-FLG = 1 AND WK-T-KAISI NOT > WK-T-SYURYO                      
         PERFORM SIKYU-SET-RTN THRU SIKYU-SET-EXT                               
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
 SINTD-EXT.                                                                     
     EXIT.                                                                      
/                                                                               
******************************                                                  
*    申請届出情報チェック処理                                                   
******************************                                                  
 SINSE-CHEK-RTN.                                                                
     MOVE JFJ-DNTKB              TO JFTA1-DNTKB.                                
     MOVE JFJ-SKJNO              TO JFTA1-SKJNO.                                
     MOVE JFJ-NTRNO              TO JFTA1-NTRNO.                                
     MOVE 999                    TO JFTA1-STRNO.                                
*    スタート→編集                                                             
     PERFORM INP4-STARTP-RTN THRU INP4-STARTP-EXT.                              
     IF  S-INP4-KEYERR  = I-TRUE                                                
         PERFORM INP4-LAST-RTN THRU INP4-LAST-EXT.                              
     IF  S-INP4-KEYERR  NOT = I-TRUE                                            
*        データのチェック処理（１件目の年度確定）                               
         INITIALIZE S-INP4-END  END-FLG                                         
         PERFORM DATA-CHEK1-RTN THRU DATA-CHEK1-EXT                             
                                  UNTIL S-INP4-END  =  I-TRUE                   
         PERFORM RDEND-HANTEI-RTN THRU RDEND-HANTEI-EXT                         
*        支給停止年月編集                                                       
         IF  WK-T-KAISI  > ZERO  AND END-FLG NOT = I-TRUE                       
*            １件目の年度確定した場合                                           
             PERFORM TEISI-EDIT-RTN THRU TEISI-EDIT-EXT                         
                                    UNTIL S-INP4-END  =  I-TRUE                 
         ELSE                                                                   
             NEXT SENTENCE                                                      
     ELSE                                                                       
         DISPLAY "JFU225P 申請届出Ｍに該当データ無し".                          
*                                                                               
 SINSE-CHEK-EXT.                                                                
     EXIT.                                                                      
/                                                                               
********************************************                                    
*    データのチェック処理（１件目の年度確定）                                   
********************************************                                    
 DATA-CHEK1-RTN.                                                                
     PERFORM INP4-READP-RTN THRU INP4-READP-EXT.                                
     IF  S-INP4-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFT-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFT-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFT-NTRNO                                         
*            キーが変わっていれば、画面編集終わり                               
             MOVE I-TRUE   TO S-INP4-END                                        
             MOVE I-TRUE   TO END-FLG                                           
         ELSE                                                                   
         IF  JFT-KTEKB  = 1                                                     
             PERFORM NEN-EDIT2-RTN  THRU  NEN-EDIT2-EXT                         
         ELSE                                                                   
             NEXT SENTENCE                                                      
     ELSE                                                                       
         MOVE I-TRUE   TO S-INP4-END                                            
         MOVE I-TRUE   TO END-FLG.                                              
*                                                                               
 DATA-CHEK1-EXT.                                                                
     EXIT.                                                                      
*                                                                               
*                                                                               
 DATA-CHEK2-RTN.                                                                
     PERFORM INP4-READP-RTN THRU INP4-READP-EXT.                                
     IF  S-INP4-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFT-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFT-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFT-NTRNO                                         
*            キーが変わっていれば、画面編集終わり                               
             MOVE I-TRUE   TO S-INP4-END                                        
             MOVE I-TRUE   TO END-FLG                                           
         ELSE                                                                   
         IF  JFT-KTEKB  = 1                                                     
             PERFORM SINKB-EDIT-RTN THRU SINKB-EDIT-EXT                         
             MOVE JFT-CQKYM       TO WK-NEW-YM                                  
             IF  WK-NEW-TUKI NOT < 1  AND  WK-NEW-TUKI NOT > 7                  
                 COMPUTE  WK-NEW-NEN = WK-NEW-NEN - 1                           
                 IF  WK-NEW-NEN  =  WK-OLD-NEN                                  
                     NEXT SENTENCE                                              
                 ELSE                                                           
                     PERFORM NEN-EDIT2-RTN  THRU  NEN-EDIT2-EXT                 
             ELSE                                                               
                 IF  WK-NEW-NEN  =  WK-OLD-NEN                                  
                     NEXT SENTENCE                                              
                 ELSE                                                           
                     PERFORM NEN-EDIT2-RTN  THRU  NEN-EDIT2-EXT                 
         ELSE                                                                   
             NEXT SENTENCE                                                      
     ELSE                                                                       
         MOVE I-TRUE   TO S-INP4-END                                            
         MOVE I-TRUE   TO END-FLG.                                              
*                                                                               
 DATA-CHEK2-EXT.                                                                
     EXIT.                                                                      
***********************                                                         
*    支給停止編集出力                                                           
***********************                                                         
 SIKYU-SYUTU-RTN.                                                               
*    表示フラグが１、開始　≦　終了の時のみ表示                                 
     IF  WK-HYOJI-FLG = 1 AND WK-T-KAISI NOT > WK-T-SYURYO                      
         PERFORM SIKYU-SET-RTN THRU SIKYU-SET-EXT.                              
 SIKYU-SYUTU-EXT.                                                               
     EXIT.                                                                      
*                                                                               
*************************                                                       
*    申請届出区分名称編集                                                       
*************************                                                       
 SINKB-EDIT-RTN.                                                                
*    現況届出区分名称                                                           
     IF  JFT-STDKB  = 03                                                        
         MOVE  NC"有"                TO L7W-TDARNS(IDX).                        
 SINKB-EDIT-EXT.                                                                
     EXIT.                                                                      
*                                                                               
***********************************                                             
*    申請届出マスタ読み込み終了編集                                             
***********************************                                             
 RDEND-HANTEI-RTN.                                                              
     IF  END-FLG NOT = I-TRUE                                                   
         INITIALIZE S-INP4-END WK-HYOJI-FLG HENSYU-END                          
*        現況届編集                                                             
         PERFORM GENKT-EDIT-RTN THRU GENKT-EDIT-EXT                             
     ELSE                                                                       
         NEXT SENTENCE.                                                         
 RDEND-HANTEI-EXT.                                                              
     EXIT.                                                                      
*                                                                               
****************                                                                
*    現況届編集                                                                 
****************                                                                
 GENKT-EDIT-RTN.                                                                
*                                                                               
*    所得判定部分編集                                                           
     PERFORM SYOTK-RTN               THRU SYOTK-EXT.                            
*                                                                               
     IF  JFT-STDKB  = 03 OR  WK-SEIGYO-FLG = 1                                  
         ADD  1                TO  IDX.                                         
*                                                                               
*    最新現況年度                                                               
     IF  JFT-STDKB  = 03 OR  WK-SEIGYO-FLG = 1                                  
         IF  WK-OLD-NEN           NOT =  ZERO                                   
             INITIALIZE                 WK-DATE                                 
             MOVE WK-OLD-NEN         TO WK-YY                                   
             MOVE 01                 TO WK-MM                                   
             MOVE 01                 TO WK-DD                                   
             PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                        
             MOVE WK-WNG             TO L7W-NENDNG(IDX)                         
             MOVE WK-WYY             TO L7W-NENDYY(IDX).                        
*                                                                               
*    現況届出区分名称                                                           
     IF  JFT-STDKB  = 03                                                        
         MOVE  NC"有"                TO L7W-TDARNS(IDX).                        
*    所得制限の該当                                                             
     IF  JFT-STDKB  = 03  OR  WK-SEIGYO-FLG = 1                                 
         IF  JFT-CQRKB   = 1                                                    
             MOVE  NC"該当"          TO L7W-SYTOKU(IDX)                         
         ELSE                                                                   
         IF  JFT-CQRKB   = 2                                                    
             MOVE  NC"一部該当"      TO L7W-SYTOKU(IDX)                         
         ELSE                                                                   
         IF  JFT-CQRKB   = 3                                                    
             MOVE  NC"非該当"        TO L7W-SYTOKU(IDX)                         
         ELSE                                                                   
             NEXT SENTENCE                                                      
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
 GENKT-EDIT-EXT.                                                                
     EXIT.                                                                      
*                                                                               
**********************                                                          
*    支給停止年月編集                                                           
**********************                                                          
 TEISI-EDIT-RTN.                                                                
     IF  S-INP4-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFT-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFT-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFT-NTRNO                                         
*            キーが変わっていれば、画面編集終わり                               
             MOVE I-TRUE   TO S-INP4-END                                        
         ELSE                                                                   
         IF  (WK-NEW-NEN <  WK-OLD-NEN )  OR (HENSYU-END  =  "1" )              
             MOVE ZERO           TO  WK-SEIGYO-FLG                              
*            支給停止編集出力                                                   
             PERFORM SIKYU-SYUTU-RTN THRU  SIKYU-SYUTU-EXT                      
*                                                                               
             IF  WK-NEW-NEN  <  WK-OLD-NEN                                      
                 MOVE  WK-NEW-NEN    TO  WK-OLD-NEN                             
                 INITIALIZE WK-HYOJI-FLG                                        
*                現況届編集                                                     
                 PERFORM GENKT-EDIT-RTN THRU GENKT-EDIT-EXT                     
             ELSE                                                               
             IF  HENSYU-END  =  "1"                                             
                 PERFORM DATA-CHEK2-RTN THRU DATA-CHEK2-EXT                     
                              UNTIL S-INP4-END  =  I-TRUE                       
                 PERFORM RDEND-HANTEI-RTN THRU RDEND-HANTEI-EXT                 
             ELSE                                                               
                 NEXT  SENTENCE                                                 
         ELSE                                                                   
         IF  IDX  = 5                                                           
             MOVE I-TRUE   TO S-INP4-END                                        
         ELSE                                                                   
         IF  (JFT-KTEKB  = 1  AND  JFT-STDKB  = 03 )  OR                        
             (JFT-KTEKB  = 1  AND  WK-SEIGYO-FLG = 1 )                          
*            支給停止年月編集サブルチン（対象となるデータ）                     
             PERFORM TEISI-EDIT-SUBRTN THRU TEISI-EDIT-SUBEXT                   
         ELSE                                                                   
             PERFORM DATA-CHEK1-RTN THRU DATA-CHEK1-EXT                         
                              UNTIL S-INP4-END  =  I-TRUE                       
             PERFORM RDEND-HANTEI-RTN THRU RDEND-HANTEI-EXT                     
     ELSE                                                                       
         MOVE I-TRUE   TO S-INP4-END .                                          
*                                                                               
 TEISI-EDIT-EXT.                                                                
     EXIT.                                                                      
*                                                                               
**************                                                                  
*    年の編集                                                                   
**************                                                                  
 NEN-EDIT1-RTN.                                                                 
     IF  S-INP4-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFT-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFT-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFT-NTRNO                                         
*            キーが変わっていれば、画面編集終わり                               
             MOVE I-TRUE   TO S-INP4-END                                        
         ELSE                                                                   
             MOVE JFT-CQKYM       TO WK-NEW-YM                                  
             IF  WK-NEW-TUKI NOT < 1  AND  WK-NEW-TUKI NOT > 7                  
                 COMPUTE  WK-NEW-NEN = WK-NEW-NEN - 1                           
             ELSE                                                               
                 NEXT SENTENCE                                                  
     ELSE                                                                       
         MOVE I-TRUE   TO S-INP4-END .                                          
 NEN-EDIT1-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
 NEN-EDIT2-RTN.                                                                 
     MOVE JFT-CQKYM     TO   WK-T-KAISI  WK-SV-STT.                             
     MOVE JFT-CQRKB     TO   WK-SV-CQRKB.                                       
     MOVE JFT-TATGK     TO   WK-SV-TATGK.                                       
     MOVE JFT-TJDSU     TO   WK-SV-TJDSU.                                       
     IF  WK-T-KMM NOT < 8  AND  WK-T-KMM NOT > 12                               
         MOVE 08        TO   WK-T-KMM                                           
         MOVE 07        TO   WK-T-SMM                                           
         COMPUTE  WK-T-SYY = WK-T-KYY + 1                                       
*        退避                                                                   
         MOVE WK-T-KYY       TO  WK-NEW-NEN  WK-OLD-NEN                         
*                                                                               
         MOVE I-TRUE   TO S-INP4-END                                            
     ELSE                                                                       
     IF  WK-T-KMM NOT < 1  AND  WK-T-KMM NOT > 7                                
         MOVE 08             TO WK-T-KMM                                        
         MOVE 07             TO WK-T-SMM                                        
         MOVE  WK-T-KYY      TO WK-T-SYY                                        
         COMPUTE  WK-T-KYY = WK-T-KYY - 1                                       
*        退避                                                                   
         MOVE WK-T-KYY       TO  WK-NEW-NEN  WK-OLD-NEN                         
*                                                                               
         MOVE I-TRUE   TO S-INP4-END                                            
     ELSE                                                                       
         NEXT SENTENCE.                                                         
 NEN-EDIT2-EXT.                                                                 
     EXIT.                                                                      
***************************************************                             
*    支給停止年月編集サブルチン（対象となるデータ）                             
***************************************************                             
 TEISI-EDIT-SUBRTN.                                                             
     MOVE JFT-CQKYM       TO  WK-TAIHI.                                         
*                                                                               
     IF (JFT-CQKYM NOT <  WK-T-KAISI)  AND                                      
        (JFT-CQKYM NOT >  WK-T-SYURYO)                                          
         IF  JFT-CQRKB  = 2 OR 3                                                
             MOVE  1      TO WK-HYOJI-FLG                                       
         ELSE                                                                   
         IF  JFT-STDKB  = 21 OR 22                                              
             MOVE  1      TO WK-HYOJI-FLG                                       
         ELSE                                                                   
             NEXT SENTENCE                                                      
     ELSE                                                                       
         IF  WK-SIKYU-FLG3 NOT = 1 AND JFT-STDKB  = 21                          
             MOVE  1      TO WK-HYOJI-FLG                                       
         ELSE                                                                   
             NEXT SENTENCE.                                                     
*                                                                               
     IF  JFT-CQRKB  NOT =  WK-SV-CQRKB                                          
         IF  JFT-CQRKB  =  1                                                    
             MOVE WK-SV-STT   TO  WK-CQKYM                                      
             MOVE WK-SV-TATGK TO  JFT-TATGK                                     
             MOVE WK-SV-TJDSU TO  JFT-TJDSU                                     
             PERFORM STT-RTN THRU STT-EXT                                       
         ELSE                                                                   
             COMPUTE WK-CQKMM = WK-SV-STMM - 1                                  
             MOVE WK-SV-STYY  TO WK-CQKYY                                       
             MOVE JFT-CQKYM  TO WK-SV-STT                                       
             MOVE JFT-CQRKB  TO WK-SV-CQRKB                                     
             PERFORM END-RTN THRU END-EXT.                                      
*                                                                               
     IF  JFT-STDKB  = 14 OR 15 OR 16                                            
         COMPUTE WK-CQKMM =  WK-TAIHI-MM  - 1                                   
         MOVE  WK-TAIHI-YY TO WK-CQKYY                                          
         MOVE  1      TO  WK-SIKYU-FLG3                                         
         PERFORM END-RTN THRU END-EXT.                                          
*                                                                               
     IF  JFT-STDKB  = 22 AND  JFT-CQRKB  = 1                                    
         COMPUTE WK-CQKMM =  WK-TAIHI-MM  - 1                                   
         MOVE  WK-TAIHI-YY TO WK-CQKYY                                          
         MOVE  1      TO  WK-SIKYU-FLG3                                         
         PERFORM END-RTN THRU END-EXT.                                          
*                                                                               
     IF  JFT-STDKB  = 21 AND  JFT-CQRKB  = 1                                    
         MOVE WK-TAIHI    TO  WK-CQKYM                                          
         PERFORM STT-RTN THRU STT-EXT.                                          
*                                                                               
     IF  JFT-STDKB  = 01 OR 02 OR 03                                            
         MOVE WK-TAIHI    TO  WK-CQKYM                                          
         MOVE "1"         TO HENSYU-END                                         
         PERFORM STT-RTN THRU STT-EXT.                                          
*                                                                               
     IF  HENSYU-END NOT  = "1"                                                  
         PERFORM INP4-READP-RTN THRU INP4-READP-EXT                             
         PERFORM NEN-EDIT1-RTN  THRU  NEN-EDIT1-EXT                             
         IF  WK-NEW-NEN <  WK-OLD-NEN                                           
             NEXT  SENTENCE                                                     
         ELSE                                                                   
         IF  WK-NEW-NEN =  WK-OLD-NEN                                           
             PERFORM SINKB-EDIT-RTN THRU SINKB-EDIT-EXT                         
         ELSE                                                                   
             NEXT  SENTENCE                                                     
     ELSE                                                                       
         NEXT  SENTENCE.                                                        
*                                                                               
 TEISI-EDIT-SUBEXT.                                                             
     EXIT.                                                                      
*                                                                               
**************************************                                          
*    開始ルーチン（支給停止開始年月）                                           
**************************************                                          
 STT-RTN.                                                                       
     IF  WK-CQKYM  NOT <  WK-T-KAISI                                            
         MOVE WK-CQKYM  TO WK-T-KAISI                                           
         MOVE JFT-TATGK TO WK-TATGK                                             
         MOVE JFT-TJDSU TO WK-TJDSU                                             
         MOVE "1"       TO HENSYU-END.                                          
*                                                                               
 STT-EXT.                                                                       
     EXIT.                                                                      
*************************************                                           
*    終了ルーチン（支給停止終了年月）                                           
*************************************                                           
 END-RTN.                                                                       
     IF  WK-CQKMM  = ZERO                                                       
         MOVE 12      TO WK-CQKMM                                               
         COMPUTE WK-CQKYY =  WK-CQKYY  - 1.                                     
*                                                                               
     IF (WK-CQKYM     <  WK-T-SYURYO) AND                                       
        (WK-CQKYM NOT <  WK-T-KAISI)                                            
         MOVE WK-CQKYM   TO  WK-T-SYURYO.                                       
*                                                                               
 END-EXT.                                                                       
     EXIT.                                                                      
****************************                                                    
*    支給停止情報セット処理                                                     
****************************                                                    
 SIKYU-SET-RTN.                                                                 
*    支給停止開始年月                                                           
*                                                                               
     IF  WK-T-KYY  NOT  =  ZERO                                                 
         INITIALIZE         WK-DATE                                             
         MOVE WK-T-KYY      TO WK-YY                                            
         MOVE WK-T-KMM      TO WK-MM                                            
         MOVE 01            TO WK-DD                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG        TO L7W-KAISNG(IDX)                                  
         MOVE WK-WYY        TO L7W-KAISYY(IDX)                                  
         MOVE  ","          TO L7W-KAISF1(IDX)                                  
         MOVE WK-WMM        TO L7W-KAISMM(IDX)                                  
*                                                                               
         MOVE NC"～"        TO L7W-SKTSF1(IDX).                                 
*                                                                               
*    対象児童１８歳チェック                                                     
     PERFORM JIDOU-CHEK-RTN THRU JIDOU-CHEK-EXT.                                
*                                                                               
*    支給停止終了年月                                                           
*                                                                               
     IF  WK-T-SYY  NOT  =  ZERO                                                 
         INITIALIZE         WK-DATE                                             
         MOVE WK-T-SYY      TO WK-YY                                            
         MOVE WK-T-SMM      TO WK-MM                                            
         MOVE 01            TO WK-DD                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG        TO L7W-SYURNG(IDX)                                  
         MOVE WK-WYY        TO L7W-SYURYY(IDX)                                  
         MOVE  ","          TO L7W-SYURF1(IDX)                                  
         MOVE WK-WMM        TO L7W-SYURMM(IDX)                                  
         IF  WK-SIKYU-FLG1 = 1 AND WK-SIKYU-FLG2 = ZERO                         
             MOVE  3        TO L7W-SYURMM(IDX).                                 
*                                                                               
*    支給停止月額                                                               
*                                                                               
     IF  WK-T-KYY NOT = ZERO  AND  WK-T-SYY NOT = ZERO                          
         PERFORM SIKYU-EDIT-SUBRTN  THRU SIKYU-EDIT-SUBEXT.                     
*                                                                               
*                                                                               
 SIKYU-SET-EXT.                                                                 
     EXIT.                                                                      
******************************                                                  
*    支給停止編集サブルーチン                                                   
******************************                                                  
 SIKYU-EDIT-SUBRTN.                                                             
*                                                                               
     MOVE  WK-T-KAISI TO  JCP-KTEYM.                                            
*    手当計算ファイルのリード                                                   
     PERFORM INP10-STARTP-RTN THRU INP10-STARTP-EXT.                            
     IF  S-INP10-KEYERR  = I-TRUE                                               
         PERFORM INP10-LAST-RTN THRU INP10-LAST-EXT.                            
     IF  S-INP10-KEYERR  = I-TRUE                                               
         DISPLAY "JFU225P ﾃｱﾃｹｲｻﾝF ｽﾀｰﾄｴﾗｰ "                                    
     ELSE                                                                       
         PERFORM INP10-READP-RTN THRU INP10-READP-EXT                           
         IF  S-INP10-STATUS  = "00"                                             
             IF  WK-T-KAISI <  JCP-KTEYM                                        
                 DISPLAY "JFU225P ｹｲｻﾝﾌｶ ﾈﾝｹﾞﾂ=" WK-T-KAISI                     
             ELSE                                                               
                 PERFORM CTGK-SET-RTN THRU CTGK-SET-EXT                         
         ELSE                                                                   
             DISPLAY "JFU225P 手当計算Ｆに該当データ無し".                      
*                                                                               
 SIKYU-EDIT-SUBEXT.                                                             
     EXIT.                                                                      
**********************                                                          
*    支給停止月額処理                                                           
**********************                                                          
 CTGK-SET-RTN.                                                                  
*    全部支給額を対象児童数により算出する                                       
     MOVE  JCP-ZCQGK  TO  WK-ZCQGK.                                             
*    対象児童数が２人以上の時                                                   
     IF  WK-TJDSU  >  1                                                         
         COMPUTE  WK-ZCQGK  =  WK-ZCQGK  +  JCP-JD2GK                           
                    +  (WK-TJDSU  -  2)  *  JCP-JD3GK.                          
*    全部支給額－停止期間開始時の手当月額より支給停止額を算出                   
     COMPUTE  L7W-SKYUGK(IDX)  =  WK-ZCQGK  -  WK-TATGK.                        
 CTGK-SET-EXT.                                                                  
     EXIT.                                                                      
***************                                                                 
*所得判定部分 *                                                                 
***************                                                                 
 SYOTK-RTN.                                                                     
     MOVE JFJ-DNTKB  TO JFHA1-DNTKB.                                            
     MOVE JFJ-SKJNO  TO JFHA1-SKJNO.                                            
     MOVE JFJ-NTRNO  TO JFHA1-NTRNO.                                            
     MOVE WK-OLD-NEN TO JFHA1-SHTND.                                            
     MOVE 9999999    TO JFHA1-HTKNO.                                            
     PERFORM INP6-STARTP-RTN THRU INP6-STARTP-EXT.                              
     IF  S-INP6-KEYERR  = I-TRUE                                                
         PERFORM INP6-LAST-RTN THRU INP6-LAST-EXT.                              
     IF  S-INP6-KEYERR  NOT = I-TRUE                                            
         INITIALIZE  S-INP6-END                                                 
         PERFORM INP6-READP-RTN THRU INP6-READP-EXT.                            
     IF  S-INP6-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFH-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFH-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFH-NTRNO OR                                      
             WK-OLD-NEN NOT = JFH-SHTND                                         
             MOVE  ZERO        TO  WK-SEIGYO-FLG                                
             DISPLAY "JFU225P 所得判定Ｍに該当データ無し"                       
         ELSE                                                                   
             MOVE  1           TO  WK-SEIGYO-FLG                                
             COMPUTE IDX =  IDX  +  1                                           
*            所得状況編集（繰返し最大５回）                                     
             PERFORM INP6-EDIT-RTN THRU INP6-EDIT-EXT                           
                          UNTIL S-INP6-END = I-TRUE                             
             COMPUTE IDX =  IDX  -  1                                           
     ELSE                                                                       
         DISPLAY "JFU225P 所得判定Ｍに該当データ無し".                          
 SYOTK-EXT.                                                                     
     EXIT.                                                                      
*                                                                               
********************************                                                
*所得状況編集（繰返し最大５回）*                                                
********************************                                                
 INP6-EDIT-RTN.                                                                 
     IF  S-INP6-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFH-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFH-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFH-NTRNO OR                                      
             WK-OLD-NEN NOT = JFH-SHTND                                         
             MOVE I-TRUE   TO S-INP6-END                                        
         ELSE                                                                   
*            所得状況編集サブルーチン                                           
             PERFORM INP6-EDIT-SUBRTN THRU INP6-EDIT-SUBEXT                     
             PERFORM INP6-READP-RTN   THRU INP6-READP-EXT                       
     ELSE                                                                       
         MOVE I-TRUE   TO S-INP6-END.                                           
 INP6-EDIT-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
***************************                                                     
*所得状況編集サブルーチン *                                                     
***************************                                                     
 INP6-EDIT-SUBRTN.                                                              
*    受給者情報                                                                 
     IF  JFH-HNTKB  =  1 OR 2 OR 3                                              
*        扶養計                                                                 
         MOVE JFH-FYOSU   TO L7W-JQRHKB(IDX)                                    
*        老人                                                                   
         MOVE JFH-RJNSU   TO L7W-JQRJKB(IDX)                                    
*        特定                                                                   
         MOVE JFH-TKTSU   TO L7W-JQTKKB(IDX)                                    
*        総所得額                                                               
         MOVE JFH-STKGK   TO L7W-JQSUTG(IDX)                                    
*        控除後所得額                                                           
         MOVE JFH-KJGGK   TO L7W-JQKOJG(IDX).                                   
*                                                                               
*    配偶者情報・扶養者情報                                                     
*    控除後所得額の一番高い人の控除後所得額と扶養親族数を退避                   
*    ただし非該当事由が入っていない人の中から                                   
     IF (JFH-HNTKB  =  4 OR 5)    AND                                           
        (JFH-KJGGK  > WK-KJG-MAX) AND                                           
        (JFH-HIGJU = ZEROS)                                                     
         MOVE JFH-KJGGK   TO  WK-KJG-MAX                                        
*        扶養計                                                                 
         MOVE JFH-FYOSU   TO L7W-HQRHKB(IDX)                                    
*        老人                                                                   
         MOVE JFH-RJNSU   TO L7W-HQRJKB(IDX)                                    
*        特定                                                                   
         MOVE JFH-TKTSU   TO L7W-HQTKKB(IDX)                                    
*        総所得額                                                               
         MOVE JFH-STKGK   TO L7W-HQSUTG(IDX)                                    
*        控除後所得額                                                           
         MOVE JFH-KJGGK   TO L7W-HQKOJG(IDX).                                   
*                                                                               
 INP6-EDIT-SUBEXT.                                                              
     EXIT.                                                                      
*                                                                               
*****************************                                                   
*    対象児童１８歳チェック                                                     
*****************************                                                   
 JIDOU-CHEK-RTN.                                                                
*    検索キーセット                                                             
     MOVE JFJ-DNTKB              TO JFDA1-DNTKB.                                
     MOVE JFJ-SKJNO              TO JFDA1-SKJNO.                                
     MOVE JFJ-NTRNO              TO JFDA1-NTRNO.                                
     MOVE ZEROS                  TO JFDA1-JDONO.                                
*    スタート→編集                                                             
     PERFORM INP5-START-RTN THRU INP5-START-EXT.                                
     IF  S-INP5-KEYERR  = I-TRUE                                                
         INITIALIZE S-INP5-END                                                  
         PERFORM JIDOU-CHEK-SUBRTN THRU JIDOU-CHEK-SUBEXT                       
                                   UNTIL S-INP5-END = I-TRUE.                   
 JIDOU-CHEK-EXT.                                                                
     EXIT.                                                                      
/                                                                               
****************************************                                        
*    対象児童１８歳チェックサブルーチン                                         
****************************************                                        
 JIDOU-CHEK-SUBRTN.                                                             
     PERFORM INP5-READNE-RTN THRU INP5-READNE-EXT.                              
     IF  S-INP5-STATUS  = "00"                                                  
*        キーチェック                                                           
         IF  JFJ-DNTKB   NOT = JFD-DNTKB OR                                     
             JFJ-SKJNO   NOT = JFD-SKJNO OR                                     
             JFJ-NTRNO   NOT = JFD-NTRNO                                        
*            キーが変わっていれば、画面編集終わり                               
             MOVE I-TRUE      TO S-INP5-END                                     
         ELSE                                                                   
*            キーセット                                                         
             MOVE JFD-JDKNO     TO INP2-KEY                                     
*            住記ファイル児童情報チェック                                       
             PERFORM CHEK-INP2-PROC                                             
*            児童年齢取得                                                       
             MOVE B15-UGP       TO SS-SEINENBI                                  
             MOVE WK-NR-WNG     TO SS-K-N                                       
             MOVE WK-NR-WYY     TO SS-K-YY                                      
             MOVE 03            TO SS-K-MM                                      
             MOVE 31            TO SS-K-DD                                      
             PERFORM NENREI-RTN THRU NENREI-EXT                                 
*            支給停止年月を編集するためのフラグ設定                             
*            児童年齢が１８歳以上の時                                           
             IF  SS-TOSI     > 18                                               
                 MOVE 1         TO WK-SIKYU-FLG1                                
             ELSE                                                               
                 MOVE 1         TO WK-SIKYU-FLG2                                
     ELSE                                                                       
         MOVE I-TRUE      TO S-INP5-END.                                        
*                                                                               
 JIDOU-CHEK-SUBEXT.                                                             
     EXIT.                                                                      
**************                                                                  
*受給資格部分*                                                                  
**************                                                                  
 JQSIK-RTN.                                                                     
     PERFORM INP1-EDIT-RTN THRU INP1-EDIT-EXT.                                  
 JQSIK-EXT.                                                                     
     EXIT.                                                                      
*                                                                               
******************                                                              
*受給資格部分編集*                                                              
******************                                                              
 INP1-EDIT-RTN.                                                                 
**   住記情報                                                                   
     MOVE JFJ-SKJNO   TO INP2-KEY.                                              
     PERFORM CHEK-INP2-PROC.                                                    
*                                                                               
*    受給者生年月日                                                             
     IF  B15-UGP  NOT = ZERO                                                    
         INITIALIZE        WK-UGP                                               
         MOVE B15-UGP   TO WK-UGP                                               
         IF  WK-JUGG        = "1"                                               
             MOVE "M"   TO L1-SEINENNG                                          
         ELSE                                                                   
         IF  WK-JUGG        = "2"                                               
             MOVE "T"   TO L1-SEINENNG                                          
         ELSE                                                                   
         IF  WK-JUGG        = "3"                                               
             MOVE "S"   TO L1-SEINENNG                                          
         ELSE                                                                   
         IF  WK-JUGG        = "4"                                               
             MOVE "H"   TO L1-SEINENNG                                          
         ELSE                                                                   
             INITIALIZE    L1-SEINENNG .                                        
     IF  B15-UGP  NOT = ZERO                                                    
         MOVE WK-JUGY   TO L1-SEINENYY                                          
         MOVE ","       TO L1-SEINENF1                                          
         MOVE WK-JUGM   TO L1-SEINENMM                                          
         MOVE ","       TO L1-SEINENF2                                          
         MOVE WK-JUGD   TO L1-SEINENDD.                                         
*    資格終了日                                                                 
     IF  JFJ-SKSBI           NOT =  ZERO                                        
         INITIALIZE                 WK-DATE                                     
         MOVE JFJ-SKSBI          TO WK-DATE                                     
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG             TO L9-SOSTNG                                   
         MOVE WK-WYY             TO L9-SOSTYY                                   
         MOVE ","                TO L9-SOSTF1                                   
         MOVE WK-WMM             TO L9-SOSTMM                                   
         MOVE ","                TO L9-SOSTF2                                   
         MOVE WK-WDD             TO L9-SOSTDD.                                  
*    資格終了事由名称                                                           
     IF  JFJ-SKSJU  NOT =  ZERO  AND SPACE                                      
         MOVE 0007          TO JCDA1-CDSYR                                      
         MOVE JFJ-SKSJU     TO JCDA1-CDKBN                                      
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-RYAKM TO L9-SOSTJU.                                       
*    証書番号                                                                   
     MOVE  JFJ-SHBAN        TO L2-SHBAN.                                        
*    支給類型区分名称                                                           
     IF  JFJ-CQRKB  NOT = ZERO AND  SPACE                                       
         MOVE 0002          TO JCDA1-CDSYR                                      
         MOVE JFJ-CQRKB     TO JCDA1-CDKBN                                      
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-SETUM TO L3-SIKYU.                                        
*    手当月額                                                                   
     MOVE JFJ-TATGK         TO L4-TATGK.                                        
     MOVE NC"円"            TO L4-TATGK-N.                                      
*    証書交付日                                                                 
     IF  JFJ-KFUBI           NOT =  ZERO                                        
         INITIALIZE                 WK-DATE                                     
         MOVE JFJ-KFUBI          TO WK-DATE                                     
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG             TO L6DW-SYOSNG(1)                              
         MOVE WK-WYY             TO L6DW-SYOSYY(1)                              
         MOVE ","                TO L6DW-SYOSF1(1)                              
         MOVE WK-WMM             TO L6DW-SYOSMM(1)                              
         MOVE ","                TO L6DW-SYOSF2(1)                              
         MOVE WK-WDD             TO L6DW-SYOSDD(1)                              
         MOVE "(   )"            TO L6DW-KIGO(1)                                
         MOVE NC"印"             TO L6DW-INKAN(1).                              
 INP1-EDIT-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
************                                                                    
*請求者部分*                                                                    
************                                                                    
 SEIQS-RTN.                                                                     
*    郵便番号                                                                   
     MOVE JFS-ZIPHN   TO HENSYU-UBN1.                                           
     MOVE "-"         TO HENSYU-UBF.                                            
     MOVE JFS-ZIPED   TO HENSYU-UBN2.                                           
     MOVE HENSYU-GUB  TO L1-ZIP8.                                               
*    請求者カナ氏名                                                             
     MOVE JFS-KNANM   TO L1-SIMEI-K.                                            
*    請求者漢字氏名                                                             
     MOVE JFS-KJINM   TO L2-SIMEI-N.                                            
*    請求者住所                                                                 
     MOVE JFS-ADRSN   TO L1-ADRS.                                               
*    請求者方書                                                                 
     MOVE JFS-KATAG   TO L2-KATA.                                               
*    電話番号                                                                   
     MOVE JFS-TELNO   TO L2-TEL.                                                
*    備考                                                                       
     MOVE JFS-BIKOU   TO L9-BIKO.                                               
 SEIQS-EXT.                                                                     
     EXIT.                                                                      
*                                                                               
**************                                                                  
*年度支給部分*                                                                  
**************                                                                  
 NENSQ-RTN.                                                                     
     MOVE JFJ-DNTKB  TO JFNA1-DNTKB.                                            
     MOVE JFJ-SKJNO  TO JFNA1-SKJNO.                                            
     MOVE JFJ-NTRNO  TO JFNA1-NTRNO.                                            
     MOVE 9999       TO JFNA1-JGYND.                                            
     PERFORM INP7-STARTP-RTN THRU INP7-STARTP-EXT.                              
     IF  S-INP7-KEYERR  = I-TRUE                                                
         PERFORM INP7-LAST-RTN THRU INP7-LAST-EXT.                              
     IF  S-INP7-KEYERR  NOT = I-TRUE                                            
         INITIALIZE  IDX  S-INP7-END                                            
         PERFORM INP7-READP-RTN THRU INP7-READP-EXT.                            
     IF  S-INP7-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFN-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFN-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFN-NTRNO                                         
             DISPLAY "JFU225P 年度支給Ｍに該当データ無し"                       
         ELSE                                                                   
*            年度支給編集（繰返し最大５回）                                     
             PERFORM INP7-HENSYU-RTN THRU INP7-HENSYU-EXT                       
                          UNTIL S-INP7-END = I-TRUE                             
     ELSE                                                                       
         DISPLAY "JFU225P 年度支給Ｍに該当データ無し".                          
*                                                                               
 NENSQ-EXT.                                                                     
     EXIT.                                                                      
*                                                                               
***********************************                                             
*    年度支給編集（繰返し最大５回）                                             
***********************************                                             
 INP7-HENSYU-RTN.                                                               
     IF  S-INP7-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFN-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFN-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFN-NTRNO                                         
*            キーが変わっていれば、画面編集終わり                               
             MOVE I-TRUE   TO S-INP7-END                                        
         ELSE                                                                   
         IF  IDX  = 5                                                           
             MOVE I-TRUE   TO S-INP7-END                                        
         ELSE                                                                   
             ADD  1               TO  IDX                                       
*            年度支給編集                                                       
             PERFORM INP7-EDIT-RTN THRU INP7-EDIT-EXT                           
             PERFORM INP7-READP-RTN THRU INP7-READP-EXT                         
     ELSE                                                                       
         MOVE I-TRUE   TO S-INP7-END .                                          
*                                                                               
 INP7-HENSYU-EXT.                                                               
     EXIT.                                                                      
*                                                                               
**************                                                                  
*年度支給編集*                                                                  
**************                                                                  
 INP7-EDIT-RTN.                                                                 
*    年度（支払状況）                                                           
     IF  JFN-JGYND     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFN-JGYND   TO WK-YY                                              
         MOVE 01          TO WK-MM                                              
         MOVE 01          TO WK-DD                                              
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L8W-SNENNG(IDX)                                    
         MOVE WK-WYY      TO L8W-SNENYY(IDX).                                   
*                                                                               
*    年度支給編集サブルーチン                                                   
     INITIALIZE  WK-TATGK-R   WK-SHRGK.                                         
     PERFORM INP7-EDIT-SUBRTN THRU INP7-EDIT-SUBEXT                             
               VARYING IDX1 FROM 1 BY 1                                         
                 UNTIL IDX1  > 12.                                              
*    一期（１２月期）                                                           
*    支払予定額                                                                 
     MOVE WK-TATGK1     TO  L8W-SHYO12(IDX).                                    
*    支払済額                                                                   
     MOVE WK-SHRGK1     TO  L8W-SHSM12(IDX).                                    
*                                                                               
*    二期（４月期）                                                             
*    支払予定額                                                                 
     MOVE WK-TATGK2     TO  L8W-SHYO04(IDX).                                    
*    支払済額                                                                   
     MOVE WK-SHRGK2     TO  L8W-SHSM04(IDX).                                    
*                                                                               
*    三期（８月期）                                                             
*    支払予定額                                                                 
     MOVE WK-TATGK3     TO  L8W-SHYO08(IDX).                                    
*    支払済額                                                                   
     MOVE WK-SHRGK3     TO  L8W-SHSM08(IDX).                                    
 INP7-EDIT-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
***************************                                                     
*年度支給編集サブルーチン *                                                     
***************************                                                     
 INP7-EDIT-SUBRTN.                                                              
*                                                                               
     IF  IDX1 NOT > 4                                                           
*        手当月額                                                               
         COMPUTE WK-TATGK1 =  WK-TATGK1 + JFN-TATGK(IDX1)                       
*        支払済額                                                               
         COMPUTE WK-SHRGK1 =  WK-SHRGK1 + JFN-SHRGK(IDX1)                       
*        支払日                                                                 
         IF JFN-SHRBI(IDX1)  NOT =  ZERO                                        
            INITIALIZE        WK-DATE                                           
            MOVE JFN-SHRBI(IDX1) TO WK-DATE                                     
            PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                         
            MOVE WK-WNG    TO L8W-SH12NG(IDX)                                   
            MOVE WK-WYY    TO L8W-SH12YY(IDX)                                   
            MOVE ","       TO L8W-SH12F1(IDX)                                   
            MOVE WK-WMM    TO L8W-SH12MM(IDX)                                   
            MOVE ","       TO L8W-SH12F2(IDX)                                   
            MOVE WK-WDD    TO L8W-SH12DD(IDX)                                   
         ELSE                                                                   
            NEXT SENTENCE                                                       
     ELSE                                                                       
     IF  IDX1 > 4  AND  IDX1 NOT >  8                                           
*        手当月額                                                               
         COMPUTE WK-TATGK2 =  WK-TATGK2 + JFN-TATGK(IDX1)                       
*        支払済額                                                               
         COMPUTE WK-SHRGK2 =  WK-SHRGK2 + JFN-SHRGK(IDX1)                       
*        支払日                                                                 
         IF JFN-SHRBI(IDX1)  NOT =  ZERO                                        
            INITIALIZE        WK-DATE                                           
            MOVE JFN-SHRBI(IDX1) TO WK-DATE                                     
            PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                         
            MOVE WK-WNG    TO L8W-SH04NG(IDX)                                   
            MOVE WK-WYY    TO L8W-SH04YY(IDX)                                   
            MOVE ","       TO L8W-SH04F1(IDX)                                   
            MOVE WK-WMM    TO L8W-SH04MM(IDX)                                   
            MOVE ","       TO L8W-SH04F2(IDX)                                   
            MOVE WK-WDD    TO L8W-SH04DD(IDX)                                   
         ELSE                                                                   
            NEXT SENTENCE                                                       
     ELSE                                                                       
     IF  IDX1 > 8  AND  IDX1 NOT > 12                                           
*        手当月額                                                               
         COMPUTE WK-TATGK3 =  WK-TATGK3 + JFN-TATGK(IDX1)                       
*        支払済額                                                               
         COMPUTE WK-SHRGK3 =  WK-SHRGK3 + JFN-SHRGK(IDX1)                       
*        支払日                                                                 
         IF JFN-SHRBI(IDX1)  NOT =  ZERO                                        
            INITIALIZE        WK-DATE                                           
            MOVE JFN-SHRBI(IDX1) TO WK-DATE                                     
            PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                         
            MOVE WK-WNG    TO L8W-SH08NG(IDX)                                   
            MOVE WK-WYY    TO L8W-SH08YY(IDX)                                   
            MOVE ","       TO L8W-SH08F1(IDX)                                   
            MOVE WK-WMM    TO L8W-SH08MM(IDX)                                   
            MOVE ","       TO L8W-SH08F2(IDX)                                   
            MOVE WK-WDD    TO L8W-SH08DD(IDX)                                   
         ELSE                                                                   
            NEXT SENTENCE                                                       
     ELSE                                                                       
         NEXT SENTENCE.                                                         
 INP7-EDIT-SUBEXT.                                                              
     EXIT.                                                                      
*                                                                               
***************                                                                 
*対象児童部分 *                                                                 
***************                                                                 
 TSJDO-RTN.                                                                     
     MOVE JFJ-DNTKB  TO JFDA1-DNTKB.                                            
     MOVE JFJ-SKJNO  TO JFDA1-SKJNO.                                            
     MOVE JFJ-NTRNO  TO JFDA1-NTRNO.                                            
     MOVE ZERO       TO JFDA1-JDONO.                                            
     PERFORM INP5-START-RTN THRU INP5-START-EXT.                                
     IF  S-INP5-KEYERR  NOT = I-TRUE                                            
         INITIALIZE  IDX  S-INP5-END                                            
         PERFORM INP5-READNE-RTN THRU INP5-READNE-EXT.                          
     IF  S-INP5-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFD-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFD-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFD-NTRNO                                         
             DISPLAY "JFU225P 対象児童Ｍに該当データ無し"                       
         ELSE                                                                   
*            対象児童部分編集（繰返し最大６回）                                 
             PERFORM INP5-EDIT-RTN THRU INP5-EDIT-EXT                           
                          UNTIL S-INP5-END = I-TRUE                             
     ELSE                                                                       
         DISPLAY "JFU225P 対象児童Ｍに該当データ無し".                          
 TSJDO-EXT.                                                                     
     EXIT.                                                                      
*                                                                               
************************************                                            
*対象児童部分編集（繰返し最大６回）*                                            
************************************                                            
 INP5-EDIT-RTN.                                                                 
     IF  S-INP5-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFD-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFD-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFD-NTRNO                                         
             MOVE I-TRUE      TO S-INP5-END                                     
         ELSE                                                                   
         IF  IDX  = 6                                                           
             MOVE I-TRUE      TO S-INP5-END                                     
             MOVE I-TRUE      TO WK-JIDO-FLG                                    
         ELSE                                                                   
             ADD  1           TO IDX                                            
             MOVE JFD-JDONO   TO WK-JDONO(IDX)                                  
*            対象児童編集サブルーチン                                           
             IF IDX NOT <  1  AND  IDX NOT > 3                                  
                PERFORM INP5-EDIT1-SUBRTN THRU INP5-EDIT1-SUBEXT                
                PERFORM INP5-EDIT2-SUBRTN THRU INP5-EDIT2-SUBEXT                
                PERFORM INP5-READNE-RTN   THRU INP5-READNE-EXT                  
             ELSE                                                               
             IF IDX = 4                                                         
                PERFORM INP5-EDIT3-SUBRTN THRU INP5-EDIT3-SUBEXT                
                PERFORM INP5-EDIT2-SUBRTN THRU INP5-EDIT2-SUBEXT                
                PERFORM INP5-READNE-RTN   THRU INP5-READNE-EXT                  
             ELSE                                                               
                PERFORM INP5-EDIT4-SUBRTN THRU INP5-EDIT4-SUBEXT                
                PERFORM INP5-EDIT2-SUBRTN THRU INP5-EDIT2-SUBEXT                
                PERFORM INP5-READNE-RTN   THRU INP5-READNE-EXT                  
     ELSE                                                                       
         MOVE I-TRUE   TO S-INP5-END.                                           
 INP5-EDIT-EXT.                                                                 
     EXIT.                                                                      
*                                                                               
**************************                                                      
*対象児童編集サブルーチン*                                                      
**************************                                                      
 INP5-EDIT1-SUBRTN.                                                             
**   児童住記情報                                                               
     MOVE JFD-JDKNO   TO INP2-KEY.                                              
     PERFORM CHEK-INP2-PROC.                                                    
*                                                                               
*    対象児童漢字氏名                                                           
     IF  B15-NAMK  NOT = SPACE                                                  
         MOVE B15-NAMK   TO L6AW-TJDOMN(IDX).                                   
*    対象児童生年月日                                                           
     IF  B15-UGP  NOT = ZERO                                                    
         INITIALIZE        WK-UGP                                               
         MOVE B15-UGP   TO WK-UGP                                               
         IF  WK-JUGG        = "1"                                               
             MOVE "M"   TO L6AW-JDOSNG(IDX)                                     
         ELSE                                                                   
         IF  WK-JUGG        = "2"                                               
             MOVE "T"   TO L6AW-JDOSNG(IDX)                                     
         ELSE                                                                   
         IF  WK-JUGG        = "3"                                               
             MOVE "S"   TO L6AW-JDOSNG(IDX)                                     
         ELSE                                                                   
         IF  WK-JUGG        = "4"                                               
             MOVE "H"   TO L6AW-JDOSNG(IDX)                                     
         ELSE                                                                   
             INITIALIZE    L6AW-JDOSNG(IDX).                                    
     IF  B15-UGP  NOT = ZERO                                                    
         MOVE WK-JUGY   TO L6AW-JDOSYY(IDX)                                     
         MOVE ","       TO L6AW-JDOSF1(IDX)                                     
         MOVE WK-JUGM   TO L6AW-JDOSMM(IDX)                                     
         MOVE ","       TO L6AW-JDOSF2(IDX)                                     
         MOVE WK-JUGD   TO L6AW-JDOSDD(IDX).                                    
*    児童年齢                                                                   
     MOVE B15-UGP       TO SS-SEINENBI.                                         
     MOVE CM-WDATEX     TO SS-KISOBI.                                           
     PERFORM NENREI-RTN THRU NENREI-EXT.                                        
     MOVE SS-TOSI       TO L6CW-NENREI(IDX).                                    
     MOVE NC"歳"        TO L6CW-NENRF1(IDX).                                    
*    続柄名称                                                                   
     INITIALIZE WK-ZGR-INPUT  WK-ZGR-OUTPUT.                                    
     IF  JFD-JDZK1  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK1   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-SETUM TO WK-ZGR-N1                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     IF  JFD-JDZK2  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK2   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE NC"の"    TO WK-ZGR-F1                                        
             MOVE JCD-SETUM TO WK-ZGR-N2                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     IF  JFD-JDZK3  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK3   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE NC"の"    TO WK-ZGR-F2                                        
             MOVE JCD-SETUM TO WK-ZGR-N3                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     MOVE  1                TO  INADR.                                          
     MOVE  ZERO             TO  OUTADR.                                         
     PERFORM ZGR-STRING-RTN THRU ZGR-STRING-EXT  26 TIMES.                      
     MOVE  WK-ZGR-OUTPUT    TO  L6CW-ZOKUGR(IDX).                               
*    当初支給開始年月日（当初該当年月日）                                       
     IF  JFD-TGTBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-TGTBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6AW-JDGTNG(IDX)                                   
         MOVE WK-WYY      TO L6AW-JDGTYY(IDX)                                   
         MOVE ","         TO L6AW-JDGTF1(IDX)                                   
         MOVE WK-WMM      TO L6AW-JDGTMM(IDX)                                   
         MOVE ","         TO L6AW-JDGTF2(IDX)                                   
         MOVE WK-WDD      TO L6AW-JDGTDD(IDX).                                  
*    事由発生年月日                                                             
     IF  JFD-JYHBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-JYHBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6CW-JYUHNG(IDX)                                   
         MOVE WK-WYY      TO L6CW-JYUHYY(IDX)                                   
         MOVE ","         TO L6CW-JYUHF1(IDX)                                   
         MOVE WK-WMM      TO L6CW-JYUHMM(IDX)                                   
         MOVE ","         TO L6CW-JYUHF2(IDX)                                   
         MOVE WK-WDD      TO L6CW-JYUHDD(IDX).                                  
*    障害の有無                                                                 
     IF  JFD-SGJKB NOT = ZERO                                                   
         MOVE JFD-SGJKB   TO JCDA1-CDKBN                                        
         MOVE 0015        TO JCDA1-CDSYR                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  =  I-TRUE                                           
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-SETUM  TO L6AW-SYOGAI(IDX)                                
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*    再診予定日                                                                 
     IF  JFD-SNYBI           NOT =  ZERO                                        
         INITIALIZE                 WK-DATE                                     
         MOVE JFD-SNYBI          TO WK-DATE                                     
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG             TO L6CW-SAISNG(IDX)                            
         MOVE WK-WYY             TO L6CW-SAISYY(IDX)                            
         MOVE ","                TO L6CW-SAISF1(IDX)                            
         MOVE WK-WMM             TO L6CW-SAISMM(IDX)                            
         MOVE ","                TO L6CW-SAISF2(IDX)                            
         MOVE WK-WDD             TO L6CW-SAISDD(IDX).                           
*    ９条２                                                                     
     IF  JFD-KJIKB = 1                                                          
         MOVE NC"該当（孤児）"   TO L6AW-9JYO2N(IDX)                            
     ELSE                                                                       
         MOVE SPACE              TO L6AW-9JYO2N(IDX).                           
*                                                                               
*    非該当年月日(該当終了日)                                                   
     IF  JFD-GTSBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-GTSBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6AW-JDHTNG(IDX)                                   
         MOVE WK-WYY      TO L6AW-JDHTYY(IDX)                                   
         MOVE ","         TO L6AW-JDHTF1(IDX)                                   
         MOVE WK-WMM      TO L6AW-JDHTMM(IDX)                                   
         MOVE ","         TO L6AW-JDHTF2(IDX)                                   
         MOVE WK-WDD      TO L6AW-JDHTDD(IDX).                                  
*    非該当予定日(有期認定日)                                                   
     IF  JFD-YKNBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-YKNBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6CW-YKNBNG(IDX)                                   
         MOVE WK-WYY      TO L6CW-YKNBYY(IDX)                                   
         MOVE ","         TO L6CW-YKNBF1(IDX)                                   
         MOVE WK-WMM      TO L6CW-YKNBMM(IDX)                                   
         MOVE ","         TO L6CW-YKNBF2(IDX)                                   
         MOVE WK-WDD      TO L6CW-YKNBDD(IDX).                                  
*    非該当事由                                                                 
     IF  JFD-GTSJU  NOT =  ZERO                                                 
         MOVE 0023        TO JCDA1-CDSYR                                        
         MOVE JFD-GTSJU   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-RYAKM TO L6CW-HIGTJM(IDX).                                
*                                                                               
 INP5-EDIT1-SUBEXT.                                                             
     EXIT.                                                                      
*                                                                               
 INP5-EDIT3-SUBRTN.                                                             
**   児童住記情報                                                               
     MOVE JFD-JDKNO   TO INP2-KEY.                                              
     PERFORM CHEK-INP2-PROC.                                                    
*                                                                               
*    対象児童漢字氏名                                                           
     IF  B15-NAMK  NOT = SPACE                                                  
         MOVE B15-NAMK   TO L6BW-TJDOMN.                                        
*    対象児童生年月日                                                           
     IF  B15-UGP  NOT = ZERO                                                    
         INITIALIZE        WK-UGP                                               
         MOVE B15-UGP   TO WK-UGP                                               
         IF  WK-JUGG        = "1"                                               
             MOVE "M"   TO L6BW-JDOSNG                                          
         ELSE                                                                   
         IF  WK-JUGG        = "2"                                               
             MOVE "T"   TO L6BW-JDOSNG                                          
         ELSE                                                                   
         IF  WK-JUGG        = "3"                                               
             MOVE "S"   TO L6BW-JDOSNG                                          
         ELSE                                                                   
         IF  WK-JUGG        = "4"                                               
             MOVE "H"   TO L6BW-JDOSNG                                          
         ELSE                                                                   
             INITIALIZE    L6BW-JDOSNG.                                         
     IF  B15-UGP  NOT = ZERO                                                    
         MOVE WK-JUGY   TO L6BW-JDOSYY                                          
         MOVE ","       TO L6BW-JDOSF1                                          
         MOVE WK-JUGM   TO L6BW-JDOSMM                                          
         MOVE ","       TO L6BW-JDOSF2                                          
         MOVE WK-JUGD   TO L6BW-JDOSDD.                                         
*    児童年齢                                                                   
     MOVE B15-UGP       TO SS-SEINENBI.                                         
     MOVE CM-WDATEX     TO SS-KISOBI.                                           
     PERFORM NENREI-RTN THRU NENREI-EXT.                                        
     MOVE SS-TOSI       TO L6EW-NENREI.                                         
     MOVE NC"歳"        TO L6EW-NENRF1.                                         
*    続柄名称                                                                   
     INITIALIZE WK-ZGR-INPUT  WK-ZGR-OUTPUT.                                    
     IF  JFD-JDZK1  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK1   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-SETUM TO WK-ZGR-N1                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     IF  JFD-JDZK2  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK2   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE NC"の"    TO WK-ZGR-F1                                        
             MOVE JCD-SETUM TO WK-ZGR-N2                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     IF  JFD-JDZK3  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK3   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE NC"の"    TO WK-ZGR-F2                                        
             MOVE JCD-SETUM TO WK-ZGR-N3                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     MOVE  1                TO  INADR.                                          
     MOVE  ZERO             TO  OUTADR.                                         
     PERFORM ZGR-STRING-RTN THRU ZGR-STRING-EXT  26 TIMES.                      
     MOVE  WK-ZGR-OUTPUT    TO  L6EW-ZOKUGR.                                    
*    当初支給開始年月日（当初該当年月日）                                       
     IF  JFD-TGTBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-TGTBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6BW-JDGTNG                                        
         MOVE WK-WYY      TO L6BW-JDGTYY                                        
         MOVE ","         TO L6BW-JDGTF1                                        
         MOVE WK-WMM      TO L6BW-JDGTMM                                        
         MOVE ","         TO L6BW-JDGTF2                                        
         MOVE WK-WDD      TO L6BW-JDGTDD.                                       
*    事由発生年月日                                                             
     IF  JFD-JYHBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-JYHBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6EW-JYUHNG                                        
         MOVE WK-WYY      TO L6EW-JYUHYY                                        
         MOVE ","         TO L6EW-JYUHF1                                        
         MOVE WK-WMM      TO L6EW-JYUHMM                                        
         MOVE ","         TO L6EW-JYUHF2                                        
         MOVE WK-WDD      TO L6EW-JYUHDD.                                       
*    障害の有無                                                                 
     IF  JFD-SGJKB NOT = ZERO                                                   
         MOVE JFD-SGJKB   TO JCDA1-CDKBN                                        
         MOVE 0015        TO JCDA1-CDSYR                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  =  I-TRUE                                           
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-SETUM  TO L6BW-SYOGAI                                     
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*    再診予定日                                                                 
     IF  JFD-SNYBI           NOT =  ZERO                                        
         INITIALIZE                 WK-DATE                                     
         MOVE JFD-SNYBI          TO WK-DATE                                     
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG             TO L6EW-SAISNG                                 
         MOVE WK-WYY             TO L6EW-SAISYY                                 
         MOVE ","                TO L6EW-SAISF1                                 
         MOVE WK-WMM             TO L6EW-SAISMM                                 
         MOVE ","                TO L6EW-SAISF2                                 
         MOVE WK-WDD             TO L6EW-SAISDD.                                
*    ９条２                                                                     
     IF  JFD-KJIKB = 1                                                          
         MOVE NC"該当（孤児）"   TO L6BW-9JYO2N                                 
     ELSE                                                                       
         MOVE SPACE              TO L6BW-9JYO2N.                                
*                                                                               
*    非該当年月日(該当終了日)                                                   
     IF  JFD-GTSBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-GTSBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6BW-JDHTNG                                        
         MOVE WK-WYY      TO L6BW-JDHTYY                                        
         MOVE ","         TO L6BW-JDHTF1                                        
         MOVE WK-WMM      TO L6BW-JDHTMM                                        
         MOVE ","         TO L6BW-JDHTF2                                        
         MOVE WK-WDD      TO L6BW-JDHTDD.                                       
*    非該当予定日(有期認定日)                                                   
     IF  JFD-YKNBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-YKNBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6EW-YKNBNG                                        
         MOVE WK-WYY      TO L6EW-YKNBYY                                        
         MOVE ","         TO L6EW-YKNBF1                                        
         MOVE WK-WMM      TO L6EW-YKNBMM                                        
         MOVE ","         TO L6EW-YKNBF2                                        
         MOVE WK-WDD      TO L6EW-YKNBDD.                                       
*    非該当事由                                                                 
     IF  JFD-GTSJU  NOT =  ZERO                                                 
         MOVE 0023        TO JCDA1-CDSYR                                        
         MOVE JFD-GTSJU   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-RYAKM TO L6EW-HIGTJM.                                     
*                                                                               
 INP5-EDIT3-SUBEXT.                                                             
     EXIT.                                                                      
*                                                                               
 INP5-EDIT4-SUBRTN.                                                             
     ADD  1           TO IDX2.                                                  
**   児童住記情報                                                               
     MOVE JFD-JDKNO   TO INP2-KEY.                                              
     PERFORM CHEK-INP2-PROC.                                                    
*                                                                               
*    対象児童漢字氏名                                                           
     IF  B15-NAMK  NOT = SPACE                                                  
         MOVE B15-NAMK   TO L6DW-TJDOMN(IDX2).                                  
*    対象児童生年月日                                                           
     IF  B15-UGP  NOT = ZERO                                                    
         INITIALIZE        WK-UGP                                               
         MOVE B15-UGP TO WK-UGP                                                 
         IF  WK-JUGG        = "1"                                               
             MOVE "M"   TO L6DW-JDOSNG(IDX2)                                    
         ELSE                                                                   
         IF  WK-JUGG        = "2"                                               
             MOVE "T"   TO L6DW-JDOSNG(IDX2)                                    
         ELSE                                                                   
         IF  WK-JUGG        = "3"                                               
             MOVE "S"   TO L6DW-JDOSNG(IDX2)                                    
         ELSE                                                                   
         IF  WK-JUGG        = "4"                                               
             MOVE "H"   TO L6DW-JDOSNG(IDX2)                                    
         ELSE                                                                   
             INITIALIZE    L6DW-JDOSNG(IDX2).                                   
     IF  B15-UGP  NOT = ZERO                                                    
         MOVE WK-JUGY   TO L6DW-JDOSYY(IDX2)                                    
         MOVE ","       TO L6DW-JDOSF1(IDX2)                                    
         MOVE WK-JUGM   TO L6DW-JDOSMM(IDX2)                                    
         MOVE ","       TO L6DW-JDOSF2(IDX2)                                    
         MOVE WK-JUGD   TO L6DW-JDOSDD(IDX2).                                   
*    児童年齢                                                                   
     MOVE B15-UGP       TO SS-SEINENBI.                                         
     MOVE CM-WDATEX     TO SS-KISOBI.                                           
     PERFORM NENREI-RTN THRU NENREI-EXT.                                        
     MOVE SS-TOSI       TO L6FW-NENREI(IDX2).                                   
     MOVE NC"歳"        TO L6FW-NENRF1(IDX2).                                   
*    続柄名称                                                                   
     INITIALIZE WK-ZGR-INPUT  WK-ZGR-OUTPUT.                                    
     IF  JFD-JDZK1  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK1   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP10-KEYERR  = I-TRUE                                           
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-SETUM TO WK-ZGR-N1                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     IF  JFD-JDZK2  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK2   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE NC"の"    TO WK-ZGR-F1                                        
             MOVE JCD-SETUM TO WK-ZGR-N2                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     IF  JFD-JDZK3  NOT =  ZERO                                                 
         MOVE 0040        TO JCDA1-CDSYR                                        
         MOVE JFD-JDZK3   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE NC"の"    TO WK-ZGR-F2                                        
             MOVE JCD-SETUM TO WK-ZGR-N3                                        
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     MOVE  1                TO  INADR.                                          
     MOVE  ZERO             TO  OUTADR.                                         
     PERFORM ZGR-STRING-RTN THRU ZGR-STRING-EXT  26 TIMES.                      
     MOVE  WK-ZGR-OUTPUT    TO  L6FW-ZOKUGR(IDX2).                              
*    当初支給開始年月日（当初該当年月日）                                       
     IF  JFD-TGTBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-TGTBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6DW-JDGTNG(IDX2)                                  
         MOVE WK-WYY      TO L6DW-JDGTYY(IDX2)                                  
         MOVE ","         TO L6DW-JDGTF1(IDX2)                                  
         MOVE WK-WMM      TO L6DW-JDGTMM(IDX2)                                  
         MOVE ","         TO L6DW-JDGTF2(IDX2)                                  
         MOVE WK-WDD      TO L6DW-JDGTDD(IDX2).                                 
*    事由発生年月日                                                             
     IF  JFD-JYHBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-JYHBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6FW-JYUHNG(IDX2)                                  
         MOVE WK-WYY      TO L6FW-JYUHYY(IDX2)                                  
         MOVE ","         TO L6FW-JYUHF1(IDX2)                                  
         MOVE WK-WMM      TO L6FW-JYUHMM(IDX2)                                  
         MOVE ","         TO L6FW-JYUHF2(IDX2)                                  
         MOVE WK-WDD      TO L6FW-JYUHDD(IDX2).                                 
*    障害の有無                                                                 
     IF  JFD-SGJKB NOT = ZERO                                                   
         MOVE JFD-SGJKB   TO JCDA1-CDKBN                                        
         MOVE 0015        TO JCDA1-CDSYR                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  =  I-TRUE                                           
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-SETUM  TO L6DW-SYOGAI(IDX2)                               
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*    再診予定日                                                                 
     IF  JFD-SNYBI           NOT =  ZERO                                        
         INITIALIZE                 WK-DATE                                     
         MOVE JFD-SNYBI          TO WK-DATE                                     
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG             TO L6FW-SAISNG(IDX2)                           
         MOVE WK-WYY             TO L6FW-SAISYY(IDX2)                           
         MOVE ","                TO L6FW-SAISF1(IDX2)                           
         MOVE WK-WMM             TO L6FW-SAISMM(IDX2)                           
         MOVE ","                TO L6FW-SAISF2(IDX2)                           
         MOVE WK-WDD             TO L6FW-SAISDD(IDX2).                          
*    ９条２                                                                     
     IF  JFD-KJIKB = 1                                                          
         MOVE NC"該当（孤児）"   TO L6DW-9JYO2N(IDX2)                           
     ELSE                                                                       
         MOVE SPACE              TO L6DW-9JYO2N(IDX2).                          
*                                                                               
*    非該当年月日(該当終了日)                                                   
     IF  JFD-GTSBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-GTSBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6DW-JDHTNG(IDX2)                                  
         MOVE WK-WYY      TO L6DW-JDHTYY(IDX2)                                  
         MOVE ","         TO L6DW-JDHTF1(IDX2)                                  
         MOVE WK-WMM      TO L6DW-JDHTMM(IDX2)                                  
         MOVE ","         TO L6DW-JDHTF2(IDX2)                                  
         MOVE WK-WDD      TO L6DW-JDHTDD(IDX2).                                 
*    非該当予定日(有期認定日)                                                   
     IF  JFD-YKNBI     NOT =  ZERO                                              
         INITIALIZE          WK-DATE                                            
         MOVE JFD-YKNBI   TO WK-DATE                                            
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG      TO L6FW-YKNBNG(IDX2)                                  
         MOVE WK-WYY      TO L6FW-YKNBYY(IDX2)                                  
         MOVE ","         TO L6FW-YKNBF1(IDX2)                                  
         MOVE WK-WMM      TO L6FW-YKNBMM(IDX2)                                  
         MOVE ","         TO L6FW-YKNBF2(IDX2)                                  
         MOVE WK-WDD      TO L6FW-YKNBDD(IDX2).                                 
*    非該当事由                                                                 
     IF  JFD-GTSJU  NOT =  ZERO                                                 
         MOVE 0023        TO JCDA1-CDSYR                                        
         MOVE JFD-GTSJU   TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-RYAKM TO L6FW-HIGTJM(IDX2).                               
*                                                                               
 INP5-EDIT4-SUBEXT.                                                             
     EXIT.                                                                      
*                                                                               
*                                                                               
 INP5-EDIT2-SUBRTN.                                                             
*    父親状況名称                                                               
     IF  JFD-TOJKB  NOT = ZERO AND SPACE                                        
         MOVE 0026          TO JCDA1-CDSYR                                      
         MOVE JFD-TOJKB     TO JCDA1-CDKBN                                      
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦにデータ無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-SETUM TO L6AW-TTJYOK(1).                                  
*                                                                               
*    父親漢字氏名(障害)                                                         
     IF  JFD-TTKNO  >  ZERO                                                     
*        キーセット                                                             
         MOVE JFD-TTKNO  TO INP2-KEY                                            
*        住記ファイル父親情報チェック                                           
         PERFORM CHEK-INP2-PROC                                                 
         MOVE B15-NAMK   TO L5-STTSIM                                           
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
*    拘禁のデータ編集                                                           
*    父親漢字氏名                                                               
     IF  JFD-TOJKB  =  6                                                        
         MOVE  1         TO WK-JIDO-FLG1                                        
         MOVE  JFD-TTKNO TO WK-TTKNO                                            
*        キーセット                                                             
         MOVE JFD-TTKNO  TO INP2-KEY                                            
*        住記ファイル父親情報チェック                                           
         PERFORM CHEK-INP2-PROC                                                 
         MOVE B15-NAMK   TO L6AW-TTJYOK(2)                                      
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
*    母親漢字氏名                                                               
     IF  JFD-HOJKB  =  6                                                        
         MOVE  1         TO WK-JIDO-FLG2                                        
         MOVE  JFD-HHKNO TO WK-HHKNO                                            
*        キーセット                                                             
         MOVE JFD-HHKNO  TO INP2-KEY                                            
*        住記ファイル母親情報チェック                                           
         PERFORM CHEK-INP2-PROC                                                 
         MOVE B15-NAMK   TO L6AW-TTJYOK(3)                                      
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
*    終了予定日                                                                 
     IF  JFD-YKNJU  =  4                                                        
         IF  JFD-YKNBI  NOT =  ZERO                                             
             MOVE  1         TO WK-JIDO-FLG3                                    
             MOVE  JFD-YKNBI TO WK-YKNBI                                        
             INITIALIZE        WK-DATE                                          
             MOVE JFD-YKNBI TO WK-DATE                                          
             PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                        
             MOVE WK-WNG    TO L6BW-SRYONG                                      
             MOVE WK-WYY    TO L6BW-SRYOYY                                      
             MOVE ","       TO L6BW-SRYOF1                                      
             MOVE WK-WMM    TO L6BW-SRYOMM                                      
             MOVE ","       TO L6BW-SRYOF2                                      
             MOVE WK-WDD    TO L6BW-SRYODD                                      
         ELSE                                                                   
             NEXT SENTENCE                                                      
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
 INP5-EDIT2-SUBEXT.                                                             
     EXIT.                                                                      
*                                                                               
 INP5-TAIHI-SUBRTN.                                                             
*    拘禁のデータ編集                                                           
*    父親漢字氏名                                                               
     IF  WK-JIDO-FLG1 = 1                                                       
*        キーセット                                                             
         MOVE WK-TTKNO  TO INP2-KEY                                             
*        住記ファイル父親情報チェック                                           
         PERFORM CHEK-INP2-PROC                                                 
         MOVE B15-NAMK   TO L6AW-TTJYOK(2)                                      
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
*    母親漢字氏名                                                               
     IF  WK-JIDO-FLG2 = 1                                                       
         MOVE  1         TO WK-JIDO-FLG2                                        
*        キーセット                                                             
         MOVE WK-HHKNO  TO INP2-KEY                                             
*        住記ファイル母親情報チェック                                           
         PERFORM CHEK-INP2-PROC                                                 
         MOVE B15-NAMK   TO L6AW-TTJYOK(3)                                      
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
*    終了予定日                                                                 
     IF  WK-JIDO-FLG3 = 1                                                       
         IF  WK-YKNBI  NOT =  ZERO                                              
             INITIALIZE        WK-DATE                                          
             MOVE WK-YKNBI TO WK-DATE                                           
             PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                        
             MOVE WK-WNG    TO L6BW-SRYONG                                      
             MOVE WK-WYY    TO L6BW-SRYOYY                                      
             MOVE ","       TO L6BW-SRYOF1                                      
             MOVE WK-WMM    TO L6BW-SRYOMM                                      
             MOVE ","       TO L6BW-SRYOF2                                      
             MOVE WK-WDD    TO L6BW-SRYODD                                      
         ELSE                                                                   
             NEXT SENTENCE                                                      
     ELSE                                                                       
         NEXT SENTENCE.                                                         
*                                                                               
*    証書交付日                                                                 
     IF  JFJ-KFUBI           NOT =  ZERO                                        
         INITIALIZE                 WK-DATE                                     
         MOVE JFJ-KFUBI          TO WK-DATE                                     
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG             TO L6DW-SYOSNG(1)                              
         MOVE WK-WYY             TO L6DW-SYOSYY(1)                              
         MOVE ","                TO L6DW-SYOSF1(1)                              
         MOVE WK-WMM             TO L6DW-SYOSMM(1)                              
         MOVE ","                TO L6DW-SYOSF2(1)                              
         MOVE WK-WDD             TO L6DW-SYOSDD(1)                              
         MOVE "(   )"            TO L6DW-KIGO(1)                                
         MOVE NC"印"             TO L6DW-INKAN(1).                              
*                                                                               
 INP5-TAIHI-SUBEXT.                                                             
     EXIT.                                                                      
*                                                                               
************************************                                            
*対象児童が７人以上の編集　　　　　*                                            
************************************                                            
 INP5-KAIPAGE-RTN.                                                              
     IF  S-INP5-STATUS  = "00"                                                  
         IF  JFJ-DNTKB  NOT = JFD-DNTKB OR                                      
             JFJ-SKJNO  NOT = JFD-SKJNO OR                                      
             JFJ-NTRNO  NOT = JFD-NTRNO                                         
             MOVE I-TRUE   TO S-INP5-END                                        
         ELSE                                                                   
         IF  IDX  = 6                                                           
             ADD  1             TO  F-OUT1-CNT                                  
*            帳票出力                                                           
             PERFORM HEAD-RTN   THRU HEAD-EXT                                   
             PERFORM OUT1-WRITE-RTN THRU OUT1-WRITE-EXT                         
             INITIALIZE            LIST6W  IDX  IDX2   WK-JDONO-01              
         ELSE                                                                   
             ADD  1        TO IDX                                               
             MOVE JFD-JDONO   TO WK-JDONO(IDX)                                  
*            対象児童編集サブルーチン                                           
             IF IDX NOT <  1  AND  IDX NOT > 3                                  
                PERFORM INP5-EDIT1-SUBRTN THRU INP5-EDIT1-SUBEXT                
                PERFORM INP5-EDIT2-SUBRTN THRU INP5-EDIT2-SUBEXT                
                PERFORM INP5-TAIHI-SUBRTN THRU INP5-TAIHI-SUBEXT                
                PERFORM INP5-READNE-RTN   THRU INP5-READNE-EXT                  
             ELSE                                                               
             IF IDX = 4                                                         
                PERFORM INP5-EDIT3-SUBRTN THRU INP5-EDIT3-SUBEXT                
                PERFORM INP5-EDIT2-SUBRTN THRU INP5-EDIT2-SUBEXT                
                PERFORM INP5-TAIHI-SUBRTN THRU INP5-TAIHI-SUBEXT                
                PERFORM INP5-READNE-RTN   THRU INP5-READNE-EXT                  
             ELSE                                                               
                PERFORM INP5-EDIT4-SUBRTN THRU INP5-EDIT4-SUBEXT                
                PERFORM INP5-EDIT2-SUBRTN THRU INP5-EDIT2-SUBEXT                
                PERFORM INP5-TAIHI-SUBRTN THRU INP5-TAIHI-SUBEXT                
                PERFORM INP5-READNE-RTN   THRU INP5-READNE-EXT                  
     ELSE                                                                       
         MOVE I-TRUE   TO S-INP5-END.                                           
 INP5-KAIPAGE-EXT.                                                              
     EXIT.                                                                      
****************                                                                
*左詰め（続柄）*                                                                
****************                                                                
 ZGR-STRING-RTN.                                                                
     IF  WK-IN-ZGR (INADR)  NOT =  SPACE                                        
         ADD  1                 TO OUTADR                                       
         MOVE WK-IN-ZGR(INADR)  TO WK-OUT-ZGR (OUTADR)                          
     ELSE                                                                       
         NEXT SENTENCE.                                                         
     ADD  1                     TO INADR.                                       
 ZGR-STRING-EXT.                                                                
     EXIT.                                                                      
*                                                                               
***************                                                                 
*福祉総合部分 *                                                                 
***************                                                                 
 HUKUS-RTN.                                                                     
     MOVE JFJ-DNTKB  TO FKZ-GYSCD.                                              
     MOVE JFJ-SKJNO  TO FKZ-KJICD.                                              
     MOVE 06         TO FKZ-GYOMU.                                              
     MOVE 99         TO FKZ-RIREK.                                              
     PERFORM INP11-STARTP-RTN THRU INP11-STARTP-EXT.                            
     IF  S-INP11-KEYERR  = I-TRUE                                               
         PERFORM INP11-LAST-RTN THRU INP11-LAST-EXT.                            
     IF  S-INP11-KEYERR  NOT = I-TRUE                                           
         PERFORM INP11-READP-RTN THRU INP11-READP-EXT.                          
     IF  S-INP11-STATUS  = "00"                                                 
         IF  FKZ-GYSCD  NOT = JFJ-DNTKB OR                                      
             FKZ-KJICD  NOT = JFJ-SKJNO OR                                      
             FKZ-GYOMU  NOT = 06                                                
             DISPLAY "JFU225P 福祉総合Ｆに該当データ無し"                       
         ELSE                                                                   
*            福祉総合情報編集                                                   
             PERFORM INP11-EDIT-RTN THRU INP11-EDIT-EXT                         
     ELSE                                                                       
         DISPLAY "JFU225P 福祉総合Ｆに該当データ無し".                          
 HUKUS-EXT.                                                                     
     EXIT.                                                                      
*                                                                               
*******************                                                             
*福祉総合情報編集 *                                                             
*******************                                                             
 INP11-EDIT-RTN.                                                                
*    種別（口座種別）                                                           
     IF  FKZ-YSBT   NOT =  ZERO                                                 
         MOVE 0033        TO JCDA1-CDSYR                                        
         MOVE FKZ-YSBT    TO JCDA1-CDKBN                                        
         PERFORM INP9-READ-RTN THRU INP9-READ-EXT                               
         IF  S-INP9-KEYERR  = I-TRUE                                            
             DISPLAY "JFU225P コードＦファイル無し " INP9-ACP                   
         ELSE                                                                   
             MOVE JCD-RYAKM TO L3-SYUBTU.                                       
*    口座番号（口座個人ＣＤ）                                                   
     MOVE FKZ-KZNO      TO L4-KOZABG.                                           
*    口座名義人カナ氏名                                                         
     MOVE FKZ-YKSM      TO L3-KOZAME.                                           
*    口座名義人漢字氏名                                                         
     MOVE FKZ-YKJM      TO L4-KOZAME-N.                                         
*    金融機関情報                                                               
     MOVE FKZ-KHCD      TO SBK-KHCD.                                            
     MOVE FKZ-KCCD      TO SBK-KCCD.                                            
     PERFORM INP3-READ-RTN THRU INP3-READ-EXT.                                  
     IF  S-INP3-KEYERR  NOT = I-TRUE                                            
*        金融機関（銀行名）                                                     
         MOVE SBK-HNAMN     TO L3-KINYHO                                        
*        金融機関（支店名）                                                     
         MOVE SBK-CNAMN     TO L4-KINYSI                                        
     ELSE                                                                       
         DISPLAY "JFU225P 金融機関Ｆに該当データ無し".                          
                                                                                
 INP11-EDIT-EXT.                                                                
     EXIT.                                                                      
*                                                                               
*****************                                                               
*西暦→和暦変換 *                                                               
*****************                                                               
 WAREKI-CNV-RTN.                                                                
     INITIALIZE                     WK-WDATE CMLB002W.                          
     MOVE "1"                    TO ACT-CDCM02.                                 
     MOVE WK-DATE                TO IN-SYMD1CM02.                               
     CALL "CMP0200S"      USING CMLB002W.                                       
     MOVE OUT-WYMDCM02           TO WK-WDATE .                                  
     IF  OUT-WNGCM02             =  1                                           
         MOVE "M"                TO WK-WNG  ELSE                                
     IF  OUT-WNGCM02             =  2                                           
         MOVE "T"                TO WK-WNG  ELSE                                
     IF  OUT-WNGCM02             =  3                                           
         MOVE "S"                TO WK-WNG  ELSE                                
     IF  OUT-WNGCM02             =  4                                           
         MOVE "H"                TO WK-WNG                                      
     ELSE                                                                       
         INITIALIZE                 WK-WNG.                                     
 WAREKI-CNV-EXT.                                                                
     EXIT.                                                                      
*                                                                               
************************                                                        
* (FROM HEAD-RTN)                                                               
************************                                                        
 HEAD-PRINT-PROC.                                                               
     INITIALIZE OUT1-REC1  LIST.                                                
     MOVE  SPACE      TO   LIST.                                                
     WRITE OUT1-REC1 FROM LIST  BEFORE 2.                                       
*                                                                               
*    開始認定日                                                                 
     IF  JFJ-KNTBI           NOT =  ZERO                                        
         INITIALIZE                 WK-DATE                                     
         MOVE JFJ-KNTBI          TO WK-DATE                                     
         PERFORM WAREKI-CNV-RTN  THRU WAREKI-CNV-EXT                            
         MOVE WK-WNG             TO H1-NG                                       
         IF WK-WNG = "1" OR "M"                                                 
            MOVE  NC"明治"       TO H1-NG                                       
         ELSE                                                                   
         IF WK-WNG = "2" OR "T"                                                 
            MOVE  NC"大正"       TO H1-NG                                       
         ELSE                                                                   
         IF WK-WNG = "3" OR "S"                                                 
            MOVE  NC"昭和"       TO H1-NG                                       
         ELSE                                                                   
         IF WK-WNG = "4" OR "H"                                                 
            MOVE  NC"平成"       TO H1-NG                                       
         ELSE                                                                   
            MOVE  SPACE          TO H1-NG.                                      
     IF  JFJ-KNTBI           NOT =  ZERO                                        
         MOVE WK-WYY             TO H1-YY                                       
         MOVE WK-WMM             TO H1-MM                                       
         MOVE WK-WDD             TO H1-DD.                                      
     ADD  1             TO  F-OUT1-CNT.                                         
*                                                                               
     MOVE JFJ-DNTKB TO JCDA1-CDKBN.                                             
     MOVE 0001      TO JCDA1-CDSYR.                                             
     PERFORM INP9-READ-RTN THRU INP9-READ-EXT.                                  
     IF  S-INP9-KEYERR  = I-TRUE                                                
         DISPLAY "JFU225P コードＦファイル無し " INP9-ACP                       
     ELSE                                                                       
         MOVE JCD-SETUM TO H1-DANM.                                             
*                                                                               
     WRITE OUT1-REC1 FROM HEAD1 BEFORE 3.                                       
     MOVE SPACE TO OUT1-REC1.                                                   
************************                                                        
* (FROM OUT1-WRITE-RTN)                                                         
************************                                                        
 OUT1-WRITE-RTN.                                                                
     INITIALIZE OUT1-REC1  .                                                    
     WRITE OUT1-REC1 FROM LIST1 BEFORE 2.                                       
*                                                                               
     INITIALIZE OUT1-REC1  .                                                    
     WRITE OUT1-REC1 FROM LIST2 BEFORE 2.                                       
*                                                                               
     INITIALIZE OUT1-REC1  .                                                    
     WRITE OUT1-REC1 FROM LIST3 BEFORE 1.                                       
*                                                                               
     INITIALIZE OUT1-REC1  .                                                    
     WRITE OUT1-REC1 FROM LIST4 BEFORE 2.                                       
*                                                                               
     INITIALIZE OUT1-REC1  .                                                    
     WRITE OUT1-REC1 FROM LIST5 BEFORE 2.                                       
*                                                                               
     PERFORM LIST6-WR-RTN THRU LIST6-WR-EXT                                     
              VARYING IDX FROM 1 BY 1                                           
                 UNTIL IDX  > 6.                                                
*                                                                               
     PERFORM LIST7-WR-RTN THRU LIST7-WR-EXT                                     
              VARYING IDX FROM 1 BY 1                                           
                 UNTIL IDX  > 5.                                                
*                                                                               
     PERFORM LIST8-WR-RTN THRU LIST8-WR-EXT                                     
              VARYING IDX FROM 1 BY 1                                           
                 UNTIL IDX  > 5.                                                
*                                                                               
     INITIALIZE OUT1-REC1  .                                                    
     WRITE OUT1-REC1 FROM LIST9 BEFORE 1.                                       
*                                                                               
*    改頁                                                                       
     INITIALIZE OUT1-REC1.                                                      
     WRITE OUT1-REC1 BEFORE PAGE.                                               
 OUT1-WRITE-EXT.                                                                
     EXIT.                                                                      
*                                                                               
*    年齢計算                                                                   
*                                                                               
     COPY LIBS010R.                                                             
*                                                                               
*****************                                                               
*リスト６出力 *                                                                 
*****************                                                               
 LIST6-WR-RTN.                                                                  
     IF  WK-JDONO(IDX)  NOT = ZERO                                              
         IF  IDX = 1 OR 2 OR 3                                                  
             INITIALIZE     OUT1-REC1    L6A-REC                                
             MOVE  L6AW-REC(IDX)  TO  L6A-REC                                   
             WRITE OUT1-REC1 FROM LIST6A BEFORE 1                               
*                                                                               
             INITIALIZE     OUT1-REC1   L6C-REC                                 
             MOVE  L6CW-REC(IDX)  TO  L6C-REC                                   
             WRITE OUT1-REC1 FROM LIST6C BEFORE 1                               
         ELSE                                                                   
         IF  IDX = 4                                                            
             INITIALIZE     OUT1-REC1    L6B-REC                                
             MOVE  L6BW-REC       TO  L6B-REC                                   
             WRITE OUT1-REC1 FROM LIST6B BEFORE 1                               
*                                                                               
             INITIALIZE     OUT1-REC1   L6C-REC                                 
             MOVE  L6EW-REC       TO  L6C-REC                                   
             WRITE OUT1-REC1 FROM LIST6C BEFORE 1                               
         ELSE                                                                   
         IF  IDX = 5                                                            
             INITIALIZE     OUT1-REC1    L6D-REC                                
             MOVE  L6DW-REC(1)  TO  L6D-REC                                     
             WRITE OUT1-REC1 FROM LIST6D BEFORE 1                               
*                                                                               
             INITIALIZE     OUT1-REC1   L6F-REC                                 
             MOVE  L6FW-REC(1)  TO  L6F-REC                                     
             WRITE OUT1-REC1 FROM LIST6F BEFORE 1                               
         ELSE                                                                   
         IF  IDX =  6                                                           
             INITIALIZE     OUT1-REC1    L6D-REC                                
             MOVE  L6DW-REC(2)  TO  L6D-REC                                     
             WRITE OUT1-REC1 FROM LIST6D BEFORE 1                               
*                                                                               
             INITIALIZE     OUT1-REC1   L6F-REC                                 
             MOVE  L6FW-REC(2)  TO  L6F-REC                                     
             WRITE OUT1-REC1 FROM LIST6F BEFORE 4                               
         ELSE                                                                   
             NEXT SENTENCE                                                      
     ELSE                                                                       
     IF  IDX = 1                                                                
         IF  L6AW-TTJYOK(1)  NOT =  SPACE                                       
             INITIALIZE     OUT1-REC1    L6A-REC                                
             MOVE  L6AW-REC(IDX)  TO  L6A-REC                                   
             WRITE OUT1-REC1 FROM LIST6A BEFORE 2                               
         ELSE                                                                   
             INITIALIZE OUT1-REC1  LIST                                         
             WRITE OUT1-REC1 FROM LIST  BEFORE  2                               
     ELSE                                                                       
     IF  IDX = 2                                                                
         IF  L6AW-TTJYOK(2)  NOT =  SPACE                                       
             INITIALIZE     OUT1-REC1    L6A-REC                                
             MOVE  L6AW-REC(IDX)  TO  L6A-REC                                   
             WRITE OUT1-REC1 FROM LIST6A BEFORE 2                               
         ELSE                                                                   
             INITIALIZE OUT1-REC1  LIST                                         
             WRITE OUT1-REC1 FROM LIST  BEFORE  2                               
     ELSE                                                                       
     IF  IDX = 3                                                                
         IF  L6AW-TTJYOK(3)  NOT =  SPACE                                       
             INITIALIZE     OUT1-REC1    L6A-REC                                
             MOVE  L6AW-REC(IDX)  TO  L6A-REC                                   
             WRITE OUT1-REC1 FROM LIST6A BEFORE 2                               
         ELSE                                                                   
             INITIALIZE OUT1-REC1  LIST                                         
             WRITE OUT1-REC1 FROM LIST  BEFORE  2                               
     ELSE                                                                       
     IF  IDX = 4                                                                
         IF  L6BW-SRYONG  NOT =  SPACE                                          
             INITIALIZE     OUT1-REC1    L6B-REC                                
             MOVE  L6BW-REC       TO  L6B-REC                                   
             WRITE OUT1-REC1 FROM LIST6B BEFORE 2                               
         ELSE                                                                   
             INITIALIZE OUT1-REC1  LIST                                         
             WRITE OUT1-REC1 FROM LIST  BEFORE  2                               
     ELSE                                                                       
     IF  IDX = 5                                                                
         IF  L6DW-SYOSNG(1)  NOT =  SPACE                                       
             INITIALIZE     OUT1-REC1    L6D-REC                                
             MOVE  L6DW-REC(1)  TO  L6D-REC                                     
             WRITE OUT1-REC1 FROM LIST6D BEFORE 2                               
         ELSE                                                                   
             INITIALIZE OUT1-REC1  LIST                                         
             WRITE OUT1-REC1 FROM LIST  BEFORE  2                               
     ELSE                                                                       
     IF  IDX = 6                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 5                                    
     ELSE                                                                       
         NEXT SENTENCE.                                                         
 LIST6-WR-EXT.                                                                  
     EXIT.                                                                      
*                                                                               
*****************                                                               
*リスト７出力   *                                                               
*****************                                                               
 LIST7-WR-RTN.                                                                  
     IF  L7W-NENDNG(IDX)  NOT = ZERO                                            
         INITIALIZE     OUT1-REC1  LIST L7-REC                                  
         MOVE  L7W-REC(IDX)   TO   L7-REC                                       
         IF  IDX  =  5                                                          
             WRITE OUT1-REC1 FROM LIST7 BEFORE 5                                
         ELSE                                                                   
             WRITE OUT1-REC1 FROM LIST7 BEFORE 1                                
     ELSE                                                                       
     IF  IDX = 1                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 9                                    
     ELSE                                                                       
     IF  IDX = 2                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 8                                    
     ELSE                                                                       
     IF  IDX = 3                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 7                                    
     ELSE                                                                       
     IF  IDX = 4                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 6                                    
     ELSE                                                                       
     IF  IDX = 5                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 5                                    
     ELSE                                                                       
         NEXT SENTENCE.                                                         
 LIST7-WR-EXT.                                                                  
     EXIT.                                                                      
*                                                                               
*****************                                                               
*リスト８出力 *                                                                 
*****************                                                               
 LIST8-WR-RTN.                                                                  
     IF  L8W-SNENNG(IDX)  NOT = ZERO                                            
         INITIALIZE     OUT1-REC1  LIST L8-REC                                  
         MOVE  L8W-REC(IDX)  TO   L8-REC                                        
         IF  IDX  =  5                                                          
             WRITE OUT1-REC1 FROM LIST8 BEFORE 2                                
         ELSE                                                                   
             WRITE OUT1-REC1 FROM LIST8 BEFORE 1                                
     ELSE                                                                       
     IF  IDX = 1                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 6                                    
     ELSE                                                                       
     IF  IDX = 2                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 5                                    
     ELSE                                                                       
     IF  IDX = 3                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 4                                    
     ELSE                                                                       
     IF  IDX = 4                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 3                                    
     ELSE                                                                       
     IF  IDX = 5                                                                
         MOVE 8     TO  IDX                                                     
         INITIALIZE OUT1-REC1  LIST                                             
         WRITE OUT1-REC1 FROM LIST  BEFORE 2                                    
     ELSE                                                                       
         NEXT SENTENCE.                                                         
 LIST8-WR-EXT.                                                                  
     EXIT.                                                                      

