      *****************************************************************
      *程序ID         ：STAPPRAISE
      *程序名         ：学生奖惩信息
      *
      *日期           作成者            概要
      *2007/04/10     张丽娟            作成
      *
      *****************************************************************
000040 01 STAPPRAISE.
           03 SNO                                      PIC  9(06).
           03 SYEAR                                   PIC  9(04).
           03 SSYNOPSIS                            PIC  X(20).
           03 SPARTICULAR                        PIC  X(60).
000040     03 SSIGN                               PIC  9.
           03 SSERIAL                                PIC  9(05).
