000010************************************************
000020* (ALM_ALMTR3)
000030************************************************
000040 01  ALM_ALMTR3-DATTYP PIC  X(001).
000050 01  ALM_ALMTR3-CNTNUM PIC  X(010).
000060 01  ALM_ALMTR3-CNTDET PIC  X(002).
000070 01  ALM_ALMTR3-COLDAY PIC  X(008).
000080 01  ALM_ALMTR3-COLAMT PIC S9(013) COMP-3.
000090 01  ALM_ALMTR3-CONTAX PIC S9(013) COMP-3.
000100 01  ALM_ALMTR3-FINEND PIC  X(008).
000110 01  ALM_ALMTR3-ACCCOD PIC  X(002).
000120 01  ALM_ALMTR3-TIECOD PIC  X(002).
000130 01  ALM_ALMTR3-PAYCNT PIC S9(003) COMP-3.
000140 01  ALM_ALMTR3-BASRAT PIC S9(002)V9(8) COMP-3.
000150 01  ALM_ALMTR3-ACTRAT PIC S9(002)V9(8) COMP-3.
000160 01  ALM_ALMTR3-PAYCYC PIC S9(002) COMP-3.
000170 01  ALM_ALMTR3-FRZTRM PIC S9(003) COMP-3.
000180 01  ALM_ALMTR3-BGNCNT PIC S9(001) COMP-3.
000190 01  ALM_ALMTR3-CALTYP PIC  X(001).
000200 01  ALM_ALMTR3-ERRFLG PIC  X(005).
