000010************************************************
000020* (ALM_ASTDET)
000030************************************************
000040 01  ALM_ASTDET-ALMDET PIC  X(002).
000050 01  ALM_ASTDET-DETNAM PIC  X(032).
