000010************************************************
000020* (ALM_FORM_0001)
000030************************************************
000040 01  ALM_FORM_0001-ASTLIA PIC  X(001).
000050 01  ALM_FORM_0001-ALMDET PIC  X(002).
000060 01  ALM_FORM_0001-FIXFLT PIC  X(001).
000070 01  ALM_FORM_0001-ALMNAM PIC  X(020).
000080 01  ALM_FORM_0001-DIVCOD PIC  X(001).
000090 01  ALM_FORM_0001-DUE001 PIC S9(013) COMP-3.
000100 01  ALM_FORM_0001-DUE002 PIC S9(013) COMP-3.
000110 01  ALM_FORM_0001-DUE003 PIC S9(013) COMP-3.
000120 01  ALM_FORM_0001-DUE004 PIC S9(013) COMP-3.
000130 01  ALM_FORM_0001-DUE005 PIC S9(013) COMP-3.
000140 01  ALM_FORM_0001-MON001 PIC S9(013) COMP-3.
000150 01  ALM_FORM_0001-MON002 PIC S9(013) COMP-3.
000160 01  ALM_FORM_0001-MON003 PIC S9(013) COMP-3.
000170 01  ALM_FORM_0001-MON004 PIC S9(013) COMP-3.
000180 01  ALM_FORM_0001-MON005 PIC S9(013) COMP-3.
000190 01  ALM_FORM_0001-MON006 PIC S9(013) COMP-3.
000200 01  ALM_FORM_0001-MON007 PIC S9(013) COMP-3.
000210 01  ALM_FORM_0001-MON008 PIC S9(013) COMP-3.
000220 01  ALM_FORM_0001-MON009 PIC S9(013) COMP-3.
000230 01  ALM_FORM_0001-MON010 PIC S9(013) COMP-3.
000240 01  ALM_FORM_0001-MON011 PIC S9(013) COMP-3.
000250 01  ALM_FORM_0001-MON012 PIC S9(013) COMP-3.
000260 01  ALM_FORM_0001-YER001 PIC S9(013) COMP-3.
000270 01  ALM_FORM_0001-YER002 PIC S9(013) COMP-3.
000280 01  ALM_FORM_0001-YER003 PIC S9(013) COMP-3.
000290 01  ALM_FORM_0001-YER004 PIC S9(013) COMP-3.
000300 01  ALM_FORM_0001-YER005 PIC S9(013) COMP-3.
000310 01  ALM_FORM_0001-YER006 PIC S9(013) COMP-3.
000320 01  ALM_FORM_0001-YER007 PIC S9(013) COMP-3.
000330 01  ALM_FORM_0001-YER008 PIC S9(013) COMP-3.
000340 01  ALM_FORM_0001-YER009 PIC S9(013) COMP-3.
000350 01  ALM_FORM_0001-YER010 PIC S9(013) COMP-3.
000360 01  ALM_FORM_0001-YER011 PIC S9(013) COMP-3.
000370 01  ALM_FORM_0001-YER012 PIC S9(013) COMP-3.
000380 01  ALM_FORM_0001-DUER01 PIC S9(002)V9(2) COMP-3.
000390 01  ALM_FORM_0001-DUER02 PIC S9(002)V9(2) COMP-3.
000400 01  ALM_FORM_0001-DUER03 PIC S9(002)V9(2) COMP-3.
000410 01  ALM_FORM_0001-DUER04 PIC S9(002)V9(2) COMP-3.
000420 01  ALM_FORM_0001-DUER05 PIC S9(002)V9(2) COMP-3.
000430 01  ALM_FORM_0001-MONR01 PIC S9(002)V9(2) COMP-3.
000440 01  ALM_FORM_0001-MONR02 PIC S9(002)V9(2) COMP-3.
000450 01  ALM_FORM_0001-MONR03 PIC S9(002)V9(2) COMP-3.
000460 01  ALM_FORM_0001-MONR04 PIC S9(002)V9(2) COMP-3.
000470 01  ALM_FORM_0001-MONR05 PIC S9(002)V9(2) COMP-3.
000480 01  ALM_FORM_0001-MONR06 PIC S9(002)V9(2) COMP-3.
000490 01  ALM_FORM_0001-MONR07 PIC S9(002)V9(2) COMP-3.
000500 01  ALM_FORM_0001-MONR08 PIC S9(002)V9(2) COMP-3.
000510 01  ALM_FORM_0001-MONR09 PIC S9(002)V9(2) COMP-3.
000520 01  ALM_FORM_0001-MONR10 PIC S9(002)V9(2) COMP-3.
000530 01  ALM_FORM_0001-MONR11 PIC S9(002)V9(2) COMP-3.
000540 01  ALM_FORM_0001-MONR12 PIC S9(002)V9(2) COMP-3.
000550 01  ALM_FORM_0001-YERR01 PIC S9(002)V9(2) COMP-3.
000560 01  ALM_FORM_0001-YERR02 PIC S9(002)V9(2) COMP-3.
000570 01  ALM_FORM_0001-YERR03 PIC S9(002)V9(2) COMP-3.
000580 01  ALM_FORM_0001-YERR04 PIC S9(002)V9(2) COMP-3.
000590 01  ALM_FORM_0001-YERR05 PIC S9(002)V9(2) COMP-3.
000600 01  ALM_FORM_0001-YERR06 PIC S9(002)V9(2) COMP-3.
000610 01  ALM_FORM_0001-YERR07 PIC S9(002)V9(2) COMP-3.
000620 01  ALM_FORM_0001-YERR08 PIC S9(002)V9(2) COMP-3.
000630 01  ALM_FORM_0001-YERR09 PIC S9(002)V9(2) COMP-3.
000640 01  ALM_FORM_0001-YERR10 PIC S9(002)V9(2) COMP-3.
000650 01  ALM_FORM_0001-YERR11 PIC S9(002)V9(2) COMP-3.
000660 01  ALM_FORM_0001-YERR12 PIC S9(002)V9(2) COMP-3.
