000010************************************************
000020* (ALM_FORM_0001Y)
000030************************************************
000040 01  ALM_FORM_0001Y-YER000 PIC  X(004).
000050 01  ALM_FORM_0001Y-YER001 PIC  X(004).
000060 01  ALM_FORM_0001Y-YER002 PIC  X(004).
000070 01  ALM_FORM_0001Y-YER003 PIC  X(004).
000080 01  ALM_FORM_0001Y-YER004 PIC  X(004).
000090 01  ALM_FORM_0001Y-YER005 PIC  X(004).
000100 01  ALM_FORM_0001Y-YER006 PIC  X(004).
000110 01  ALM_FORM_0001Y-YER007 PIC  X(004).
000120 01  ALM_FORM_0001Y-YER008 PIC  X(004).
000130 01  ALM_FORM_0001Y-YER009 PIC  X(004).
000140 01  ALM_FORM_0001Y-YER010 PIC  X(004).
000150 01  ALM_FORM_0001Y-YER011 PIC  X(004).
000160 01  ALM_FORM_0001Y-YER012 PIC  X(004).
