000010************************************************
000020* (ALM_GAPMST)
000030************************************************
000040 01  ALM_GAPMST-REGNUM PIC  X(004).
000050 01  ALM_GAPMST-ASTLIA PIC  X(001).
000060 01  ALM_GAPMST-ALMDET PIC  X(002).
000070 01  ALM_GAPMST-FIXFLT PIC  X(001).
000080 01  ALM_GAPMST-ACCCOD PIC  X(005).
000090 01  ALM_GAPMST-DUECOD PIC  X(002).
000100 01  ALM_GAPMST-MONCNT PIC S9(003) COMP-3.
000110 01  ALM_GAPMST-FISYER PIC  X(004).
000120 01  ALM_GAPMST-BASYER PIC  X(004).
000130 01  ALM_GAPMST-BASMON PIC  X(002).
000140 01  ALM_GAPMST-COLAMT PIC S9(013) COMP-3.
000150 01  ALM_GAPMST-COLRAT PIC S9(002)V9(2) COMP-3.
000160 01  ALM_GAPMST-BALCAP PIC S9(013) COMP-3.
000170 01  ALM_GAPMST-AVEBAL PIC S9(013) COMP-3.
000180 01  ALM_GAPMST-AVEINT PIC S9(013) COMP-3.
000190 01  ALM_GAPMST-AVERAT PIC S9(002)V9(2) COMP-3.
000200 01  ALM_GAPMST-DIVCOD PIC  X(001).
000210 01  ALM_GAPMST-GAPFLG PIC  X(001).
000220 01  ALM_GAPMST-JOBTYP PIC  X(003).
