000010************************************************
000020* (ALM_FORM_0007)
000030************************************************
000040 01  ALM_FORM_0007-ACCCOD PIC  X(005).
000050 01  ALM_FORM_0007-ACCNAM PIC  X(032).
000060 01  ALM_FORM_0007-ASTLIA PIC  X(001).
000070 01  ALM_FORM_0007-ALMDET PIC  X(002).
000080 01  ALM_FORM_0007-ALMNAM PIC  X(032).
000090 01  ALM_FORM_0007-DUECOD PIC  X(002).
000100 01  ALM_FORM_0007-ALMTYP PIC  X(001).
000110 01  ALM_FORM_0007-OPEDAY PIC  X(008).
000120 01  ALM_FORM_0007-BALCAP PIC S9(013) COMP-3.
000130 01  ALM_FORM_0007-OPEFLG PIC  X(001).
