000010************************************************
000020* (ALM_ALMTR2)
000030************************************************
000040 01  ALM_ALMTR2-DATTYP PIC  X(001).
000050 01  ALM_ALMTR2-CNTNUM PIC  X(009).
000060 01  ALM_ALMTR2-APRDAY PIC  X(008).
000070 01  ALM_ALMTR2-PLNDAY PIC  X(008).
000080 01  ALM_ALMTR2-PAYDAY PIC  X(008).
000090 01  ALM_ALMTR2-COLAMT PIC S9(013) COMP-3.
000100 01  ALM_ALMTR2-CONTAX PIC S9(013) COMP-3.
000110 01  ALM_ALMTR2-PREAMT PIC S9(013) COMP-3.
000120 01  ALM_ALMTR2-SETAMT PIC S9(013) COMP-3.
000130 01  ALM_ALMTR2-TIECOD PIC  X(002).
000140 01  ALM_ALMTR2-ERRFLG PIC  X(005).
