000010************************************************
000020* (ANK_WORK008)
000030************************************************
000040 01  ANK_WORK008-KEY PIC  X(001).
000050 01  ANK_WORK008-案件番号 PIC  X(010).
000060 01  ANK_WORK008-見積枝番 PIC  X(002).
000070 01  ANK_WORK008-取引先名 PIC  X(060).
000080 01  ANK_WORK008-登録日 PIC  X(008).
000090 01  ANK_WORK008-登録時刻 PIC  X(006).
000100 01  ANK_WORK008-登録担当者ｺｰﾄﾞ PIC  X(004).
000110 01  ANK_WORK008-更新日 PIC  X(008).
000120 01  ANK_WORK008-更新時刻 PIC  X(006).
000130 01  ANK_WORK008-更新担当者ｺｰﾄﾞ PIC  X(004).
