000010************************************************
000020* (ANK_KANNI)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|ŒÚ‹qƒR[ƒh PIC  X(006).
000080 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|Œ©Ï“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000110 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000120 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000130 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000140 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000150 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|‘e—˜‰v PIC S9(013) COMP-3.
000160 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|“o˜^“ú PIC  X(008).
000170 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|“o˜^Žž PIC  X(006).
000180 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000190 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|XV“ú PIC  X(008).
000200 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|XVŽž PIC  X(006).
000210 01  ‚`‚m‚j|‚j‚`‚m‚m‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
