000010************************************************
000020* (ANK_LPWK_KIHON)
000030************************************************
000040 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|’[––”Ô† PIC  X(016).
000070 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000080 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒvŽZ•ûŽ® PIC  X(001).
000090 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒJ‰„” PIC S9(002) COMP-3.
000100 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|•¨Œ” PIC S9(003) COMP-3.
000110 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|w“ü‹àŠz PIC S9(013) COMP-3.
000120 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‰Šú”ï—p PIC S9(013) COMP-3.
000130 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000140 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000150 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000160 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|˜’uŠúŠÔ 
                                             PIC S9(002)V9(2) COMP-3.
000170 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000180 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000190 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‘Ï—p”N” PIC S9(002) COMP-3.
000200 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅ—¦ 
                                             PIC S9(002)V9(2) COMP-3.
000210 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000220 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Žc‰¿Šz PIC S9(013) COMP-3.
000230 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒŽŠz•ÛŽç—¿ 
                                             PIC S9(013) COMP-3.
000240 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‘OŽóŒŽ” PIC S9(002) COMP-3.
000250 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒJ‰„‹àŠz‚P 
                                             PIC S9(013) COMP-3.
000260 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒJ‰„ŒŽ”‚P 
                                             PIC S9(002)V9(2) COMP-3.
000270 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒJ‰„‹àŠz‚Q 
                                             PIC S9(013) COMP-3.
000280 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒJ‰„ŒŽ”‚Q 
                                             PIC S9(002)V9(2) COMP-3.
000290 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Œ_–ñ‘Šz PIC S9(013) COMP-3.
000300 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿‘Šz 
                                             PIC S9(013) COMP-3.
000310 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿ŒŽŠz 
                                             PIC S9(013) COMP-3.
000320 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000330 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅ‘Šz 
                                             PIC S9(013) COMP-3.
000340 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅŒŽŠz 
                                             PIC S9(013) COMP-3.
000350 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅ—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000360 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯‘Šz 
                                             PIC S9(013) COMP-3.
000370 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯ŒŽŠz 
                                             PIC S9(013) COMP-3.
000380 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯—¿—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000390 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‡Œv‚P PIC S9(013) COMP-3.
000400 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‡Œv‚Q PIC S9(013) COMP-3.
000410 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‡Œv‚R 
                                             PIC S9(002)V9(8) COMP-3.
000420 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿‘Šz 
                                             PIC S9(013) COMP-3.
000430 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ŒŽŠz 
                                             PIC S9(013) COMP-3.
000440 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000450 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒJ‰„‹àŠz‘Šz 
                                             PIC S9(013) COMP-3.
000460 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒJ‰„‹àŠzŒŽŠz 
                                             PIC S9(013) COMP-3.
000470 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŒJ‰„‹àŠz—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000480 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‡Œv‚S PIC S9(013) COMP-3.
000490 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‡Œv‚T PIC S9(013) COMP-3.
000500 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‡Œv‚U 
                                             PIC S9(002)V9(8) COMP-3.
000510 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(8) COMP-3.
000520 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000530 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000540 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|ŽÀŽ¿ƒŠ[ƒX—¿‚o‚u 
                                             PIC S9(013) COMP-3.
000550 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|Žc‰¿Šz‚o‚u 
                                             PIC S9(013) COMP-3.
000560 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‘e—˜‰v PIC S9(013) COMP-3.
000570 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚P 
                                             PIC S9(013) COMP-3.
000580 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚Q 
                                             PIC S9(013) COMP-3.
000590 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚R 
                                             PIC S9(013) COMP-3.
000600 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚S 
                                             PIC S9(013) COMP-3.
000610 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚T 
                                             PIC S9(013) COMP-3.
000620 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚U 
                                             PIC S9(013) COMP-3.
000630 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚V 
                                             PIC S9(013) COMP-3.
000640 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚W 
                                             PIC S9(013) COMP-3.
000650 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚X 
                                             PIC S9(013) COMP-3.
000660 01  ‚`‚m‚j|‚k‚o‚v‚j|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à‚P‚O 
                                             PIC S9(013) COMP-3.
