000010************************************************
000020* (ANK_KEITAI)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000050 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|“à—e PIC  X(050).
000060 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|Œ_–ñ”Ô†ã‚PŒ… PIC  X(001).
000070 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|ƒ\[ƒg‚j‚d‚x PIC S9(002) COMP-3.
000080 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|“o˜^“ú PIC  X(008).
000090 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|“o˜^Žž PIC  X(006).
000100 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000110 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|XV“ú PIC  X(008).
000120 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|XVŽž PIC  X(006).
000130 01  ‚`‚m‚j|‚j‚d‚h‚s‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
