000010************************************************
000020* (ANK_KINJITI)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|Œ‹‰Ê‚m‚n PIC S9(001) COMP-3.
000050 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000060 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|ƒŠ[ƒX—¿—¦ PIC S9(002)V9(8) COMP-3.
000070 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000080 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|‘e—˜ PIC S9(013) COMP-3.
000090 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|‚e‚q‚n‚l PIC S9(001) COMP-3.
000100 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|‚s‚n PIC S9(001) COMP-3.
000110 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|ŒvŽZ•ûŽ® PIC  X(001).
000120 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|“o˜^“ú PIC  X(008).
000130 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|“o˜^Žž PIC  X(006).
000140 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|XV“ú PIC  X(008).
000160 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|XVŽž PIC  X(006).
000170 01  ‚`‚m‚j|‚j‚h‚m‚i‚h‚s‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
