000010************************************************
000020* (ANK_WORK007)
000030************************************************
000040 01  ANK_WORK007-KEY PIC  X(001).
000050 01  ANK_WORK007-見積書提出先 PIC  X(060).
000060 01  ANK_WORK007-住所 PIC  X(100).
000070 01  ANK_WORK007-担当部店 PIC  X(020).
000080 01  ANK_WORK007-電話番号 PIC  X(020).
000090 01  ANK_WORK007-FAX番号 PIC  X(020).
000100 01  ANK_WORK007-ﾃｷｽﾄ1 PIC  X(060).
000110 01  ANK_WORK007-ﾃｷｽﾄ2 PIC  X(060).
000120 01  ANK_WORK007-ﾃｷｽﾄ3 PIC  X(060).
000130 01  ANK_WORK007-ﾃｷｽﾄ4 PIC  X(060).
000140 01  ANK_WORK007-ﾃｷｽﾄ5 PIC  X(060).
000150 01  ANK_WORK007-ﾃｷｽﾄ6 PIC  X(060).
000160 01  ANK_WORK007-登録日 PIC  X(008).
000170 01  ANK_WORK007-登録時刻 PIC  X(006).
000180 01  ANK_WORK007-登録担当者ｺｰﾄﾞ PIC  X(004).
000190 01  ANK_WORK007-更新日 PIC  X(008).
000200 01  ANK_WORK007-更新時刻 PIC  X(006).
000210 01  ANK_WORK007-更新担当者ｺｰﾄﾞ PIC  X(004).
