000010************************************************
000020* (ANK_TENKAI)
000030************************************************
000040 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|˜A”Ô PIC S9(003) COMP-3.
000070 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|“WŠJƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000080 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|‰ñ” PIC S9(003) COMP-3.
000090 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|“o˜^“ú PIC  X(008).
000100 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|“o˜^Žž PIC  X(006).
000110 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|XV“ú PIC  X(008).
000130 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|XVŽž PIC  X(006).
000140 01  ‚`‚m‚j|‚s‚d‚m‚j‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
