000010************************************************
000020* (ANK_KEISAN)
000030************************************************
000040 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ˆÄŒ”Ô† PIC  X(010).
000050 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|Œ©ÏŽ}”Ô PIC  X(002).
000060 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŒvŽZ•ûŽ® PIC  X(001).
000070 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000080 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000090 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
000100 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|‘OŽóŒŽ” PIC S9(002) COMP-3.
000110 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|˜’uŠúŠÔ PIC S9(002)V9(2) COMP-3.
000120 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(2) COMP-3.
000130 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŒŽŠz•½‹Ï•ÛŽç—¿ PIC S9(013) COMP-3.
000140 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|‰Šú”ï—p PIC S9(013) COMP-3.
000150 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000160 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|Á”ïÅ’¥Žû‹æ•ª PIC  X(001).
000170 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000180 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000190 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000200 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|‘e—˜‰v PIC S9(013) COMP-3.
000210 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000220 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ƒŠ[ƒX—¿—¦ PIC S9(002)V9(8) COMP-3.
000230 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|Šî–{ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000240 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŒŽŠzŒÅ’èŽ‘ŽYÅŒv PIC S9(013) COMP-3.
000250 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŒŽŠz“®‘•ÛŒ¯—¿Œv PIC S9(013) COMP-3.
000260 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŒŽŠz‘OŽóƒƒŠƒbƒg PIC S9(013) COMP-3.
000270 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŒŽŠzŒJ‰„ƒƒŠƒbƒgŒv 
                                             PIC S9(013) COMP-3.
000280 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŽÀŽ¿ƒŠ[ƒX—¿‚o‚u PIC S9(013) COMP-3.
000290 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|Žc‰¿‚o‚u PIC S9(013) COMP-3.
000300 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|•¨Œ” PIC S9(003) COMP-3.
000310 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|ŒJ‰„” PIC S9(002) COMP-3.
000320 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|“o˜^“ú PIC  X(008).
000330 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|“o˜^Žž PIC  X(006).
000340 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000350 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|XV“ú PIC  X(008).
000360 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|XVŽž PIC  X(006).
000370 01  ‚`‚m‚j|‚j‚d‚h‚r‚`‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
