000010************************************************
000020* (ANK_CHOHYO)
000030************************************************
000040 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|˜A”Ô PIC S9(004) COMP-3.
000050 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|’ •[‚P PIC S9(001) COMP-3.
000060 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|’ •[‚Q PIC S9(001) COMP-3.
000070 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|’ •[‚R PIC S9(001) COMP-3.
000080 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|’ •[‚S PIC S9(001) COMP-3.
000090 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|’ •[‚T PIC S9(001) COMP-3.
000100 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|’ •[‚U PIC S9(001) COMP-3.
000110 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|’ •[‚V PIC S9(001) COMP-3.
000120 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|’ •[‚W PIC S9(001) COMP-3.
000130 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|Žx•¥ŠJŽn“ú PIC  X(008).
000140 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|w“ü‹àŠz”ñ•\Ž¦‹æ•ª 
                                             PIC S9(001) COMP-3.
000150 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|—¿—¦”ñ•\Ž¦‹æ•ª PIC S9(001) COMP-3.
000160 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|“Á–ñ•¶Œ¾”ñ•\Ž¦‹æ•ª 
                                             PIC S9(001) COMP-3.
000170 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|“o˜^“ú PIC  X(008).
000180 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|“o˜^Žž PIC  X(006).
000190 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000200 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|XV“ú PIC  X(008).
000210 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|XVŽž PIC  X(006).
000220 01  ‚`‚m‚j|‚b‚g‚n‚g‚x‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
