000010************************************************
000020* (APR_KIHON_SOSIN)
000030************************************************
000040 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ƒf[ƒ^Ž¯•ÊƒR[ƒh 
                                             PIC  X(002).
000050 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘—MŽ–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000060 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ì¬“ú•t PIC  X(008).
000070 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ì¬Žž PIC  X(006).
000080 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Œ_–ñ”Ô† PIC  X(009).
000090 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ƒŒƒR[ƒh‹æ•ª PIC  X(001).
000100 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000110 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000120 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Œ_–ñ“ú PIC  X(008).
000130 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŒŸŽû—\’è“ú PIC  X(008).
000140 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŒŸŽû“ú PIC  X(008).
000150 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000160 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000170 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000180 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Á”ïÅ—¦ PIC S9(003) COMP-3.
000190 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Á”ïÅ’¥Žû‹æ•ª PIC  X(001).
000200 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000210 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|I‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000220 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŒÅ’èŽ‘ŽYÅ 
                                             PIC S9(013) COMP-3.
000230 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•ÛŒ¯—¿ PIC S9(013) COMP-3.
000240 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‚»‚Ì‘¼””ï—p‚P 
                                             PIC S9(013) COMP-3.
000250 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‚»‚Ì‘¼””ï—p‚Q 
                                             PIC S9(013) COMP-3.
000260 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŒŽŠz•½‹Ï•ÛŽç—¿ 
                                             PIC S9(013) COMP-3.
000270 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000280 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘OŽóƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000290 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|’P”N“xŒ_–ñ PIC  X(002).
000300 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000310 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000320 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Â–±‹¦’²ƒR[ƒh PIC  X(002).
000330 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Šî–{—˜‰ñ‚èƒTƒCƒ“—Ìˆæ 
                                             PIC  X(001).
000340 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Šî–{—˜‰ñ‚è 
                                             PIC S9(010) COMP-3.
000350 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŽÀŽ¿—˜‰ñ‚èƒTƒCƒ“—Ìˆæ 
                                             PIC  X(001).
000360 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(010) COMP-3.
000370 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘O“n‹à—˜‘§ƒTƒCƒ“—Ìˆæ 
                                             PIC  X(001).
000380 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘O“n‹à—˜‘§‰Šú”ï—p 
                                             PIC S9(013) COMP-3.
000390 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|¿‹æƒR[ƒh PIC  X(008).
000400 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|¿‹‹æ•ª‚P PIC  X(001).
000410 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|¿‹‹æ•ª‚Q PIC  X(001).
000420 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000430 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000440 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|˜’uŠúŠÔ 
                                             PIC S9(003) COMP-3.
000450 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‚a‚d‚f‚h‚m‰ñ” 
                                             PIC S9(001) COMP-3.
000460 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŒvŽZ•ûŽ® PIC  X(001).
000470 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‹âsƒR[ƒh PIC  X(007).
000480 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|“]ƒŠ[ƒX’ñŒgæƒR[ƒh 
                                             PIC  X(002).
000490 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000500 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000510 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘e—˜‰vƒTƒCƒ“—Ìˆæ 
                                             PIC  X(001).
000520 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘e—˜‰v PIC S9(013) COMP-3.
000530 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŒûÀ”Ô† PIC  X(007).
000540 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|—a‹àŽí—Þ PIC  X(001).
000550 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|“ü‹à“ú PIC  X(002).
000560 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Žc‰¿‰ñŽû“ú PIC  X(008).
000570 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ŒJ‰„ŒŽ” PIC S9(004) COMP-3.
000580 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|Šî€‹à—˜ PIC S9(004) COMP-3.
000590 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|‘O“n‹à‹æ•ª PIC  X(001).
000600 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|[“–‘ŠŽE‹æ•ª PIC  X(001).
000610 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000620 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|âg‹c‹æ•ª PIC  X(001).
000630 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚P PIC  X(008).
000640 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|—^Mæ–¼‚P PIC  X(060).
000650 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚P PIC  X(002).
000660 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚P PIC  X(002).
000670 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•‰’SŠ„‡‚P 
                                             PIC S9(003) COMP-3.
000680 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚Q PIC  X(008).
000690 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|—^Mæ–¼‚Q PIC  X(060).
000700 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚Q PIC  X(002).
000710 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚Q PIC  X(002).
000720 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•‰’SŠ„‡‚Q 
                                             PIC S9(003) COMP-3.
000730 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚R PIC  X(008).
000740 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|—^Mæ–¼‚R PIC  X(060).
000750 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚R PIC  X(002).
000760 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚R PIC  X(002).
000770 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•‰’SŠ„‡‚R 
                                             PIC S9(003) COMP-3.
000780 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚S PIC  X(008).
000790 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|—^Mæ–¼‚S PIC  X(060).
000800 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚S PIC  X(002).
000810 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚S PIC  X(002).
000820 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•‰’SŠ„‡‚S 
                                             PIC S9(003) COMP-3.
000830 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|–¼Šñ‚¹ƒR[ƒh‚T PIC  X(008).
000840 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|—^Mæ–¼‚T PIC  X(060).
000850 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•ÛØ’S•Û“à—e‚T PIC  X(002).
000860 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•Û‘S”ÍˆÍ‚T PIC  X(002).
000870 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|•‰’SŠ„‡‚T 
                                             PIC S9(003) COMP-3.
000880 01  ‚`‚o‚q|‚j‚h‚g‚n‚m|‚r‚n‚r‚h‚m|ƒf[ƒ^‹æ•ª PIC  X(001).
