000010************************************************
000020* (COM_MSG)
000030************************************************
000040 01  ‚b‚n‚l|‚l‚r‚f|ƒƒbƒZ[ƒW‚h‚c PIC  X(006).
000050 01  ‚b‚n‚l|‚l‚r‚f|ƒƒbƒZ[ƒW PIC  X(100).
