000010************************************************
000020* ’nˆÊ³Œp(CPFCISYO)
000030************************************************
000040 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Œ³Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚b‚o‚e‚b‚h‚r‚x‚n|³Œp‹æ•ª PIC  X(001).
000060 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Œ³•¨Œ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Œ³Å—¦ PIC S9(002)V9(1) COMP-3.
000080 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Š¨’èˆ—‚b‚c PIC S9(002) COMP-3.
000090 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Œ_–ñ‚m‚n PIC  X(009).
000100 01  ‚b‚o‚e‚b‚h‚r‚x‚n|•¨Œ‚m‚n PIC S9(003) COMP-3.
000110 01  ‚b‚o‚e‚b‚h‚r‚x‚n|ˆ—‹æ•ª PIC  X(001).
000120 01  ‚b‚o‚e‚b‚h‚r‚x‚n|ˆ—Š®—¹Ï‹æ•ª PIC  X(001).
000130 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Ž–‹ÆŠ‚b‚c PIC S9(004) COMP-3.
000140 01  ‚b‚o‚e‚b‚h‚r‚x‚n|ƒ†[ƒU[‚b‚c PIC  X(008).
000150 01  ‚b‚o‚e‚b‚h‚r‚x‚n|¿‹æ‚b‚c PIC  X(008).
000160 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Å—¦ PIC S9(002)V9(1) COMP-3.
000170 01  ‚b‚o‚e‚b‚h‚r‚x‚n|¿‹‹æ•ª‚Q PIC S9(001) COMP-3.
000180 01  ‚b‚o‚e‚b‚h‚r‚x‚n|‹âs‚b‚c PIC  X(007).
000190 01  ‚b‚o‚e‚b‚h‚r‚x‚n|—a‹àŽí—Þ PIC  X(001).
000200 01  ‚b‚o‚e‚b‚h‚r‚x‚n|ŒûÀ”Ô† PIC  X(007).
000210 01  ‚b‚o‚e‚b‚h‚r‚x‚n|“ü‹à“ú PIC S9(002) COMP-3.
000220 01  ‚b‚o‚e‚b‚h‚r‚x‚n|w“ü‹àŠz PIC S9(013) COMP-3.
000230 01  ‚b‚o‚e‚b‚h‚r‚x‚n|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000240 01  ‚b‚o‚e‚b‚h‚r‚x‚n|”[•tæ‚b‚c PIC  X(006).
000250 01  ‚b‚o‚e‚b‚h‚r‚x‚n|”—Ê PIC S9(004) COMP-3.
000260 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Ý’uêŠ–¼ƒJƒi PIC  X(020).
000270 01  ‚b‚o‚e‚b‚h‚r‚x‚n|•¨Œ–¼ƒJƒi PIC  X(030).
000280 01  ‚b‚o‚e‚b‚h‚r‚x‚n|ÄƒŠ[ƒX‚b‚c PIC S9(001) COMP-3.
000290 01  ‚b‚o‚e‚b‚h‚r‚x‚n|³Œp•ªŠ„Œ” PIC S9(002) COMP-3.
000300 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Ž‘ŽY‚b‚c PIC S9(007) COMP-3.
000310 01  ‚b‚o‚e‚b‚h‚r‚x‚n|•ÛŒ¯‰ïŽÐ‚b‚c PIC  X(001).
000320 01  ‚b‚o‚e‚b‚h‚r‚x‚n|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000330 01  ‚b‚o‚e‚b‚h‚r‚x‚n|•t•Û‹æ•ª PIC  X(001).
000340 01  ‚b‚o‚e‚b‚h‚r‚x‚n|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000350 01  ‚b‚o‚e‚b‚h‚r‚x‚n|‹@ŠB‹æ•ª PIC  X(002).
000360 01  ‚b‚o‚e‚b‚h‚r‚x‚n|‹@Ží–¼”Ô† PIC  X(002).
000370 01  ‚b‚o‚e‚b‚h‚r‚x‚n|Œ^Ž®”Ô† PIC  X(015).
000380 01  ‚b‚o‚e‚b‚h‚r‚x‚n|ƒ_ƒ~[‚O‚O‚P PIC  X(018).
