000010************************************************
000020* ‰ð–ñ—š—ðÂŒ ƒtƒ@ƒCƒ‹(ƒŠ[ƒX“WŠJ)(CPFKAIRD03)
000030************************************************
000040 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚j‚d‚x|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚j‚d‚x|•¨Œ‚m‚n PIC S9(003) COMP-3.
000060 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚j‚d‚x|‰ð–ñ‹æ•ª PIC  X(001).
000070 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚j‚d‚x|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000080 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚j‚d‚x|‰ð–ñ“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000090 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚j‚d‚x|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000100 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚j‚d‚x|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000110 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚j‚d‚x|ƒŒƒR[ƒh‹æ•ª PIC  X(002).
000120 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Œ_–ñ”Ô† PIC  X(009).
000130 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000140 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|•¨Œ‚m‚n PIC S9(003) COMP-3.
000150 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000160 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000170 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‰ð–ñ‹æ•ª PIC  X(001).
000180 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|”N“x|¢‹I PIC  X(001).
000190 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|”N“x|”N PIC  X(002).
000200 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|”N“x|ŒŽ PIC  X(002).
000210 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000220 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|ŽÀƒŠ[ƒX—¿|Šî–{ PIC S9(013) COMP-3.
000230 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|ŽÀƒŠ[ƒX—¿|ŽÀŽ¿ PIC S9(013) COMP-3.
000240 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚m‚d‚s|ƒŠ[ƒX—¿Šî–{ PIC S9(013) COMP-3.
000250 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‚m‚d‚s|ƒŠ[ƒX—¿ŽÀŽ¿ PIC S9(013) COMP-3.
000260 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|—˜‘§|Šî–{ PIC  X(013).
000270 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|—˜‘§|ŽÀŽ¿ PIC  X(013).
000280 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Œ³–{“à“ü PIC S9(013) COMP-3.
000290 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Œ³–{Žc‚ PIC S9(013) COMP-3.
000300 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|ÂŒ Žc‚|Šî–{ PIC S9(013) COMP-3.
000310 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|ÂŒ Žc‚|ŽÀŽ¿ PIC S9(013) COMP-3.
000320 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Á”ïÅ|Šz PIC S9(011) COMP-3.
000330 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Á”ïÅ|‰ñŽû•ûŽ® PIC  X(001).
000340 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|””ï—p PIC S9(013) COMP-3.
000350 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000360 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000370 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‰ñŽû•ûŽ® PIC  X(001).
000380 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‰ñŽûÏ•\Ž¦ PIC  X(001).
000390 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|‘OŽó[“–•\Ž¦ PIC  X(001).
000400 01  ‚b‚o‚e‚j‚`‚h‚q‚c‚O‚R|Žc‰¿‰ñŽû•\Ž¦ PIC  X(001).
