000010************************************************
000020* ÂŒ ’Šoƒtƒ@ƒCƒ‹(CPFSAISL)
000030************************************************
000040 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ÄƒŠ[ƒXƒR[ƒh PIC  X(001).
000060 01  ‚b‚o‚e‚r‚`‚h‚r‚k|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚b‚o‚e‚r‚`‚h‚r‚k|¿‹ƒR[ƒh PIC  X(002).
000080 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000090 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰ð–ñ‹æ•ª PIC  X(001).
000100 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000110 01  ‚b‚o‚e‚r‚`‚h‚r‚k|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000120 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒOƒ‹[ƒvƒR[ƒh PIC  X(008).
000130 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒNƒ‰ƒX PIC  X(002).
000140 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000150 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒ†[ƒU–¼Ì|Š¿ŽšƒJƒi‹æ•ª PIC  X(001).
000160 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒ†[ƒU–¼Ì|—ªÌ PIC  X(026).
000170 01  ‚b‚o‚e‚r‚`‚h‚r‚k|–¼Šñ‚¹–¼Ì|Š¿ŽšƒJƒi‹æ•ª PIC  X(001).
000180 01  ‚b‚o‚e‚r‚`‚h‚r‚k|–¼Šñ‚¹–¼Ì|—ªÌ PIC  X(030).
000190 01  ‚b‚o‚e‚r‚`‚h‚r‚k|—^MŒÀ“xŠz PIC S9(013) COMP-3.
000200 01  ‚b‚o‚e‚r‚`‚h‚r‚k|•¨ŒŽ}”Ô” PIC S9(003) COMP-3.
000210 01  ‚b‚o‚e‚r‚`‚h‚r‚k|”—Ê PIC S9(005) COMP-3.
000220 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒ_ƒ~[‚O‚O‚P PIC  X(001).
000230 01  ‚b‚o‚e‚r‚`‚h‚r‚k|•¨Œ–¼ PIC  X(030).
000240 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒ_ƒ~[‚O‚O‚Q PIC  X(001).
000250 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Ý’uêŠ–¼ PIC  X(020).
000260 01  ‚b‚o‚e‚r‚`‚h‚r‚k|¿‹æƒR[ƒh PIC  X(008).
000270 01  ‚b‚o‚e‚r‚`‚h‚r‚k|¿‹æ–¼Ì|Š¿ŽšƒJƒi‹æ•ª PIC  X(001).
000280 01  ‚b‚o‚e‚r‚`‚h‚r‚k|¿‹æ–¼Ì|—ªÌ PIC  X(026).
000290 01  ‚b‚o‚e‚r‚`‚h‚r‚k|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000300 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“ü‹à“ú PIC S9(002) COMP-3.
000310 01  ‚b‚o‚e‚r‚`‚h‚r‚k|¿‹‘”­s—lŽ® PIC  X(001).
000320 01  ‚b‚o‚e‚r‚`‚h‚r‚k|¿‹‘”­sŒŽ‹æ•ª PIC  X(001).
000330 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“ü‹àî•ñ|‹âsƒR[ƒh PIC  X(007).
000340 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“ü‹àî•ñ|‹âs–¼Ì|Š¿ŽšƒJƒi‹æ•ª PIC  X(001).
000350 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“ü‹àî•ñ|‹âs–¼Ì|—ªÌ PIC  X(030).
000360 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“ü‹àî•ñ|ŒûÀ”Ô† PIC  X(007).
000370 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“ü‹àî•ñ|—a‹àŽí—Þ PIC  X(001).
000380 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Ž©“®ˆø—Ž|‹âsƒR[ƒh PIC  X(007).
000390 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Ž©“®ˆø—Ž|‹âs–¼Ì|Š¿ŽšƒJƒi‹æ•ª PIC  X(001).
000400 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Ž©“®ˆø—Ž|‹âs–¼Ì|—ªÌ PIC  X(030).
000410 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Ž©“®ˆø—Ž|ŒûÀ”Ô† PIC  X(007).
000420 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Ž©“®ˆø—Ž|—a‹àŽí—Þ PIC  X(001).
000430 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‹ÆŽíƒR[ƒh PIC  X(002).
000440 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘åŠé‹ÆƒR[ƒh PIC  X(001).
000450 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒŠ[ƒX—¿“ü‹à’PˆÊ PIC  X(001).
000460 01  ‚b‚o‚e‚r‚`‚h‚r‚k|UžŽè”—¿’PˆÊ PIC  X(001).
000470 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŸŽû“ú|¢‹I PIC  X(001).
000480 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000490 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC  X(001).
000500 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000510 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒŠ[ƒXI—¹“ú|¢‹I PIC  X(001).
000520 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000530 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000540 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC  X(001).
000550 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000560 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Žc‰¿‰ñŽû“ú|¢‹I PIC  X(001).
000570 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000580 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰ð–ñ“ú|¢‹I PIC  X(001).
000590 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000600 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Žc‰¿•ÛØ‹æ•ª PIC  X(001).
000610 01  ‚b‚o‚e‚r‚`‚h‚r‚k|˜’uŠúŠÔ PIC S9(003) COMP-3.
000620 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000630 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒvŽZ•ûŽ® PIC  X(001).
000640 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|¢‹I PIC  X(001).
000650 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000660 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000670 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽó[“–ŠJŽn“ú|¢‹I PIC  X(001).
000680 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽó[“–ŠJŽn“ú|”NŒŽ PIC  X(004).
000690 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽó[“–I—¹“ú|¢‹I PIC  X(001).
000700 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽó[“–I—¹“ú|”NŒŽ PIC  X(004).
000710 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽó[“–ŒŽ” PIC S9(003) COMP-3.
000720 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ˆê•”[“–Šz PIC S9(013) COMP-3.
000730 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽó‹à—˜‘§Šz PIC S9(013) COMP-3.
000740 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŽŽŸƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000750 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000760 01  ‚b‚o‚e‚r‚`‚h‚r‚k|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000770 01  ‚b‚o‚e‚r‚`‚h‚r‚k|—˜‘§‡Œv PIC S9(013) COMP-3.
000780 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŽŠzŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000790 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŽŠz•ÛŒ¯—¿ PIC S9(013) COMP-3.
000800 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŽŠz•ÛŽç—¿ PIC S9(013) COMP-3.
000810 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŽŠz‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000820 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŽŠz‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000830 01  ‚b‚o‚e‚r‚`‚h‚r‚k|””ï—p‡Œv PIC S9(013) COMP-3.
000840 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Žc‰¿Šz‡Œv PIC S9(013) COMP-3.
000850 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000860 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000870 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘e—˜ PIC S9(013) COMP-3.
000880 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Šî€‹à—˜ PIC S9(002)V9(7) COMP-3.
000890 01  ‚b‚o‚e‚r‚`‚h‚r‚k|’S“–ŽÒƒR[ƒh PIC  X(004).
000900 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Žx•¥‰ñ” PIC S9(003) COMP-3.
000910 01  ‚b‚o‚e‚r‚`‚h‚r‚k|¿‹‘”­sÏ‰ñ” PIC S9(003) COMP-3.
000920 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒtƒ@ƒCƒiƒ“ƒXŠúŠÔ PIC S9(003) COMP-3.
000930 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒtƒ@ƒCƒiƒ“ƒXŠJŽn“ú|¢‹I PIC  X(001).
000940 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒtƒ@ƒCƒiƒ“ƒXŠJŽn“ú|”NŒŽ PIC  X(004).
000950 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|¢‹I PIC  X(001).
000960 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒtƒ@ƒCƒiƒ“ƒXI—¹“ú|”NŒŽ PIC  X(004).
000970 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Œ_–ñ“ú|¢‹I PIC  X(001).
000980 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000990 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ˆê•”‰ð–ñ“ú|¢‹I PIC  X(001).
001000 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ˆê•”‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
001010 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“–ŒŽ PIC  X(001).
001020 01  ‚b‚o‚e‚r‚`‚h‚r‚k|—‚ŒŽ PIC  X(001).
001030 01  ‚b‚o‚e‚r‚`‚h‚r‚k|—‚XŒŽ PIC  X(001).
001040 01  ‚b‚o‚e‚r‚`‚h‚r‚k|’S•Û‹æ•ª PIC  X(001).
001050 01  ‚b‚o‚e‚r‚`‚h‚r‚k|’S•Û‹âsƒR[ƒh PIC  X(007).
001060 01  ‚b‚o‚e‚r‚`‚h‚r‚k|’S•Û·“ü“ú|¢‹I PIC  X(001).
001070 01  ‚b‚o‚e‚r‚`‚h‚r‚k|’S•Û·“ü“ú|”NŒŽ“ú PIC  X(006).
001080 01  ‚b‚o‚e‚r‚`‚h‚r‚k|’S•Ûˆ—ŒŽ“x|¢‹I PIC  X(001).
001090 01  ‚b‚o‚e‚r‚`‚h‚r‚k|’S•Ûˆ—ŒŽ“x|”NŒŽ PIC  X(004).
001100 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‹¦’²ƒR[ƒh PIC  X(002).
001110 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ˆ´ùƒŠ[ƒX”»’è‹æ•ª PIC  X(001).
001120 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Á”ïÅ’¥Žû‹æ•ª PIC  X(001).
001130 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Á”ïÅ|Å—¦ PIC S9(002)V9(1) COMP-3.
001140 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Žd“üÁ”ïÅ PIC S9(013) COMP-3.
001150 01  ‚b‚o‚e‚r‚`‚h‚r‚k|’P”N“xŒ_–ñ PIC  X(002).
001160 01  ‚b‚o‚e‚r‚`‚h‚r‚k|Á”ïÅƒR[ƒh PIC  X(002).
001170 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
001180 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ˆ—“ú|¢‹I PIC  X(001).
001190 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ˆ—“ú|”NŒŽ PIC  X(004).
001200 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ŒŸŽûWŒv•\‘ÎÛŠO‹æ•ª PIC  X(001).
001210 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ”NŒŽ|¢‹I PIC  X(001).
001220 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ”NŒŽ|”NŒŽ PIC  X(004).
001230 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
001240 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|ŽÀƒŠ[ƒX—¿ PIC S9(013) COMP-3.
001250 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|ƒlƒbƒgƒŠ[ƒX—¿ PIC S9(013) COMP-3.
001260 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|””ï—p PIC S9(013) COMP-3.
001270 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|—˜‘§ PIC S9(013) COMP-3.
001280 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|Œ³–{ PIC S9(013) COMP-3.
001290 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|Œ³–{“à“ü PIC S9(013) COMP-3.
001300 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|Œ³–{Žc‚ PIC S9(013) COMP-3.
001310 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|ÂŒ Žc‚ PIC S9(013) COMP-3.
001320 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|Á”ïÅŠz PIC S9(011) COMP-3.
001330 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|Á”ïÅ‰ñŽû•ûŽ®ƒR[ƒh PIC  X(001).
001340 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
001350 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒ_ƒ~| PIC  X(007).
001360 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|‰ñŽû•ûŽ®ƒR[ƒh PIC  X(001).
001370 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|‰ñŽûÏƒR[ƒh PIC  X(001).
001380 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|‘OŽó[“–•\Ž¦ PIC  X(001).
001390 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‰‰ñ¿‹î•ñ|Žc‰¿[“–•\Ž¦ PIC  X(001).
001400 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒ†[ƒUƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n PIC  X(012).
001410 01  ‚b‚o‚e‚r‚`‚h‚r‚k|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
001420 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒIƒyƒŒ[ƒeƒBƒ“ƒO”»’èƒtƒ‰ƒO PIC  X(001).
001430 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ÅV“ü—ÍÁ”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
001440 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘OŽóƒŠ[ƒX—¿Žc‚ PIC S9(013) COMP-3.
001450 01  ‚b‚o‚e‚r‚`‚h‚r‚k|”Û”F‹æ•ª PIC  X(001).
001460 01  ‚b‚o‚e‚r‚`‚h‚r‚k|[“–‘ŠŽE‹æ•ª PIC  X(001).
001470 01  ‚b‚o‚e‚r‚`‚h‚r‚k|ƒ_ƒ~[‚O‚O‚R PIC  X(075).
001480 01  ‚b‚o‚e‚r‚`‚h‚r‚k|‘Ý•tŽí—Þ PIC  X(001).
