000010************************************************
000020* (CPM_PRTTRN)
000030************************************************
000040 01  CPM_PRTTRN-CTLNUM PIC  X(006).
000050 01  CPM_PRTTRN-DEBCRE PIC  X(001).
000060 01  CPM_PRTTRN-TRNDAY PIC  X(008).
000070 01  CPM_PRTTRN-BORCAP PIC S9(013) COMP-3.
000080 01  CPM_PRTTRN-BALAMT PIC S9(013) COMP-3.
