      *****************************************************************
      *   ŽæˆøæŽc‚î•ñŽí—Þ•Êƒ}ƒXƒ^(D016TZS_TBL)
      *****************************************************************
       01  ŽæˆøæŽc‚î•ñŽí—Þ•Êƒ}ƒXƒ^.
           03  ‚c‚O‚P‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚U|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚P‚U|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚O‚P‚U|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚U|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚P‚U|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚P‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚P‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
