      *****************************************************************
      *   ŽæˆøæŽc‚î•ñ—š—ðƒ}ƒXƒ^(D017TZJ_TBL)
      *****************************************************************
       01  ŽæˆøæŽc‚î•ñ—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚P‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚V|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚P‚V|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚V|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|•ÛØŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|–¢ÁžŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚P‚V|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚P‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚P‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
