      *****************************************************************
      *   à–±•ªÍ˜AŒgƒ}ƒXƒ^(D019TZR_TBL)
      *****************************************************************
       01  à–±•ªÍ˜AŒgƒ}ƒXƒ^.
           03  ‚c‚O‚P‚X|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚P‚X|ŒˆŽZ”NŒŽ    PIC  X(006).
           03  ‚c‚O‚P‚X|‰È–Ú”Ô†    PIC  X(004).
           03  ‚c‚O‚P‚X|‹àŠzˆÊŽæ‚è‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚P‚X|‹àŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚P‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚P‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚P‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚P‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚P‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
