      *****************************************************************
      *   Œ_–ñæŽc‚î•ñŽí—Þ•Êƒ}ƒXƒ^(D023KZS_TBL)
      *****************************************************************
       01  Œ_–ñæŽc‚î•ñŽí—Þ•Êƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚R|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚Q‚R|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚Q‚R|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚O‚Q‚R|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚R|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚R|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
