      *****************************************************************
      *   Œ_–ñæŽc‚î•ñ—š—ðƒ}ƒXƒ^(D024KZJ_TBL)
      *****************************************************************
       01  Œ_–ñæŽc‚î•ñ—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚S|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚S|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚Q‚S|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚Q‚S|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚S|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚S|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
