      *****************************************************************
      *   Œ_–ñæŽc‚î•ñŽí—Þ•Ê—š—ðƒ}ƒXƒ^(D025KZR_TBL)
      *****************************************************************
       01  Œ_–ñæŽc‚î•ñŽí—Þ•Ê—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚Q‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚T|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚Q‚T|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚Q‚T|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚O‚Q‚T|ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚Q‚T|Œ_–ñ”      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|ÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|–ñ’èÂŒ Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|–ñ’èÂŒ Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|—^MŽc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|—^MŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|–¢’¥Žû‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|‘OŽó‹àŽc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|‘OŽó‹àŽc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|–ñ’èŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|ŒˆÙÏŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|Œ_–ñÏ–¢ŒŸŽûŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|¬–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|‘e—˜‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|ÂŒ ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚Q‚T|M—p•ÛŒ¯Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚Q‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚Q‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚Q‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚Q‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚Q‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
