      *****************************************************************
      *   ¤•iƒ}ƒXƒ^(D031FKM_TBL)
      *****************************************************************
       01  ¤•iƒ}ƒXƒ^.
           03  ‚c‚O‚R‚P|•¨Œ‹æ•ª    PIC  X(002).
           03  ‚c‚O‚R‚P|Ží—Þ‹æ•ª    PIC  X(002).
           03  ‚c‚O‚R‚P|ƒ[ƒJ[‹æ•ª
                                     PIC  X(003).
           03  ‚c‚O‚R‚P|•¨Œ‹æ•ª–¼  PIC  X(060).
           03  ‚c‚O‚R‚P|Ží—Þ‹æ•ª–¼  PIC  X(060).
           03  ‚c‚O‚R‚P|ƒ[ƒJ[–¼  PIC  X(060).
           03  ‚c‚O‚R‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚R‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚R‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚R‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚R‚P|“o˜^’S“–ŽÒ  PIC  X(008).
