      *****************************************************************
      *   Žx•¥æÂ–±Žc‚î•ñƒ}ƒXƒ^(D035SSZ_TBL)
      *****************************************************************
       01  Žx•¥æÂ–±Žc‚î•ñƒ}ƒXƒ^.
           03  ‚c‚O‚R‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚R‚T|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚R‚T|•”“XƒR[ƒh  PIC  X(008).
           03  ‚c‚O‚R‚T|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚O‚R‚T|Â–±Žc‚‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚R‚T|Â–±ŽcŒ”  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚R‚T|Â–±Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚R‚T|Â–±Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚R‚T|Â–±–¢•¥Œ”
                                     PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚O‚R‚T|Â–±–¢•¥Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚R‚T|Â–±–¢•¥Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚O‚R‚T|Â–±ŽcŠm’è”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚R‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚R‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚R‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚R‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚R‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚R‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
