      *****************************************************************
      *   Žx•¥æƒ}ƒXƒ^(D03SHS_TBL)
      *****************************************************************
       01  Žx•¥æƒ}ƒXƒ^.
           03  ‚c‚O‚R|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚O‚R|Žx•¥æƒR[ƒh  PIC  X(005).
           03  ‚c‚O‚R|Žx•¥æ–¼Ì    PIC  X(080).
           03  ‚c‚O‚R|Žx•¥æ’Z–¼Ì  PIC  X(016).
           03  ‚c‚O‚R|•”–å–¼Ì      PIC  X(060).
           03  ‚c‚O‚R|—X•Ö”Ô†      PIC  X(007).
           03  ‚c‚O‚R|”[•tæƒR[ƒh  PIC  X(011).
           03  ‚c‚O‚R|ZŠ‚Q        PIC  X(060).
           03  ‚c‚O‚R|ZŠ‚R        PIC  X(060).
           03  ‚c‚O‚R|“d˜b”Ô†      PIC  X(015).
           03  ‚c‚O‚R|Žx•¥“ú        PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚R|Žx•¥•û–@      PIC  X(001).
           03  ‚c‚O‚R|‹âsƒR[ƒh    PIC  X(004).
           03  ‚c‚O‚R|Žx“XƒR[ƒh    PIC  X(003).
           03  ‚c‚O‚R|ŒûÀŽí—Þ      PIC  X(001).
           03  ‚c‚O‚R|ŒûÀ”Ô†      PIC  X(010).
           03  ‚c‚O‚R|–¼‹`l        PIC  X(030).
           03  ‚c‚O‚R|–{“XƒR[ƒh    PIC  X(003).
           03  ‚c‚O‚R|ˆêŠ‡Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚R|XV“úŽž      PIC  X(016).
           03  ‚c‚O‚R|XVŽÒ        PIC  X(008).
           03  ‚c‚O‚R|Žè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚R|•”–åƒJƒi–¼Ì  PIC  X(030).
           03  ‚c‚O‚R|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚R|‘ŠŽEƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚O‚R|ƒRƒƒ“ƒg—“    PIC  X(060).
           03  ‚c‚O‚R|‘O‰ñŽx•¥ƒTƒCƒg
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚R|‘O‰ñXV”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚R|‘OX‰ñŽx•¥ƒTƒCƒg
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚R|‘OX‰ñXV”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚R|‘OXX‰ñŽx•¥ƒTƒCƒg
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚R|‘OXX‰ñXV”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚R|•”‰ÛƒR[ƒh    PIC  X(004).
           03  ‚c‚O‚R|’S“–ŽÒƒR[ƒh  PIC  X(008).
           03  ‚c‚O‚R|’n‹æƒuƒƒbƒN  PIC  X(001).
           03  ‚c‚O‚R|•ÛŽç—¿Ž©“®³”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚R|ƒCƒ“ƒ^[ƒKƒCƒhŽ©“®³”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚R|’S“–ŽÒ–¼Ì    PIC  X(020).
           03  ‚c‚O‚R|ZŠ‚P        PIC  X(060).
           03  ‚c‚O‚R|ZŠƒJƒi–¼Ì  PIC  X(060).
           03  ‚c‚O‚R|‚e‚`‚w”Ô†    PIC  X(015).
           03  ‚c‚O‚R|‹x“ú‘Î‰ž‹æ•ª  PIC  X(001).
           03  ‚c‚O‚R|¿‹‘‰ñŽûŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚R|“ü‹àŠm”F‹æ•ª  PIC  X(001).
           03  ‚c‚O‚R|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚R|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚R|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚O‚R|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚R|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚R|‹Œw“üæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚R|Žd“üÁ”ïÅ–ÆÅ‹æ•ª
                                     PIC S9(001) PACKED-DECIMAL.
