      *****************************************************************
      *   Žæˆøæƒƒ‚ƒ}ƒXƒ^(D046TMN_TBL)
      *****************************************************************
       01  Žæˆøæƒƒ‚ƒ}ƒXƒ^.
           03  ‚c‚O‚S‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚S‚U|ƒƒ‚‹æ•ª    PIC  X(002).
           03  ‚c‚O‚S‚U|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚S‚U|ƒƒ‚“o˜^“ú  PIC  X(008).
           03  ‚c‚O‚S‚U|ƒƒ‚“o˜^ŽÒ  PIC  X(008).
           03  ‚c‚O‚S‚U|ƒƒ‚“à—e    PIC  X(120).
           03  ‚c‚O‚S‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚S‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚S‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚U|“o˜^’S“–ŽÒ  PIC  X(008).
