      *****************************************************************
      *   ”zMó‹µŠÇ—ƒe[ƒuƒ‹(D048PHJ_TBL)
      *****************************************************************
       01  ”zMó‹µŠÇ—ƒe[ƒuƒ‹.
           03  ‚c‚O‚S‚W|’ •[‚h‚c    PIC  X(008).
           03  ‚c‚O‚S‚W|‹æ•ª        PIC  X(001).
           03  ‚c‚O‚S‚W|•”“XƒR[ƒh  PIC  X(004).
           03  ‚c‚O‚S‚W|o—Íó‹µ    PIC  X(001).
           03  ‚c‚O‚S‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚S‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚S‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
