      *****************************************************************
      *   ’ •[–¼Ìƒ}ƒXƒ^(D049PNM_TBL)
      *****************************************************************
       01  ’ •[–¼Ìƒ}ƒXƒ^.
           03  ‚c‚O‚S‚X|’ •[‚h‚c    PIC  X(008).
           03  ‚c‚O‚S‚X|‹æ•ª        PIC  X(001).
           03  ‚c‚O‚S‚X|ƒvƒƒOƒ‰ƒ€‚h‚c
                                     PIC  X(008).
           03  ‚c‚O‚S‚X|ƒtƒH[ƒ€‚h‚c
                                     PIC  X(020).
           03  ‚c‚O‚S‚X|’ •[–¼Ì    PIC  X(080).
           03  ‚c‚O‚S‚X|–¢ˆóüíœŠúŒÀ
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚O‚S‚X|ˆóüÏíœŠúŒÀ
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚O‚S‚X|Žæ‚è‚Ü‚Æ‚ß•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚S‚X|ˆ—‹æ•ª    PIC  X(003).
           03  ‚c‚O‚S‚X|ÝŒv—pŽ†ƒTƒCƒY
                                     PIC  X(002).
           03  ‚c‚O‚S‚X|ˆóü—pŽ†ƒTƒCƒY
                                     PIC  X(002).
           03  ‚c‚O‚S‚X|—pŽ†•ûŒü    PIC  X(001).
           03  ‚c‚O‚S‚X|ÝŒvs”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚S‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚S‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚S‚X|ƒvƒŠƒ“ƒ^Ž¯•ÊƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚O‚S‚X|‚i‚n‚aƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚S‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚S‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚S‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚S‚X|o—ÍŒ`‘Ô    PIC  X(001).
           03  ‚c‚O‚S‚X|—pŽ†‹æ•ª    PIC  X(001).
           03  ‚c‚O‚S‚X|ƒe[ƒuƒ‹–¼  PIC  X(016).
