      *****************************************************************
      *   ”[•tæƒ}ƒXƒ^(D04NOF_TBL)
      *****************************************************************
       01  ”[•tæƒ}ƒXƒ^.
           03  ‚c‚O‚S|”[•tæƒR[ƒh  PIC  X(006).
           03  ‚c‚O‚S|”[•tæ–¼Ì    PIC  X(040).
           03  ‚c‚O‚S|—X•Ö”Ô†      PIC  X(007).
           03  ‚c‚O‚S|ZŠ‚P        PIC  X(040).
           03  ‚c‚O‚S|ZŠ‚Q        PIC  X(060).
           03  ‚c‚O‚S|ZŠ‚R        PIC  X(060).
           03  ‚c‚O‚S|“d˜b”Ô†      PIC  X(015).
           03  ‚c‚O‚S|\®—”Ô†  PIC  X(020).
           03  ‚c‚O‚S|XV“úŽž      PIC  X(016).
           03  ‚c‚O‚S|XVŽÒ        PIC  X(008).
           03  ‚c‚O‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚S|”[•tæ–¼ÌƒJƒi
                                     PIC  X(040).
           03  ‚c‚O‚S|ZŠƒJƒi‚P    PIC  X(040).
           03  ‚c‚O‚S|ZŠƒJƒi‚Q    PIC  X(060).
           03  ‚c‚O‚S|ZŠƒJƒi‚R    PIC  X(060).
           03  ‚c‚O‚S|ŒÅ’èŽ‘ŽYÅ—¦  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚O‚S|W–ñ\æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚S|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚S|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚S|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚O‚S|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚S|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚S|”[•t‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚O‚S|Ž©“®ˆø—Ž‹æ•ª  PIC  X(001).
