      *****************************************************************
      *   •¶Œ¾ƒ}ƒXƒ^(D050MNG_TBL)
      *****************************************************************
       01  •¶Œ¾ƒ}ƒXƒ^.
           03  ‚c‚O‚T‚O|•¶Œ¾ƒOƒ‹[ƒvƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚T‚O|•¶Œ¾”Ô†    PIC  X(003).
           03  ‚c‚O‚T‚O|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚T‚O|•¶Œ¾        PIC  X(120).
           03  ‚c‚O‚T‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚T‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚T‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚O|“o˜^’S“–ŽÒ  PIC  X(008).
