      *****************************************************************
      *   ‹@ŽíƒR[ƒhƒ}ƒXƒ^(D056KSM_TBL)
      *****************************************************************
       01  ‹@ŽíƒR[ƒhƒ}ƒXƒ^.
           03  ‚c‚O‚T‚U|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚O‚T‚U|“K—p”NŒŽ    PIC  X(006).
           03  ‚c‚O‚T‚U|‹@ŠB—ÞƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚T‚U|‹@Ží–¼”Ô†  PIC  X(002).
           03  ‚c‚O‚T‚U|‹@Ží–¼      PIC  X(060).
           03  ‚c‚O‚T‚U|‹@Ží–¼ƒJƒi  PIC  X(010).
           03  ‚c‚O‚T‚U|•t•Û‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚T‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚T‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚T‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚T‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚T‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
