      *****************************************************************
      *   ŽóŽæŒûÀƒ}ƒXƒ^(D05GKO_TBL)
      *****************************************************************
       01  ŽóŽæŒûÀƒ}ƒXƒ^.
           03  ‚c‚O‚T|‹âs’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚T|‹âsƒR[ƒh    PIC  X(004).
           03  ‚c‚O‚T|Žx“XƒR[ƒh    PIC  X(003).
           03  ‚c‚O‚T|—a‹àŽí—Þ      PIC  X(001).
           03  ‚c‚O‚T|ŒûÀ”Ô†      PIC  X(010).
           03  ‚c‚O‚T|‹âs–¼        PIC  X(040).
           03  ‚c‚O‚T|Žx“X–¼        PIC  X(040).
           03  ‚c‚O‚T|–¼‹`l        PIC  X(030).
           03  ‚c‚O‚T|XV“úŽž      PIC  X(016).
           03  ‚c‚O‚T|XVŽÒ        PIC  X(008).
           03  ‚c‚O‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚T|•”‰ÛƒR[ƒh    PIC  X(004).
           03  ‚c‚O‚T|‹âs˜A”Ô      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚T|¿‹‹æ•ªŽ¯•Ê  PIC  X(001).
           03  ‚c‚O‚T|“K—p”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚T|‹âsŽx“X–¼    PIC  X(040).
           03  ‚c‚O‚T|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚T|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚T|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚O‚T|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚T|XVŽžŠÔ      PIC  X(008).
