      *****************************************************************
      *   GLOVIA—˜—pŽÒƒ}ƒXƒ^(D063GLT_TBL)
      *****************************************************************
       01  ‚f‚k‚n‚u‚h‚`—˜—pŽÒƒ}ƒXƒ^.
           03  ‚c‚O‚U‚R|ƒ†[ƒU‚h‚c  PIC  X(010).
           03  ‚c‚O‚U‚R|‰ïŽÐƒR[ƒh  PIC  X(002).
           03  ‚c‚O‚U‚R|ŽÐˆõƒR[ƒh  PIC  X(008).
           03  ‚c‚O‚U‚R|ƒpƒXƒ[ƒh  PIC  X(010).
           03  ‚c‚O‚U‚R|ƒpƒXƒ[ƒh—LŒøŠúŠÔ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚O‚U‚R|ƒf[ƒ^ƒx[ƒX—˜—pŽÒ–¼
                                     PIC  X(010).
           03  ‚c‚O‚U‚R|ƒf[ƒ^ƒx[ƒXƒpƒXƒ[ƒh
                                     PIC  X(010).
           03  ‚c‚O‚U‚R|‚k‚h‚r‚s‚v‚n‚q‚j˜AŒg—p—˜—pŽÒ–¼
                                     PIC  X(010).
           03  ‚c‚O‚U‚R|‚k‚h‚r‚s‚v‚n‚q‚j˜AŒg—pƒpƒXƒ[ƒh
                                     PIC  X(010).
           03  ‚c‚O‚U‚R|ƒ†[ƒUŠJ•úˆæ
                                     PIC  X(064).
           03  ‚c‚O‚U‚R|ƒVƒXƒeƒ€ƒŠƒU[ƒu
                                     PIC  X(064).
           03  ‚c‚O‚U‚R|—˜—pŽÒ‹æ•ª  PIC  X(002).
           03  ‚c‚O‚U‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚U‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚R|XVŽÒ      PIC  X(008).
