      *****************************************************************
      *   Œ ŒÀƒ}ƒXƒ^(D065KNG_TBL)
      *****************************************************************
       01  Œ ŒÀƒ}ƒXƒ^.
           03  ‚c‚O‚U‚T|Œ ŒÀƒŒƒxƒ‹  PIC  X(003).
           03  ‚c‚O‚U‚T|ƒƒjƒ…[ƒ{ƒ^ƒ“‚h‚c
                                     PIC  X(008).
           03  ‚c‚O‚U‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚U‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚U‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚U‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚U‚T|XVŽÒ      PIC  X(008).
