      *****************************************************************
      *   w“üæƒR[ƒh•ÏŠ·ƒ}ƒXƒ^(D071KHN_TBL)
      *****************************************************************
       01  w“üæƒR[ƒh•ÏŠ·ƒ}ƒXƒ^.
           03  ‚c‚O‚V‚P|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚O‚V‚P|æ•ûw“üæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚V‚P|ŽæˆøæƒR[ƒh|w“üæ
                                     PIC  X(009).
           03  ‚c‚O‚V‚P|Žx•¥æƒR[ƒh|w“üæ
                                     PIC  X(005).
           03  ‚c‚O‚V‚P|ŽæˆøæƒR[ƒh|Žx•¥æ
                                     PIC  X(009).
           03  ‚c‚O‚V‚P|Žx•¥æƒR[ƒh|Žx•¥æ
                                     PIC  X(005).
           03  ‚c‚O‚V‚P|ƒrƒ‹ƒoƒŠ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚V‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚V‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚V‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
