      *****************************************************************
      *   ƒVƒƒ[ƒvŽx“XƒR[ƒhƒ}ƒXƒ^(D073SHS_TBL)
      *****************************************************************
       01  ƒVƒƒ[ƒvŽx“XƒR[ƒhƒ}ƒXƒ^.
           03  ‚c‚O‚V‚R|•ïŠ‡ƒGƒŠƒAƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚O‚V‚R|ƒGƒŠƒAƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚V‚R|ƒVƒƒ[ƒvŽx“XƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚O‚V‚R|“K—p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚V‚R|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚V‚R|Žx“X–¼      PIC  X(060).
           03  ‚c‚O‚V‚R|Žx“X–¼ƒJƒi  PIC  X(020).
           03  ‚c‚O‚V‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚V‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚V‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
