      *****************************************************************
      *   “Œ‹žŽO•H‹âsŽåŠÇ•”“Xƒ}ƒXƒ^(D078TMS_TBL)
      *****************************************************************
       01  “Œ‹žŽO•H‹âsŽåŠÇ•”“Xƒ}ƒXƒ^.
           03  ‚c‚O‚V‚W|ŽåŠÇ•”ƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚O‚V‚W|ŽåŠÇ•”–¼    PIC  X(062).
           03  ‚c‚O‚V‚W|ŽåŠÇ•”–¼ƒJƒi
                                     PIC  X(030).
           03  ‚c‚O‚V‚W|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚V‚W|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚V‚W|“ü‹à“ú      PIC  X(002).
           03  ‚c‚O‚V‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚V‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚V‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚V‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚V‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
