      *****************************************************************
      *   ’S“–ŽÒƒ}ƒXƒ^(D07TNT_TBL)
      *****************************************************************
       01  ’S“–ŽÒƒ}ƒXƒ^.
           03  ‚c‚O‚V|’S“–ŽÒƒR[ƒh  PIC  X(008).
           03  ‚c‚O‚V|’S“–ŽÒ–¼Ì    PIC  X(020).
           03  ‚c‚O‚V|ÅVŒ©Ï”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚V|•”‰ÛƒR[ƒh‚P  PIC  X(004).
           03  ‚c‚O‚V|•”‰ÛƒR[ƒh‚Q  PIC  X(004).
           03  ‚c‚O‚V|’S“–ŽÒ•\Ž¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚O‚V|ƒ‰ƒ“ƒN        PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚V|ƒpƒXƒ[ƒh    PIC  X(015).
           03  ‚c‚O‚V|XV“úŽž      PIC  X(016).
           03  ‚c‚O‚V|XVŽÒ        PIC  X(008).
           03  ‚c‚O‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚V|’S“–ŽÒƒJƒi    PIC  X(030).
           03  ‚c‚O‚V|’S“–ŽÒƒ‰ƒ“ƒN‚P
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚V|’S“–ŽÒƒ‰ƒ“ƒN‚Q
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚V|ƒpƒXƒ[ƒh—LŒøŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚O‚V|‘ãs“ü—ÍŽÒƒR[ƒh‚P
                                     PIC  X(008).
           03  ‚c‚O‚V|‘ãs“ü—ÍŽÒƒR[ƒh‚Q
                                     PIC  X(008).
           03  ‚c‚O‚V|‘ãs“ü—ÍŽÒƒR[ƒh‚R
                                     PIC  X(008).
           03  ‚c‚O‚V|ŒÂl”Ô†      PIC  X(007).
           03  ‚c‚O‚V|˜A“®—pƒpƒXƒ[ƒh
                                     PIC  X(015).
           03  ‚c‚O‚V|’S“–ŽÒ—˜—pŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚O‚V|’S“–ŽÒ—˜—pI—¹“ú
                                     PIC  X(008).
           03  ‚c‚O‚V|Œ ŒÀƒŒƒxƒ‹‚P  PIC  X(003).
           03  ‚c‚O‚V|Œ ŒÀƒŒƒxƒ‹‚Q  PIC  X(003).
           03  ‚c‚O‚V|Œ ŒÀƒŒƒxƒ‹‚R  PIC  X(003).
           03  ‚c‚O‚V|Œ ŒÀƒŒƒxƒ‹‚S  PIC  X(003).
           03  ‚c‚O‚V|Œ ŒÀƒŒƒxƒ‹‚T  PIC  X(003).
           03  ‚c‚O‚V|•”‰ÛƒR[ƒh‚R  PIC  X(004).
           03  ‚c‚O‚V|•”‰ÛƒR[ƒh‚S  PIC  X(004).
           03  ‚c‚O‚V|•”‰ÛƒR[ƒh‚T  PIC  X(004).
           03  ‚c‚O‚V|•”‰ÛƒR[ƒh‚U  PIC  X(004).
           03  ‚c‚O‚V|Šé‹Æî•ñŒ ŒÀƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚O‚V|‚f‚k‚n‚u‚h‚`˜A“®ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚O‚V|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚V|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚O‚V|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚O‚V|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚V|XVŽžŠÔ      PIC  X(008).
