      *****************************************************************
      *   “Œ‹žŽO•H‹âs•”Žº“Xƒ}ƒXƒ^(D080TMB_TBL)
      *****************************************************************
       01  “Œ‹žŽO•H‹âs•”Žº“Xƒ}ƒXƒ^.
           03  ‚c‚O‚W‚O|•”Žº“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚O‚W‚O|•”Žº“X–¼    PIC  X(030).
           03  ‚c‚O‚W‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
