      *****************************************************************
      *   “ú–{“ÁŽê“©‹Æ•”ƒ}ƒXƒ^(D081NTG_TBL)
      *****************************************************************
       01  “ú–{“ÁŽê“©‹Æ•”ƒ}ƒXƒ^.
           03  ‚c‚O‚W‚P|“o˜^”Ô†    PIC  X(004).
           03  ‚c‚O‚W‚P|æ•ûŽQÆ”Ô†
                                     PIC  X(010).
           03  ‚c‚O‚W‚P|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚W‚P|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚W‚P|•”–å–¼Ì‚P  PIC  X(040).
           03  ‚c‚O‚W‚P|•”–å–¼Ì‚Q  PIC  X(040).
           03  ‚c‚O‚W‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
