      *****************************************************************
      *   Œ_–ñæŒð—¬—š—ðƒ}ƒXƒ^(D087KYK_TBL)
      *****************************************************************
       01  Œ_–ñæŒð—¬—š—ðƒ}ƒXƒ^.
           03  ‚c‚O‚W‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚W‚V|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚W‚V|—š—ð‹æ•ª    PIC  X(002).
           03  ‚c‚O‚W‚V|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚W‚V|“à—e“o˜^“ú  PIC  X(008).
           03  ‚c‚O‚W‚V|“à—e“o˜^ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚V|“à—e•¶Œ¾    PIC  X(120).
           03  ‚c‚O‚W‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚W‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚W‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚W‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚W‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
