      *****************************************************************
      *   ÷“nl•ÊŒ´Â–±ŽÒƒ}ƒXƒ^(D093JYS_TBL)
      *****************************************************************
       01  ÷“nl•ÊŒ´Â–±ŽÒƒ}ƒXƒ^.
           03  ‚c‚O‚X‚R|÷“nlŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚X‚R|÷“nlŒ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚X‚R|Œ´Â–±ŽÒŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚O‚X‚R|Œ´Â–±ŽÒŒ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚X‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚X‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚R|“o˜^’S“–ŽÒ  PIC  X(008).
