      *****************************************************************
      *   ’ZŠúŽÐ“à‹à—˜ƒ}ƒXƒ^(D095TSK_TBL)
      *****************************************************************
       01  ’ZŠúŽÐ“à‹à—˜ƒ}ƒXƒ^.
           03  ‚c‚O‚X‚T|‹à—˜‹æ•ª    PIC  X(002).
           03  ‚c‚O‚X‚T|“K—pŠJŽn“ú  PIC  X(008).
           03  ‚c‚O‚X‚T|I—¹“ú      PIC  X(008).
           03  ‚c‚O‚X‚T|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚O‚X‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚O‚X‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
