      *****************************************************************
      *   ’é‘ƒf[ƒ^ƒ}ƒXƒ^(D097TKD_TBL)
      *****************************************************************
       01  ’é‘ƒf[ƒ^ƒ}ƒXƒ^.
           03  ‚c‚O‚X‚V|Šé‹ÆƒR[ƒh  PIC S9(009) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|–@lŠiƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŒŸõ—pƒJƒi¤†
                                     PIC  X(020).
           03  ‚c‚O‚X‚V|ŒŸõ—pŠ¿Žš¤†
                                     PIC  X(020).
           03  ‚c‚O‚X‚V|Š¿Žš¤†    PIC  X(060).
           03  ‚c‚O‚X‚V|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚O‚X‚V|Šé‹ÆŠÝ’nƒo[ƒR[ƒh”Ô†
                                     PIC  X(023).
           03  ‚c‚O‚X‚V|’é‘ZŠƒR[ƒh
                                     PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Š¿ŽšŠÝ’n  PIC  X(100).
           03  ‚c‚O‚X‚V|Šé‹Æ“d˜b”Ô†
                                     PIC  X(013).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—ÞƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—ÞƒR[ƒh‚Q
                                     PIC  X(005).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—ÞƒR[ƒh‚R
                                     PIC  X(005).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—ÞƒR[ƒh‚S
                                     PIC  X(005).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—ÞƒR[ƒh‚T
                                     PIC  X(005).
           03  ‚c‚O‚X‚V|Ž‘–{‹à      PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|]‹Æˆõ”    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|‘n‹Æ        PIC  X(006).
           03  ‚c‚O‚X‚V|Ý—§        PIC  X(006).
           03  ‚c‚O‚X‚V|•]“_        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|’²¸”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚V|‚b‚n‚r‚l‚n‚r‚QXV”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|Ž–‹ÆŠƒtƒ@ƒCƒ‹Žû˜^ƒtƒ‰ƒO
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Ž–‹ÆŠ”    PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŒˆŽZŠú      PIC  X(006).
           03  ‚c‚O‚X‚V|”„ã‚      PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|—˜‰v–•Áƒtƒ‰ƒO
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ÅˆøŒã—˜‰v  PIC S9(012) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|”z“–—¦      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Ž©ŒÈŽ‘–{”ä—¦
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŒˆŽZ‘—L–³ƒtƒ‰ƒO
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|–@l\Š“¾Šz
                                     PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŒˆŽZŠú‘OŠú  PIC  X(006).
           03  ‚c‚O‚X‚V|”„ã‚‘OŠú  PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|—˜‰v–•Áƒtƒ‰ƒO‘OŠú
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ÅˆøŒã—˜‰v‘OŠú
                                     PIC S9(012) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|”z“–—¦‘OŠú  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Ž©ŒÈŽ‘–{”ä—¦‘OŠú
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŒˆŽZ‘—L–³ƒtƒ‰ƒO‘OŠú
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|–@l\Š“¾Šz‘OŠú
                                     PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŒˆŽZŠú‘OXŠú
                                     PIC  X(006).
           03  ‚c‚O‚X‚V|”„ã‚‘OXŠú
                                     PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|—˜‰v–•Áƒtƒ‰ƒO‘OXŠú
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ÅˆøŒã—˜‰v‘OXŠú
                                     PIC S9(012) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|”z“–—¦‘OXŠú
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Ž©ŒÈŽ‘–{”ä—¦‘OXŠú
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŒˆŽZ‘—L–³ƒtƒ‰ƒO‘OXŠú
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|–@l\Š“¾Šz‘OXŠú
                                     PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ÅV–@l\ŒˆŽZ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚O‚X‚V|ÅV–@l\Š“¾Šz
                                     PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|‘S‘ŽÐ”    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|‘S‘ƒ‰ƒ“ƒLƒ“ƒO
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|“s“¹•{Œ§•ÊŽÐ”
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|“s“¹•{Œ§•Êƒ‰ƒ“ƒLƒ“ƒO
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|–ðE–¼      PIC  X(020).
           03  ‚c‚O‚X‚V|ƒJƒiŽ–¼    PIC  X(020).
           03  ‚c‚O‚X‚V|Š¿ŽšŽ–¼    PIC  X(040).
           03  ‚c‚O‚X‚V|Ž©‘î—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚O‚X‚V|Ž©‘îƒo[ƒR[ƒh”Ô†
                                     PIC  X(023).
           03  ‚c‚O‚X‚V|Ž©‘î’é‘ZŠƒR[ƒh
                                     PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Ž©‘îZŠ    PIC  X(100).
           03  ‚c‚O‚X‚V|Ž©‘î“d˜b”Ô†
                                     PIC  X(013).
           03  ‚c‚O‚X‚V|¶”NŒŽ“ú    PIC  X(008).
           03  ‚c‚O‚X‚V|ogŒ§ƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ogZƒR[ƒh
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|«•Êƒtƒ‰ƒO  PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚P
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚Q
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚R
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚S
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚T
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚U
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚V
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚W
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚X
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žæˆø‹âsƒR[ƒh‚P‚O
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Žå—vŽd“üæŠ¿ŽšŠé‹Æ–¼‚P
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—vŽd“üæŠ¿ŽšŠé‹Æ–¼‚Q
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—vŽd“üæŠ¿ŽšŠé‹Æ–¼‚R
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—vŽd“üæŠ¿ŽšŠé‹Æ–¼‚S
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—vŽd“üæŠ¿ŽšŠé‹Æ–¼‚T
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—v”Ì”„æŠ¿ŽšŠé‹Æ–¼‚P
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—v”Ì”„æŠ¿ŽšŠé‹Æ–¼‚Q
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—v”Ì”„æŠ¿ŽšŠé‹Æ–¼‚R
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—v”Ì”„æŠ¿ŽšŠé‹Æ–¼‚S
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|Žå—v”Ì”„æŠ¿ŽšŠé‹Æ–¼‚T
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|eŠé‹ÆŠ¿ŽšŠé‹Æ–¼
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|ŠOŽ‘Šé‹Æƒtƒ‰ƒO
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|o”Å•¨ƒtƒ‰ƒO
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚P
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚Q
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚R
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚S
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚T
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚U
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚V
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚W
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚X
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõ–ðE–¼‚P‚O
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚P
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚Q
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚R
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚S
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚T
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚U
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚V
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚W
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚X
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|–ðˆõŠ¿ŽšŽ–¼‚P‚O
                                     PIC  X(016).
           03  ‚c‚O‚X‚V|Š”Ž®ŒöŠJƒtƒ‰ƒO
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Šz–ÊŠ”‰¿ƒtƒ‰ƒO
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ØŒ”ŒÅ—L–¼ƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚O‚X‚V|Š”Žå”      PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|Š”Žå–¼‚P    PIC  X(030).
           03  ‚c‚O‚X‚V|Š”Žå–¼‚Q    PIC  X(030).
           03  ‚c‚O‚X‚V|Š”Žå–¼‚R    PIC  X(030).
           03  ‚c‚O‚X‚V|Š”Žå–¼‚S    PIC  X(030).
           03  ‚c‚O‚X‚V|Š”Žå–¼‚T    PIC  X(030).
           03  ‚c‚O‚X‚V|ŽŠ””‚P    PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŽŠ””‚Q    PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŽŠ””‚R    PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŽŠ””‚S    PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|ŽŠ””‚T    PIC S9(011) PACKED-DECIMAL.
           03  ‚c‚O‚X‚V|–Ú“I        PIC  X(100).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—Þ–¼Ì‚P
                                     PIC  X(018).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—Þ–¼Ì‚Q
                                     PIC  X(018).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—Þ–¼Ì‚R
                                     PIC  X(018).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—Þ–¼Ì‚S
                                     PIC  X(018).
           03  ‚c‚O‚X‚V|’é‘ŽY‹Æ•ª—Þ–¼Ì‚T
                                     PIC  X(018).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚P  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚Q  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚R  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚S  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚T  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚U  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚V  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚W  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚X  PIC  X(030).
           03  ‚c‚O‚X‚V|Žæˆø‹âs‚P‚O
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|‘ã•\ŽÒogŒ§
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|‘ã•\ŽÒogZ
                                     PIC  X(030).
           03  ‚c‚O‚X‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚O‚X‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚O‚X‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚O‚X‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚O‚X‚V|“o˜^’S“–ŽÒ  PIC  X(008).
