      *****************************************************************
      *   M‘õæƒ}ƒXƒ^(D133SNT_TBL)
      *****************************************************************
       01  M‘õæƒ}ƒXƒ^.
           03  ‚c‚P‚R‚R|M‘õæƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚P‚R‚R|M‘õæ–¼    PIC  X(080).
           03  ‚c‚P‚R‚R|M‘õæ–¼ƒJƒi
                                     PIC  X(040).
           03  ‚c‚P‚R‚R|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚P‚R‚R|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚P‚R‚R|ŒûÀŽí—Þ    PIC  X(001).
           03  ‚c‚P‚R‚R|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚P‚R‚R|–¼‹`l      PIC  X(030).
           03  ‚c‚P‚R‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚R‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚R‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚R‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚R‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚R‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚R‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
