      *****************************************************************
      *   •¼ŽíŠ·ŽZ‘Šêƒ}ƒXƒ^(D182KSB_TBL)
      *****************************************************************
       01  •¼ŽíŠ·ŽZ‘Šêƒ}ƒXƒ^.
           03  ‚c‚P‚W‚Q|•¼ŽíƒR[ƒh  PIC  X(003).
           03  ‚c‚P‚W‚Q|“K—p”NŒŽ    PIC  X(006).
           03  ‚c‚P‚W‚Q|ƒ†ƒjƒbƒg’PˆÊ
                                     PIC  X(001).
           03  ‚c‚P‚W‚Q|’Ê‰Ý¬”“_ˆÊ’u
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|ŒŽ––‚s‚s‚r  PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|ŒŽ––‚s‚s‚a  PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|ŒŽ––Š·ŽZ‘Šê
                                     PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|ŒŽ––Šî€“ú  PIC  X(008).
           03  ‚c‚P‚W‚Q|‘OŒŽ––‚s‚s‚r
                                     PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|‘OŒŽ––‚s‚s‚a
                                     PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|‘OŒŽ––Š·ŽZ‘Šê
                                     PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|‘OŒŽ––Šî€“ú
                                     PIC  X(008).
           03  ‚c‚P‚W‚Q|‘OŠú––‚s‚s‚r
                                     PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|‘OŠú––‚s‚s‚a
                                     PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|‘OŠú––Š·ŽZ‘Šê
                                     PIC S9(004)V9(006) PACKED-DECIMAL.
           03  ‚c‚P‚W‚Q|‘OŠú––Šî€“ú
                                     PIC  X(008).
           03  ‚c‚P‚W‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚P‚W‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚P‚W‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚P‚W‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚P‚W‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
