      *****************************************************************
      *   ˆø‡ˆÄŒ(D20HAN_TBL)
      *****************************************************************
       01  ˆø‡ˆÄŒ.
           03  ‚c‚Q‚O|ˆÄŒ”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚O|ˆÄŒ”Ô†Ž}”Ô  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚O|’S“–ŽÒƒR[ƒh  PIC  X(008).
           03  ‚c‚Q‚O|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚Q‚O|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚Q‚O|ŽåŒ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚Q‚O|ˆÄŒ–¼        PIC  X(040).
           03  ‚c‚Q‚O|ˆÄŒ”­¶“ú    PIC  X(008).
           03  ‚c‚Q‚O|ˆÄŒ”­¶——R‹æ•ª
                                     PIC  X(002).
           03  ‚c‚Q‚O|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚Q‚O|Œ_–ñæƒR[ƒh  PIC  X(005).
           03  ‚c‚Q‚O|¬–ñ—\’è“ú    PIC  X(008).
           03  ‚c‚Q‚O|Œ_–ñŠúŠÔ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚O|•¨Œw“ü‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚O|¬–ñ—\’èŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚O|—\’è‘e—˜      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚O|—D‹ö‹à—˜‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚O|ˆø‡ó‹µƒRƒƒ“ƒg
                                     PIC  X(120).
           03  ‚c‚Q‚O|Ð‰îæ‹æ•ª    PIC  X(001).
           03  ‚c‚Q‚O|Ð‰îæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚Q‚O|Ð‰îæŽ}”ÔƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚Q‚O|Ð‰îæ‚a‚s‚l–{Žx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚Q‚O|Ð‰îæ—»“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚Q‚O|Ð‰îæ‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚Q‚O|Ð‰îæŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚Q‚O|ˆø‡ó‘Ô‹æ•ª  PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚Q‚O|Šî€Šm“x‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚O|“ü—ÍŠm“x‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚O|ˆø‡’†Ž~‹æ•ª  PIC  X(001).
           03  ‚c‚Q‚O|ˆø‡’†Ž~“ú    PIC  X(008).
           03  ‚c‚Q‚O|ˆø‡’†Ž~——R‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚O|ˆø‡’†Ž~——RƒRƒƒ“ƒg
                                     PIC  X(160).
           03  ‚c‚Q‚O|‹£‡ŽÐ”      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚O|“–ŽÐ‡ˆÊ      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚O|‹£‡‘¼ŽÐ‚P    PIC  X(040).
           03  ‚c‚Q‚O|’ñŽ¦Šz‚P      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚O|—¿—¦‚P        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚O|Žó’ƒ`ƒFƒbƒN‚P
                                     PIC  X(001).
           03  ‚c‚Q‚O|‹£‡‘¼ŽÐ‚Q    PIC  X(040).
           03  ‚c‚Q‚O|’ñŽ¦Šz‚Q      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚O|—¿—¦‚Q        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚O|Žó’ƒ`ƒFƒbƒN‚Q
                                     PIC  X(001).
           03  ‚c‚Q‚O|‹£‡‘¼ŽÐ‚R    PIC  X(040).
           03  ‚c‚Q‚O|’ñŽ¦Šz‚R      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚O|—¿—¦‚R        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚O|Žó’ƒ`ƒFƒbƒN‚R
                                     PIC  X(001).
           03  ‚c‚Q‚O|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚O|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚O|XVŽÒ        PIC  X(008).
           03  ‚c‚Q‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚O|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚Q‚O|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚Q‚O|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚Q‚O|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
