      *****************************************************************
      *   Œ©Ï•Ï‘¥Žx•¥(D263MNS_TBL)
      *****************************************************************
       01  Œ©Ï•Ï‘¥Žx•¥.
           03  ‚c‚Q‚U‚R|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚R|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚Q‚U‚R|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚Q‚U‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚Q‚U‚R|ŠJŽn‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚R|ŠJŽn”NŒŽ    PIC  X(006).
           03  ‚c‚Q‚U‚R|I—¹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚R|I—¹”NŒŽ    PIC  X(006).
           03  ‚c‚Q‚U‚R|‹àŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚R|Á”ïÅ      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚U‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚U‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚Q‚U‚R|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
