      *****************************************************************
      *   Œ©Ï‹¦’²(D265MKC_TBL)
      *****************************************************************
       01  Œ©Ï‹¦’².
           03  ‚c‚Q‚U‚T|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚T|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚T|‹¦’²ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚Q‚U‚T|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚T|•¨Œ‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚T|•¨Œ‰ñŽû“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚T|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚T|‘¼ŽÐw“ü‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚U‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚U‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚U‚T|Ž•ª”ä—¦    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚U‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚U‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚U‚T|“o˜^’S“–ŽÒ  PIC  X(008).
