      *****************************************************************
      *   Œ©ÏÂŒ “WŠJ(D270MST_TBL)
      *****************************************************************
       01  Œ©ÏÂŒ “WŠJ.
           03  ‚c‚Q‚V‚O|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚O|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚O|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚Q‚V‚O|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚O|•¨Œ”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚O|Œ©Ï”Ô†|’S“–ŽÒ
                                     PIC  X(002).
           03  ‚c‚Q‚V‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚V‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚V‚O|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚O|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚O|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚O|“o˜^’S“–ŽÒ  PIC  X(008).
