      *****************************************************************
      *   Œ©ÏÂŒ (D271MSA_TBL)
      *****************************************************************
       01  Œ©ÏÂŒ .
           03  ‚c‚Q‚V‚P|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚Q‚V‚P|‰ñŽû‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|‰ñŽûƒTƒCƒg  PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|‰ñŽûƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|‰ñŽû“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|•Ï‘¥•¥—L–³  PIC  X(001).
           03  ‚c‚Q‚V‚P|‰ñŽû‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|‰ñŽû‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|‰ñŽû‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚Q‚V‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚V‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
