      *****************************************************************
      *   Œ©Ï”„Š|ÂŒ –¾×(D275MUS_TBL)
      *****************************************************************
       01  Œ©Ï”„Š|ÂŒ –¾×.
           03  ‚c‚Q‚V‚T|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|–¾×”Ô†    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚Q‚V‚T|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚Q‚V‚T|Šz–Ê‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|Šú“ú        PIC  X(008).
           03  ‚c‚Q‚V‚T|—˜‘§Šú“ú    PIC  X(008).
           03  ‚c‚Q‚V‚T|“ú”        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|Š„ˆø—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|Š„ˆø—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|Žæ—§Žè”—¿“™
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|Žæ—§Žè”—¿“™Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|”ƒŽæ‘ã‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|ŽÐ“à‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚Q‚V‚T|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|ŽÀŽ¿”N—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|‘e—˜        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|ŽÐ“à‹à—˜|ˆê”Ê
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|‘e—˜|ˆê”Ê  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚Q‚V‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚Q‚V‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚Q‚V‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚Q‚V‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚Q‚V‚T|“o˜^’S“–ŽÒ  PIC  X(008).
