      *****************************************************************
      *   Œ_–ñ”Ô†ƒe[ƒuƒ‹(D315KNO_TBL)
      *****************************************************************
       01  Œ_–ñ”Ô†ƒe[ƒuƒ‹.
           03  ‚c‚R‚P‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚P‚T|ÅVÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚T|ÅI•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚P‚T|¿‹‰ñŽûðŒ•ÏXƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P‚T|Œ‡—Ž¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚P‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚P‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚P‚T|”N†        PIC  X(002).
           03  ‚c‚R‚P‚T|•¨Œˆ•ª\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚T|—\–ñ’†ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚T|‘O‰ñÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚T|ˆË—Š”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚P‚T|ÅIŽ}”Ô    PIC  X(002).
           03  ‚c‚R‚P‚T|•ïŠ‡\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚P‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚P‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚P‚T|“o˜^’S“–ŽÒ  PIC  X(008).
