      *****************************************************************
      *   Œ_–ñ‰c‹ÆˆÓŒ©ƒe[ƒuƒ‹(D329KIN_TBL)
      *****************************************************************
       01  Œ_–ñ‰c‹ÆˆÓŒ©ƒe[ƒuƒ‹.
           03  ‚c‚R‚Q‚X|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚Q‚X|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002)V9(00‚O) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚X|ŒˆÙŽí—Þ    PIC  X(001).
           03  ‚c‚R‚Q‚X|\¿˜A”Ô    PIC S9(002)V9(00‚O) PACKED-DECIMAL.
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚P
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚Q
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚R
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚S
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚T
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚U
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚V
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚W
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚X
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|‰c‹ÆˆÓŒ©—“‚P‚O
                                     PIC  X(060).
           03  ‚c‚R‚Q‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚Q‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚Q‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚Q‚X|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚Q‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
