      *****************************************************************
      *   ŽÔ—¼•¨Œ(D333SRB_TBL)
      *****************************************************************
       01  ŽÔ—¼•¨Œ.
           03  ‚c‚R‚R‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚R‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚R‚R|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|“o˜^”Ô†    PIC  X(020).
           03  ‚c‚R‚R‚R|ŽÔŒŸ–ž—¹“ú  PIC  X(008).
           03  ‚c‚R‚R‚R|Ý’èŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|Ž©“®ŽÔÅ•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚R‚R|Ž©“®ŽÔÅŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|Ž©”…Ó•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚R‚R|Ž©”…Ó‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|d—ÊÅ•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚R‚R|d—ÊÅŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|”CˆÓ•ÛŒ¯•‰’SƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚R‚R|”CˆÓ•ÛŒ¯‘ã—“XƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚R‚R|”CˆÓ•ÛŒ¯•t•ÛæƒR[ƒh
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|”CˆÓ•ÛŒ¯–ž—¹“ú
                                     PIC  X(008).
           03  ‚c‚R‚R‚R|ƒƒ“ƒeƒiƒ“ƒXŒ_–ñæ
                                     PIC  X(009).
           03  ‚c‚R‚R‚R|ŒŽŠzƒƒ“ƒeƒiƒ“ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|‘–s‹——£    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|ƒ^ƒCƒ„–{”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚R|ƒRƒƒ“ƒg    PIC  X(040).
           03  ‚c‚R‚R‚R|”õl‚P      PIC  X(040).
           03  ‚c‚R‚R‚R|”õl‚Q      PIC  X(040).
           03  ‚c‚R‚R‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚R‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚R‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚R‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚R‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
