      *****************************************************************
      *   ’S•ÛŽó•t(D336TPU_TBL)
      *****************************************************************
       01  ’S•ÛŽó•t.
           03  ‚c‚R‚R‚U|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚R‚U|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚U|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚R‚U|’S•ÛŽó•tì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R‚U|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚U|ðŒŽwŽ¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚R‚U|ðŒŽwŽ¦”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚R‚U|ðŒŽwŽ¦“à—e
                                     PIC  X(120).
           03  ‚c‚R‚R‚U|’S•ÛŽó•t“ú  PIC  X(008).
           03  ‚c‚R‚R‚U|Žó•tŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚R‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚R‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚R‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚R‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚R‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚R‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
