      *****************************************************************
      *   ’¥‹‘—Þ(D342CHS_TBL)
      *****************************************************************
       01  ’¥‹‘—Þ.
           03  ‚c‚R‚S‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚S‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚Q|’¥‹ŠÇ—Ží—Þ
                                     PIC  X(001).
           03  ‚c‚R‚S‚Q|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚Q|‘—ÞŽí—Þ    PIC  X(003).
           03  ‚c‚R‚S‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚S‚Q|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚S‚Q|‘—Þ˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S‚Q|Žx•¥ˆË—ŠŽžƒ`ƒFƒbƒN
                                     PIC  X(001).
           03  ‚c‚R‚S‚Q|Žæ“¾”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚Q|’¥‹‘—ÞŽæ“¾Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚S‚Q|˜A”Ô        PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚Q|ƒRƒƒ“ƒg—“  PIC  X(080).
           03  ‚c‚R‚S‚Q|’¥‹‘—Þì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚S‚Q|‰ñŽûÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚S‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚S‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚S‚Q|’•¶‘”Ô†  PIC  X(015).
           03  ‚c‚R‚S‚Q|‘—•t“ú      PIC  X(008).
           03  ‚c‚R‚S‚Q|”­Œø“ú      PIC  X(008).
           03  ‚c‚R‚S‚Q|Žx•¥—\’è“ú  PIC  X(008).
           03  ‚c‚R‚S‚Q|‘—Þ“o˜^ŽÒ  PIC  X(008).
           03  ‚c‚R‚S‚Q|Œ_–ñ“o˜^Žžƒ`ƒFƒbƒN
                                     PIC  X(001).
           03  ‚c‚R‚S‚Q|ŒŸŽû“o˜^Žžƒ`ƒFƒbƒN
                                     PIC  X(001).
           03  ‚c‚R‚S‚Q|•”“X’·“_ŒŸ“ú
                                     PIC  X(008).
           03  ‚c‚R‚S‚Q|•”“X’·“_ŒŸŽÒ
                                     PIC  X(008).
           03  ‚c‚R‚S‚Q|ƒ~ƒhƒ‹ƒIƒtƒBƒX“_ŒŸ“ú
                                     PIC  X(008).
           03  ‚c‚R‚S‚Q|ƒ~ƒhƒ‹ƒIƒtƒBƒX“_ŒŸŽÒ
                                     PIC  X(008).
           03  ‚c‚R‚S‚Q|Ž––±ŠÇ—•”Žó—Ì“ú
                                     PIC  X(008).
           03  ‚c‚R‚S‚Q|Ž––±ŠÇ—•”Žó—ÌŽÒ
                                     PIC  X(008).
           03  ‚c‚R‚S‚Q|–³Œøƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚S‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚S‚Q|Ž©“®“o˜^ƒtƒ‰ƒO
                                     PIC  X(001).
