      *****************************************************************
      *   •Ï‘¥•¥“](D343HTN_TBL)
      *****************************************************************
       01  •Ï‘¥•¥“].
           03  ‚c‚R‚S‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚S‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚R|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚S‚R|ŠJŽn‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S‚R|ŠJŽn”NŒŽ    PIC  X(006).
           03  ‚c‚R‚S‚R|I—¹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S‚R|I—¹”NŒŽ    PIC  X(006).
           03  ‚c‚R‚S‚R|‹àŠz        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚R|Á”ïÅ      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚S‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚S‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚S‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚R|“o˜^’S“–ŽÒ  PIC  X(008).
