      *****************************************************************
      *   Œ_–ñQŒ©Ï‘•\Ž¦(D347KMH_TBL)
      *****************************************************************
       01  Œ_–ñ|Œ©Ï‘•\Ž¦.
           03  ‚c‚R‚S‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚S‚V|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚S‚V|•”–¼Ì    PIC  X(060).
           03  ‚c‚R‚S‚V|Œ©Ï‘ì¬“ú•t
                                     PIC  X(008).
           03  ‚c‚R‚S‚V|‘æ‚P‰ñ‰ñŽû•û–@
                                     PIC  X(040).
           03  ‚c‚R‚S‚V|‘æ‚Q‰ñˆÈ~‰ñŽû•û–@
                                     PIC  X(040).
           03  ‚c‚R‚S‚V|ÄƒŠ[ƒXðŒ•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚R‚S‚V|•ÛŽçŒ_–ñæ  PIC  X(060).
           03  ‚c‚R‚S‚V|Œ©Ï—LŒøŠúŒÀ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚P
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚Q
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚R
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚S
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚T
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚U
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚V
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚W
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚X
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|Œ©Ï‘•\Ž¦‚P‚O
                                     PIC  X(100).
           03  ‚c‚R‚S‚V|”„ŽåŒ©Ï”Ô†
                                     PIC  X(020).
           03  ‚c‚R‚S‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚S‚V|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚S‚V|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚S‚V|Œ_–ñŒ–¼    PIC  X(040).
           03  ‚c‚R‚S‚V|•¨Œ‹àŠz•\Ž¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚S‚V|•¨Œ–¾×•\Ž¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚S‚V|‘ã—‰ñŽû•ÛŽç—¿•\Ž¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚S‚V|ÄƒŠ[ƒXðŒ‘I‘ð
                                     PIC  X(001).
           03  ‚c‚R‚S‚V|•¨ŒÝ’uêŠ
                                     PIC  X(060).
           03  ‚c‚R‚S‚V|˜A‘Ñ•ÛØl  PIC  X(040).
           03  ‚c‚R‚S‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚S‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚S‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚S‚V|“o˜^’S“–ŽÒ  PIC  X(008).
