      *****************************************************************
      *   Žx•¥“à—e(D35SHN_TBL)
      *****************************************************************
       01  Žx•¥“à—e.
           03  ‚c‚R‚T|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚R‚T|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥Ží—Þ      PIC  X(002).
           03  ‚c‚R‚T|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚R‚T|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚R‚T|Žx•¥æƒR[ƒh  PIC  X(005).
           03  ‚c‚R‚T|‰‰ñŽx•¥‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|‰‰ñŽx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥‘Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|–³žŠúŠÔ      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥ŠÔŠu      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥“úƒpƒ^[ƒ“
                                     PIC  X(001).
           03  ‚c‚R‚T|Žx•¥ƒTƒCƒg    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥“ú        PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥•û–@      PIC  X(001).
           03  ‚c‚R‚T|•ÏX“ú        PIC  X(008).
           03  ‚c‚R‚T|‰ð–ñ”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚T|‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|‘¼ŽÐŒ_–ñ”Ô†  PIC  X(020).
           03  ‚c‚R‚T|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚T|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚R‚T|XVŽÒ        PIC  X(008).
           03  ‚c‚R‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚T|Žx•¥Žè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|ŽŸ‰ñŽx•¥Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|ŽŸ‰ñŽx•¥Žè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|“ñ‰ñ–ÚˆÈ~Žx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|“ñ‰ñ–ÚˆÈ~Žx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|‘OŽóŒŽ”      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|“ª‹à          PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|“ª‹àÁ”ïÅ    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|ŽèŒ`UoƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|ŽèŒ`Uo“ú    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|ŒŽŠz—¿‹à      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|ŒŽŠz—¿‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥‰ñ”      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥Ï‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥Ï‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|‰‰ñŽx•¥‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚T|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚R‚T|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚R‚T|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚R‚T|‰ð–ñ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|Ž•ª”ä—¦      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚T|¿‹‘Šm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚T|“ü‹àŠm”F‹æ•ª  PIC  X(001).
           03  ‚c‚R‚T|Už—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚T|ƒ\ƒtƒgŽx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|ƒ\ƒtƒgŽx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|Žx•¥Šî€ŒŽ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|ÄƒŠ[ƒXŽx•¥Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚T|Šî–{—˜‰ñ‚è    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚T|ŽÀŽ¿—˜‰ñ‚è    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚T|ˆÈ~Žx•¥ƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|ˆÈ~Žx•¥“ú    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚T|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
