      *****************************************************************
      *   •ÏX\¿_ÂŒ  (D362HSA_TBL)
      *****************************************************************
       01  •ÏX\¿|ÂŒ .
           03  ‚c‚R‚U‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚U‚Q|Œ_–ñŒ–¼    PIC  X(040).
           03  ‚c‚R‚U‚Q|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚R‚U‚Q|•Ï‘¥•¥      PIC  X(001).
           03  ‚c‚R‚U‚Q|“–‰ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚Q|“–‰Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Á”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅVŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅVÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚Q|ÅVÁ”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅVŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅVÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|•ÛŽç–³žŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚Q|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚Q|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚Q|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚Q|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚R‚U‚Q|‰ð–ñ‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅV—š—ð‰ð–ñ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Á”ïÅ‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅV‰ñŽû“ú  PIC  X(008).
           03  ‚c‚R‚U‚Q|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|Š„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Š„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘k‹y‰ð–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚Q|‰ð–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|–ž—¹ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚Q|–ž—¹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚Q|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|‰ð–ñ\¿“ú  PIC  X(008).
           03  ‚c‚R‚U‚Q|‰ñŽûðŒ•ÏXƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|‰ñŽûðŒ•ÏX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‰ñŽûðŒ•ÏX“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚R‚U‚Q|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|•ÛŽç—L–³ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒXŽ©“®ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒXŽ©“®ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚Q|“–‰Žæ“¾Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Žæ“¾ŠzŒ»‰¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘O•¥ŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚Q|¿‹‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‡ŽZæŒ_–ñŽí—Þ
                                     PIC  X(003).
           03  ‚c‚R‚U‚Q|¡‰ñÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒXŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©U¿‹ƒXƒgƒbƒv\¿”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|Ž©U¿‹ƒXƒgƒbƒv\¿•”‰Û
                                     PIC  X(004).
           03  ‚c‚R‚U‚Q|Ž©U¿‹ƒXƒgƒbƒv\¿ŽÒ
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|Ž©U¿‹ƒXƒgƒbƒvŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚Q|Ž©U¿‹ƒXƒgƒbƒvI—¹”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚Q|Ž©U¿‹ƒXƒgƒbƒv——R
                                     PIC  X(002).
           03  ‚c‚R‚U‚Q|Ž©UƒXƒgƒbƒvƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|Ž©U“Á•Ê¿‹\¿”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|Ž©U“Á•Ê¿‹\¿•”‰Û
                                     PIC  X(004).
           03  ‚c‚R‚U‚Q|Ž©U“Á•Ê¿‹\¿ŽÒ
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|Ž©U“Á•Ê¿‹ŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚Q|Ž©U“Á•Ê¿‹I—¹”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚Q|Ž©U“Á•Ê¿‹\¿‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©U“Á•ÊƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|Žx•¥ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|ˆÏ‘õ•ÛŽç‘Š“–ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|‚»‚Ì‘¼Œ_–ñŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚Q|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚U‚Q|‘e—˜‰vŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘e—˜‰vŠz|•\
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ŽèŒ`ŽóŽæ“ú  PIC  X(008).
           03  ‚c‚R‚U‚Q|ŽèŒ`–‡”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ•ªŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ•ªŒŽŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ•ªÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘¼ŽÐŠ„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|‘¼ŽÐŠ„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒXŽè”—¿‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒXŽè”—¿‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚Q|”„‹p‘ãŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒXŽ©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÄƒŠ[ƒX‘¼ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Š„•ŠŒ´‰¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Š„•Š—˜‰v‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Š„•ŠŒ´‰¿‘ŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Š„•Š—˜‰v‘ŠzŽ©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Â–±Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚U‚Q|Á”ïÅ’·Šú|ŽÀÑ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚U‚Q|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|“–‰ŒŽŠz—¿‹à‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Á”ïÅŠz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅVŒŽŠz—¿‹à‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅVÁ”ïÅŠz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅVŒ_–ñ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ÅVÁ”ïÅ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Žæ“¾‰¿Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Žæ“¾Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ŽŸ‰ñÄƒŠ[ƒX—¿‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|ƒŠƒXƒP‘OŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚U‚Q|Ž©U¿‹‹àŠz•ÏX——R
                                     PIC  X(002).
           03  ‚c‚R‚U‚Q|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ý’uêŠ‹æ•ª
                                     PIC S9(001) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Œ_–ñ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|“–‰Á”ïÅ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐŒ³–{‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ”„ã—˜‘§‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ—˜‘§‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐŒÅ’èŽ‘ŽYÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ“®‘•ÛŒ¯‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐˆÏ‘õ•ÛŽç—¿‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ‚»‚Ì‘¼””ï—p‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ•ªŽx•¥”ï—p“K—p‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Ž©ŽÐ•ªŽx•¥”ï—pˆê”Ê‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|Œ³–{‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|—˜‘§‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚Q|””ï—p‘Šz  PIC S9(013) PACKED-DECIMAL.
