      *****************************************************************
      *   •ÏX\¿_Žx•¥“à—e(D365HSN_TBL)
      *****************************************************************
       01  •ÏX\¿|Žx•¥“à—e.
           03  ‚c‚R‚U‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚R‚U‚T|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚U‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚T|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚U‚T|‰‰ñŽx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|‰‰ñŽx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|–³žŠúŠÔ    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥“úƒpƒ^[ƒ“
                                     PIC  X(001).
           03  ‚c‚R‚U‚T|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚R‚U‚T|•ÏX“ú      PIC  X(008).
           03  ‚c‚R‚U‚T|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚T|‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|‘¼ŽÐŒ_–ñ”Ô†
                                     PIC  X(020).
           03  ‚c‚R‚U‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚T|Žx•¥Žè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ŽŸ‰ñŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ŽŸ‰ñŽx•¥Žè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|“ñ‰ñ–ÚˆÈ~Žx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|“ñ‰ñ–ÚˆÈ~Žx•¥Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|‘OŽóŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|“ª‹à        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|“ª‹àÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ŽèŒ`UoƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ŽèŒ`Uo“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ŒŽŠz—¿‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥Ï‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥Ï‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|‰‰ñŽx•¥‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚U‚T|‰ð–ñ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Ž•ª”ä—¦    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|¿‹‘Šm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚T|“ü‹àŠm”F‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚T|Už—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚T|ƒ\ƒtƒgŽx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ƒ\ƒtƒgŽx•¥‘ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Žx•¥Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ÄƒŠ[ƒXŽx•¥Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Šî–{—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ŽÀŽ¿—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ˆÈ~Žx•¥ƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|ˆÈ~Žx•¥“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚T|Á”ïÅ’¥Žû‹æ•ª
                                     PIC  X(001).
