      *****************************************************************
      *   •ÏX\¿_Žx•¥(D366HSH_TBL)
      *****************************************************************
       01  •ÏX\¿|Žx•¥.
           03  ‚c‚R‚U‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚U|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚U‚U|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚U|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚U‚U|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚R‚U‚U|”ƒŠ|˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|˜A”Ô        PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|ŽèŒ`•ªŠ„˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚R‚U‚U|Žx•¥—\’è“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Žx•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚U‚U|‘ŠŽE‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Žè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚U‚U|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥ˆË—Š“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥ŽwŽ¦“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥³”F“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚R‚U‚U|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚R‚U‚U|ŒûÀŽí•ÊƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚U|–¼‹`l      PIC  X(030).
           03  ‚c‚R‚U‚U|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚U|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚R‚U‚U|UžŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|ŽÀÛŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|ŽÀÛŽx•¥ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Žx•¥‘‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|ˆË—Šˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|ŽwŽ¦ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|Žx•¥ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|Žx•¥ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|ˆø“nˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|ŒÚ‹qƒR[ƒh  PIC  X(009).
           03  ‚c‚R‚U‚U|•ªŠ„Œ³˜A”Ô  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Žx•¥—\’è“ú‚Q
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|Uo“ú      PIC  X(008).
           03  ‚c‚R‚U‚U|ŽóŽæ•û–@    PIC  X(001).
           03  ‚c‚R‚U‚U|˜A—æ      PIC  X(060).
           03  ‚c‚R‚U‚U|ˆË—Š”Ô†    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Œo—’÷ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|Œo—’÷Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|•â³ŠzŒvãˆ—”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|“Á•Êˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|“–‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚U‚U|“–‰Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚U‚U|“–‰Žx•¥Ží—Þ
                                     PIC  X(002).
           03  ‚c‚R‚U‚U|“–‰Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚U‚U|“–‰ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|“–‰˜A”Ô    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|–ñ’èŽx•¥“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|˜A—æ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚R‚U‚U|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚U‚U|Žx•¥ŠzŒŽŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Žx•¥‹àŠzÁ”ïÅŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Ž©“®³”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|Žx•¥ˆË—ŠƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|ŽèŒ`•ªŠ„‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|ŽèŒ`•ªŠ„—}Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|ƒRƒƒ“ƒg    PIC  X(040).
           03  ‚c‚R‚U‚U|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Žx•¥ˆË—Š³”F“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥ˆË—ŠŠm’è“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|ˆË—Š³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|ˆË—ŠŠm’èˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚U‚U|“ü‹àŠm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|¿‹‘Šm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|Žx•¥ˆË—ŠŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥ŽwŽ¦ŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥³”FŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚U|Žx•¥ŽæÁ“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|‹x“ú‘Î‰ž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|Žx•¥‹àŠzÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Žè”—¿‘ŠŽE‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|Žè”—¿‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚U|–³Œøƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚U‚U|ŽæÁÄˆË—Š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|ŽdŒü‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚U‚U|ŽdŒüŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚U‚U|ŽdŒüŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚R‚U‚U|ŽdŒüŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚U‚U|ŽdŒü–¼‹`l  PIC  X(030).
           03  ‚c‚R‚U‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚U|“o˜^’S“–ŽÒ  PIC  X(008).
