      *****************************************************************
      *   •ÏX\¿QŒ_–ñ“à—eŒÂ•Êî•ñ(D367HKJ_TBL)
      *****************************************************************
       01  •ÏX\¿|Œ_–ñ“à—eŒÂ•Êî•ñ.
           03  ‚c‚R‚U‚V|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚U‚V|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|‘ÎR—vŒ    PIC  X(002).
           03  ‚c‚R‚U‚V|Š„ˆø—¿      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|Žæ—§Žè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|Žæ—§Žè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|—˜—¦Šî”‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚V|—˜‘§’[”‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚V|•Ð’[—¼’[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚V|‹x“ú‘Î‰ž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚V|—˜‘§ŒvŽZ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚V|‰‰ñ—˜‘§‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚V|ŽÀŽ¿”N—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|ƒXƒvƒŒƒbƒh  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|‰‰ñŒ³–{‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚V|Œ³–{ƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|Œ³–{‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|‰‰ñ—˜‘§‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚V|—˜‘§ƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|—˜‘§‰ñ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|Œ©’¼‚µƒTƒCƒNƒ‹
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚U‚V|—˜—¦Šm’èŠúŒÀ
                                     PIC  X(008).
           03  ‚c‚R‚U‚V|‘æ‚P‰ñ•ÔÏ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚V|‘æ‚Q‰ñ•ÔÏ“ú
                                     PIC  X(008).
           03  ‚c‚R‚U‚V|— •tŽæˆø    PIC  X(060).
           03  ‚c‚R‚U‚V|ŽèŒ`— ‘•û–@
                                     PIC  X(001).
           03  ‚c‚R‚U‚V|’S•ÛƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚R‚U‚V|Šm”FƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚R‚U‚V|V‹K‘‘Ö‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚U‚V|‘‘ÖæŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚U‚V|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚V|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚V|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚U‚V|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚U‚V|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚U‚V|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚U‚V|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
