      *****************************************************************
      *   •ÏX—š—ð_Žx•¥(D375HSH_TBL)
      *****************************************************************
       01  •ÏX—š—ð|Žx•¥.
           03  ‚c‚R‚V‚T|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚T|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚R‚V‚T|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚R‚V‚T|”ƒŠ|˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|˜A”Ô        PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|ŽèŒ`•ªŠ„˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|“à—e•ÏX“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚R‚V‚T|Žx•¥—\’è“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Žx•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚V‚T|‘ŠŽE‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Žè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚V‚T|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥ˆË—Š“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥ŽwŽ¦“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥³”F“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚R‚V‚T|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚R‚V‚T|ŒûÀŽí•ÊƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚R‚V‚T|–¼‹`l      PIC  X(030).
           03  ‚c‚R‚V‚T|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚T|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚R‚V‚T|UžŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|ŽÀÛŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|ŽÀÛŽx•¥ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Žx•¥‘‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|ˆË—Šˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|ŽwŽ¦ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|Žx•¥ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|Žx•¥ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|ˆø“nˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|ŒÚ‹qƒR[ƒh  PIC  X(009).
           03  ‚c‚R‚V‚T|•ªŠ„Œ³˜A”Ô  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Žx•¥—\’è“ú‚Q
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|Uo“ú      PIC  X(008).
           03  ‚c‚R‚V‚T|ŽóŽæ•û–@    PIC  X(001).
           03  ‚c‚R‚V‚T|˜A—æ      PIC  X(060).
           03  ‚c‚R‚V‚T|ˆË—Š”Ô†    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Œo—’÷ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|Œo—’÷Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|•â³ŠzŒvãˆ—”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|“Á•Êˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚T|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚V‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|“–‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚V‚T|“–‰Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚V‚T|“–‰Žx•¥Ží—Þ
                                     PIC  X(002).
           03  ‚c‚R‚V‚T|“–‰Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚V‚T|“–‰ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|“–‰˜A”Ô    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|–ñ’èŽx•¥“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|˜A—æ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚R‚V‚T|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚R‚V‚T|Žx•¥ŠzŒŽŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Žx•¥‹àŠzÁ”ïÅŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Ž©“®³”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|Žx•¥ˆË—ŠƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|ŽèŒ`•ªŠ„‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|ŽèŒ`•ªŠ„—}Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|ƒRƒƒ“ƒg    PIC  X(040).
           03  ‚c‚R‚V‚T|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Žx•¥ˆË—Š³”F“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥ˆË—ŠŠm’è“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|ˆË—Š³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|ˆË—ŠŠm’èˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚R‚V‚T|“ü‹àŠm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|¿‹‘Šm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|Žx•¥ˆË—ŠŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥ŽwŽ¦ŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥³”FŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚R‚V‚T|Žx•¥ŽæÁ“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|‹x“ú‘Î‰ž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|Žx•¥‹àŠzÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Žè”—¿‘ŠŽE‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|Žè”—¿‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚R‚V‚T|–³Œøƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚V‚T|ŽæÁÄˆË—Š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|ŽdŒü‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚V‚T|ŽdŒüŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚V‚T|ŽdŒüŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚R‚V‚T|ŽdŒüŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚V‚T|ŽdŒü–¼‹`l  PIC  X(030).
           03  ‚c‚R‚V‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚V‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚V‚T|“o˜^’S“–ŽÒ  PIC  X(008).
