      *****************************************************************
      *   •ÏX\¿|¿‹æƒ}ƒXƒ^(D392HSQ_TBL)
      *****************************************************************
       01  •ÏX\¿|¿‹æƒ}ƒXƒ^.
           03  ‚c‚R‚X‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚R‚X‚Q|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚Q|¿‹æ–¼Ì  PIC  X(080).
           03  ‚c‚R‚X‚Q|•”–å–¼Ì    PIC  X(060).
           03  ‚c‚R‚X‚Q|’S“–ŽÒ–¼Ì  PIC  X(020).
           03  ‚c‚R‚X‚Q|¿‹‘•\Ž¦  PIC  X(001).
           03  ‚c‚R‚X‚Q|Užl–¼    PIC  X(040).
           03  ‚c‚R‚X‚Q|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚R‚X‚Q|”[•tæƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚R‚X‚Q|ZŠ‚Q      PIC  X(060).
           03  ‚c‚R‚X‚Q|ZŠ‚R      PIC  X(060).
           03  ‚c‚R‚X‚Q|“d˜b”Ô†    PIC  X(015).
           03  ‚c‚R‚X‚Q|ˆêŠ‡“ü‹àƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚Q|‘—•tæ–¼Ì  PIC  X(060).
           03  ‚c‚R‚X‚Q|‘—•tæ•”–å  PIC  X(060).
           03  ‚c‚R‚X‚Q|‘—•tæ’S“–ŽÒ
                                     PIC  X(020).
           03  ‚c‚R‚X‚Q|‘—•tæƒJƒi–¼Ì
                                     PIC  X(040).
           03  ‚c‚R‚X‚Q|‘—•tæ—X•Ö”Ô†
                                     PIC  X(007).
           03  ‚c‚R‚X‚Q|‘—•tæŽs’¬‘ºƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚R‚X‚Q|‘—•tæZŠ‚Q
                                     PIC  X(060).
           03  ‚c‚R‚X‚Q|‘—•tæZŠ‚R
                                     PIC  X(060).
           03  ‚c‚R‚X‚Q|‘—•tæ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚R‚X‚Q|Ž©“®ƒ}ƒbƒ`ƒ“ƒO‘ÎÛŠO‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|‰ñŽûƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚Q|‰ñŽû“ú      PIC  X(002).
           03  ‚c‚R‚X‚Q|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚R‚X‚Q|‰ñŽûŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚Q|¿‹ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚Q|¿‹’÷“ú    PIC  X(002).
           03  ‚c‚R‚X‚Q|¿‹ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚Q|¿‹Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚Q|ì¬’Ê”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚R‚X‚Q|ì¬’PˆÊ    PIC  X(001).
           03  ‚c‚R‚X‚Q|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|¿‹Žw’è—lŽ®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|‘—•t‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚Q|ŽóŽæ‘¤‹à—Z‹@ŠÖƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚X‚Q|ŽóŽæ‘¤Žx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚X‚Q|ŽóŽæ‘¤ŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|ŽóŽæ‘¤ŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚X‚Q|ŒûU‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚X‚Q|ŒûUŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚X‚Q|ŒûUŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|ŒûUŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚R‚X‚Q|ŒûU–¼‹`l  PIC  X(030).
           03  ‚c‚R‚X‚Q|¿‹ˆ¶–¼ˆóü
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|¿‹“ú•tˆóü
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|‰ñŽûŠúŒÀˆóü
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|Žg—pŒŽˆóü  PIC  X(001).
           03  ‚c‚R‚X‚Q|“à–óˆóü    PIC  X(001).
           03  ‚c‚R‚X‚Q|¿‹”Ô†ˆóü
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|“E—v—“ˆóü  PIC  X(001).
           03  ‚c‚R‚X‚Q|“E—v—“      PIC  X(060).
           03  ‚c‚R‚X‚Q|”õl—“ˆóü  PIC  X(001).
           03  ‚c‚R‚X‚Q|ŒûU‚²ˆÄ“à‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|W–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚R‚X‚Q|XV“úŽž    PIC  X(016).
           03  ‚c‚R‚X‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚R‚X‚Q|‘—•tæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚R‚X‚Q|‰¼‘zŒûÀ˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚R‚X‚Q|ŒÚ‹qŽg—p•s‰Âƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|ƒRƒƒ“ƒg—“  PIC  X(060).
           03  ‚c‚R‚X‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚X‚Q|•”–åƒJƒi–¼Ì
                                     PIC  X(030).
           03  ‚c‚R‚X‚Q|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚R‚X‚Q|‹¤—Lƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚R‚X‚Q|ZŠ‚P      PIC  X(060).
           03  ‚c‚R‚X‚Q|ZŠƒJƒi–¼Ì
                                     PIC  X(060).
           03  ‚c‚R‚X‚Q|‚e‚`‚w”Ô†  PIC  X(015).
           03  ‚c‚R‚X‚Q|U‘Ö‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚X‚Q|Ž©Uˆø—Ž“ú  PIC  X(002).
           03  ‚c‚R‚X‚Q|ŽóŽæ‘¤ŒûÀƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚R‚X‚Q|UžŽè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚R‚X‚Q|Œ»’S“–ŽÒ    PIC  X(008).
           03  ‚c‚R‚X‚Q|Žå’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚R‚X‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚R‚X‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚R‚X‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚R‚X‚Q|‹Œ¿‹æƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚R‚X‚Q|ŒûÀˆø—ŽˆË—Š‘Žó—Ì“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚Q|ŒûÀˆø—ŽŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚Q|Ž––±ŠÇŽó—Ì“ú
                                     PIC  X(008).
           03  ‚c‚R‚X‚Q|ŒûUŠJŽn“K—p“ú
                                     PIC  X(008).
