      *****************************************************************
      *   ‰ð–ñ—š—ðQŒ_–ñ“à—e(D463KYR_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|Œ_–ñ“à—e.
           03  ‚c‚S‚U‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|Œ©Ï”Ô†    PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|Œ©Ï”Ô†Ž}”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚U‚R|âg‹cŒˆÙ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|‘Ý•tŽÀs—\’è“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|¬–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|ŠúŠÔ        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|Œ_–ñŒ–¼    PIC  X(060).
           03  ‚c‚S‚U‚R|ƒGƒ“ƒhƒ†[ƒUƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚U‚R|Œ_–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|Ð‰îƒ‹[ƒg  PIC  X(001).
           03  ‚c‚S‚U‚R|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚S‚U‚R|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|•Ï‘¥•¥      PIC  X(001).
           03  ‚c‚S‚U‚R|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|Œ_–ñ‘Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX—¿‹à‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|’S•Û‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|‹¦’²‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚U‚R|ŽåŠ²Ž–æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚U‚R|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ƒ†[ƒU—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|’·ƒvƒ‰‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽÐ“à‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚U‚R|¿‹‘ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚S‚U‚R|‘æ‚P‰ñ‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‘æ‚P‰ñ‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‘æ‚P‰ñ‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‘æ‚P‰ñ‰ñŽû‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|U‘ÖŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|‘O•¥‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|“ª‹à‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|‰c‹ÆƒRƒƒ“ƒg—“‚P
                                     PIC  X(080).
           03  ‚c‚S‚U‚R|‰c‹ÆƒRƒƒ“ƒg—“‚Q
                                     PIC  X(080).
           03  ‚c‚S‚U‚R|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚U‚R|–ž—¹ˆÄ“à‘—•t‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|–ž—¹ˆÄ“à‰ñ“š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚S‚U‚R|‘k‹yˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‘k‹yˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|ŒŸŽûƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|ŒŸŽûŽæÁ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|ŒŸŽûŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|ŒŸŽûŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|“–‰‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ÅV‰ñŽûŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ÅI•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒXƒf[ƒ^ì¬‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒXŽ©“®ì¬”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|ƒŠ[ƒXŠ„•Š‘O•¥ŒŽ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|“ª‹à¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‘O•¥¿‹‘ì¬ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|“ª‹à¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‘O•¥¿‹Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚U‚R|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|‘‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|•¨ŒŠm”F    PIC  X(001).
           03  ‚c‚S‚U‚R|‚Ü‚é‚ß’PˆÊ  PIC  X(001).
           03  ‚c‚S‚U‚R|“à–óˆóü•û–@
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Œ_–ñŠúŠÔ‰ñ”ˆóü—L–³
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|¬–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|¬–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|¬–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|¬–ñŽæÁ”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX¿‹ŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚U‚R|“–‰—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|“–‰‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|“–‰ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|“–‰Œ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆÈ~‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆÈ~‰ñŽû“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆÈ~‰ñŽûŠÔŠu
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‹ŒŽæˆø”Ô†  PIC  X(010).
           03  ‚c‚S‚U‚R|‰ð–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|‰ð–ñŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|–ž—¹—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|–ž—¹—\–ñƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒXŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒXŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|³ŒpƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|³Œpˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|³ŒpŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|³ŒpŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|”„‹pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|”„‹pˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|ðŒ•ÏXƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|ðŒ•ÏXˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚R|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Œ_–ñ—¿—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‘e—˜Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|“–‰Œ_–ñ—¿—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆÈ~‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|¿‹ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|¿‹ŠÔŠu    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|¿‹Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|Œ_–ñŽæˆø‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Ó”C‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|‘ŠŽE‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|’•¶‘o—Í‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|–ž—¹ˆÄ“à’ •[‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX—¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒXŽ©“®Œp‘±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Œ_–ñ‘Ž®    PIC  X(001).
           03  ‚c‚S‚U‚R|•¨Œ•ÛŠÇêŠ
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|¿‹æ‹æ•ª  PIC  X(001).
           03  ‚c‚S‚U‚R|•s“®ŽY’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|—L‰¿ØŒ”’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‚»‚Ì‘¼’S•ÛÝ’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|•ÛØl—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|–¢ŽûŽc‚‘ÎÛŠOƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚S‚U‚R|“®‘•ÛŒ¯—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|“®‘•t•ÛŠJŽn”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|¿‹ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚U‚R|–â‡‚¹”Ô†  PIC  X(010).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‹ŒŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚S‚U‚R|w“ü‘I‘ðŒ •tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX\¿‘—L–³‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|³Œp\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|âg‹c\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ƒŠƒXƒPƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‘e—˜‰vŠz|•\
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‚¨Žx•¥–¾×‘ì¬Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‚¨Žx•¥–¾×‘—v”Û
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|\¿”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|‘ÎÛŒ³–{Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚R|\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX\¿‘o—Í”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|¿‹Šî€    PIC  X(001).
           03  ‚c‚S‚U‚R|ŽŸ‰ñÄƒŠ[ƒX‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽŸ‰ñÄƒŠ[ƒX‰ñŽû“ú
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽG”ï•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽG”ï”Ì‘£”ï  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽG”ïM—p•ÛŒ¯
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽG”ï‚»‚Ì‘¼  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|’¥‹Š®—¹ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|’¥‹Š®—¹ŽæÁƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ŽŸ‰ñÄƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Œ_–ñ‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|’•¶‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‚»‚Ì‘¼”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‰c‹ÆƒRƒƒ“ƒg—“‚R
                                     PIC  X(080).
           03  ‚c‚S‚U‚R|ŽÐ“à‹à—˜‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ŽG”ï’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ƒI[ƒvƒ“ƒuƒ‰ƒCƒ“ƒh‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‹¦’²‰ñŽû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|’P”N“xŒ_–ñ  PIC  X(001).
           03  ‚c‚S‚U‚R|ƒoƒbƒNŽæˆø  PIC  X(001).
           03  ‚c‚S‚U‚R|”Û”F‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|‘O“n‹à‹æ•ª  PIC  X(001).
           03  ‚c‚S‚U‚R|”ñ‰ÛÅ‹æ•ª  PIC  X(001).
           03  ‚c‚S‚U‚R|•ïŠ‡‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|ŠCŠOÝ’u‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|•¨ŒƒRƒƒ“ƒg
                                     PIC  X(040).
           03  ‚c‚S‚U‚R|‰ð–ñ‹àŒvŽZ•û–@
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|”À“ü—\’è“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|\¿Œ_–ñŠz‰ÁŽZƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Ð‰îæŽæˆøæ
                                     PIC  X(009).
           03  ‚c‚S‚U‚R|Ð‰îæŒ_–ñæ
                                     PIC  X(005).
           03  ‚c‚S‚U‚R|Ð‰îæ‚a‚s‚l
                                     PIC  X(004).
           03  ‚c‚S‚U‚R|Ð‰îæ—»“X  PIC  X(004).
           03  ‚c‚S‚U‚R|Ð‰îæ‹âs  PIC  X(004).
           03  ‚c‚S‚U‚R|Ð‰îæŽx“X  PIC  X(003).
           03  ‚c‚S‚U‚R|¿‹“ú      PIC  X(002).
           03  ‚c‚S‚U‚R|Œ_–ñŽæÁ——R‚P
                                     PIC  X(080).
           03  ‚c‚S‚U‚R|Œ_–ñŽæÁ——R‚Q
                                     PIC  X(080).
           03  ‚c‚S‚U‚R|Œ_–ñŽæÁ\¿‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ŒˆÙ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Œ_–ñ“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ŒŸŽû“o˜^\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Œ_–ñŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ŒŸŽûŽæÁ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|•ÏX\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|•ÏXƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚U‚R|•ÏX”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|Â–±‹¦’²ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚S‚U‚R|ˆê”Ê‘åŒû‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|§“xƒŠ[ƒX  PIC  X(001).
           03  ‚c‚S‚U‚R|Šî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‘e—˜Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆê”ÊŽÐ“à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆê”ÊŠî–{—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆê”ÊŽÀŽ¿—˜‰ñ‚è
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆê”Ê‘e—˜Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆê”ÊŠî–{—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆê”ÊŽÀŽ¿—˜‰ñ‚è‘Šz•ª
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆê”Ê‘e—˜ŠzŽ©ŽÐ•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‹­§•Û‘¶ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚U‚R|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚U‚R|ˆ´ùŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‹Æ–±‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|”ƒ–ß‹`–±‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‘ã—‰ñŽû    PIC  X(001).
           03  ‚c‚S‚U‚R|”ƒŽæ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‹à—˜•Ï“®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|˜A“®‹à—˜‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚R|Š„ˆø—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‘Ý•t‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‘Ý•t‹à—˜    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|Ž‘‹àŽg“r‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚R|Ž‘‹àŽg“r•¶Œ¾
                                     PIC  X(080).
           03  ‚c‚S‚U‚R|Žx•¥ˆÏ‘õŽæˆøŒ`‘Ô
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|—ZŽ‘•û–@    PIC  X(001).
           03  ‚c‚S‚U‚R|•ÔÏðŒ    PIC  X(001).
           03  ‚c‚S‚U‚R|ƒŠ[ƒXŽí—Þ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Ž‘ŽY‰È–Ú‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|d—v«Šî€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‘O“n‹à‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ƒgƒŠƒvƒ‹ƒIƒvƒVƒ‡ƒ“•ûŽ®
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ˆø‡’†Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|“à—e•ÏX\¿˜A”Ô
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|³Œp•ªŠ„Ží—Þ
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|³Œp‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|–ž—¹ðŒ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‘æ‚P‰ñ–Ú‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚S‚U‚R|‘æ‚Q‰ñ–ÚˆÈ~‰ñŽû“ú•¶Œ¾
                                     PIC  X(040).
           03  ‚c‚S‚U‚R|÷“nðŒ•tƒŠ[ƒX‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Žc‰¿‰ñŽûƒTƒCƒg
                                     PIC S9(002)V9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ÂŒ ”ƒŽæ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Žx•¥Šî€ŒŽ  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‘¹ŠQ”…ž‹à•¶Œ¾
                                     PIC  X(080).
           03  ‚c‚S‚U‚R|—¬“®‰»”Ô†  PIC  X(006).
           03  ‚c‚S‚U‚R|—¬“®‰»æ    PIC  X(007).
           03  ‚c‚S‚U‚R|M‘õæÝ’è“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|M‘õI—¹“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|·“ü—\–ñ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ÂŒ ”ƒŽæ“ú  PIC  X(008).
           03  ‚c‚S‚U‚R|‘ŠŽEð€‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|÷“n‹ÖŽ~“Á–ñ
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|æ•ûŒ_–ñ”Ô†
                                     PIC  X(016).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX—¿•ªŽq
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX—¿•ª•ê
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|‰c‹ÆƒRƒƒ“ƒg—“‚S
                                     PIC  X(080).
           03  ‚c‚S‚U‚R|V‹Kæ‹æ•ª  PIC  X(001).
           03  ‚c‚S‚U‚R|e–§æ‹æ•ª  PIC  X(001).
           03  ‚c‚S‚U‚R|à–±•”‹à—˜  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ˆê”Ê‘O“n‹à‹à—˜
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|ŒˆÙƒ‰ƒ“ƒN  PIC  X(001).
           03  ‚c‚S‚U‚R|‚¨—çó”­sƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|ˆÚsƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX\¿ðŒ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚R|–â‚¢‡‚í‚¹’S“–•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚S‚U‚R|–â‚¢‡‚í‚¹’S“–ŽÒ–¼
                                     PIC  X(020).
           03  ‚c‚S‚U‚R|ÄƒŠ[ƒX—¿Žx•¥—\’è“ú
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|–ž—¹’Ê’m‘‰ñ“šŠúŒÀ
                                     PIC  X(008).
           03  ‚c‚S‚U‚R|\¿‹æ•ª    PIC  X(001).
           03  ‚c‚S‚U‚R|“à—e\¿‘ˆóü‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚R|“à—e\¿‘ˆóüÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|Œ_–ñŒ–¼Ž©“®“o˜^‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|•ÔÏŒ´Ž‘    PIC  X(080).
           03  ‚c‚S‚U‚R|”Û”Fˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚U‚R|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚S‚U‚R|—¬“®‰»æŒ_–ñæƒR[ƒh
                                     PIC  X(005).
