      *****************************************************************
      *   ‰ð–ñ—š—ðQ‘O•¥‹à(D468KMA_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|‘O•¥‹à.
           03  ‚c‚S‚U‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚U‚W|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚U‚W|‘O•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘O•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘O•¥‹àŠzÁ”ïÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘O•¥‹àŠzÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚U‚W|‘O•¥‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚S‚U‚W|‘O•¥‰ñŽûƒTƒCƒg
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘O•¥‰ñŽû“ú  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|[“–ŠJŽn‰ñ  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|[“–ŒŽ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|[“–ŠJŽn”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚U‚W|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|UžŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚U‚W|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚W|‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚U‚W|Ž©ŽÐ‘O•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|Ž©ŽÐ‘O•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘¼ŽÐ‰ð–ñ•ª—¿‹à—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘¼ŽÐ‰ð–ñ•ªÁ”ïÅ—ÝŒv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘¼ŽÐ–¢‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚S‚U‚W|‘Ý“|‘¹Ž¸‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚U‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚U‚W|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚U‚W|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚U‚W|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚U‚W|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚S‚U‚W|[“–ÏŒŽ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|[“–ÏŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|–¢[“–Žc‚  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚S‚U‚W|Ž©ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|Ž©ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘¼ŽÐ‘O•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|‘¼ŽÐ‘O•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|[“–”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚W|[“–ÏŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|Ž©ŽÐ[“–ÏŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|Ž©ŽÐ[“–ÏŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|–¢[“–Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|Ž©ŽÐ–¢[“–Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|Ž©ŽÐ–¢[“–Žc‚Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚U‚W|Áž”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚U‚W|‰ñŽû—\’è“ú  PIC  X(008).
