      *****************************************************************
      *   ‰ð–ñ—š—ðQ‘¹ŠQ‹à¿‹(D471KSG_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|‘¹ŠQ‹à¿‹.
           03  ‚c‚S‚V‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚V‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à¿‹•û–@
                                     PIC  X(001).
           03  ‚c‚S‚V‚P|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‰ð–ñ˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‰ð–ñ–{ŽZ”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚P|‘¹ŠQ‹àŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à‰ñŽû—\’è“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚P|VŒ_–ñ”Ô†  PIC  X(015).
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à¿‹Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à¿‹ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à¿‹ŠzÁ”ïÅ—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à¿‹ŠzÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚V‚P|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚V‚P|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à‰ñŽûŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚V‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚V‚P|Ž©ŽÐ”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|Ž©ŽÐ”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|ŠÇ—ÂŒ ƒŒƒxƒ‹
                                     PIC  X(001).
           03  ‚c‚S‚V‚P|‘Ý“|‘¹Ž¸‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|“Â‘£ƒJ[ƒh”­sƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚V‚P|ŒJã•ÙÏŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|ŒJã•ÙÏ—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|ŒJã•ÙÏŒ³–{Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|ŒJã•ÙÏ—˜‘§Ž©ŽÐ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|–ß‚µ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|Á”ïÅˆêŠ‡’¥Žû‰ß“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|Á”ïÅˆêŠ‡’¥Žû•s‘«‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|Ž©ŽÐÁ”ïÅˆêŠ‡’¥Žû‰ß“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|Ž©ŽÐÁ”ïÅˆêŠ‡’¥Žû•s‘«‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚V‚P|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚S‚V‚P|‘¹ŠQ‹à‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚S‚V‚P|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚S‚V‚P|Áž”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚P|‘ŠŽE‰ß“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘ŠŽE‰ß“ü‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘ŠŽE‘O•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|‘ŠŽE‘O•¥‹àÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚P|“o˜^’S“–ŽÒ  PIC  X(008).
