      *****************************************************************
      *   ‰ð–ñ—š—ðQŽx•¥(D472KYS_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|Žx•¥.
           03  ‚c‚S‚V‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚V‚Q|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚V‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚V‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚V‚Q|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚S‚V‚Q|”ƒŠ|˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|˜A”Ô        PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|ŽèŒ`•ªŠ„˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚S‚V‚Q|Žx•¥—\’è“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|ˆø“n”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Žx•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚V‚Q|‘ŠŽE‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Žè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚S‚V‚Q|’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥ˆË—Š“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥ŽwŽ¦“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥³”F“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|‹âsƒR[ƒh  PIC  X(004).
           03  ‚c‚S‚V‚Q|Žx“XƒR[ƒh  PIC  X(003).
           03  ‚c‚S‚V‚Q|ŒûÀŽí•ÊƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚S‚V‚Q|–¼‹`l      PIC  X(030).
           03  ‚c‚S‚V‚Q|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚V‚Q|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚S‚V‚Q|UžŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|ŽÀÛŽx•¥Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|ŽÀÛŽx•¥ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Žx•¥‘‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|ˆË—Šˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|ŽwŽ¦ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|Žx•¥ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|Žx•¥ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|ˆø“nˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|ŒÚ‹qƒR[ƒh  PIC  X(009).
           03  ‚c‚S‚V‚Q|•ªŠ„Œ³˜A”Ô  PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Žx•¥—\’è“ú‚Q
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|Uo“ú      PIC  X(008).
           03  ‚c‚S‚V‚Q|ŽóŽæ•û–@    PIC  X(001).
           03  ‚c‚S‚V‚Q|˜A—æ      PIC  X(060).
           03  ‚c‚S‚V‚Q|ˆË—Š”Ô†    PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Œo—’÷ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|Œo—’÷Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|•â³ŠzŒvãˆ—”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|“Á•Êˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚V‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|“–‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚S‚V‚Q|“–‰Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚S‚V‚Q|“–‰Žx•¥Ží—Þ
                                     PIC  X(002).
           03  ‚c‚S‚V‚Q|“–‰Œ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚V‚Q|“–‰ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|“–‰˜A”Ô    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|–ñ’èŽx•¥“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|˜A—æ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚S‚V‚Q|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚S‚V‚Q|Žx•¥ŠzŒŽŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Žx•¥‹àŠzÁ”ïÅŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Ž©“®³”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|Žx•¥ˆË—ŠƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|ŽèŒ`•ªŠ„‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|ŽèŒ`•ªŠ„—}Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|ƒRƒƒ“ƒg    PIC  X(040).
           03  ‚c‚S‚V‚Q|ŽóŽæŽè”—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Žx•¥ˆË—Š³”F“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥ˆË—ŠŠm’è“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|ˆË—Š³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|ˆË—ŠŠm’èˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚S‚V‚Q|“ü‹àŠm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|¿‹‘Šm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|Žx•¥ˆË—ŠŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥ŽwŽ¦ŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥³”FŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚S‚V‚Q|Žx•¥ŽæÁ“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|‹x“ú‘Î‰ž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|Žx•¥‹àŠzÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Žè”—¿‘ŠŽE‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|Žè”—¿‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚Q|–³Œøƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚S‚V‚Q|ŽæÁÄˆË—Š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|ŽdŒü‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚S‚V‚Q|ŽdŒüŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚S‚V‚Q|ŽdŒüŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚S‚V‚Q|ŽdŒüŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚V‚Q|ŽdŒü–¼‹`l  PIC  X(030).
           03  ‚c‚S‚V‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
