      *****************************************************************
      *   ‰ð–ñ—š—ðQ‹à—Z“WŠJ(D475KKT_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|‹à—Z“WŠJ.
           03  ‚c‚S‚V‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚V‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚V‚T|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚S‚V‚T|“WŠJ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚T|—˜‘§ŒŽ”    PIC S9(001)V9(002) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|—˜‘§        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|—˜‰ñ‚è      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Œ³–{’²®Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐŒ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐ””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|“–ŒŽ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐ—˜‰ñ‚è  PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|Ž©ŽÐŒ³–{’²®Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚V‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚V‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚S‚V‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚V‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚V‚T|XVŽÒ      PIC  X(008).
