      *****************************************************************
      *   ‰ð–ñ—š—ðQ‘‡ÌŽZÂŒ (D482KSA_TBL)
      *****************************************************************
       01  ‰ð–ñ—š—ð|‘‡ÌŽZÂŒ .
           03  ‚c‚S‚W‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚S‚W‚Q|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚W‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚S‚W‚Q|‰ñŽûŽí—Þ    PIC  X(003).
           03  ‚c‚S‚W‚Q|‰ñŽû˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚W‚Q|•R•tŒ_–ñ”Ô†
                                     PIC  X(010).
           03  ‚c‚S‚W‚Q|•R•tÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚S‚W‚Q|•R•tŒ_–ñŽí—Þ
                                     PIC  X(003).
           03  ‚c‚S‚W‚Q|•R•t˜A”Ô    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚S‚W‚Q|–ñ’è‰ñŽû”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚S‚W‚Q|‰ñŽûƒTƒCƒg  PIC S9(003)V9(002) PACKED-DECIMAL.
           03  ‚c‚S‚W‚Q|–ñ’è‰ñŽû‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚S‚W‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚W‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚W‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚S‚W‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚S‚W‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚S‚W‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚S‚W‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
