      *****************************************************************
      *   ‰ð–ñ\¿(D510KSI_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿.
           03  ‚c‚T‚P‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|‰ð–ñ³Œp‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚O|‰ð–ñ˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚O|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚T‚P‚O|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚T‚P‚O|³ŒpŽí—Þ    PIC  X(001).
           03  ‚c‚T‚P‚O|‹¦’²“]‹æ•ª  PIC  X(001).
           03  ‚c‚T‚P‚O|Â–±‹¦’²ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚T‚P‚O|Œo‰ßŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|Œ_–ñŒ–¼    PIC  X(060).
           03  ‚c‚T‚P‚O|‘ã•\‰ð–ñ•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|Œp‘±””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|ŽcƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|Œ¸Šz–@‚P‚P‚O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|Œ¸Šz–@‚P‚O‚T
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|•ÛŒ¯‰¿Ši‚P‚P‚O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|ŽÀŽ¿Œ³–{Žc‚P‚O‚T
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|ŽÀŽ¿–¢‰ñŽûŒ³–{Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|–¢’¥ŽûŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|–¢’¥Žû•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|–¢’¥Žû‡ŒvŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|ŽÀŽ¿Œ³–{Žc‚P‚O‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|‰ð–ñŒvã‘e—˜
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|–@’è’èŠzž‹pŠzŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|–@’è’è—¦ž‹pŠzŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|‰ð–ñ•¨Œ‘Ï—p”N”
                                     PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|‰ð–ñ•¨Œ•ÛŒ¯—¿—¦
                                     PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|\¿”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚O|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚T‚P‚O|‰c‹ÆˆÓŒ©    PIC  X(160).
           03  ‚c‚T‚P‚O|‰ð–ñˆÈ~’²’B—˜‘§–ñ’è
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|‰ð–ñˆÈ~’²’B—˜‘§”„ã
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚O|³Œp‹æ•ª    PIC  X(001).
           03  ‚c‚T‚P‚O|Œ_–ñŒ–¼Ž©“®“o˜^‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚O|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚P‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚P‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
