      *****************************************************************
      *   ‰ð–ñ\¿QÂŒ ‰ð–ñ(D514KSK_TBL)
      *****************************************************************
       01  ‰ð–ñ\¿|ÂŒ ‰ð–ñ.
           03  ‚c‚T‚P‚S|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚T‚P‚S|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚T‚P‚S|‰ð–ñ—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñŒã—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñŒãÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ŒŽŠz—¿‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñŒãŒ_–ñ‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñŒãŒ_–ñ‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‚Ü‚é‚ß’PˆÊ  PIC  X(001).
           03  ‚c‚T‚P‚S|‡ˆÓ‰ð–ñ‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‘¹ŠQ”…ž‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|”„‹p‘ã[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚S|”„‹p‘ã[“–Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ß“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‘OŽó‰ß“ü‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ß•¥‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|•ÛŽç‰ß•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚T‚P‚S|‰ð–ñ‹à¿‹‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñ‹à¿‹ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñ‰ñ”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñ”„ã”NŒŽ
                                     PIC  X(006).
           03  ‚c‚T‚P‚S|–¢’¥Žû‹àŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ß“ü‹à•Ô‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ß“ü‹à•Ô‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‘OŽó‹à•Ô‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‘OŽó‹à•Ô‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|•Ô‹àŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚T‚P‚S|•Ô‹à¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚T‚P‚S|‰ß“ü‹à•Ô‹à“ú
                                     PIC  X(008).
           03  ‚c‚T‚P‚S|•Ô‹à“ú•Ê“rŽw’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚T‚P‚S|•Ô‹à‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚T‚P‚S|•Ô‹àŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚T‚P‚S|•Ô‹àŒûÀŽí—Þ
                                     PIC  X(001).
           03  ‚c‚T‚P‚S|•Ô‹àŒûÀ”Ô†
                                     PIC  X(010).
           03  ‚c‚T‚P‚S|•Ô‹àŒûÀ–¼‹`l
                                     PIC  X(030).
           03  ‚c‚T‚P‚S|‰ð–ñ•ª‘O•¥ƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñ•ª‘O•¥ƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‘OŽóƒŠ[ƒX—¿ˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚T‚P‚S|Žc‰ñŽû‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ŽcƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñŽc‰¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñ•ÛØŽc‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Œ¸Šz–@‚P‚P‚O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Œ¸Šz–@‚P‚O‚T
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|•ÛŒ¯‰¿Ši‚P‚P‚O
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ŽÀŽ¿Œ³–{Žc‚P‚O‚T
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ŽÀŽ¿–¢‰ñŽûŒ³–{Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|–¢’¥ŽûŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|–¢’¥Žû•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|–¢’¥Žû‡ŒvŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ŽÀŽ¿Œ³–{Žc‚P‚O‚Q
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñŒvã‘e—˜
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|–@’è’èŠzž‹pŠzŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|–@’è’è—¦ž‹pŠzŽc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Š¨’èˆ—ƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚T‚P‚S|‰ð–ñŽd–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚T‚P‚S|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚T‚P‚S|“ü‹à’âŽ~“ú  PIC  X(008).
           03  ‚c‚T‚P‚S|Ž©ŽÐ•ªŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Ž©ŽÐ•ªŒŽŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Ž©ŽÐ•ªŒ_–ñ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Ž©ŽÐ•ªÁ”ïÅ‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|Ž©ŽÐ•ªŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ÅVŒŽŠz—¿‹à‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ÅVÁ”ïÅŠz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ÅVŒ_–ñ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ÅVÁ”ïÅ‘Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ŽŸ‰ñÄƒŠ[ƒX—¿‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ŽŸ‰ñÄƒŠ[ƒX—¿Á”ïÅ‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ÅVŽæ“¾‰¿Šz‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|ÅVŽæ“¾‰¿ŠzÁ”ïÅ‘Šz•ª
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñˆÈ~—˜‘§‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñˆÈ~—˜‘§‡Œv”„ã
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|‰ð–ñˆÈ~’²’B—˜‘§”„ã
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚P‚S|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚S|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚S|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚T‚P‚S|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚T‚P‚S|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚T‚P‚S|XVŽÒ      PIC  X(008).
           03  ‚c‚T‚P‚S|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
