      *****************************************************************
      *   ”„‹pŒ©Ï(D52BAM_TBL)
      *****************************************************************
       01  ”„‹pŒ©Ï.
           03  ‚c‚T‚Q|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚T‚Q|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚T‚Q|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚T‚Q|ˆ•ªæƒR[ƒh  PIC  X(005).
           03  ‚c‚T‚Q|”„‹p“ú        PIC  X(008).
           03  ‚c‚T‚Q|”„‹p‘ã        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q|”„‹p‘ãÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q|”„‹p‘ãÁ”ïÅ—¦
                                     PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚T‚Q|”„‹p‘ãÁ”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚T‚Q|”„‹p‘ã‰ñŽû“ú  PIC  X(008).
           03  ‚c‚T‚Q|ˆø“næ‹æ•ª    PIC  X(001).
           03  ‚c‚T‚Q|”„‹pˆÏ‘õŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q|ˆøŽæ•‰’S‹æ•ª  PIC  X(001).
           03  ‚c‚T‚Q|ˆøŽæ”ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q|””ï—pÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚T‚Q|Œ©ÏŒˆ’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚T‚Q|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚Q|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚Q|XVŽÒ        PIC  X(008).
           03  ‚c‚T‚Q|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚T‚Q|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚T‚Q|“o˜^’S“–ŽÒ    PIC  X(008).
           03  ‚c‚T‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
