      *****************************************************************
      *   •ÛŽç—¿Â–±ŽæˆøŽc‚ƒe[ƒuƒ‹(D602SHR_TBL)
      *****************************************************************
       01  •ÛŽç—¿Â–±ŽæˆøŽc‚ƒe[ƒuƒ‹.
           03  ‚c‚U‚O‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚O‚Q|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚O‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚O‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC  X(002).
           03  ‚c‚U‚O‚Q|Žx•¥Ží—Þ    PIC  X(002).
           03  ‚c‚U‚O‚Q|’S“–•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚O‚Q|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O‚Q|‘OŒŽ–––¢•¥Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O‚Q|“–ŒŽŽx•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O‚Q|“–ŒŽ–––¢•¥‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚O‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚O‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚O‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚O‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚O‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚O‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
