      *****************************************************************
      *   Žx•¥ŽèŒ`ŠÇ—”Ô†Ì”Ô(D603SAI_TBL)
      *****************************************************************
       01  Žx•¥ŽèŒ`ŠÇ—”Ô†Ì”Ô.
           03  ‚c‚U‚O‚R|“K—pŠJŽn“ú  PIC  X(008).
           03  ‚c‚U‚O‚R|˜A”Ô        PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚U‚O‚R|”­sŒ`Ž®    PIC  X(001).
           03  ‚c‚U‚O‚R|‰ïŒv”N“x    PIC  X(002).
           03  ‚c‚U‚O‚R|”N“x•Êˆê˜A”Ô†
                                     PIC  X(005).
           03  ‚c‚U‚O‚R|•ªŠ„”Ô†    PIC  X(001).
