      *****************************************************************
      *   Žx•¥(D60SHR_TBL)
      *****************************************************************
       01  Žx•¥.
           03  ‚c‚U‚O|ŽæˆøæƒR[ƒh  PIC  X(009).
           03  ‚c‚U‚O|Žx•¥æƒR[ƒh  PIC  X(005).
           03  ‚c‚U‚O|Œ_–ñ”Ô†      PIC  X(010).
           03  ‚c‚U‚O|ÄƒŠ[ƒX‰ñ”  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚O|Œ_–ñŽí—Þ      PIC  X(003).
           03  ‚c‚U‚O|Žx•¥Ží—Þ      PIC  X(002).
           03  ‚c‚U‚O|”ƒŠ|˜A”Ô      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚O|˜A”Ô          PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚U‚O|ŽèŒ`•ªŠ„˜A”Ô  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚O|”„ã”NŒŽ      PIC  X(006).
           03  ‚c‚U‚O|Žx•¥—\’è“ú    PIC  X(008).
           03  ‚c‚U‚O|ˆø“n”NŒŽ“ú    PIC  X(008).
           03  ‚c‚U‚O|Žx•¥‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Žx•¥‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|‘ŠŽEŒ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚U‚O|‘ŠŽE‹àŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Žè”—¿•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚O|’S“–•”‰ÛƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚O|’S“–ŽÒƒR[ƒh  PIC  X(008).
           03  ‚c‚U‚O|Žx•¥ˆË—Š“ú    PIC  X(008).
           03  ‚c‚U‚O|Žx•¥ŽwŽ¦“ú    PIC  X(008).
           03  ‚c‚U‚O|Žx•¥³”F“ú    PIC  X(008).
           03  ‚c‚U‚O|Žx•¥”NŒŽ“ú    PIC  X(008).
           03  ‚c‚U‚O|‹âsƒR[ƒh    PIC  X(004).
           03  ‚c‚U‚O|Žx“XƒR[ƒh    PIC  X(003).
           03  ‚c‚U‚O|ŒûÀŽí•ÊƒR[ƒh
                                     PIC  X(001).
           03  ‚c‚U‚O|ŒûÀ”Ô†      PIC  X(010).
           03  ‚c‚U‚O|–¼‹`l        PIC  X(030).
           03  ‚c‚U‚O|ó‘Ôƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚U‚O|Žx•¥•û–@      PIC  X(001).
           03  ‚c‚U‚O|UžŽè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|ŽÀÛŽx•¥Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|ŽÀÛŽx•¥ŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Á”ïÅ•â³Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Žx•¥‘‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|ˆË—Šˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚U‚O|ŽwŽ¦ˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚U‚O|³”Fˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚U‚O|Žx•¥ˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚U‚O|Žx•¥ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚U‚O|ˆø“nˆ—”NŒŽ  PIC  X(006).
           03  ‚c‚U‚O|ŒÚ‹qƒR[ƒh    PIC  X(009).
           03  ‚c‚U‚O|•ªŠ„Œ³˜A”Ô    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚U‚O|Žx•¥—\’è“ú‚Q  PIC  X(008).
           03  ‚c‚U‚O|Uo“ú        PIC  X(008).
           03  ‚c‚U‚O|ŽóŽæ•û–@      PIC  X(001).
           03  ‚c‚U‚O|˜A—æ        PIC  X(060).
           03  ‚c‚U‚O|ˆË—Š”Ô†      PIC S9(010) PACKED-DECIMAL.
           03  ‚c‚U‚O|Œo—’÷ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚U‚O|Œo—’÷Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|•â³ŠzŒvãˆ—”NŒŽ“ú
                                     PIC  X(008).
           03  ‚c‚U‚O|“Á•Êˆ—‹æ•ª  PIC  X(001).
           03  ‚c‚U‚O|XV”NŒŽ“ú    PIC  X(008).
           03  ‚c‚U‚O|XVŽžŠÔ      PIC  X(008).
           03  ‚c‚U‚O|XVŽÒ        PIC  X(008).
           03  ‚c‚U‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚O|“–‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚O|“–‰Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚O|“–‰Žx•¥Ží—Þ  PIC  X(002).
           03  ‚c‚U‚O|“–‰Œ_–ñ”Ô†  PIC  X(010).
           03  ‚c‚U‚O|“–‰ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚O|“–‰˜A”Ô      PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚U‚O|–ñ’èŽx•¥“ú    PIC  X(008).
           03  ‚c‚U‚O|˜A—æ“d˜b”Ô†
                                     PIC  X(015).
           03  ‚c‚U‚O|Á”ïÅ—¦      PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚O|Á”ïÅ—¦‹æ•ª  PIC  X(002).
           03  ‚c‚U‚O|Žx•¥ŠzŒŽŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Žx•¥‹àŠzÁ”ïÅŒŽŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Ž©“®³”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚O|Žx•¥ˆË—ŠƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚U‚O|ŽèŒ`•ªŠ„‹àŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|ŽèŒ`•ªŠ„—}Ž~‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚O|ƒRƒƒ“ƒg      PIC  X(040).
           03  ‚c‚U‚O|ŽóŽæŽè”—¿    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|ŽóŽæŽè”—¿Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Žx•¥ˆË—Š³”F“ú
                                     PIC  X(008).
           03  ‚c‚U‚O|Žx•¥ˆË—ŠŠm’è“ú
                                     PIC  X(008).
           03  ‚c‚U‚O|ˆË—Š³”Fˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚U‚O|ˆË—ŠŠm’èˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚U‚O|“ü‹àŠm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚O|¿‹‘Šm”Fƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚O|Žx•¥ˆË—ŠŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚U‚O|Žx•¥ŽwŽ¦ŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚U‚O|Žx•¥³”FŽæÁ“ú
                                     PIC  X(008).
           03  ‚c‚U‚O|Žx•¥ŽæÁ“ú    PIC  X(008).
           03  ‚c‚U‚O|‹x“ú‘Î‰ž‹æ•ª  PIC  X(001).
           03  ‚c‚U‚O|Žx•¥‹àŠzÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Žè”—¿‘ŠŽE‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|Žè”—¿‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚O|–³Œøƒtƒ‰ƒO    PIC  X(001).
           03  ‚c‚U‚O|ŽæÁÄˆË—Š‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚O|ŽdŒü‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚U‚O|ŽdŒüŽx“XƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚O|ŽdŒüŒûÀŽí—Þ  PIC  X(001).
           03  ‚c‚U‚O|ŽdŒüŒûÀ”Ô†  PIC  X(010).
           03  ‚c‚U‚O|ŽdŒü–¼‹`l    PIC  X(030).
           03  ‚c‚U‚O|“o˜^”NŒŽ“ú    PIC  X(008).
           03  ‚c‚U‚O|“o˜^ŽžŠÔ      PIC  X(008).
           03  ‚c‚U‚O|“o˜^’S“–ŽÒ    PIC  X(008).
