      *****************************************************************
      *   Œ_–ñŠÖ˜A’ •[”­sŠÇ—ƒe[ƒuƒ‹(D631KEC_TBL)
      *****************************************************************
       01  Œ_–ñŠÖ˜A’ •[”­sŠÇ—ƒe[ƒuƒ‹.
           03  ‚c‚U‚R‚P|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚R‚P|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚R‚P|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚R‚P|’¥‹ŠÇ—Ží—Þ
                                     PIC  X(001).
           03  ‚c‚U‚R‚P|Œ_–ñŠÖ˜A‘—ÞŽí—Þ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚R‚P|w“üŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚R‚P|w“üæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚R‚P|•¨Œˆ•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚R‚P|‘—Þ˜A”Ô|’¥‹‘—Þ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚R‚P|”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚R‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚R‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚R‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚R‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚R‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚R‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚R‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
