      *****************************************************************
      *   •¨Œˆ•ªŠÖ˜A’ •[”­sŠÇ—ƒe[ƒuƒ‹(D633BUC_TBL)
      *****************************************************************
       01  •¨Œˆ•ªŠÖ˜A’ •[”­sŠÇ—ƒe[ƒuƒ‹.
           03  ‚c‚U‚R‚R|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚R‚R|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚R‚R|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚R‚R|•¨Œˆ•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚R‚R|•¨Œˆ•ª˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚R‚R|”„‹p—p”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚R‚R|”pŠü—p”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚R‚R|•´Ž¸—p”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚R‚R|ƒ\ƒtƒg—p”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚R‚R|‚»‚Ì‘¼—p”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚R‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚R‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚R‚R|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚R‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚R‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚R‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚R‚R|“o˜^’S“–ŽÒ  PIC  X(008).
