      *****************************************************************
      *   ’ñŒgƒŠ[ƒX–ž—¹‚r‚e‚bŒ_–ñŠî–{(D662MSK_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX–ž—¹‚r‚e‚bŒ_–ñŠî–{.
           03  ‚c‚U‚U‚Q|‚r‚e‚bŒ_–ñ”Ô†
                                     PIC  X(012).
           03  ‚c‚U‚U‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚U‚Q|XV‹æ•ª    PIC  X(001).
           03  ‚c‚U‚U‚Q|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚U‚U‚Q|–ž—¹ˆ—“ú  PIC  X(008).
           03  ‚c‚U‚U‚Q|ÄƒŠ[ƒXˆ—Œ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚U‚U‚Q|”„‹pˆ—Œ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚U‚U‚Q|”pŠüˆ—Œ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚U‚U‚Q|“]ƒŠ[ƒX’ñŒgæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚U‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚Q|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚Q|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚Q|‚r‚e‚bŽx“XƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚U‚U‚Q|‚r‚e‚bŽx“X–¼
                                     PIC  X(060).
           03  ‚c‚U‚U‚Q|Ý’uêŠ–¼  PIC  X(080).
           03  ‚c‚U‚U‚Q|ÄƒŠ[ƒX—¿‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚Q|ÄƒŠ[ƒXÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚Q|‚r‚e‚bÝ’uêŠ–¼
                                     PIC  X(025).
           03  ‚c‚U‚U‚Q|‚r‚e‚bÄƒŠ[ƒX—¿‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚Q|‚r‚e‚bÄƒŠ[ƒXÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚Q|V‚r‚e‚bŒ_–ñ”Ô†
                                     PIC  X(012).
           03  ‚c‚U‚U‚Q|ÄƒŠ[ƒXŠúŠÔ
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚Q|”„‹p‹àŠz‡Œv
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚Q|”„‹p‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚Q|•¨ŒƒŒƒR[ƒhŒ”
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚U‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚U‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚U‚Q|XV‰ñ”    PIC S9(003) PACKED-DECIMAL.
