      *****************************************************************
      *   ’ñŒgƒŠ[ƒX–ž—¹’ñŒgæ•¨Œ–¾×(D665MTB_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX–ž—¹’ñŒgæ•¨Œ–¾×.
           03  ‚c‚U‚U‚T|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚U‚T|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚P
                                     PIC  X(016).
           03  ‚c‚U‚U‚T|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚Q
                                     PIC  X(016).
           03  ‚c‚U‚U‚T|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚R
                                     PIC  X(016).
           03  ‚c‚U‚U‚T|ƒŠƒtƒ@ƒŒƒ“ƒX”Ô†‚S
                                     PIC  X(016).
           03  ‚c‚U‚U‚T|–ž—¹ˆ—Œ‹‰Ê
                                     PIC  X(001).
           03  ‚c‚U‚U‚T|•¨Œ–¼      PIC  X(060).
           03  ‚c‚U‚U‚T|”—Ê        PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|’PˆÊ        PIC  X(001).
           03  ‚c‚U‚U‚T|w“ü‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|•¨ŒƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|ÄƒŠ[ƒX—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|ÄƒŠ[ƒX—¿—¦
                                     PIC S9(001)V9(004) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚T|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|ÄƒŠ[ƒXˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|ÄƒŠ[ƒX•t•Û—¦
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|ÄŽc‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|”„‹pˆø“næ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚T|”„‹pˆø“næƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚T|”„‹pˆ•ªæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚T|”„‹pæ–¼|‘æ‚RŽÒ”„‹p
                                     PIC  X(040).
           03  ‚c‚U‚U‚T|”„‹p‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|”„‹pˆÏ‘õŽè”—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|”pŠüˆø“næ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚T|”pŠüˆø“næƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚T|”pŠüˆ•ªæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚T|ˆøŽæ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚T|ˆøŽæ”ï—p    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|w“ü‹àŠz“à–ó|ÄƒŠ[ƒX
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|w“ü‹àŠz“à–ó|”„‹p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|w“ü‹àŠz“à–ó|”pŠü
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|”—Ê“à–ó|ÄƒŠ[ƒX
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|”—Ê“à–ó|”„‹p
                                     PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚U‚U‚T|”—Ê“à–ó|”pŠü
                                     PIC S9(005) PACKED-DECIMAL.
