      *****************************************************************
      *   ’ñŒgƒŠ[ƒX¿‹‘ƒe[ƒuƒ‹(D668SEQ_TBL)
      *****************************************************************
       01  ’ñŒgƒŠ[ƒX¿‹‘ƒe[ƒuƒ‹.
           03  ‚c‚U‚U‚W|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚U‚U‚W|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚U‚U‚W|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Á”ïÅ—¦    PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚U‚U‚W|”„ã”NŒŽ    PIC  X(006).
           03  ‚c‚U‚U‚W|”„ãŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|”„ãÁ”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|”„ãÁ”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|ê—pƒVƒXƒeƒ€‹æ•ª
                                     PIC  X(003).
           03  ‚c‚U‚U‚W|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚U‚W|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚U‚U‚W|¿‹”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚W|¿‹Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|¿‹Á”ïÅ  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|¿‹Á”ïÅ•â³Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|‰ñŽû—\’è“ú  PIC  X(008).
           03  ‚c‚U‚U‚W|‰ñŽû”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚W|‰ñŽûŠz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|¿‹‘”­sÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚U‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚U‚U‚W|¿‹‘”­s“ú
                                     PIC  X(008).
           03  ‚c‚U‚U‚W|¿‹‘”Ô†  PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|–¢‰ñŽûŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚W|ˆÏ‘õ•ÛŽç—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|ˆÏ‘õ•ÛŽçÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|¿‹Œ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚U‚U‚W|‰ñŽû•û–@    PIC  X(001).
           03  ‚c‚U‚U‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚U‚W|Œo—‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Œo—’÷”„ãŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Œo—’÷”„ãÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|ŽèŒ`ŽóŽæƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚U‚U‚W|Ž©ŽÐ”„ãŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ”„ãŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|‘¼ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|‘¼ŽÐ‰ñŽûŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ¿‹Šz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ¿‹Á”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚U‚U‚W|Áž’Ê”Ô    PIC  X(011).
           03  ‚c‚U‚U‚W|—š—ð˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|”„ãÂŒ Žc  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ”„ãÂŒ Žc
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Œ³–{        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|—˜‘§        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|””ï—p      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Œ³–{Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐŒ³–{    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ—˜‘§    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐŒÅ’èŽ‘ŽYÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ“®‘•ÛŒ¯—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ””ï—p  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐˆÏ‘õ•ÛŽç—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ”„ãŒ³–{
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ”„ã—˜‘§
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ”„ãŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐŒ³–{Žc‚
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ•ªŽx•¥—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐŽÐ“à‹à—˜—˜‘§“K—p
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐŽÐ“à‹à—˜—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ•ªŽx•¥—˜‘§ˆê”Ê
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|‹à—˜        PIC S9(002)V9(008) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|•ÔÏ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚W|ŠúŠÔŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|ŠúŠÔ“ú”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|—˜‘§ŒvŽZŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚U‚U‚W|—˜‘§ŒvŽZI—¹“ú
                                     PIC  X(008).
           03  ‚c‚U‚U‚W|Ž©ŽÐ‰ñŽûŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Ž©ŽÐ‰ñŽûÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚U‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚U‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚U‚W|‰‰ñ“ü‹à“ú  PIC  X(008).
           03  ‚c‚U‚U‚W|‘O•¥[“–‹æ•ª
                                     PIC  X(001).
           03  ‚c‚U‚U‚W|¿‹‰ñ      PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚U‚U‚W|Áž”NŒŽ“ú  PIC  X(008).
