      *****************************************************************
      *   ’ñŒgƒƒjƒ…[Žæˆøæ•ÏŠ·ƒe[ƒuƒ‹(D686THN_TBL)
      *****************************************************************
       01  ’ñŒgƒƒjƒ…[Žæˆøæ•ÏŠ·ƒe[ƒuƒ‹.
           03  ‚c‚U‚W‚U|ƒƒjƒ…[ƒ{ƒ^ƒ“‚h‚c
                                     PIC  X(008).
           03  ‚c‚U‚W‚U|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚U‚W‚U|ê—pƒVƒXƒeƒ€‹æ•ª
                                     PIC  X(003).
           03  ‚c‚U‚W‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚U‚W‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚U‚W‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚U‚W‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚U‚W‚U|XVŽÒ      PIC  X(008).
