      *****************************************************************
      *   —ÝÏŽd–óƒ}ƒXƒ^(D713KRS_TBL)
      *****************************************************************
       01  —ÝÏŽd–óƒ}ƒXƒ^.
           03  ‚c‚V‚P‚R|Žæˆø”NŒŽ    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|“`•[”Ô†    PIC  X(012).
           03  ‚c‚V‚P‚R|“E—v‚P      PIC  X(010).
           03  ‚c‚V‚P‚R|Žd–óƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚P‚R|‹N•[•”–åƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚P‚R|‹N•[ŽÐˆõƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚R|³”FŽÐˆõƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚R|³”F“ú•t    PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|“ü—Í“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|Žæˆø“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|‚u‚`‚k‚t‚d“ú
                                     PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|‘ÝŽØ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚R|ŽæˆøæƒR[ƒh‚P
                                     PIC  X(009).
           03  ‚c‚V‚P‚R|ŽæˆøæƒR[ƒh‚Q
                                     PIC  X(005).
           03  ‚c‚V‚P‚R|Œvã•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚P‚R|s”Ô†      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚P‚R|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚P‚R|‚q‚d‚e‚m‚n  PIC  X(016).
           03  ‚c‚V‚P‚R|Á”ïÅ‰ÛÅ‹æ•ª
                                     PIC  X(003).
           03  ‚c‚V‚P‚R|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚R|•¼Ží        PIC  X(003).
           03  ‚c‚V‚P‚R|‹àŠz        PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|‚d‚wƒŒ[ƒg  PIC S9(003)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|‚e‚h‚w      PIC  X(001).
           03  ‚c‚V‚P‚R|‰~‰ÝŠ·ŽZŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|ŽnŠú        PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|IŠú        PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|—˜—¦        PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|•Ð—¼        PIC  X(001).
           03  ‚c‚V‚P‚R|‘OŒã        PIC  X(001).
           03  ‚c‚V‚P‚R|—˜—¦Šî”    PIC  X(001).
           03  ‚c‚V‚P‚R|“àŠO‹æ•ª    PIC  X(010).
           03  ‚c‚V‚P‚R|Žd–óŽí•Ê‹æ•Ê
                                     PIC  X(002).
           03  ‚c‚V‚P‚R|“E—v        PIC  X(050).
           03  ‚c‚V‚P‚R|‚a‚n‚s‚k˜AŒ‹‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚R|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚R|—\–ñ‚m‚n    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|W–ñ”Ô†    PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚R|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚R|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚R|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚P‚R|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚R|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚R|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚R|XVŽÒ      PIC  X(008).
