000010*****************************************************************
000020*   ”Ä—p‰ïŒvŽd–óƒ}ƒXƒ^i–¾×j(D714KHS_TBL)
000030*****************************************************************
000040 01  ”Ä—p‰ïŒvŽd–óƒ}ƒXƒ^|–¾×.
000050     03  ‚c‚V‚P‚S|“`•[”Ô†    PIC  X(012).
000060     03  ‚c‚V‚P‚S|s”Ô†      PIC  X(002).
000070     03  ‚c‚V‚P‚S|‘ÝŽØ‹æ•ª    PIC  X(001).
000080     03  ‚c‚V‚P‚S|Š¨’è‰È–ÚƒR[ƒh
000090                               PIC  X(006).
000100     03  ‚c‚V‚P‚S|ŒûÀ”Ô†    PIC  X(010).
000110     03  ‚c‚V‚P‚S|Œ_–ñ‚q‚d‚e‚m‚n
000120                               PIC  X(016).
000130     03  ‚c‚V‚P‚S|•¼Ží        PIC  X(003).
000140     03  ‚c‚V‚P‚S|‹àŠz        PIC S9(013)V9(002) PACKED-DECIMAL.
000150     03  ‚c‚V‚P‚S|Á”ïÅ‰ÛÅ‹æ•ª
000160                               PIC  X(003).
000170     03  ‚c‚V‚P‚S|Á”ïÅ—¦‹æ•ª
000180                               PIC  X(002).
000190     03  ‚c‚V‚P‚S|•”“X        PIC  X(004).
000200     03  ‚c‚V‚P‚S|Š·ŽZƒŒ[ƒg  PIC S9(003)V9(002) PACKED-DECIMAL.
000210     03  ‚c‚V‚P‚S|‰~‰ÝŠ·ŽZŠz  PIC S9(013) PACKED-DECIMAL.
000220     03  ‚c‚V‚P‚S|Š·ŽZ‚e‚h‚w  PIC  X(001).
000230     03  ‚c‚V‚P‚S|—\–ñ”Ô†    PIC  X(004).
000240     03  ‚c‚V‚P‚S|“E—v‚P      PIC  X(010).
000250     03  ‚c‚V‚P‚S|“E—v‚Q      PIC  X(034).
000260     03  ‚c‚V‚P‚S|ŽnŠú        PIC  X(008).
000270     03  ‚c‚V‚P‚S|IŠú        PIC  X(008).
000280     03  ‚c‚V‚P‚S|—˜—¦        PIC S9(002)V9(007) PACKED-DECIMAL.
000290     03  ‚c‚V‚P‚S|•Ð’[|—¼’[‹æ•ª
000300                               PIC  X(001).
000310     03  ‚c‚V‚P‚S|‘OŽæ|ŒãŽæ‹æ•ª
000320                               PIC  X(001).
000330     03  ‚c‚V‚P‚S|—˜‘§Šî”    PIC  X(001).
000340     03  ‚c‚V‚P‚S|ŽQlÁ”ïÅŠz
000350                               PIC S9(013) PACKED-DECIMAL.
