      *****************************************************************
      *   Ž©“®Žd–óQƒoƒbƒ`(D719JSB_TBL)
      *****************************************************************
       01  Ž©“®Žd–ó|ƒoƒbƒ`.
           03  ‚c‚V‚P‚X|Žd–óƒCƒxƒ“ƒg‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚X|Žd–óƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚P‚X|¿‹“à–óƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚V‚P‚X|“ü‹àŽd–ó’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚P‚X|ÁžŽd–ó’ZkƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚V‚P‚X|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚X|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚P‚X|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚V‚P‚X|o—ÍŒ³ƒvƒƒOƒ‰ƒ€‚h‚c
                                     PIC  X(008).
           03  ‚c‚V‚P‚X|‹N•[•”–åƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚P‚X|‹N•[ŽÐˆõƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚X|³”FŽÐˆõƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚X|³”F“ú•t    PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|“ü—Í“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|Žæˆø“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‚u‚`‚k‚t‚d“ú
                                     PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|ŽæˆøæƒR[ƒh‚P
                                     PIC  X(009).
           03  ‚c‚V‚P‚X|ŽæˆøæƒR[ƒh‚Q
                                     PIC  X(005).
           03  ‚c‚V‚P‚X|Œvã•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚P‚X|‚a‚n‚s‚k˜AŒ‹‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚X|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚P‚X|”„ãÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚X|Žd“üÁ”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚X|ŽóŽæŽè”—¿Á”ïÅ‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚P‚X|Á”ïÅŒvã‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚X|‘OŽóƒŠ[ƒX—¿‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚P‚X|—LŒø‹àŠzÝ’è”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚P      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚Q      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚R      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚S      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚T      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚U      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚V      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚W      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚X      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|‹àŠz‚P‚O    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚P‚X|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚X|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚X|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚P‚X|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚P‚X|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚P‚X|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚P‚X|XVŽÒ      PIC  X(008).
