      *****************************************************************
      *   —ÝÏŽd–óiæ“ú•t•ªjƒ}ƒXƒ^(D745KRH_TBL)
      *****************************************************************
       01  —ÝÏŽd–óiæ“ú•t•ªjƒ}ƒXƒ^.
           03  ‚c‚V‚S‚T|Žæˆø”NŒŽ    PIC S9(006) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|“`•[”Ô†    PIC  X(012).
           03  ‚c‚V‚S‚T|“E—v‚P      PIC  X(010).
           03  ‚c‚V‚S‚T|Žd–óƒR[ƒh  PIC  X(004).
           03  ‚c‚V‚S‚T|‹N•[•”–åƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚S‚T|‹N•[ŽÐˆõƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚S‚T|³”FŽÐˆõƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚S‚T|³”F“ú•t    PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|“ü—Í“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|Žæˆø“ú      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|‚u‚`‚k‚t‚d“ú
                                     PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|‘ÝŽØ‹æ•ª    PIC  X(001).
           03  ‚c‚V‚S‚T|ŽæˆøæƒR[ƒh‚P
                                     PIC  X(009).
           03  ‚c‚V‚S‚T|ŽæˆøæƒR[ƒh‚Q
                                     PIC  X(005).
           03  ‚c‚V‚S‚T|Œvã•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚S‚T|s”Ô†      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚S‚T|ŒûÀ”Ô†    PIC  X(010).
           03  ‚c‚V‚S‚T|‚q‚d‚e‚m‚n  PIC  X(016).
           03  ‚c‚V‚S‚T|Á”ïÅ‰ÛÅ‹æ•ª
                                     PIC  X(003).
           03  ‚c‚V‚S‚T|Á”ïÅ—¦‹æ•ª
                                     PIC  X(002).
           03  ‚c‚V‚S‚T|•¼Ží        PIC  X(003).
           03  ‚c‚V‚S‚T|‹àŠz        PIC S9(011)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|‚d‚wƒŒ[ƒg  PIC S9(003)V9(002) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|‚e‚h‚w      PIC  X(001).
           03  ‚c‚V‚S‚T|‰~‰ÝŠ·ŽZŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|ŽnŠú        PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|IŠú        PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|—˜—¦        PIC S9(002)V9(007) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|•Ð—¼        PIC  X(001).
           03  ‚c‚V‚S‚T|‘OŒã        PIC  X(001).
           03  ‚c‚V‚S‚T|—˜—¦Šî”    PIC  X(001).
           03  ‚c‚V‚S‚T|“àŠO‹æ•ª    PIC  X(010).
           03  ‚c‚V‚S‚T|Žd–óŽí•Ê‹æ•Ê
                                     PIC  X(002).
           03  ‚c‚V‚S‚T|“E—v        PIC  X(050).
           03  ‚c‚V‚S‚T|‚a‚n‚s‚k˜AŒ‹‘ÎÛ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚S‚T|ˆ—‹æ•ª    PIC  X(001).
           03  ‚c‚V‚S‚T|—\–ñ‚m‚n    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|W–ñ”Ô†    PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚V‚S‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚S‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚S‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚S‚T|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚S‚T|XVŽÒ      PIC  X(008).
