      *****************************************************************
      *   ¿‹ƒXƒPƒWƒ…[ƒ‹(D751SCH_TBL)
      *****************************************************************
       01  ¿‹ƒXƒPƒWƒ…[ƒ‹.
           03  ‚c‚V‚T‚P|ˆ—”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚T‚P|{ˆ—ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚T‚P|ˆ—Ïƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚V‚T‚P|¿‹‘”­sŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚V‚T‚P|¿‹‘”­sI—¹“ú
                                     PIC  X(008).
           03  ‚c‚V‚T‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚T‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚T‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚T‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚T‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚T‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚T‚P|“o˜^’S“–ŽÒ  PIC  X(008).
