      *****************************************************************
      *   ŒûUˆÄ“àQŒ_–ñ“à—e(D772KAK_TBL)
      *****************************************************************
       01  ŒûUˆÄ“à|Œ_–ñ“à—e.
           03  ‚c‚V‚V‚Q|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚V‚V‚Q|¿‹æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚V‚V‚Q|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚V‚V‚Q|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚V‚V‚Q|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚V‚V‚Q|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚V‚V‚Q|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚V‚V‚Q|‰‰ñŽx•¥ŒŽ  PIC  X(006).
           03  ‚c‚V‚V‚Q|ÅIŽx•¥ŒŽ  PIC  X(006).
           03  ‚c‚V‚V‚Q|Žx•¥Šz      PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚V‚Q|Žx•¥Ï‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚V‚Q|‘Žx•¥‰ñ”  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚V‚V‚Q|¿‹Œ–¼    PIC  X(060).
           03  ‚c‚V‚V‚Q|Œ_–ñæ–¼    PIC  X(080).
           03  ‚c‚V‚V‚Q|æ•ûŒ_–ñ”Ô†
                                     PIC  X(016).
           03  ‚c‚V‚V‚Q|•¨Œ”      PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚V‚V‚Q|ˆ—”NŒŽ    PIC  X(006).
           03  ‚c‚V‚V‚Q|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚V‚Q|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚V‚Q|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚V‚Q|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚V‚Q|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚V‚Q|XVŽÒ      PIC  X(008).
           03  ‚c‚V‚V‚Q|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚V‚V‚Q|Á”ïÅŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚V‚V‚Q|•Ï‘¥‹æ•ª    PIC  X(001).
