      *****************************************************************
      *   Š¨’è‰È–Ú—š—ðƒ}ƒXƒ^(D785KJR_TBL)
      *****************************************************************
       01  Š¨’è‰È–Ú—š—ðƒ}ƒXƒ^.
           03  ‚c‚V‚W‚T|Š¨’è‰È–ÚƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|ŽåŠÇ•”“XƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚V‚W‚T|Š¨’è‰È–Ú—˜—pŠJŽn“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚T|Š¨’è‰È–Ú—˜—pI—¹“ú
                                     PIC  X(008).
           03  ‚c‚V‚W‚T|Š¨’è‰È–Ú–¼Ì
                                     PIC  X(040).
           03  ‚c‚V‚W‚T|Š¨’è‰È–Ú—ªÌ
                                     PIC  X(016).
           03  ‚c‚V‚W‚T|Š¨’è‰È–ÚƒJƒi–¼Ì
                                     PIC  X(012).
           03  ‚c‚V‚W‚T|Š¨’è‰È–Ú‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|Š¨’è‰È–Ú‘ÝŽØ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|Žc‚ŒvŽZ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|Š¨’è‰È–Ú•ª—Þ
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|•â••ë‹æ•ª  PIC  X(002).
           03  ‚c‚V‚W‚T|à–±‰ïŒv—pWŒvæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|à–±‰ïŒv—p“]‘—æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|¤–@—pWŒvæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|¤–@—p“]‘—æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|ØŽæ˜AŒ‹—pWŒvæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|ØŽæ˜AŒ‹—p“]‘—æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|ØŽæ’P“Æ—pWŒvæƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|ØŽæ’P“Æ—p“]‘—æƒR[ƒh
                                     PIC  X(006).
           03  ‚c‚V‚W‚T|ŒûÀ”Ô†ŠÇ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|Š¨’è‰È–ÚÁ”ïÅ’[”ˆ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|Š¨’è‰È–ÚÁ”ïÅŠÇ—‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|Š¨’è‰È–ÚÁ”ïÅ—¦‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|‰È–Úƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚V‚W‚T|Æ‡ƒ^ƒCƒv  PIC  X(001).
           03  ‚c‚V‚W‚T|‚`‚k‚l˜AŒg‹æ•ª
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|‘«Žw’è      PIC  X(003).
           03  ‚c‚V‚W‚T|•½‹ÏŽc‚—v”Û
                                     PIC  X(001).
           03  ‚c‚V‚W‚T|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚T|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚T|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚V‚W‚T|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚V‚W‚T|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚V‚W‚T|XVƒtƒ‰ƒO  PIC  X(001).
