      *****************************************************************
      *   Ž©—pŽ‘ŽY(D810LSS_TBL)
      *****************************************************************
       01  Ž©—pŽ‘ŽY.
           03  ‚c‚W‚P‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚P‚O|Œ_–ñŽí—Þ    PIC  X(003).
           03  ‚c‚W‚P‚O|•¨Œ”Ô†    PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|‚eŒ^–¼      PIC  X(025).
           03  ‚c‚W‚P‚O|Žæ“¾”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|‰ð–ñ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|ˆÚ“®”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|”„”p”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|ó‘Ôƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚P‚O|‰ð–ñƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚P‚O|ˆÚ“®ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚P‚O|”„”pƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚P‚O|³Œpƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚P‚O|‰ð–ñ\¿ƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|‰ð–ñ——R    PIC  X(002).
           03  ‚c‚W‚P‚O|ˆÚ“®——R    PIC  X(002).
           03  ‚c‚W‚P‚O|”„”p——R    PIC  X(002).
           03  ‚c‚W‚P‚O|»‘¢ŽÒ–¼    PIC  X(060).
           03  ‚c‚W‚P‚O|Žæ“¾‰¿Šz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Žæ“¾Á”ïÅŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|‘ŠŽE‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|‘ŠŽE‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|‘ŠŽEŒ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚W‚P‚O|·ˆø‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|·ˆø‹àŠzÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Žc‰¿Ý’èŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Ž‘ŽYŽí—Þ    PIC  X(005).
           03  ‚c‚W‚P‚O|”—Ê        PIC S9(005) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|’PˆÊ        PIC  X(001).
           03  ‚c‚W‚P‚O|Å–@‹æ•ª    PIC  X(001).
           03  ‚c‚W‚P‚O|‘Ï—p”N”    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|•¨ŒŽí—Þ    PIC  X(002).
           03  ‚c‚W‚P‚O|“®‘•t•Û‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|ƒ\ƒtƒg‹æ•ª  PIC  X(001).
           03  ‚c‚W‚P‚O|­ŠzŽ‘ŽY‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|’†ŒÃŽ‘ŽY‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|‰ïŽÐž‹p‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|ŒÅ’èŽ‘ŽYÅ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|M—p•ÛŒ¯‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|‹@ŠB—Þ•ª—ÞƒR[ƒh
                                     PIC  X(002).
           03  ‚c‚W‚P‚O|ƒfƒB[ƒ‰ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚P‚O|ƒfƒB[ƒ‰ƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚P‚O|Žx•¥ƒTƒCƒg  PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Žx•¥“ú      PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Žx•¥•û–@    PIC  X(001).
           03  ‚c‚W‚P‚O|ŽèŒ`ƒTƒCƒg  PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|”[•tæƒR[ƒh
                                     PIC  X(011).
           03  ‚c‚W‚P‚O|ZŠ‚Q      PIC  X(060).
           03  ‚c‚W‚P‚O|ZŠ‚R      PIC  X(060).
           03  ‚c‚W‚P‚O|•¨ŒƒŠ[ƒX—¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|‹ŒŒ_–ñ”Ô†  PIC  X(015).
           03  ‚c‚W‚P‚O|‹Œ•¨Œ”Ô†  PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ˆ•ªæŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚P‚O|ˆ•ªæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚P‚O|”„‹p‘ã‹à    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|”„‹p‘ã‰ñŽû“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚O|”„‹p‘ã‰ñŽû•û–@
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|•ÛŒ¯Ž–ŒÌƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|•ÛŒ¯Ž–ŒÌ‰ñ”
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Ž–ŒÌ”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|Ž–ŒÌ‘ä”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ƒ†[ƒUŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|“–ŽÐŒü’lˆøŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|•ªŠ„”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|’èŠz|ŒŽŠzž‹p”ï
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|’èŠz|ŒŽŠzž‹p”ï’[”
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Œ©Ï•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ÄƒŠ[ƒX—\’èƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|ÄƒŠ[ƒX—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ÄƒŠ[ƒXŽc‰¿
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|‹Œ•¨Œ—¿‹à  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|‹ŒŽc‰¿Ý’èŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Ž©‘¼ŽÐ‹æ•ª  PIC  X(001).
           03  ‚c‚W‚P‚O|ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚P‚O|Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚P‚O|Ý’uêŠƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚P‚O|•ÛŒ¯‰ïŽÐ‹æ•ª
                                     PIC  X(004).
           03  ‚c‚W‚P‚O|’è‰¿        PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ƒŒƒ“ƒ^ƒ‹”{—¦
                                     PIC S9(002)V9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ƒŒƒ“ƒ^ƒ‹—¿  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|”„”pƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚O|”„”pˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|”„”pŽæÁ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|”„”pŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚O|”„”pŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|‰ð–ñˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|‰ð–ñŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|’™‘ •i•]‰¿Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|³ŒpŒ³Œ_–ñ”Ô†
                                     PIC  X(015).
           03  ‚c‚W‚P‚O|³ŒpŒ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|³Œp”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|³Œpˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|ˆ•ª—\’è    PIC  X(001).
           03  ‚c‚W‚P‚O|–ž—¹ƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚O|–ž—¹ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|–ž—¹ŽæÁƒGƒ“ƒgƒŠ“ú
                                     PIC  X(008).
           03  ‚c‚W‚P‚O|–ž—¹ŽæÁˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|‰ð–ñ‹æ•ª    PIC  X(001).
           03  ‚c‚W‚P‚O|”„”p‹æ•ª    PIC  X(001).
           03  ‚c‚W‚P‚O|‹¦’²ŽæˆøæƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚P‚O|‹¦’²Žx•¥æƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚P‚O|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚O|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚P‚O|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|’™‘ •i‹æ•ª  PIC  X(001).
           03  ‚c‚W‚P‚O|Žæ“¾ŠzŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|ƒŠ[ƒX—¿ŠÛ‚ß’PˆÊ
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|•ªŠ„Œ³•¨Œ”Ô†
                                     PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|•ªŠ„ˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|ˆÏ‘õ•ÛŽç—¿Žx•¥‘Šz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|HŽ–”ï“™‘gž‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|HŽ–”ï“™    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ŠCŠOÝ’uêŠ‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|•ÛØ‰ïŽÐ    PIC  X(009).
           03  ‚c‚W‚P‚O|•¨Œ–¼Ì    PIC  X(060).
           03  ‚c‚W‚P‚O|³Œp“ñŽŸÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|‘¼ŽÐw“üŠz  PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ˆÏ‘õ•ÛŽç‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|ˆÏ‘õ•ÛŽç—¿ŒŽŠz—¿‹à
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|•¨Œˆ•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚P‚O|—X•Ö”Ô†    PIC  X(007).
           03  ‚c‚W‚P‚O|•¨Œˆ•ª˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Œ©Ï|Œ©Ï”Ô†|’S“–ŽÒ
                                     PIC  X(002).
           03  ‚c‚W‚P‚O|Œ©Ï|Œ©Ï”Ô†|˜A”Ô
                                     PIC S9(007) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|Œ©Ï|•¨Œ”Ô†
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|“ñŽŸŒ_–ñ—\–ñƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚W‚P‚O|“o˜^”Ô†    PIC  X(008).
           03  ‚c‚W‚P‚O|ž‹pŒŽ”    PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚O|ŒŸŽûˆ—”NŒŽ
                                     PIC  X(006).
           03  ‚c‚W‚P‚O|“o˜^ƒtƒ‰ƒO  PIC  X(001).
           03  ‚c‚W‚P‚O|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚O|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚O|“o˜^’S“–ŽÒ  PIC  X(008).
