      *****************************************************************
      *   •¨Œˆ•ªŒˆÙ(D816BSK_TBL)
      *****************************************************************
       01  •¨Œˆ•ªŒˆÙ.
           03  ‚c‚W‚P‚U|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚P‚U|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚U|\¿˜A”Ô    PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚P‚U|•¨Œˆ•ª‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚U|•¨Œˆ•ª˜A”Ô
                                     PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚W‚P‚U|ˆøŽæ•‰’S‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚P‚U|ˆ—•û–@    PIC  X(001).
           03  ‚c‚W‚P‚U|‘æŽOŽÒ‹ÆŽÒ–¼
                                     PIC  X(080).
           03  ‚c‚W‚P‚U|‘æŽOŽÒ¸’è‰¿Ši
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚P‚U|”„‹pæŽí—Þ  PIC  X(001).
           03  ‚c‚W‚P‚U|”„‹pæÚ×  PIC  X(040).
           03  ‚c‚W‚P‚U|³”F‹æ•ª    PIC  X(001).
           03  ‚c‚W‚P‚U|³”F“ú      PIC  X(008).
           03  ‚c‚W‚P‚U|‘ÎÛ€–Ú‚P  PIC  X(001).
           03  ‚c‚W‚P‚U|‘ÎÛ€–Ú‚Q  PIC  X(001).
           03  ‚c‚W‚P‚U|‘ÎÛ€–Ú‚R  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚P  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚Q  PIC  X(001).
           03  ‚c‚W‚P‚U|Šm”FŽ–€‚P  PIC  X(060).
           03  ‚c‚W‚P‚U|Šm”FŽ–€‚Q  PIC  X(060).
           03  ‚c‚W‚P‚U|Šm”FŽ–€‚R  PIC  X(060).
           03  ‚c‚W‚P‚U|Šm”FŽ–€‚S  PIC  X(060).
           03  ‚c‚W‚P‚U|Šm”FŽ–€‚T  PIC  X(060).
           03  ‚c‚W‚P‚U|‰c‹ÆˆÓŒ©—“‚P
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|‰c‹ÆˆÓŒ©—“‚Q
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|‰c‹ÆˆÓŒ©—“‚R
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|‰c‹ÆˆÓŒ©—“‚S
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|‰c‹ÆˆÓŒ©—“‚T
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|³”FˆÓŒ©—“‚P
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|³”FˆÓŒ©—“‚Q
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|³”FˆÓŒ©—“‚R
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|³”FˆÓŒ©—“‚S
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|³”FˆÓŒ©—“‚T
                                     PIC  X(060).
           03  ‚c‚W‚P‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚P‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚P‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚P‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚P‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚W‚P‚U|ŽcƒŠ[ƒX—¿‘Š“–Šz”„‹p
                                     PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚R  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚S  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚T  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚U  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚V  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚W  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚X  PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚P‚O
                                     PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚P‚P
                                     PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚P‚Q
                                     PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚P‚R
                                     PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚P‚S
                                     PIC  X(001).
           03  ‚c‚W‚P‚U|’¥Žû‘—Þ‚P‚T
                                     PIC  X(001).
