      *****************************************************************
      *   ”ñ‰Ò“®Ž‘ŽY‰ñŽûU‘Ö(D856HSK_TBL)
      *****************************************************************
       01  ”ñ‰Ò“®Ž‘ŽY‰ñŽûU‘Ö.
           03  ‚c‚W‚T‚U|—^MŠÇ—æƒR[ƒh
                                     PIC  X(009).
           03  ‚c‚W‚T‚U|Œ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚T‚U|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚T‚U|Žæˆø”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚U|˜A”Ô        PIC S9(004) PACKED-DECIMAL.
           03  ‚c‚W‚T‚U|ŽåŒ_–ñ‹æ•ª  PIC  X(001).
           03  ‚c‚W‚T‚U|‰ñŽûU‘Ö‹æ•ª
                                     PIC  X(002).
           03  ‚c‚W‚T‚U|‰ñŽûU‘Ö”õl
                                     PIC  X(040).
           03  ‚c‚W‚T‚U|‰ñŽûU‘Ö‹àŠz
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚U|‰ñŽûU‘ÖÁ”ïÅ
                                     PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚T‚U|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚U|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚U|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚T‚U|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚U|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚U|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚T‚U|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
