      *****************************************************************
      *   Žž‹N“®ŠÇ—(D858ZKD_TBL)
      *****************************************************************
       01  Žž‹N“®ŠÇ—.
           03  ‚c‚W‚T‚W|ŠÇ——^M‹N“®ŠÇ—‹æ•ª
                                     PIC  X(006).
           03  ‚c‚W‚T‚W|ŠÇ——^MŽž‹N“®‹æ•ª
                                     PIC  X(001).
           03  ‚c‚W‚T‚W|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚W|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚W|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚T‚W|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚T‚W|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚T‚W|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚T‚W|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
