      *****************************************************************
      *   ÂŒ —¬“®‰»Šî–{(D860SRK_TBL)
      *****************************************************************
       01  ÂŒ —¬“®‰»Šî–{.
           03  ‚c‚W‚U‚O|—¬“®‰»”Ô†  PIC  X(006).
           03  ‚c‚W‚U‚O|Œ_–ñ”Ô†    PIC  X(010).
           03  ‚c‚W‚U‚O|ÄƒŠ[ƒX‰ñ”
                                     PIC S9(002) PACKED-DECIMAL.
           03  ‚c‚W‚U‚O|—¬“®‰»æ    PIC  X(007).
           03  ‚c‚W‚U‚O|—¬“®‰»æ–¼Ì
                                     PIC  X(080).
           03  ‚c‚W‚U‚O|M‘õæÝ’è“ú
                                     PIC  X(008).
           03  ‚c‚W‚U‚O|M‘õI—¹“ú  PIC  X(008).
           03  ‚c‚W‚U‚O|ŽæˆøæƒR[ƒh
                                     PIC  X(007).
           03  ‚c‚W‚U‚O|Œ_–ñæƒR[ƒh
                                     PIC  X(003).
           03  ‚c‚W‚U‚O|Œ_–ñæ–¼    PIC  X(080).
           03  ‚c‚W‚U‚O|ŽåŒ_–ñ‹æ•ª  PIC  X(003).
           03  ‚c‚W‚U‚O|Œ_–ñŠJŽn“ú  PIC  X(008).
           03  ‚c‚W‚U‚O|Œ_–ñI—¹“ú  PIC  X(008).
           03  ‚c‚W‚U‚O|Œ_–ñ‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚U‚O|ÂŒ Žc‚    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚U‚O|ÂŒ —¬“®‰»‹æ•ª
                                     PIC  X(010).
           03  ‚c‚W‚U‚O|ÂŒ —¬“®‰»XV‹æ•ª
                                     PIC  X(010).
           03  ‚c‚W‚U‚O|·“ü—\–ñ‹æ•ª
                                     PIC  X(010).
           03  ‚c‚W‚U‚O|—¬“®‰»æŒ_–ñæƒR[ƒh
                                     PIC  X(005).
           03  ‚c‚W‚U‚O|“o˜^”NŒŽ“ú  PIC  X(010).
           03  ‚c‚W‚U‚O|“o˜^ŽžŠÔ    PIC  X(010).
           03  ‚c‚W‚U‚O|“o˜^’S“–ŽÒ  PIC  X(010).
           03  ‚c‚W‚U‚O|XV”NŒŽ“ú  PIC  X(010).
           03  ‚c‚W‚U‚O|XVŽžŠÔ    PIC  X(010).
           03  ‚c‚W‚U‚O|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(010).
           03  ‚c‚W‚U‚O|XVŽÒ      PIC  X(010).
