      *****************************************************************
      *   ŒûUƒXƒe[ƒ^ƒX(D871KFS_TBL)
      *****************************************************************
       01  ŒûUƒXƒe[ƒ^ƒX.
           03  ‚c‚W‚V‚P|U‘Ö‹âsƒR[ƒh
                                     PIC  X(004).
           03  ‚c‚W‚V‚P|–ñ’è”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚V‚P|U‘Ö“ú      PIC  X(008).
           03  ‚c‚W‚V‚P|–ñ’è“ú      PIC  X(002).
           03  ‚c‚W‚V‚P|ì¬“ú      PIC  X(008).
           03  ‚c‚W‚V‚P|ŒûUƒXƒe[ƒ^ƒX
                                     PIC  X(001).
           03  ‚c‚W‚V‚P|‹âs”      PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚W‚V‚P|¿‹Œ”    PIC S9(008) PACKED-DECIMAL.
           03  ‚c‚W‚V‚P|¿‹‹àŠz    PIC S9(013) PACKED-DECIMAL.
           03  ‚c‚W‚V‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚V‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚V‚P|“o˜^’S“–ŽÒ  PIC  X(008).
           03  ‚c‚W‚V‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚W‚V‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚W‚V‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚W‚V‚P|•ÏXÏƒtƒ‰ƒO
                                     PIC  X(001).
           03  ‚c‚W‚V‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
