      *****************************************************************
      *   Š¥“ª–¢•\Ž¦ƒ}ƒXƒ^(D991KAN_TBL)
      *****************************************************************
       01  Š¥“ª–¢•\Ž¦ƒ}ƒXƒ^.
           03  ‚c‚X‚X‚P|˜A”Ô        PIC S9(003) PACKED-DECIMAL.
           03  ‚c‚X‚X‚P|Š¥“ª        PIC  X(010).
           03  ‚c‚X‚X‚P|XV”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚X‚P|XVŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚X‚P|XVŽÒ      PIC  X(008).
           03  ‚c‚X‚X‚P|“ü—Í’S“–ŽÒƒR[ƒh
                                     PIC  X(008).
           03  ‚c‚X‚X‚P|“o˜^”NŒŽ“ú  PIC  X(008).
           03  ‚c‚X‚X‚P|“o˜^ŽžŠÔ    PIC  X(008).
           03  ‚c‚X‚X‚P|“o˜^’S“–ŽÒ  PIC  X(008).
