000010************************************************
000020* (DFS_ADDMST)
000030************************************************
000040 01  DFS_ADDMST-PAYNUM PIC  X(008).
000050 01  DFS_ADDMST-CSTNUM PIC  X(012).
000060 01  DFS_ADDMST-PAYDAY PIC  X(002).
000070 01  DFS_ADDMST-BNKCOD PIC  X(004).
000080 01  DFS_ADDMST-BNKNAM PIC  X(015).
000090 01  DFS_ADDMST-BRCCOD PIC  X(003).
000100 01  DFS_ADDMST-BRCNAM PIC  X(015).
000110 01  DFS_ADDMST-DEPKND PIC  X(001).
000120 01  DFS_ADDMST-DEPNUM PIC  X(007).
000130 01  DFS_ADDMST-CSTNAM PIC  X(030).
000140 01  DFS_ADDMST-TRNAMT PIC S9(010) COMP-3.
000150 01  DFS_ADDMST-CONTAX PIC S9(005) COMP-3.
