000010************************************************
000020* (DFS_ADDLST)
000030************************************************
000040 01  DFS_ADDLST-PAYNUM PIC  X(008).
000050 01  DFS_ADDLST-CSTNUM PIC  X(012).
000060 01  DFS_ADDLST-PAYDAY PIC  X(002).
000070 01  DFS_ADDLST-BNKCOD PIC  X(004).
000080 01  DFS_ADDLST-BNKNAM PIC  X(015).
000090 01  DFS_ADDLST-BRCCOD PIC  X(003).
000100 01  DFS_ADDLST-BRCNAM PIC  X(015).
000110 01  DFS_ADDLST-DEPKND PIC  X(001).
000120 01  DFS_ADDLST-DEPNUM PIC  X(007).
000130 01  DFS_ADDLST-CSTNAM PIC  X(030).
000140 01  DFS_ADDLST-TRNAMT PIC S9(010) COMP-3.
000150 01  DFS_ADDLST-CONTAX PIC S9(005) COMP-3.
