000010************************************************
000020* (DFS_CNVLST)
000030************************************************
000040 01  DFS_CNVLST-PAYNUM PIC  X(008).
000050 01  DFS_CNVLST-CSTNAM PIC  X(030).
000060 01  DFS_CNVLST-REGDAY PIC  X(008).
000070 01  DFS_CNVLST-REGTIM PIC  X(006).
000080 01  DFS_CNVLST-REGPSN PIC  X(004).
000090 01  DFS_CNVLST-MODDAY PIC  X(008).
000100 01  DFS_CNVLST-MODTIM PIC  X(006).
000110 01  DFS_CNVLST-MODPSN PIC  X(004).
