000010************************************************
000020* (DFS_HEADER)
000030************************************************
000040 01  DFS_HEADER-DATTYP PIC  X(001).
000050 01  DFS_HEADER-TRNCOD PIC  X(002).
000060 01  DFS_HEADER-CODTYP PIC  X(001).
000070 01  DFS_HEADER-CONSIG PIC  X(010).
000080 01  DFS_HEADER-CONNAM PIC  X(040).
000090 01  DFS_HEADER-TRNDAY PIC  X(004).
000100 01  DFS_HEADER-BNKCOD PIC  X(004).
000110 01  DFS_HEADER-BNKNAM PIC  X(015).
000120 01  DFS_HEADER-BRCCOD PIC  X(003).
000130 01  DFS_HEADER-BRCNAM PIC  X(015).
000140 01  DFS_HEADER-DEPKND PIC  X(001).
000150 01  DFS_HEADER-DEPNUM PIC  X(007).
000160 01  DFS_HEADER-DUMMY1 PIC  X(017).
