000010************************************************
000020* (DFS_CNVMOD)
000030************************************************
000040 01  DFS_CNVMOD-JOBTYP PIC  X(004).
000050 01  DFS_CNVMOD-REGTIM PIC  X(006).
000060 01  DFS_CNVMOD-PAYNUM PIC  X(008).
000070 01  DFS_CNVMOD-CSTNAM PIC  X(030).
000080 01  DFS_CNVMOD-CSTNAM_O PIC  X(030).
000090 01  DFS_CNVMOD-CSTNAM_M PIC  X(001).
