000010************************************************
000020* (ELP_INTRAT)
000030************************************************
000040 01  ELP_INTRAT-LONTYP PIC  X(001).
000050 01  ELP_INTRAT-LONNAM PIC  X(012).
000060 01  ELP_INTRAT-APLDAY PIC  X(008).
000070 01  ELP_INTRAT-INTRAT PIC S9(002)V9(6) COMP-3.
000080 01  ELP_INTRAT-OLDAPL PIC  X(008).
000090 01  ELP_INTRAT-OLDRAT PIC S9(002)V9(6) COMP-3.
