000010************************************************
000020* (EMC_WK_HOMEN)
000030************************************************
000040 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|•¨Œ–¼ PIC  X(030).
000060 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|•ÛŽç—¿ PIC S9(013) COMP-3.
000070 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|Á”ïÅ PIC S9(013) COMP-3.
000080 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|Å—¦ PIC S9(002)V9(1) COMP-3.
000090 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|‹æ•ª PIC  X(001).
000100 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|ƒ`ƒFƒbƒN‚P PIC  X(001).
000110 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|ƒ`ƒFƒbƒN‚Q PIC  X(001).
000120 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|ƒ`ƒFƒbƒN‚R PIC  X(001).
000130 01  ‚d‚l‚b|‚v‚j|‚g‚n‚l‚d‚m|ƒ`ƒFƒbƒN‚S PIC  X(001).
