000010************************************************
000020* (EXP_SIMMOD)
000030************************************************
000040 01  EXP_SIMMOD-JOBTYP PIC  X(001).
000050 01  EXP_SIMMOD-REGTIM PIC  X(006).
000060 01  EXP_SIMMOD-TRNNUM PIC  X(004).
000070 01  EXP_SIMMOD-EXTNUM PIC  X(002).
000080 01  EXP_SIMMOD-DIVCOD PIC  X(004).
000090 01  EXP_SIMMOD-CNTNUM PIC  X(007).
000100 01  EXP_SIMMOD-PAYDAY PIC  X(008).
000110 01  EXP_SIMMOD-PAYMON PIC  X(006).
000120 01  EXP_SIMMOD-PAYBGN PIC  X(006).
000130 01  EXP_SIMMOD-PAYEND PIC  X(006).
000140 01  EXP_SIMMOD-FIXDAY PIC  X(002).
000150 01  EXP_SIMMOD-FISYER PIC  X(004).
000160 01  EXP_SIMMOD-ACCCOD PIC  X(005).
000170 01  EXP_SIMMOD-ACCEXT PIC  X(002).
000180 01  EXP_SIMMOD-PAYTYP PIC  X(001).
000190 01  EXP_SIMMOD-APRNUM PIC  X(010).
000200 01  EXP_SIMMOD-PAYCYC PIC  X(002).
000210 01  EXP_SIMMOD-CLTCOD PIC  X(008).
000220 01  EXP_SIMMOD-FRMNAM PIC  X(050).
000230 01  EXP_SIMMOD-ITMNAM PIC  X(050).
000240 01  EXP_SIMMOD-REMAK1 PIC  X(050).
000250 01  EXP_SIMMOD-REMAK2 PIC  X(050).
000260 01  EXP_SIMMOD-DEMFLG PIC  X(001).
000270 01  EXP_SIMMOD-RCVFLG PIC  X(001).
000280 01  EXP_SIMMOD-AUTFLG PIC  X(001).
000290 01  EXP_SIMMOD-TAXTYP PIC  X(001).
000300 01  EXP_SIMMOD-ITMCNT PIC S9(003) COMP-3.
000310 01  EXP_SIMMOD-PAYCNT PIC S9(003) COMP-3.
000320 01  EXP_SIMMOD-PAYAMT PIC S9(013) COMP-3.
000330 01  EXP_SIMMOD-CONTAX PIC S9(013) COMP-3.
000340 01  EXP_SIMMOD-TOTAMT PIC S9(013) COMP-3.
000350 01  EXP_SIMMOD-UNTPRC PIC S9(013) COMP-3.
000360 01  EXP_SIMMOD-PAYFIS PIC S9(013) COMP-3.
000370 01  EXP_SIMMOD-DIVCOD_O PIC  X(004).
000380 01  EXP_SIMMOD-CNTNUM_O PIC  X(007).
000390 01  EXP_SIMMOD-PAYDAY_O PIC  X(008).
000400 01  EXP_SIMMOD-PAYBGN_O PIC  X(006).
000410 01  EXP_SIMMOD-PAYEND_O PIC  X(006).
000420 01  EXP_SIMMOD-FIXDAY_O PIC  X(002).
000430 01  EXP_SIMMOD-ACCCOD_O PIC  X(005).
000440 01  EXP_SIMMOD-ACCEXT_O PIC  X(002).
000450 01  EXP_SIMMOD-APRNUM_O PIC  X(010).
000460 01  EXP_SIMMOD-PAYCYC_O PIC  X(002).
000470 01  EXP_SIMMOD-CLTCOD_O PIC  X(008).
000480 01  EXP_SIMMOD-FRMNAM_O PIC  X(050).
000490 01  EXP_SIMMOD-ITMNAM_O PIC  X(050).
000500 01  EXP_SIMMOD-DEMFLG_O PIC  X(001).
000510 01  EXP_SIMMOD-RCVFLG_O PIC  X(001).
000520 01  EXP_SIMMOD-TAXTYP_O PIC  X(001).
000530 01  EXP_SIMMOD-ITMCNT_O PIC S9(003) COMP-3.
000540 01  EXP_SIMMOD-PAYCNT_O PIC S9(003) COMP-3.
000550 01  EXP_SIMMOD-PAYAMT_O PIC S9(013) COMP-3.
000560 01  EXP_SIMMOD-CONTAX_O PIC S9(013) COMP-3.
000570 01  EXP_SIMMOD-TOTAMT_O PIC S9(013) COMP-3.
000580 01  EXP_SIMMOD-UNTPRC_O PIC S9(013) COMP-3.
000590 01  EXP_SIMMOD-PAYFIS_O PIC S9(013) COMP-3.
000600 01  EXP_SIMMOD-DIVCOD_M PIC  X(001).
000610 01  EXP_SIMMOD-CNTNUM_M PIC  X(001).
000620 01  EXP_SIMMOD-PAYDAY_M PIC  X(001).
000630 01  EXP_SIMMOD-PAYBGN_M PIC  X(001).
000640 01  EXP_SIMMOD-PAYEND_M PIC  X(001).
000650 01  EXP_SIMMOD-FIXDAY_M PIC  X(001).
000660 01  EXP_SIMMOD-ACCCOD_M PIC  X(001).
000670 01  EXP_SIMMOD-ACCEXT_M PIC  X(001).
000680 01  EXP_SIMMOD-APRNUM_M PIC  X(001).
000690 01  EXP_SIMMOD-PAYCYC_M PIC  X(001).
000700 01  EXP_SIMMOD-CLTCOD_M PIC  X(001).
000710 01  EXP_SIMMOD-FRMNAM_M PIC  X(001).
000720 01  EXP_SIMMOD-ITMNAM_M PIC  X(001).
000730 01  EXP_SIMMOD-DEMFLG_M PIC  X(001).
000740 01  EXP_SIMMOD-RCVFLG_M PIC  X(001).
000750 01  EXP_SIMMOD-TAXTYP_M PIC  X(001).
000760 01  EXP_SIMMOD-ITMCNT_M PIC  X(001).
000770 01  EXP_SIMMOD-PAYCNT_M PIC  X(001).
000780 01  EXP_SIMMOD-PAYAMT_M PIC  X(001).
000790 01  EXP_SIMMOD-CONTAX_M PIC  X(001).
000800 01  EXP_SIMMOD-TOTAMT_M PIC  X(001).
000810 01  EXP_SIMMOD-UNTPRC_M PIC  X(001).
000820 01  EXP_SIMMOD-PAYFIS_M PIC  X(001).
