000010************************************************
000020* (EXP_SIMWRK)
000030************************************************
000040 01  EXP_SIMWRK-TRNNUM PIC  X(004).
000050 01  EXP_SIMWRK-EXTNUM PIC  X(002).
000060 01  EXP_SIMWRK-RECNUM PIC  X(004).
000070 01  EXP_SIMWRK-DIVCOD PIC  X(004).
000080 01  EXP_SIMWRK-ADDNUM PIC  X(004).
000090 01  EXP_SIMWRK-ADDEXT PIC  X(002).
000100 01  EXP_SIMWRK-PAYDAY PIC  X(008).
000110 01  EXP_SIMWRK-PAYMON PIC  X(006).
000120 01  EXP_SIMWRK-FISYER PIC  X(004).
000130 01  EXP_SIMWRK-ACCCOD PIC  X(005).
000140 01  EXP_SIMWRK-ACCEXT PIC  X(002).
000150 01  EXP_SIMWRK-PAYTYP PIC  X(001).
000160 01  EXP_SIMWRK-APRNUM PIC  X(010).
000170 01  EXP_SIMWRK-CLTCOD PIC  X(008).
000180 01  EXP_SIMWRK-FRMNAM PIC  X(050).
000190 01  EXP_SIMWRK-ITMNAM PIC  X(050).
000200 01  EXP_SIMWRK-REMAK1 PIC  X(050).
000210 01  EXP_SIMWRK-REMAK2 PIC  X(050).
000220 01  EXP_SIMWRK-DEMFLG PIC  X(001).
000230 01  EXP_SIMWRK-RCVFLG PIC  X(001).
000240 01  EXP_SIMWRK-AUTFLG PIC  X(001).
000250 01  EXP_SIMWRK-TAXTYP PIC  X(001).
000260 01  EXP_SIMWRK-ITMCNT PIC S9(003) COMP-3.
000270 01  EXP_SIMWRK-PAYAMT PIC S9(013) COMP-3.
000280 01  EXP_SIMWRK-CONTAX PIC S9(013) COMP-3.
000290 01  EXP_SIMWRK-TOTAMT PIC S9(013) COMP-3.
000300 01  EXP_SIMWRK-UNTPRC PIC S9(013) COMP-3.
000310 01  EXP_SIMWRK-PAYFIS PIC S9(013) COMP-3.
000320 01  EXP_SIMWRK-ADDDAY PIC  X(008).
000330 01  EXP_SIMWRK-ADDTIM PIC  X(006).
000340 01  EXP_SIMWRK-ADDPSN PIC  X(004).
000350 01  EXP_SIMWRK-MODDAY PIC  X(008).
000360 01  EXP_SIMWRK-MODTIM PIC  X(006).
000370 01  EXP_SIMWRK-MODPSN PIC  X(004).
