000010************************************************
000020* (EXP_SIMACT)
000030************************************************
000040 01  EXP_SIMACT-TRNNUM PIC  X(004).
000050 01  EXP_SIMACT-EXTNUM PIC  X(002).
000060 01  EXP_SIMACT-RECNUM PIC  X(004).
000070 01  EXP_SIMACT-DIVCOD PIC  X(004).
000080 01  EXP_SIMACT-ADDNUM PIC  X(004).
000090 01  EXP_SIMACT-ADDEXT PIC  X(002).
000100 01  EXP_SIMACT-PAYDAY PIC  X(008).
000110 01  EXP_SIMACT-PAYMON PIC  X(006).
000120 01  EXP_SIMACT-FISYER PIC  X(004).
000130 01  EXP_SIMACT-ACCCOD PIC  X(005).
000140 01  EXP_SIMACT-ACCEXT PIC  X(002).
000150 01  EXP_SIMACT-PAYTYP PIC  X(001).
000160 01  EXP_SIMACT-APRNUM PIC  X(010).
000170 01  EXP_SIMACT-CLTCOD PIC  X(008).
000180 01  EXP_SIMACT-FRMNAM PIC  X(050).
000190 01  EXP_SIMACT-ITMNAM PIC  X(050).
000200 01  EXP_SIMACT-REMAK1 PIC  X(050).
000210 01  EXP_SIMACT-REMAK2 PIC  X(050).
000220 01  EXP_SIMACT-DEMFLG PIC  X(001).
000230 01  EXP_SIMACT-RCVFLG PIC  X(001).
000240 01  EXP_SIMACT-AUTFLG PIC  X(001).
000250 01  EXP_SIMACT-TAXTYP PIC  X(001).
000260 01  EXP_SIMACT-ITMCNT PIC S9(003) COMP-3.
000270 01  EXP_SIMACT-PAYAMT PIC S9(013) COMP-3.
000280 01  EXP_SIMACT-CONTAX PIC S9(013) COMP-3.
000290 01  EXP_SIMACT-TOTAMT PIC S9(013) COMP-3.
000300 01  EXP_SIMACT-UNTPRC PIC S9(013) COMP-3.
000310 01  EXP_SIMACT-PAYFIS PIC S9(013) COMP-3.
000320 01  EXP_SIMACT-ADDDAY PIC  X(008).
000330 01  EXP_SIMACT-ADDTIM PIC  X(006).
000340 01  EXP_SIMACT-ADDPSN PIC  X(004).
000350 01  EXP_SIMACT-MODDAY PIC  X(008).
000360 01  EXP_SIMACT-MODTIM PIC  X(006).
000370 01  EXP_SIMACT-MODPSN PIC  X(004).
