000010************************************************
000020* (FCT_SOSIN1)
000030************************************************
000040 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ƒf[ƒ^Ž¯•ÊƒR[ƒh PIC  X(002).
000050 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‘—MŽ–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ì¬“ú•t PIC  X(008).
000070 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ì¬Žž PIC  X(006).
000080 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Œ_–ñ”Ô† PIC  X(007).
000090 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Œ_–ñŽ}”Ô PIC  X(002).
000100 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ƒŒƒR[ƒh‹æ•ª PIC  X(001).
000110 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ƒf[ƒ^‹æ•ª PIC  X(001).
000120 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000130 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‹Æ–±‹æ•ª PIC  X(001).
000140 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000150 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|âg‹c‹æ•ª PIC  X(001).
000160 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|’S“–ŽÒƒR[ƒh PIC  X(004).
000170 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000180 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000190 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Œ_–ñ“ú PIC  X(008).
000200 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽÀs“ú PIC  X(008).
000210 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Šú“ú PIC  X(008).
000220 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Šz–Ê‹àŠz PIC S9(013) COMP-3.
000230 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽÐ“à‹à—˜ƒTƒCƒ“—Ìˆæ PIC  X(001).
000240 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000250 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŒŽ—˜•¡—˜—¦ƒTƒCƒ“—Ìˆæ PIC  X(001).
000260 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŒŽ—˜•¡—˜—¦ PIC S9(002)V9(8) COMP-3.
000270 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‘e—˜‰vƒTƒCƒ“—Ìˆæ PIC  X(001).
000280 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‘e—˜‰v PIC S9(013) COMP-3.
000290 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‹âsƒR[ƒh PIC  X(007).
000300 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|—a‹àŽí—Þ PIC  X(001).
000310 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŒûÀ‚m‚n PIC  X(007).
000320 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|˜A“®‹à—˜‹æ•ª PIC  X(002).
000330 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ƒXƒvƒŒƒbƒhƒTƒCƒ“—Ìˆæ PIC  X(001).
000340 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ƒXƒvƒŒƒbƒh PIC S9(002)V9(8) COMP-3.
000350 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|•Ð’[—¼’[‹æ•ª PIC  X(001).
000360 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‹à—˜•Ï“®‹æ•ª PIC  X(001).
000370 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‘OŽæŒãŽæ‹æ•ª PIC  X(001).
000380 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|—˜‘§’[”ˆ—ƒR[ƒh PIC  X(001).
000390 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|—˜—¦Šî”ƒR[ƒh PIC  X(001).
000400 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‹x“ú‘Î‰ž‹æ•ª PIC  X(001).
000410 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Œ´Â–±ŽÒƒR[ƒh PIC  X(008).
000420 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Œ´Â–±ŽÒî•ñ‚P PIC  X(040).
000430 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Œ´Â–±ŽÒî•ñ‚Q PIC  X(040).
000440 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Œ´Â–±ŽÒî•ñ‚R PIC  X(040).
000450 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|¿‹æƒR[ƒh PIC  X(008).
000460 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|—˜‘§Šú“ú PIC  X(008).
000470 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŠúŒÀ‘OŒˆÏ“ú PIC  X(008).
000480 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|–ß‚µ—˜‘§ŠzƒTƒCƒ“—Ìˆæ PIC  X(001).
000490 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|–ß‚µ—˜‘§Šz PIC S9(013) COMP-3.
000500 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|–ß‚µ—˜—¦ƒTƒCƒ“—Ìˆæ PIC  X(001).
000510 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|–ß‚µ—˜—¦ PIC S9(002)V9(8) COMP-3.
000520 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|–ß‚µ“ú” PIC S9(004) COMP-3.
000530 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|–ß‚µ—˜‘§‘ŠŽEƒR[ƒh PIC  X(001).
000540 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|•ÔÏŽè”—¿ PIC S9(013) COMP-3.
000550 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|•ÔÏŽè”—¿Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000560 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|”ƒ–ß—\’è“ú PIC  X(008).
000570 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|”ƒŽæ‘ã‹àŽx•¥“ú PIC  X(008).
000580 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŠúŠÔ“ú” PIC S9(004) COMP-3.
000590 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|”ƒŽæ‹àŠz PIC S9(013) COMP-3.
000600 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Š„ˆø—¿ PIC S9(013) COMP-3.
000610 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Š„ˆø—¦ƒTƒCƒ“—Ìˆæ PIC  X(001).
000620 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Š„ˆø—¦ PIC S9(002)V9(8) COMP-3.
000630 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‰ñŽû•ûŽ® PIC  X(001).
000640 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|‘ã—‰ñŽû‹æ•ª PIC  X(001).
000650 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000660 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽóŽæŽè”—¿Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000670 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ÂŒ ‚Ì•\Ž¦ PIC  X(060).
000680 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`Ží—Þ PIC  X(001).
000690 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Žæˆø‹âsƒR[ƒh PIC  X(007).
000700 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Žx•¥l–¼ PIC  X(060).
000710 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Žx•¥êŠ PIC  X(060).
000720 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`”Ô† PIC  X(010).
000730 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`‚Ì— ‘•û–@ PIC  X(001).
000740 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`Uo“ú PIC  X(008).
000750 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`ŒˆÏ“ú PIC  X(008).
000760 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`ŒˆÏŠm”F“ú PIC  X(008).
000770 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`•ÛØŠúŠÔ‰‚ß PIC  X(008).
000780 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`•ÛØŠúŠÔI‚í‚è PIC  X(008).
000790 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|•ÛØ—¿ PIC S9(013) COMP-3.
000800 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`•ÛØ‹àŠz PIC S9(013) COMP-3.
000810 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|•ÛØ—¿—¦ƒTƒCƒ“—Ìˆæ PIC  X(001).
000820 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|•ÛØ—¿—¦ PIC S9(002)V9(8) COMP-3.
000830 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|ŽèŒ`•ÛØ“ú” PIC S9(004) COMP-3.
000840 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|•ÛØ—¿Žx•¥“ú PIC  X(008).
000850 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|•ÛØ—¿‰ñŽû•ûŽ® PIC  X(001).
000860 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Šm”Fæ PIC  X(020).
000870 01  ‚e‚b‚s|‚r‚n‚r‚h‚m‚P|Šm”F“à—e PIC  X(080).
