000010************************************************
000020* (FCT_WORK)
000030************************************************
000040 01  ‚e‚b‚s|‚v‚n‚q‚j|Œ_–ñ”Ô† PIC  X(007).
000050 01  ‚e‚b‚s|‚v‚n‚q‚j|Ží—Þ PIC  X(001).
000060 01  ‚e‚b‚s|‚v‚n‚q‚j|VŽ–‹ÆŠƒR[ƒh PIC  X(004).
