000010************************************************
000020* (FCT_URIKAKE)
000030************************************************
000040 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Œ_–ñ”Ô† PIC  X(007).
000050 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Œ_–ñ”Ô†Ž}”Ô PIC  X(002).
000060 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ŽÀs“ú PIC  X(008).
000070 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Šú“ú PIC  X(008).
000080 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|—˜‘§Šú“ú PIC  X(008).
000090 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|”ƒŽæ‘ã‹àŽx•¥“ú PIC  X(008).
000100 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ŠúŠÔ“ú” PIC S9(004) COMP-3.
000110 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Šz–Ê‹àŠz PIC S9(013) COMP-3.
000120 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|”ƒŽæ‹àŠz PIC S9(013) COMP-3.
000130 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Š„ˆø—¿ PIC S9(013) COMP-3.
000140 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|‰ñŽû•ûŽ® PIC  X(001).
000150 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|‘e—˜‰v PIC S9(013) COMP-3.
000160 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000170 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|‘ã—‰ñŽû‹æ•ª PIC  X(001).
000180 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000190 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ŽóŽæŽè”—¿Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000200 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ÂŒ ‚Ì•\Ž¦ PIC  X(060).
000210 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Š„ˆø—¦ PIC S9(002)V9(8) COMP-3.
000220 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|— •tŽæˆø PIC  X(040).
000230 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|’¥Žû‘—Þ PIC  X(030).
000240 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|¿‹‘‘—•tæ PIC  X(060).
000250 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|¿‹æƒR[ƒh PIC  X(008).
000260 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Œ´Â–±ŽÒƒR[ƒh PIC  X(008).
000270 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|‹âs’ZkƒR[ƒh PIC  X(002).
000280 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|‹âsƒR[ƒh PIC  X(007).
000290 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|‹âs–¼ PIC  X(060).
000300 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|—a‹àŽí—Þ PIC  X(001).
000310 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ŒûÀ–¼Ì PIC  X(060).
000320 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ŒûÀ”Ô† PIC  X(007).
000330 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Œ´Â–±ŽÒî•ñ‚P PIC  X(040).
000340 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Œ´Â–±ŽÒî•ñ‚Q PIC  X(040).
000350 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|Œ´Â–±ŽÒî•ñ‚R PIC  X(040).
000360 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|“o˜^“ú PIC  X(008).
000370 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|“o˜^Žž PIC  X(006).
000380 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000390 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|XV“ú PIC  X(008).
000400 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|XVŽž PIC  X(006).
000410 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000420 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|ŠúŒÀ‘OŒˆÏ“ú PIC  X(008).
000430 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|–ß‚µ—˜—¦ PIC S9(002)V9(8) COMP-3.
000440 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|–ß‚µ“ú” PIC S9(004) COMP-3.
000450 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|–ß‚µ—˜‘§‘ŠŽEƒR[ƒh PIC  X(001).
000460 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|•ÔÏŽè”—¿ PIC S9(013) COMP-3.
000470 01  ‚e‚b‚s|‚t‚q‚h‚j‚`‚j‚d|•ÔÏŽè”—¿Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
