000010************************************************
000020* (FCT_TEGATA)
000030************************************************
000040 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Œ_–ñ”Ô† PIC  X(007).
000050 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Œ_–ñ”Ô†Ž}”Ô PIC  X(002).
000060 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽÀs“ú PIC  X(008).
000070 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽèŒ`Šú“ú PIC  X(008).
000080 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|—˜‘§Šú“ú PIC  X(008).
000090 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŠúŠÔ“ú” PIC S9(004) COMP-3.
000100 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|”ƒ–ß—\’è“ú PIC  X(008).
000110 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|”ƒŽæ‘ã‹àŽx•¥“ú PIC  X(008).
000120 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Šz–Ê‹àŠz PIC S9(013) COMP-3.
000130 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|”ƒŽæ‹àŠz PIC S9(013) COMP-3.
000140 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Š„ˆø—¿ PIC S9(013) COMP-3.
000150 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|‰ñŽû•ûŽ® PIC  X(001).
000160 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|‘e—˜‰v PIC S9(013) COMP-3.
000170 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽèŒ`Ží—Þ PIC  X(001).
000180 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Žæˆø‹âsƒR[ƒh PIC  X(007).
000190 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Žx•¥l–¼ PIC  X(060).
000200 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Žx•¥êŠ PIC  X(060).
000210 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽèŒ`‚m‚n PIC  X(010).
000220 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000230 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽóŽæŽè”—¿Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000240 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|–ß‚µ—˜‘§Šz PIC S9(013) COMP-3.
000250 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Š„ˆø—¦ PIC S9(002)V9(8) COMP-3.
000260 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000270 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽèŒ`‚Ì— ‘•û–@ PIC  X(001).
000280 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|— •tŽæˆø PIC  X(040).
000290 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|’¥Žû‘—Þ PIC  X(030).
000300 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|¿‹‘‘—•tæ PIC  X(060).
000310 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|¿‹æƒR[ƒh PIC  X(008).
000320 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŽèŒ`ÂŒ ‚Ì•\Ž¦ PIC  X(060).
000330 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|‘ã—‰ñŽû‹æ•ª PIC  X(001).
000340 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Œ´Â–±ŽÒƒR[ƒh PIC  X(008).
000350 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Œ´Â–±ŽÒî•ñ‚P PIC  X(040).
000360 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Œ´Â–±ŽÒî•ñ‚Q PIC  X(040).
000370 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|Œ´Â–±ŽÒî•ñ‚R PIC  X(040).
000380 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|“o˜^“ú PIC  X(008).
000390 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|“o˜^Žž PIC  X(006).
000400 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000410 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|XV“ú PIC  X(008).
000420 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|XVŽž PIC  X(006).
000430 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000440 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|ŠúŒÀ‘OŒˆÏ“ú PIC  X(008).
000450 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|–ß‚µ—˜—¦ PIC S9(002)V9(8) COMP-3.
000460 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|–ß‚µ“ú” PIC S9(004) COMP-3.
000470 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|–ß‚µ—˜‘§‘ŠŽEƒR[ƒh PIC  X(001).
000480 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|•ÔÏŽè”—¿ PIC S9(013) COMP-3.
000490 01  ‚e‚b‚s|‚s‚d‚f‚`‚s‚`|•ÔÏŽè”—¿Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
