000010************************************************
000020* ”Û”F(‰‰ñî•ñ)(HSNINS)
000030************************************************
000040 01  ‚g‚r‚m‚h‚m‚r|Œ_–ñ”Ô†  PIC  X(009).
000050 01  ‚g‚r‚m‚h‚m‚r|‰ŽÀƒŠ[ƒX—¿  PIC S9(013) COMP-3.
000060 01  ‚g‚r‚m‚h‚m‚r|‰‰ñ—˜‘§  PIC S9(013) COMP-3.
000070 01  ‚g‚r‚m‚h‚m‚r|‰Œ³–{“à  PIC S9(013) COMP-3.
000080 01  ‚g‚r‚m‚h‚m‚r|‰Œ³–{Žc  PIC S9(013) COMP-3.
000090 01  ‚g‚r‚m‚h‚m‚r|‰ÂŒ Žc  PIC S9(013) COMP-3.
000100 01  ‚g‚r‚m‚h‚m‚r|‰‰ñ””ï—p  PIC S9(013) COMP-3.
