000010************************************************
000020* (IBS_TRANS_GUARANTEE)
000030************************************************
000040 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‚f‚t‚`‚q‚`‚m‚s‚d‚d|ˆÄŒ‚m‚n 
                                             PIC  X(012).
000050 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‚f‚t‚`‚q‚`‚m‚s‚d‚d|”í•ÛØæƒR[ƒh 
                                             PIC  X(008).
000060 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‚f‚t‚`‚q‚`‚m‚s‚d‚d|•‰’SŠ„‡•ªŽq 
                                             PIC S9(014)V9(2) COMP-3.
000070 01  ‚h‚a‚r|‚s‚q‚`‚m‚r|‚f‚t‚`‚q‚`‚m‚s‚d‚d|•‰’SŠ„‡•ª•ê 
                                             PIC S9(014)V9(2) COMP-3.
