000010************************************************
000020* (IBS_CURRENCY)
000030************************************************
000040 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|•¼ŽíƒR[ƒh PIC  X(003).
000050 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|‘ƒR[ƒh PIC  X(003).
000060 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|‚r‚v‚h‚e‚sƒR[ƒh PIC  X(003).
000070 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|ƒ†ƒjƒbƒg’PˆÊ PIC S9(005) COMP-3.
000080 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|¬”“_ˆÊ PIC S9(001) COMP-3.
000090 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|–¼Ì|“ú–{Œê PIC  X(030).
000100 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|–¼Ì|‰pŒê PIC  X(030).
000110 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|“o˜^“ú PIC  X(008).
000120 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|“o˜^Žž PIC  X(006).
000130 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000140 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|XV“ú PIC  X(008).
000150 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|XVŽž PIC  X(006).
000160 01  ‚h‚a‚r|‚b‚t‚q‚q‚d‚m‚b‚x|XV’S“–ŽÒƒR[ƒh PIC  X(004).
