000010************************************************
000020* (IBS_ASSET)
000030************************************************
000040 01  ‚h‚a‚r|‚`‚r‚r‚d‚s|Ž‘‹àŽg“rƒR[ƒh PIC  X(004).
000050 01  ‚h‚a‚r|‚`‚r‚r‚d‚s|–¼Ì|“ú–{Œê PIC  X(030).
000060 01  ‚h‚a‚r|‚`‚r‚r‚d‚s|“o˜^“ú PIC  X(008).
000070 01  ‚h‚a‚r|‚`‚r‚r‚d‚s|“o˜^Žž PIC  X(006).
000080 01  ‚h‚a‚r|‚`‚r‚r‚d‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚h‚a‚r|‚`‚r‚r‚d‚s|XV“ú PIC  X(008).
000100 01  ‚h‚a‚r|‚`‚r‚r‚d‚s|XVŽž PIC  X(006).
000110 01  ‚h‚a‚r|‚`‚r‚r‚d‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
