000010************************************************
000020* (IBS_CUSTOMER)
000030************************************************
000040 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|ŽæˆøæƒR[ƒh PIC  X(008).
000050 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000060 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|ƒOƒ‹[ƒvƒR[ƒh PIC  X(008).
000070 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|•”“XƒR[ƒh PIC  X(004).
000080 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|‘Û‘“à‹æ•ª PIC  X(001).
000090 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|–¼Ì PIC  X(060).
000100 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|Žæˆøæ–¼Ì|Š¿Žš PIC  X(040).
000110 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|Žæˆøæ–¼Ì|ƒJƒi PIC  X(060).
000120 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|ƒtƒŠƒKƒi PIC  X(010).
000130 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|‚l‚s‚e‚fŠÖ˜A‰ïŽÐ‹æ•ª PIC  X(001).
000140 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|‚a‚n‚s‚kŠÖ˜A‰ïŽÐ‹æ•ª PIC  X(001).
000150 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|‰ïŽÐ‹æ•ª PIC  X(002).
000160 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|ƒ\ƒuƒŠƒ“‹æ•ª PIC  X(001).
000170 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|‘ƒR[ƒh PIC  X(003).
000180 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|‹ÆŽíƒR[ƒh PIC  X(002).
000190 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|Ši•t‚¯ PIC  X(003).
000200 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|î•ñŒðŠ·’Ê’m‹æ•ª PIC  X(001).
000210 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|¿‹î•ñ‚P PIC  X(040).
000220 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|¿‹î•ñ‚Q PIC  X(040).
000230 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|¿‹î•ñ‚R PIC  X(040).
000240 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|¿‹î•ñ‚S PIC  X(040).
000250 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|¿‹î•ñ‚T PIC  X(040).
000260 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|¿‹î•ñ‚U PIC  X(040).
000270 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|¿‹î•ñ‚V PIC  X(040).
000280 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|¿‹î•ñ‚W PIC  X(040).
000290 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|“d˜b”Ô† PIC  X(020).
000300 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|‚e‚`‚w”Ô† PIC  X(020).
000310 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|”õl‚P PIC  X(050).
000320 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|”õl‚Q PIC  X(050).
000330 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|“o˜^“ú PIC  X(008).
000340 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|“o˜^Žž PIC  X(006).
000350 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000360 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|XV“ú PIC  X(008).
000370 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|XVŽž PIC  X(006).
000380 01  ‚h‚a‚r|‚b‚t‚r‚s‚n‚l‚d‚q|XV’S“–ŽÒƒR[ƒh PIC  X(004).
