000010************************************************
000020* (IBS_BRANCH)
000030************************************************
000040 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|•”“XƒR[ƒh PIC  X(004).
000050 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|Œ_–ñ•”“XƒR[ƒh PIC  X(001).
000060 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|—ªÌƒR[ƒh PIC  X(003).
000070 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|“sŽsƒR[ƒh PIC  X(003).
000080 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|–¼Ì|“ú–{Œê PIC  X(050).
000090 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|–¼Ì|‰pŒê PIC  X(050).
000100 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|—ªÌ PIC  X(018).
000110 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|“o˜^“ú PIC  X(008).
000120 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|“o˜^Žž PIC  X(006).
000130 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000140 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|XV“ú PIC  X(008).
000150 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|XVŽž PIC  X(006).
000160 01  ‚h‚a‚r|‚a‚q‚`‚m‚b‚g|XV’S“–ŽÒƒR[ƒh PIC  X(004).
