000010************************************************
000020* (IBS_HOLIDAY)
000030************************************************
000040 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|‹x“ú|”N PIC  X(004).
000050 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|‹x“ú|ŒŽ PIC  X(002).
000060 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|‹x“ú|“ú PIC  X(002).
000070 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|“sŽsƒR[ƒh PIC  X(003).
000080 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|“o˜^“ú PIC  X(008).
000090 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|“o˜^Žž PIC  X(006).
000100 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000110 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|XV“ú PIC  X(008).
000120 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|XVŽž PIC  X(006).
000130 01  ‚h‚a‚r|‚g‚n‚k‚h‚c‚`‚x|XV’S“–ŽÒƒR[ƒh PIC  X(004).
