000010************************************************
000020* 入金仕訳短縮コード(IKOTBL008)
000030************************************************
000040 01  ＩＫＯ００８－旧入金仕訳短縮コード PIC  X(002).
000050 01  ＩＫＯ００８－新入金仕訳短縮コード PIC  X(002).
