000010************************************************
000020* V•¨Œ”Ô†Ì”Ôƒe[ƒuƒ‹(IKOTBL010)
000030************************************************
000040 01  ‚h‚j‚n‚O‚P‚O|Œ_–ñ”Ô† PIC  X(010).
000050 01  ‚h‚j‚n‚O‚P‚O|•¨Œ”Ô† PIC S9(004) COMP-3.
000060 01  ‚h‚j‚n‚O‚P‚O|‰ð–ñ“ú PIC  X(007).
000070 01  ‚h‚j‚n‚O‚P‚O|¼—ï‰ð–ñ“ú PIC  X(008).
000080 01  ‚h‚j‚n‚O‚P‚O|V•¨Œ”Ô† PIC S9(004) COMP-3.
000090 01  ‚h‚j‚n‚O‚P‚O|‚h‚m‹æ•ª PIC  X(001).
