000010************************************************
000020* Žx•¥æƒR[ƒh•ÏŠ·ƒe[ƒuƒ‹(IKOTBL007)
000030************************************************
000040 01  ‚h‚j‚n‚O‚O‚V|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚h‚j‚n‚O‚O‚V|w“üæŽ¯•Ê”Ô† PIC S9(002) COMP-3.
000060 01  ‚h‚j‚n‚O‚O‚V|ÂŒ Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000070 01  ‚h‚j‚n‚O‚O‚V|Â–±Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000080 01  ‚h‚j‚n‚O‚O‚V|Œ»ƒfƒB[ƒ‰[ƒR[ƒh PIC  X(005).
000090 01  ‚h‚j‚n‚O‚O‚V|w“üæVŽæˆøæƒR[ƒh PIC  X(007).
000100 01  ‚h‚j‚n‚O‚O‚V|w“üæŽ}”Ô PIC  X(003).
000110 01  ‚h‚j‚n‚O‚O‚V|Žx•¥æVŽæˆøæƒR[ƒh PIC  X(007).
000120 01  ‚h‚j‚n‚O‚O‚V|Žx•¥æŽ}”Ô PIC  X(003).
