000010************************************************
000020* (JOM_FORM_0003)
000030************************************************
000040 01  JOM_FORM_0003-SHTNUM PIC S9(002) COMP-3.
000050 01  JOM_FORM_0003-Œ_–ñ“ú PIC  X(008).
000060 01  JOM_FORM_0003-Œ_–ñ”Ô† PIC  X(007).
000070 01  JOM_FORM_0003-ŠJŽnŽ}”Ô PIC  X(002).
000080 01  JOM_FORM_0003-ÅIŽ}”Ô PIC  X(002).
000090 01  JOM_FORM_0003-w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000100 01  JOM_FORM_0003-Žd“üÁ”ïÅ“™Šz‡Œv PIC S9(013) COMP-3.
000110 01  JOM_FORM_0003-Žx•¥ðŒ1 PIC  X(002).
000120 01  JOM_FORM_0003-Žx•¥ðŒ2 PIC  X(002).
000130 01  JOM_FORM_0003-Žx•¥ðŒ3 PIC  X(002).
000140 01  JOM_FORM_0003-Žx•¥ðŒ4 PIC  X(002).
000150 01  JOM_FORM_0003-Žx•¥ðŒ5 PIC  X(002).
000160 01  JOM_FORM_0003-Žx•¥ðŒ•¶Œ¾1 PIC  X(040).
000170 01  JOM_FORM_0003-Žx•¥ðŒ•¶Œ¾2 PIC  X(040).
000180 01  JOM_FORM_0003-Žx•¥ðŒ•¶Œ¾3 PIC  X(040).
000190 01  JOM_FORM_0003-Žx•¥ðŒ•¶Œ¾4 PIC  X(040).
000200 01  JOM_FORM_0003-Žx•¥ðŒ•¶Œ¾5 PIC  X(040).
000210 01  JOM_FORM_0003-Žx•¥‹àŠz1 PIC S9(013) COMP-3.
000220 01  JOM_FORM_0003-Žx•¥‹àŠz2 PIC S9(013) COMP-3.
000230 01  JOM_FORM_0003-Žx•¥‹àŠz3 PIC S9(013) COMP-3.
000240 01  JOM_FORM_0003-Žx•¥‹àŠz4 PIC S9(013) COMP-3.
000250 01  JOM_FORM_0003-Žx•¥‹àŠz5 PIC S9(013) COMP-3.
