000010************************************************
000020* (JOM_SNDREC)
000030************************************************
000040 01  JOM_SNDREC-SNDREC PIC  X(1024).
