000010************************************************
000020* (JOM_MEISAI)
000030************************************************
000040 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|ƒWƒ‡ƒ‚Žx“XƒR[ƒh PIC  X(002).
000050 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|ƒWƒ‡ƒ‚Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|ƒWƒ‡ƒ‚•¨Œ‚m‚n PIC  X(003).
000070 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000080 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|•¨Œ‚m‚n PIC  X(003).
000090 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|ƒWƒ‡ƒ‚¤•iƒR[ƒh PIC  X(004).
000100 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|•¨Œ–¼|Š¿Žš PIC  X(040).
000110 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|•¨Œ–¼ PIC  X(020).
000120 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|‹@Ží–¼ PIC  X(020).
000130 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|”—Ê PIC S9(004) COMP-3.
000140 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|w“ü‹àŠz PIC S9(013) COMP-3.
000150 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|Žd“üÁ”ïÅ“™Šz PIC S9(013) COMP-3.
000160 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000170 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000180 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|“®‘•ÛŒ¯—¿—¦ PIC S9(002)V9(3) COMP-3.
000190 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|Ž‘ŽYƒR[ƒh PIC  X(007).
000200 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|‘Ï—p”N” PIC  X(002).
000210 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|M—p•ÛŒ¯ƒR[ƒh PIC  X(006).
000220 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|Å‹æ•ª PIC  X(001).
000230 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|ŒÅ’èŽ‘ŽYÅ—¦ PIC S9(002)V9(2) COMP-3.
000240 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000250 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|Ý’uêŠZŠ PIC  X(100).
000260 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000270 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼|ƒJƒi PIC  X(020).
000280 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|”[•tæƒR[ƒh PIC  X(006).
000290 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|“o˜^“ú PIC  X(008).
000300 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|“o˜^Žž PIC  X(006).
000310 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000320 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|XV“ú PIC  X(008).
000330 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|XVŽž PIC  X(006).
000340 01  ‚i‚n‚l|‚l‚d‚h‚r‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
