000010************************************************
000020* (JOM_SEIKYU_KIHON)
000030************************************************
000040 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000060 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|ÄƒŠ[ƒXƒR[ƒh 
                                             PIC  X(001).
000070 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000080 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000090 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000100 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|¿‹æƒR[ƒh PIC  X(008).
000110 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000120 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|“ü‹à“ú PIC  X(002).
000130 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|“–ŒŽƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000140 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|“–ŒŽÂŒ Žc‚ 
                                             PIC S9(013) COMP-3.
000150 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|“–ŒŽ‘OŽóƒŠ[ƒX—¿Žc‚ 
                                             PIC S9(013) COMP-3.
000160 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|“ú•t PIC  X(004).
000170 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|[“–‰ñ 
                                             PIC S9(003) COMP-3.
000180 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|‘Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000190 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000200 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|’¥Žû‹æ•ª PIC  X(001).
000210 01  ‚i‚n‚l|‚r‚d‚h‚j‚x‚t|‚j‚h‚g‚n‚m|Å—¦ 
                                             PIC S9(002)V9(1) COMP-3.
