000010************************************************
000020* (JOM_KINRI)
000030************************************************
000040 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|‚j‚d‚x PIC  X(003).
000050 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|ƒŠ[ƒXŠúŠÔ‚e‚q‚n‚l PIC S9(003) COMP-3.
000060 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|ƒŠ[ƒXŠúŠÔ‚s‚n PIC S9(003) COMP-3.
000070 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|ŽÐ“à‹à—˜ PIC S9(002)V9(2) COMP-3.
000080 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|“o˜^“ú PIC  X(008).
000090 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|“o˜^Žž PIC  X(006).
000100 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000110 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|XV“ú PIC  X(008).
000120 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|XVŽž PIC  X(006).
000130 01  ‚i‚n‚l|‚j‚h‚m‚q‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
