000010************************************************
000020* (JYO_INPWRK)
000030************************************************
000040 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Ž‘ŽYƒR[ƒh PIC  X(014).
000050 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Ž‘ŽY–¼ PIC  X(040).
000060 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|•”–å PIC  X(010).
000070 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|êŠ PIC  X(020).
000080 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Š¨’è PIC  X(020).
000090 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ž‹p•û–@ PIC  X(006).
000100 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|”—Ê PIC S9(004) COMP-3.
000110 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|’PˆÊ PIC  X(001).
000120 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|‘‰Á——R PIC  X(006).
000130 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Œ¸­——R PIC  X(006).
000140 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Ž–‹Æ‹Ÿ—p“ú PIC  X(010).
000150 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|‘‰Á“ú PIC  X(010).
000160 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Œ¸­“ú PIC  X(010).
000170 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Žæ“¾‰¿Šz PIC S9(013) COMP-3.
000180 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ˆ³kˆø“–‹à PIC S9(013) COMP-3.
000190 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Žc‘¶‰¿Šz PIC S9(013) COMP-3.
000200 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ž‹p‰Â”\ŒÀ“x PIC S9(013) COMP-3.
000210 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ŠúŽñ’ •ë‰¿Šz PIC S9(013) COMP-3.
000220 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Šú’†Œ¸­Šz PIC S9(013) COMP-3.
000230 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Šú’†‘‰ÁŠz PIC S9(013) COMP-3.
000240 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ŠúŽñž‹p‰ß•s‘« PIC S9(013) COMP-3.
000250 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ž‹pŠî‘bŠz PIC S9(013) COMP-3.
000260 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|‘Ï—p”N” PIC S9(003) COMP-3.
000270 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ž‹p—¦ PIC S9(002)V9(3) COMP-3.
000280 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ƒŠ[ƒXŠúŠÔ PIC S9(004) COMP-3.
000290 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ž‹pŒŽ” PIC S9(004) COMP-3.
000300 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ŽZož‹pŠz PIC S9(013) COMP-3.
000310 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|‘‰Áž‹pŠz PIC S9(013) COMP-3.
000320 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|“–Šúž‹pŒÀ“xŠz PIC S9(013) COMP-3.
000330 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Š„‘ž‹pŠz PIC S9(013) COMP-3.
000340 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|“Á•Êž‹pŠz PIC S9(013) COMP-3.
000350 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|“–Šúž‹pŠz PIC S9(013) COMP-3.
000360 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ˆø“–‹àŽæ•öŠz PIC S9(013) COMP-3.
000370 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Šú––ˆø“–‹àŠz PIC S9(013) COMP-3.
000380 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|Šú––’ •ë‰¿Šz PIC S9(013) COMP-3.
000390 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ž‹p’´‰ßŠz PIC S9(013) COMP-3.
000400 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ž‹p•s‘«Šz PIC S9(013) COMP-3.
000410 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|ž‹p—ÝŒvŠz PIC S9(013) COMP-3.
000420 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|‰c‹ÆŠO”ï—p PIC S9(013) COMP-3.
000430 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|»‘¢Œ´‰¿ PIC S9(013) COMP-3.
000440 01  ‚i‚x‚n|‚h‚m‚o‚v‚q‚j|”ÌŠÇ”ï PIC S9(013) COMP-3.
