000010************************************************
000020* (JYO_CHKTMP)
000030************************************************
000040 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|ƒ_ƒ~[‚P PIC  X(020).
000050 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|ƒf[ƒ^‹æ•ª PIC  X(001).
000060 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|Ž‘ŽY”Ô† PIC  X(009).
000070 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|ƒ_ƒ~[‚Q PIC  X(031).
000080 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|ƒ_ƒ~[‚R PIC  X(008).
000090 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|Ž‘ŽYŽí—Þ PIC  X(001).
000100 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|Ž‘ŽYƒR[ƒh PIC  X(006).
000110 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|‘Ï—p”N” PIC  X(002).
000120 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|ž‹p—¦ PIC  X(003).
000130 01  ‚i‚x‚n|‚b‚g‚j‚s‚l‚o|ƒ_ƒ~[‚S PIC  X(019).
