000010************************************************
000020* (KAI_IREI)
000030************************************************
000040 01  ‚j‚`‚h|‚h‚q‚d‚h|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000050 01  ‚j‚`‚h|‚h‚q‚d‚h|Žæˆøæ–¼Š¿Žš PIC  X(060).
000060 01  ‚j‚`‚h|‚h‚q‚d‚h|³”F”Ô† PIC  X(005).
000070 01  ‚j‚`‚h|‚h‚q‚d‚h|•ïŠ‡ŠúŒÀŠJŽn PIC  X(008).
000080 01  ‚j‚`‚h|‚h‚q‚d‚h|•ïŠ‡ŠúŒÀI—¹ PIC  X(008).
000090 01  ‚j‚`‚h|‚h‚q‚d‚h|ˆÙ—á“à—e PIC  X(400).
000100 01  ‚j‚`‚h|‚h‚q‚d‚h|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000110 01  ‚j‚`‚h|‚h‚q‚d‚h|“o˜^“ú PIC  X(008).
000120 01  ‚j‚`‚h|‚h‚q‚d‚h|“o˜^Žž PIC  X(006).
000130 01  ‚j‚`‚h|‚h‚q‚d‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000140 01  ‚j‚`‚h|‚h‚q‚d‚h|XV“ú PIC  X(008).
000150 01  ‚j‚`‚h|‚h‚q‚d‚h|XVŽž PIC  X(006).
000160 01  ‚j‚`‚h|‚h‚q‚d‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
