000010************************************************
000020* (KAI_KIHON)
000030************************************************
000040 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000060 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Žæˆøæ–¼Š¿Žš PIC  X(060).
000080 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Žæˆøæ–¼ƒJƒi PIC  X(030).
000090 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000100 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000110 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ŒŸŽû“ú PIC  X(008).
000120 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000130 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000140 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|’èŠzƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000150 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000160 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿“ü‹à“ú PIC  X(008).
000170 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000180 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ŒŽŠzŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000190 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ŒŽŠz•ÛŒ¯—¿ PIC S9(013) COMP-3.
000200 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ŒŽŠz•ÛŽç—¿ PIC S9(013) COMP-3.
000210 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000220 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000230 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000240 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000250 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‰Šú”ï—p PIC S9(013) COMP-3.
000260 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000270 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Žx•¥‰ñ” PIC S9(003) COMP-3.
000280 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|˜’uŒŽ” PIC S9(003) COMP-3.
000290 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000300 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Žc‰¿‰ñŽû“ú PIC  X(008).
000310 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|“ü‹à“ú PIC  X(002).
000320 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú PIC  X(008).
000330 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú PIC  X(008).
000340 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ÄƒŠ[ƒXƒR[ƒh PIC  X(001).
000350 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Žè”—¿¿‹ƒR[ƒh PIC  X(002).
000360 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒXI—¹“ú PIC  X(008).
000370 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000380 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Žc‰¿Šz‡Œv PIC S9(013) COMP-3.
000390 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000400 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Á”ïÅ’¥Žû‹æ•ª PIC  X(001).
000410 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Â–±‹¦’²ƒR[ƒh PIC  X(002).
000420 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿[“–”NŒŽ‘OŒŽ PIC  X(006).
000430 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|[“–‰ñ”‘OŒŽ PIC S9(003) COMP-3.
000440 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿‘OŒŽ PIC S9(013) COMP-3.
000450 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ÂŒ Žc‚‘OŒŽ PIC S9(013) COMP-3.
000460 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿Žc‚‘OŒŽ 
                                             PIC S9(013) COMP-3.
000470 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿[“–”NŒŽ“–ŒŽ PIC  X(006).
000480 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|[“–‰ñ”“–ŒŽ PIC S9(003) COMP-3.
000490 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿“–ŒŽ PIC S9(013) COMP-3.
000500 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ÂŒ Žc‚“–ŒŽ PIC S9(013) COMP-3.
000510 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿Žc‚“–ŒŽ 
                                             PIC S9(013) COMP-3.
000520 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿[“–”NŒŽ—‚ŒŽ PIC  X(006).
000530 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|[“–‰ñ”—‚ŒŽ PIC S9(003) COMP-3.
000540 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿—‚ŒŽ PIC S9(013) COMP-3.
000550 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ÂŒ Žc‚—‚ŒŽ PIC S9(013) COMP-3.
000560 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿Žc‚—‚ŒŽ 
                                             PIC S9(013) COMP-3.
000570 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|–¢‰ñŽûŒ³–{Žc‚ PIC S9(013) COMP-3.
000580 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|–¢’¥Žû•ÛŒ¯—¿ PIC S9(013) COMP-3.
000590 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|–¢’¥Žû‚s‚`‚w PIC S9(013) COMP-3.
000600 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|Œo‰ßŒŽ” PIC S9(003) COMP-3.
000610 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘OŽó[“–ŠJŽn”NŒŽ PIC  X(006).
000620 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‘OŽó[“–ŠJŽn[“–Šz PIC S9(013) COMP-3.
000630 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‰ñŽû•ûŽ® PIC  X(001).
000640 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‹âsƒR[ƒh PIC  X(007).
000650 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‹âs–¼ƒJƒi PIC  X(030).
000660 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ŒûÀ”Ô† PIC  X(007).
000670 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|—a‹àŽí—Þ PIC  X(001).
000680 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|¿‹æƒR[ƒh PIC  X(008).
000690 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ŒvŽZ•ûŽ® PIC  X(001).
000700 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ƒf[ƒ^Ž¯•ÊƒR[ƒh PIC  X(002).
000710 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|•¶Œ¾”Ô† PIC S9(002) COMP-3.
000720 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|•¶Œ¾ PIC  X(600).
000730 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|ˆÙ—á‚e‚k‚f PIC  X(001).
000740 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000750 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000760 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000770 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000780 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000790 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000800 01  ‚j‚`‚h|‚j‚h‚g‚n‚m|‰‰ñƒŠ[ƒX—¿ PIC S9(013) COMP-3.
