000010************************************************
000020* (KAI_WK_HOUGAMEN)
000030************************************************
000040 01  KAI_WK_HOUGAMEN-NO PIC S9(003) COMP-3.
000050 01  KAI_WK_HOUGAMEN-未徴収金残高 PIC S9(013) COMP-3.
000060 01  KAI_WK_HOUGAMEN-未徴収金回収方法 PIC  X(020).
000070 01  KAI_WK_HOUGAMEN-回収予定日 PIC  X(008).
000080 01  KAI_WK_HOUGAMEN-処分先 PIC  X(080).
000090 01  KAI_WK_HOUGAMEN-売却決済条件 PIC  X(004).
000100 01  KAI_WK_HOUGAMEN-新契約NO PIC  X(009).
000110 01  KAI_WK_HOUGAMEN-その他 PIC  X(080).
000120 01  KAI_WK_HOUGAMEN-消費税調整 PIC  X(002).
000130 01  KAI_WK_HOUGAMEN-過剰ﾘｰｽ料回収方法 PIC  X(008).
000140 01  KAI_WK_HOUGAMEN-指示 PIC  X(080).
000150 01  KAI_WK_HOUGAMEN-返金先 PIC  X(008).
000160 01  KAI_WK_HOUGAMEN-銀行 PIC  X(030).
000170 01  KAI_WK_HOUGAMEN-支店 PIC  X(030).
000180 01  KAI_WK_HOUGAMEN-預金種類 PIC  X(004).
000190 01  KAI_WK_HOUGAMEN-口座NO PIC  X(007).
000200 01  KAI_WK_HOUGAMEN-預金名義 PIC  X(080).
000210 01  KAI_WK_HOUGAMEN-期日未到来手形 PIC  X(100).
000220 01  KAI_WK_HOUGAMEN-営業部店意見 PIC  X(400).
000230 01  KAI_WK_HOUGAMEN-契約番号 PIC  X(009).
000240 01  KAI_WK_HOUGAMEN-報告NO PIC  X(008).
000250 01  KAI_WK_HOUGAMEN-取引先区分 PIC  X(001).
