000010************************************************
000020* (KAI_MONGON)
000030************************************************
000040 01  ‚j‚`‚h|‚l‚n‚m‚f‚n‚m|ƒL[€–Ú PIC S9(002) COMP-3.
000050 01  ‚j‚`‚h|‚l‚n‚m‚f‚n‚m|•¶Œ¾ PIC  X(600).
000060 01  ‚j‚`‚h|‚l‚n‚m‚f‚n‚m|“o˜^“ú PIC  X(008).
000070 01  ‚j‚`‚h|‚l‚n‚m‚f‚n‚m|“o˜^Žž PIC  X(006).
000080 01  ‚j‚`‚h|‚l‚n‚m‚f‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚`‚h|‚l‚n‚m‚f‚n‚m|XV“ú PIC  X(008).
000100 01  ‚j‚`‚h|‚l‚n‚m‚f‚n‚m|XVŽž PIC  X(006).
000110 01  ‚j‚`‚h|‚l‚n‚m‚f‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
