000010************************************************
000020* (KEI_KYOCHO_CD)
000030************************************************
000040 01  ‚j‚d‚h|‚j‚x‚n‚b‚g‚n|‚b‚c|Â–±‹¦’²ƒR[ƒh PIC  X(002).
000050 01  ‚j‚d‚h|‚j‚x‚n‚b‚g‚n|‚b‚c|“à—e PIC  X(050).
000060 01  ‚j‚d‚h|‚j‚x‚n‚b‚g‚n|‚b‚c|“o˜^“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚j‚x‚n‚b‚g‚n|‚b‚c|“o˜^Žž PIC  X(006).
000080 01  ‚j‚d‚h|‚j‚x‚n‚b‚g‚n|‚b‚c|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚j‚x‚n‚b‚g‚n|‚b‚c|XV“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚j‚x‚n‚b‚g‚n|‚b‚c|XVŽž PIC  X(006).
000110 01  ‚j‚d‚h|‚j‚x‚n‚b‚g‚n|‚b‚c|XV’S“–ŽÒƒR[ƒh PIC  X(004).
