000010************************************************
000020* (KEI_WK_EDA_KURINOBE)
000030************************************************
000040 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|”Ô† PIC  X(004).
000060 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žæˆøæ–¼ 
                                             PIC  X(060).
000070 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Œ_–ñ“ú PIC  X(008).
000080 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|ŒŸŽû—\’è“ú 
                                             PIC  X(008).
000090 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|[“–|‘ŠŽE‹æ•ª 
                                             PIC  X(001).
000100 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|‘O“n‹à‹æ•ª 
                                             PIC  X(001).
000110 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|w“üæ–¼ 
                                             PIC  X(060).
000120 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|w“üæZŠ 
                                             PIC  X(100).
000130 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000150 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„ŒŽ”‚P 
                                             PIC S9(002)V9(2) COMP-3.
000160 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„‹àŠz‚P 
                                             PIC S9(013) COMP-3.
000170 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ðŒ•¶Œ¾‚P 
                                             PIC  X(040).
000180 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„ŒŽ”‚Q 
                                             PIC S9(002)V9(2) COMP-3.
000190 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„‹àŠz‚Q 
                                             PIC S9(013) COMP-3.
000200 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ðŒ•¶Œ¾‚Q 
                                             PIC  X(040).
000210 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„ŒŽ”‚R 
                                             PIC S9(002)V9(2) COMP-3.
000220 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„‹àŠz‚R 
                                             PIC S9(013) COMP-3.
000230 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ðŒ•¶Œ¾‚R 
                                             PIC  X(040).
000240 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„ŒŽ”‚S 
                                             PIC S9(002)V9(2) COMP-3.
000250 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„‹àŠz‚S 
                                             PIC S9(013) COMP-3.
000260 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ðŒ•¶Œ¾‚S 
                                             PIC  X(040).
000270 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„ŒŽ”‚T 
                                             PIC S9(002)V9(2) COMP-3.
000280 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ŒJ‰„‹àŠz‚T 
                                             PIC S9(013) COMP-3.
000290 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|Žx•¥ðŒ•¶Œ¾‚T 
                                             PIC  X(040).
000300 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000310 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|“s“¹•{Œ§ 
                                             PIC  X(010).
000320 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|ZŠ‚P PIC  X(040).
000330 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|ZŠ‚Q PIC  X(040).
000340 01  ‚j‚d‚h|‚v‚j|‚d‚c‚`|‚j‚t‚q‚h‚m‚n‚a‚d|’[––”Ô† 
                                             PIC  X(016).
