000010************************************************
000020* (KEI_LPWK_EDA_THUMON1)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚P|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚P|’[––”Ô† 
                                             PIC  X(016).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚P|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚P|”Ô† 
                                             PIC S9(003) COMP-3.
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚P|w“üæ–¼ 
                                             PIC  X(060).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚P|w“üæZŠ 
                                             PIC  X(100).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚P|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚d‚c‚`|‚s‚g‚t‚l‚n‚m‚P|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
