000010************************************************
000020* (KEI_TENKAI_WK)
000030************************************************
000040 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|˜A”Ô PIC S9(003) COMP-3.
000060 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000070 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|‰ñ” PIC S9(003) COMP-3.
000080 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|“o˜^“ú PIC  X(008).
000090 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|“o˜^Žž PIC  X(006).
000100 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000110 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|XV“ú PIC  X(008).
000120 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|XVŽž PIC  X(006).
000130 01  ‚j‚d‚h|‚s‚d‚m‚j‚`‚h|‚v‚j|XV’S“–ŽÒƒR[ƒh PIC  X(004).
