000010************************************************
000020* (KEI_WK_YOTEI1)
000030************************************************
000040 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|’[––”Ô† PIC  X(016).
000060 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|Žæˆøæ“s“¹•{Œ§–¼ PIC  X(022).
000070 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|ŽæˆøæZŠ‚P PIC  X(040).
000080 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|ŽæˆøæZŠ‚Q PIC  X(040).
000090 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|Žæˆøæ–¼ PIC  X(060).
000100 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|“Œ‹âŽ–‹ÆŠ–¼ PIC  X(020).
000110 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|“Œ‹âŽ–‹ÆŠZŠ PIC  X(090).
000120 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|“Œ‹â’S“–ŽÒ–¼ PIC  X(020).
000130 01  ‚j‚d‚h|‚v‚j|‚x‚n‚s‚d‚h‚P|“Œ‹âŽ–‹ÆŠ“d˜b PIC  X(015).
