000010************************************************
000020* (KEI_LPWK_RINGI_KIHON)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|’[––”Ô† 
                                             PIC  X(016).
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|âg‹c‚m‚n 
                                             PIC  X(010).
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|âg‹c‹æ•ª 
                                             PIC  X(001).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Žæˆøæ‹æ•ª 
                                             PIC  X(001).
000100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh 
                                             PIC  X(006).
000120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Žæˆøæ–¼ 
                                             PIC  X(060).
000130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŽæˆøŒ`‘ÔƒR[ƒh 
                                             PIC  X(002).
000150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ˆÄŒ”­¶‹æ•ª 
                                             PIC  X(001).
000160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|•¨ŒŠm”FŠî€ 
                                             PIC  X(001).
000170 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|•¨Œ” 
                                             PIC S9(004) COMP-3.
000180 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|w“üæ” 
                                             PIC S9(002) COMP-3.
000190 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Œ_–ñ“ú 
                                             PIC  X(008).
000200 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒŸŽû—\’è“ú 
                                             PIC  X(008).
000210 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒŸŽû“ú 
                                             PIC  X(008).
000220 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒvŽZ•ûŽ® 
                                             PIC  X(001).
000230 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000240 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000250 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000260 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|˜’uŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000270 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘OŽóŒŽ” 
                                             PIC S9(002) COMP-3.
000280 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(2) COMP-3.
000290 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒŽŠz•½‹Ï•ÛŽç—¿ 
                                             PIC S9(013) COMP-3.
000300 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‚»‚Ì‘¼””ï—p‘Šz 
                                             PIC S9(013) COMP-3.
000310 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘O“n‹à—˜‘§ 
                                             PIC S9(013) COMP-3.
000320 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000330 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000340 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘O“n‹à‹æ•ª 
                                             PIC  X(001).
000350 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000360 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Žc‰¿Šz‡Œv 
                                             PIC S9(013) COMP-3.
000370 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000380 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Šî–{—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000390 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘e—˜‰v 
                                             PIC S9(013) COMP-3.
000400 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000410 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000420 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Šî–{ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000430 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒÅ’èŽ‘ŽYÅ‘Šz 
                                             PIC S9(013) COMP-3.
000440 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|“®‘•ÛŒ¯—¿‘Šz 
                                             PIC S9(013) COMP-3.
000450 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‹K’è‘¹Ž¸‹à•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000460 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒvŽZ•û–@|‹K’è‘¹Ž¸‹à 
                                             PIC  X(002).
000470 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒƒ“ƒRƒ~•t‹c‚m‚n 
                                             PIC  X(007).
000480 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒˆÏ‹æ•ª 
                                             PIC  X(001).
000490 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000500 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|I‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000510 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|¿‹‹æ•ª‚P 
                                             PIC  X(001).
000520 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|¿‹‹æ•ª‚Q 
                                             PIC  X(001).
000530 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘æ‚P‰ñƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000540 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‚Q‰ñ–ÚˆÈ~ƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000550 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŽèŒ`–‡” 
                                             PIC S9(003) COMP-3.
000560 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‹âsƒR[ƒh 
                                             PIC  X(007).
000570 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒûÀ”Ô† 
                                             PIC  X(007).
000580 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|e‰ïŽÐ–¼ 
                                             PIC  X(060).
000590 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Žæˆøæ•”–¼ 
                                             PIC  X(040).
000600 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|—X•Ö”Ô†‚RŒ… 
                                             PIC  X(003).
000610 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|—X•Ö”Ô†‚SŒ… 
                                             PIC  X(004).
000620 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|“s“¹•{Œ§ 
                                             PIC  X(010).
000630 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ZŠ‚P 
                                             PIC  X(040).
000640 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ZŠ‚Q 
                                             PIC  X(040).
000650 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ãê‹æ•ª 
                                             PIC  X(001).
000660 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘åŠé‹ÆƒR[ƒh 
                                             PIC  X(001).
000670 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|]‹Æˆõ” 
                                             PIC S9(006) COMP-3.
000680 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‚a‚s‚lŽæˆø‹æ•ª 
                                             PIC  X(001).
000690 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‚a‚s‚l’S“–•”“X
                                             PIC  X(030).
000700 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|—˜—pƒŠ[ƒX‰ïŽÐ 
                                             PIC  X(070).
000710 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‹ÆŽí 
                                             PIC  X(030).
000720 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Ž‘–{‹à 
                                             PIC S9(006) COMP-3.
000730 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŽæˆøŠJŽn“ú 
                                             PIC  X(008).
000740 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŽæˆøŽí—Þ 
                                             PIC  X(030).
000750 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Ý—§”NŒŽ“ú 
                                             PIC  X(008).
000760 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒˆŽZŒŽ 
                                             PIC  X(002).
000770 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒNƒŒƒ‰ƒCƒ“ŠúŒÀ”NŒŽ
                                             PIC  X(002).
000780 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŒˆŽZ”NŒŽ 
                                             PIC  X(006).
000790 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|”„ã‚ 
                                             PIC S9(013) COMP-3.
000800 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Œoí—˜‰v 
                                             PIC S9(013) COMP-3.
000810 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|“–Šú—˜‰v 
                                             PIC S9(013) COMP-3.
000820 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|\Š“¾ 
                                             PIC S9(013) COMP-3.
000830 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Ž©ŒÈŽ‘–{ 
                                             PIC S9(013) COMP-3.
000840 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘Ž‘ŽY 
                                             PIC S9(013) COMP-3.
000850 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒXŽc‚ƒ†[ƒU[ 
                                             PIC S9(013) COMP-3.
000860 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Š„•ŠŽc‚ƒ†[ƒU[ 
                                             PIC S9(013) COMP-3.
000870 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘Ý•tŽc‚ƒ†[ƒU[ 
                                             PIC S9(013) COMP-3.
000880 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒtƒ@ƒNŽc‚ƒ†[ƒU[ 
                                             PIC S9(013) COMP-3.
000890 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|–¢ŒŸŽûŽc‚ƒ†[ƒU[ 
                                             PIC S9(013) COMP-3.
000900 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|–¢’¥ŽûŽc‚ƒ†[ƒU[ 
                                             PIC S9(013) COMP-3.
000910 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|•ÛØŽc‰¿ƒ†[ƒU[ 
                                             PIC S9(013) COMP-3.
000920 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒXŽc‚–¼Šñ‚¹ 
                                             PIC S9(013) COMP-3.
000930 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Š„•ŠŽc‚–¼Šñ‚¹ 
                                             PIC S9(013) COMP-3.
000940 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘Ý•tŽc‚–¼Šñ‚¹ 
                                             PIC S9(013) COMP-3.
000950 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒtƒ@ƒNŽc‚–¼Šñ‚¹ 
                                            PIC S9(013) COMP-3.
000960 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|–¢ŒŸŽûŽc‚–¼Šñ‚¹ 
                                            PIC S9(013) COMP-3.
000970 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|–¢’¥ŽûŽc‚–¼Šñ‚¹ 
                                            PIC S9(013) COMP-3.
000980 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|•ÛØŽc‰¿–¼Šñ‚¹ 
                                            PIC S9(013) COMP-3.
000990 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒŠ[ƒXŽc‚ƒOƒ‹[ƒv 
                                            PIC S9(013) COMP-3.
001000 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Š„•ŠŽc‚ƒOƒ‹[ƒv 
                                            PIC S9(013) COMP-3.
001010 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‘Ý•tŽc‚ƒOƒ‹[ƒv 
                                            PIC S9(013) COMP-3.
001020 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ƒtƒ@ƒNŽc‚ƒOƒ‹[ƒv 
                                            PIC S9(013) COMP-3.
001030 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|–¢ŒŸŽûŽc‚ƒOƒ‹[ƒv 
                                            PIC S9(013) COMP-3.
001040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|–¢’¥ŽûŽc‚ƒOƒ‹[ƒv 
                                            PIC S9(013) COMP-3.
001050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|•ÛØŽc‰¿ƒOƒ‹[ƒv 
                                            PIC S9(013) COMP-3.
001060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|æ•û’S“–ŽÒ–¼‚P 
                                            PIC  X(014).
001070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|’¼’Ê“d˜b‚P                                                                                           PIC  X(015).
001080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ŽæˆøŒ`‘Ô–¼ 
                                            PIC  X(030).
001090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|ˆÄŒ”­¶“à—e 
                                            PIC  X(020).
001100 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Ž–‹ÆŠ–¼ 
                                            PIC  X(020).
001110 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|’S“–ŽÒ–¼ 
                                            PIC  X(020).
001120 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‚v‚jw“üˆóü—L–³
                                            PIC  X(001).
001130 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|˜A“®‹à—˜ 
                                            PIC S9(002)V9(8) COMP-3.
001140 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|‰c‹Æ•”ˆÓŒ© 
                                            PIC  X(340).
001150 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|Ši•t PIC  X(003).
001160 01  ‚j‚d‚h|‚k‚o‚v‚j|‚q‚h‚m‚f‚h|‚j‚h‚g‚n‚m|’é‘“_” 
                                           PIC  X(003).
