000010************************************************
000020* (KEI_ANKEN_KBN)
000030************************************************
000040 01  ‚j‚d‚h|‚`‚m‚j‚d‚m|‚j‚a‚m|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000050 01  ‚j‚d‚h|‚`‚m‚j‚d‚m|‚j‚a‚m|ˆÄŒ”­¶“à—e PIC  X(020).
000060 01  ‚j‚d‚h|‚`‚m‚j‚d‚m|‚j‚a‚m|“o˜^“ú PIC  X(008).
000070 01  ‚j‚d‚h|‚`‚m‚j‚d‚m|‚j‚a‚m|“o˜^Žž PIC  X(006).
000080 01  ‚j‚d‚h|‚`‚m‚j‚d‚m|‚j‚a‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚j‚d‚h|‚`‚m‚j‚d‚m|‚j‚a‚m|XV“ú PIC  X(008).
000100 01  ‚j‚d‚h|‚`‚m‚j‚d‚m|‚j‚a‚m|XVŽž PIC  X(006).
000110 01  ‚j‚d‚h|‚`‚m‚j‚d‚m|‚j‚a‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
