000010************************************************
000020* (KEI_PATTERN_WK)
000030************************************************
000040 01  ‚j‚d‚h|‚o‚`‚s‚s‚d‚q‚m|‚v‚j|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚o‚`‚s‚s‚d‚q‚m|‚v‚j|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚d‚h|‚o‚`‚s‚s‚d‚q‚m|‚v‚j|•¨ŒƒR[ƒh PIC  X(003).
000070 01  ‚j‚d‚h|‚o‚`‚s‚s‚d‚q‚m|‚v‚j|Ý’uêŠƒR[ƒh PIC  X(003).
