000010************************************************
000020* (KEI_LPWK_SEIKYUSYO_TENKAI)
000030************************************************
000040 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚m‚j‚`‚h|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚m‚j‚`‚h|˜A”Ô 
                                             PIC S9(003) COMP-3.
000060 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚m‚j‚`‚h|Á”ïÅŠz 
                                             PIC S9(013) COMP-3.
000070 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚m‚j‚`‚h|ŽèŒ`–‡” 
                                             PIC S9(003) COMP-3.
000080 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚m‚j‚`‚h|Á”ïÅŒvŽZƒtƒ‰ƒO 
                                             PIC  X(001).
000090 01  ‚j‚d‚h|‚k‚o‚v‚j|‚r‚d‚h‚j‚x‚t‚r‚x‚n|‚s‚d‚m‚j‚`‚h|’[––”Ô† 
                                             PIC  X(016).
