000010************************************************
000020* (KEI_BUNKATU_KIHON)
000030************************************************
000040 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|V•¨Œ‚m‚n PIC  X(003).
000060 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|•¨Œ–¼|Š¿Žš 
                                             PIC  X(040).
000080 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|•¨Œ–¼|ƒJƒi 
                                             PIC  X(020).
000090 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|Žd—l»‘¢”Ô† 
                                             PIC  X(020).
000100 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|”—Ê 
                                             PIC S9(004) COMP-3.
000110 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|w“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000120 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|”[•tæƒR[ƒh 
                                             PIC  X(006).
000130 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|Ý’uêŠ—X•Ö”Ô† 
                                             PIC  X(007).
000140 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|Ý’uêŠZŠ 
                                             PIC  X(100).
000150 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|Ý’uêŠ–¼|Š¿Žš 
                                             PIC  X(040).
000160 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|Ý’uêŠ–¼|ƒJƒi 
                                             PIC  X(020).
000170 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000180 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚P 
                                             PIC  X(012).
000190 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚Q 
                                             PIC  X(012).
000200 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000210 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
000220 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
000230 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000240 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
000250 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
000260 01  ‚j‚d‚h|‚a‚t‚m‚j‚`‚s‚t|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
