000010************************************************
000020* (KOK_SOUKI_SOSIN)
000030************************************************
000040 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‚r‚n‚r‚h‚m|‘—Mƒf[ƒ^ PIC  X(350).
