000010************************************************
000020* (KOK_TANTO)
000030************************************************
000040 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|ŒÚ‹qƒR[ƒh PIC  X(006).
000050 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|æ•û’S“–ŽÒ–¼‚P PIC  X(014).
000060 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|–ðE–¼‚P PIC  X(014).
000070 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|’¼’Ê“d˜b‚P PIC  X(015).
000080 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|‚dƒ[ƒ‹‚P PIC  X(040).
000090 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|ƒRƒƒ“ƒg‚P PIC  X(200).
000100 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|æ•û’S“–ŽÒ–¼‚Q PIC  X(014).
000110 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|–ðE–¼‚Q PIC  X(014).
000120 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|’¼’Ê“d˜b‚Q PIC  X(015).
000130 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|‚dƒ[ƒ‹‚Q PIC  X(040).
000140 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|ƒRƒƒ“ƒg‚Q PIC  X(200).
000150 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|æ•û’S“–ŽÒ–¼‚R PIC  X(014).
000160 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|–ðE–¼‚R PIC  X(014).
000170 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|æ•û’S“–ŽÒ–¼‚S PIC  X(014).
000180 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|–ðE–¼‚S PIC  X(014).
000190 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|“o˜^“ú PIC  X(008).
000200 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|“o˜^Žž PIC  X(006).
000210 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000220 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|XV“ú PIC  X(008).
000230 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|XVŽž PIC  X(006).
000240 01  ‚j‚n‚j|‚s‚`‚m‚s‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
