000010************************************************
000020* (KOK_SOUKI)
000030************************************************
000040 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|ŒÚ‹qƒR[ƒh PIC  X(008).
000050 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|Žæˆøæ–¼ƒJƒi PIC  X(070).
000060 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|Žæˆøæ–¼Š¿Žš PIC  X(100).
000070 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|ZŠ PIC  X(100).
000080 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|¶”NŒŽ“ú PIC  X(007).
000090 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|‘ã•\ŽÒŽ–¼ PIC  X(030).
000100 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|“o˜^“ú PIC  X(008).
000110 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|“o˜^Žž PIC  X(006).
000120 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000130 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|XV“ú PIC  X(008).
000140 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|XVŽž PIC  X(006).
000150 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000160 01  ‚j‚n‚j|‚r‚n‚t‚j‚h|íœ‹æ•ª PIC  X(001).
