000010************************************************
000020* (KOK_PATCH_JIGYO)
000030************************************************
000040 01  ‚j‚n‚j|‚o‚`‚s‚b‚g|‚i‚h‚f‚x‚n|ŽæˆøæƒR[ƒh PIC  X(008).
000050 01  ‚j‚n‚j|‚o‚`‚s‚b‚g|‚i‚h‚f‚x‚n|VŽ–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚j‚n‚j|‚o‚`‚s‚b‚g|‚i‚h‚f‚x‚n|V’S“–ŽÒƒR[ƒh PIC  X(004).
000070 01  ‚j‚n‚j|‚o‚`‚s‚b‚g|‚i‚h‚f‚x‚n|VƒT[ƒo[ƒR[ƒh 
                                             PIC  X(002).
