000010************************************************
000020* (KSL_KEI_LPWK_KEISANSYO_2)
000030************************************************
000040 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚Q|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚Q|‚v‚j˜A”Ô 
                                             PIC S9(003) COMP-3.
000060 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚Q|’[––”Ô† 
                                             PIC  X(016).
000070 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚Q|Žx•¥ŒJ‰„‹àŠz 
                                             PIC S9(013) COMP-3.
000080 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚Q|Žx•¥ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
