000010************************************************
000020* (KSL_KEI_SEIKYU)
000030************************************************
000040 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|¿‹æƒR[ƒh PIC  X(008).
000060 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|¿‹æ–¼ PIC  X(060).
000070 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|¿‹æ—X•Ö”Ô† PIC  X(007).
000080 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|¿‹æZŠ PIC  X(100).
000090 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|¿‹æ“d˜b”Ô† PIC  X(015).
000100 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|¿‹æ•”–å–¼Ì PIC  X(040).
000110 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|¿‹‹æ•ª‚P PIC  X(001).
000120 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|¿‹‹æ•ª‚Q PIC  X(001).
000130 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‘æ‚P‰ñƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000140 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‘æ‚Q‰ñ–ÚˆÈ~ƒŠ[ƒX—¿ŽóŽæðŒ 
                                             PIC  X(020).
000150 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|ŽèŒ`–‡” PIC S9(003) COMP-3.
000160 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|“ü‹àŠî€“ú PIC  X(002).
000170 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|—a‹àŽí—Þ PIC  X(001).
000180 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‹âsƒR[ƒh PIC  X(007).
000190 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|ŒûÀ”Ô† PIC  X(007).
000200 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000210 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000220 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‘OŽóƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000230 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|Žc‰¿‰ñŽû“ú PIC  X(008).
000240 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|‹âs’ZkƒR[ƒh PIC  X(002).
000250 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|“o˜^“ú PIC  X(008).
000260 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|“o˜^Žž PIC  X(006).
000270 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000280 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|XV“ú PIC  X(008).
000290 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|XVŽž PIC  X(006).
000300 01  ‚j‚r‚k|‚j‚d‚h|‚r‚d‚h‚j‚x‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
