000010************************************************
000020* (KSL_KEI_LPWK_TORIHIKI2)
000030************************************************
000040 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|•¨Œ‚m‚n 
                                             PIC  X(003).
000060 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|‚v‚j˜A”Ô 
                                             PIC S9(003) COMP-3.
000070 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|’[––”Ô† 
                                             PIC  X(016).
000080 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|w“üæŽ¯•Ê‚m‚n 
                                             PIC  X(001).
000090 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|•¨Œ–¼|Š¿Žš 
                                             PIC  X(040).
000100 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|•¨Œ–¼|ƒJƒi 
                                             PIC  X(020).
000110 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Žd—l»‘¢”Ô† 
                                             PIC  X(020).
000120 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|»‘¢‹ÆŽÒ 
                                             PIC  X(060).
000130 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|’P‰¿ 
                                             PIC S9(013) COMP-3.
000140 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|”—Ê 
                                             PIC S9(004) COMP-3.
000150 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|w“ü‹àŠz 
                                             PIC S9(013) COMP-3.
000160 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000170 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|ŒÂ•ÊƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000180 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|’†ŒÃ•iƒR[ƒh 
                                             PIC  X(001).
000190 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|“®‘•t•Û‹æ•ª 
                                             PIC  X(001).
000200 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|“®‘•ÛŒ¯ƒR[ƒh 
                                             PIC  X(004).
000210 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|“®‘•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(3) COMP-3.
000220 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Ž‘ŽYƒR[ƒh 
                                             PIC  X(007).
000230 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|‘Ï—p”N” 
                                             PIC S9(002) COMP-3.
000240 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|M—p•ÛŒ¯ƒR[ƒh 
                                             PIC  X(006).
000250 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Œ^Ž®”Ô† 
                                             PIC  X(015).
000260 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Žc‰¿•ÛØ‹æ•ª 
                                             PIC  X(001).
000270 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Žc‰¿Šz 
                                             PIC S9(013) COMP-3.
000280 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Žc‰¿•ÛØæƒR[ƒh 
                                             PIC  X(008).
000290 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Žc‰¿•ÛØæ–¼ 
                                             PIC  X(060).
000300 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Å‹æ•ª 
                                             PIC  X(001).
000310 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Å•‰’SƒR[ƒh 
                                             PIC  X(001).
000320 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|ŒÅ’èŽ‘ŽYÅŠz 
                                             PIC S9(002)V9(2) COMP-3.
000330 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|“Á—á—¦|•ªŽq 
                                             PIC S9(002) COMP-3.
000340 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|“Á—á—¦|•ª•ê 
                                             PIC S9(002) COMP-3.
000350 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|“Á—áŠúŠÔ 
                                             PIC S9(002) COMP-3.
000360 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Ý’uêŠ–¼|Š¿Žš 
                                             PIC  X(040).
000370 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Ý’uêŠ–¼|ƒJƒi 
                                             PIC  X(020).
000380 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Ý’uêŠ—X•Ö”Ô† 
                                             PIC  X(007).
000390 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|”[•tæƒR[ƒh 
                                             PIC  X(006).
000400 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Ý’uêŠZŠ 
                                             PIC  X(100).
000410 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|ƒ†[ƒU[‚q‚d‚e‚P 
                                             PIC  X(012).
000420 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|ƒ†[ƒU[‚q‚d‚e‚Q 
                                             PIC  X(012).
000430 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|ƒ†[ƒU[‚q‚d‚e‚R 
                                             PIC  X(012).
000440 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|ƒ†[ƒU[‚q‚d‚e‚S 
                                             PIC  X(012).
000450 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Žw’è“dŽqŒvŽZ‹@ 
                                             PIC  X(040).
000460 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Žg—pŒ Ý’èŽÒ 
                                             PIC  X(060).
000470 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|Ž‘ŽYƒ}ƒXƒ^Ž‘ŽY–¼ 
                                             PIC  X(030).
000480 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|ƒfƒB[ƒ‰[ƒR[ƒh 
                                             PIC  X(005).
000490 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚s‚n‚q‚h‚g‚h‚j‚h‚Q|w“üæ–¼ 
                                             PIC  X(060).
