000010************************************************
000020* (KSL_KEI_MITUMO)
000030************************************************
000040 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|Žæˆøæ–¼ PIC  X(060).
000060 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|‘ã•\•¨Œ–¼ PIC  X(040).
000070 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|•¨Œ‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000080 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|•¨Œ‹àŠzÁ”ïÅ 
                                             PIC S9(010) COMP-3.
000090 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|”—Ê PIC S9(004) COMP-3.
000100 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|‰Ád‘Ï—p”N” 
                                             PIC S9(002)V9(2) COMP-3.
000110 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|‰ÁdŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000120 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000130 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|‘OŽóŒŽ” PIC S9(002) COMP-3.
000140 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|‹àŒÉŽx“XƒR[ƒh PIC  X(005).
000150 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|‹àŒÉ–¼ PIC  X(020).
000160 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|Žx“X–¼ PIC  X(020).
000170 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|“Œ‹âƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000180 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|“Œ‹â‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000190 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|”õl PIC  X(100).
000200 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|o—Í‹æ•ª PIC  X(001).
000210 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|“o˜^“ú PIC  X(008).
000220 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|“o˜^Žž PIC  X(006).
000230 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000240 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|XV“ú PIC  X(008).
000250 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|XVŽž PIC  X(006).
000260 01  ‚j‚r‚k|‚j‚d‚h|‚l‚h‚s‚t‚l‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
