000010************************************************
000020* (KSL_KEI_LPWK_KEISANSYO_1)
000030************************************************
000040 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Œ_–ñ”Ô† 
                                             PIC  X(009).
000050 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|’[––”Ô† 
                                             PIC  X(016).
000060 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000070 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000080 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Žæˆøæ–¼ 
                                             PIC  X(060).
000090 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Š¨’èˆ—ƒR[ƒh 
                                             PIC  X(002).
000100 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŽæˆøŒ`‘ÔƒR[ƒh 
                                             PIC  X(002).
000110 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Œ_–ñ“ú 
                                             PIC  X(008).
000120 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒŸŽû—\’è“ú 
                                             PIC  X(008).
000130 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒŸŽû“ú 
                                             PIC  X(008).
000140 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒvŽZ•ûŽ® 
                                             PIC  X(001).
000150 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000160 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000170 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000180 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|˜’uŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000190 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‘OŽóŒŽ” 
                                             PIC S9(002) COMP-3.
000200 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(2) COMP-3.
000210 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒŽŠz•½‹Ï•ÛŽç—¿ 
                                             PIC S9(013) COMP-3.
000220 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‚»‚Ì‘¼””ï—p‘Šz 
                                             PIC S9(013) COMP-3.
000230 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‘O“n‹à—˜‘§ 
                                             PIC S9(013) COMP-3.
000240 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000250 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Á”ïÅ’¥Žû‹æ•ª 
                                             PIC  X(001).
000260 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000270 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000280 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‘O“n‹à‹æ•ª 
                                             PIC  X(001).
000290 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ÄƒŠ[ƒX—¿•\Ž¦‹æ•ª 
                                             PIC  X(001).
000300 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ÄƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000310 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000320 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Žc‰¿Šz‡Œv 
                                             PIC S9(013) COMP-3.
000330 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000340 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Šî–{—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000350 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‘e—˜‰v 
                                             PIC S9(013) COMP-3.
000360 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000370 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000380 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Šî–{ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000390 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒÅ’èŽ‘ŽYÅ‘Šz 
                                             PIC S9(013) COMP-3.
000400 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|“®‘•ÛŒ¯—¿‘Šz 
                                             PIC S9(013) COMP-3.
000410 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‹K’è‘¹Ž¸‹à•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000420 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒvŽZ•û–@|‹K’è‘¹Ž¸‹à 
                                             PIC  X(002).
000430 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000440 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|I‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000450 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Žd“üÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000460 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‰Ád‘Ï—p”N” 
                                             PIC S9(002)V9(8) COMP-3.
000470 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‰Ád•ÛŒ¯—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000480 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Šî–{ƒŠ[ƒX—¿‘Šz 
                                             PIC S9(013) COMP-3.
000490 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Šî–{ƒŠ[ƒX—¿ŒŽŠz 
                                             PIC S9(013) COMP-3.
000500 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒÅ’èŽ‘ŽYÅŒŽŠz 
                                             PIC S9(013) COMP-3.
000510 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|“®‘•ÛŒ¯—¿ŒŽŠz 
                                             PIC S9(013) COMP-3.
000520 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‘OŽóƒŠ[ƒX—¿‘Šz 
                                             PIC S9(013) COMP-3.
000530 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒJ‰„ƒŠ[ƒX—¿‘Šz 
                                             PIC S9(013) COMP-3.
000540 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|•ÛŽç—¿‘Šz 
                                             PIC S9(013) COMP-3.
000550 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒŽŠz‘OŽóƒƒŠƒbƒg 
                                             PIC S9(013) COMP-3.
000560 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŒŽŠzŒJ‰„ƒƒŠƒbƒg 
                                             PIC S9(013) COMP-3.
000570 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ŽÀŽ¿‚o‚u 
                                             PIC S9(013) COMP-3.
000580 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|Žc‰¿‚o‚u 
                                             PIC S9(013) COMP-3.
000590 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|’èŠzƒŠ[ƒXÁ”ïÅŠz 
                                             PIC S9(013) COMP-3.
000600 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|‰‰ñƒŠ[ƒXÁ”ïÅŠz 
                                             PIC S9(013) COMP-3.
000610 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|I‰ñƒŠ[ƒXÁ”ïÅŠz 
                                             PIC S9(013) COMP-3.
000620 01  ‚j‚r‚k|‚j‚d‚h|‚k‚o‚v‚j|‚j‚d‚h‚r‚`‚m‚r‚x‚n|‚P|ƒŠ[ƒXÁ”ïÅ‡Œv 
                                             PIC S9(013) COMP-3.
