000010************************************************
000020* (KSL_WK_ERR1)
000030************************************************
000040 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|“à—e PIC  X(060).
000060 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000070 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|Žæˆøæ–¼ PIC  X(060).
000080 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000090 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|Œ_–ñ“ú PIC  X(008).
000100 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|ŒŸŽû“ú PIC  X(008).
000110 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000120 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000130 01  ‚j‚r‚k|‚v‚j|‚d‚q‚q‚P|‹àŒÉŽx“XƒR[ƒh PIC  X(005).
