000010************************************************
000020* (KTK_SAIBAN)
000030************************************************
000040 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000050 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|Œ_–ñŒ`‘Ô PIC  X(001).
000060 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|Šú PIC S9(002) COMP-3.
000070 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|’S“–•”“X PIC  X(001).
000080 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|˜A”Ô PIC  X(003).
000090 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|“o˜^“ú PIC  X(008).
000100 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|“o˜^Žž PIC  X(006).
000110 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|XV“ú PIC  X(008).
000130 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|XVŽž PIC  X(006).
000140 01  ‚j‚s‚j|‚r‚`‚h‚a‚`‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
