000010************************************************
000020* (KTK_KIHON)
000030************************************************
000040 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ƒf[ƒ^‹æ•ª PIC  X(001).
000060 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000070 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000080 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000090 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|–¼Šñ‚¹ƒR[ƒh PIC  X(008).
000100 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŒÚ‹qƒR[ƒh PIC  X(006).
000110 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|V‹K‘‘Ö‹æ•ª PIC  X(001).
000120 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Œ_–ñ“ú PIC  X(008).
000130 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŽÀs“ú PIC  X(008).
000140 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000150 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘Ý•tŽí—Þ PIC  X(001).
000160 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Œ³–{Œ³—˜‹æ•ª PIC  X(001).
000170 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘Ý•t‹àŠz PIC S9(013) COMP-3.
000180 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Œ_–ñŠúŠÔ PIC S9(003) COMP-3.
000190 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Šú“ú PIC  X(008).
000200 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|’·’Z‹æ•ª PIC  X(001).
000210 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‹à—˜•Ï“®‹æ•ª PIC  X(001).
000220 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|–ñ’è•ÙÏ‹æ•ª PIC  X(001).
000230 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000240 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŽóŽæŽè”—¿Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000250 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥“ú PIC  X(008).
000260 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000270 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥æƒR[ƒh PIC  X(004).
000280 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥æ–¼ PIC  X(040).
000290 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥æ‹âsƒR[ƒh PIC  X(007).
000300 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥æŒûÀ”Ô† PIC  X(007).
000310 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥æ—a‹àŽí—Þ PIC  X(001).
000320 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥³”F‚m‚n PIC  X(006).
000330 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥³”F“ú PIC  X(008).
000340 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žx•¥³”F’S“–ŽÒƒR[ƒh PIC  X(004).
000350 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|—˜—¦Šî”ƒR[ƒh PIC  X(001).
000360 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‰‰ñ“úŠ„‹æ•ª PIC  X(001).
000370 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|—˜‘§’[”ˆ—ƒR[ƒh PIC  X(001).
000380 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘OŽæŒãŽæ‹æ•ª PIC  X(001).
000390 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|•Ð’[—¼’[‹æ•ª PIC  X(001).
000400 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‹x“ú‘Î‰ž‹æ•ª PIC  X(001).
000410 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|˜A“®‹à—˜‹æ•ª PIC  X(002).
000420 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Œ©’¼‚µƒTƒCƒNƒ‹ PIC S9(003) COMP-3.
000430 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ƒXƒvƒŒƒbƒh PIC S9(002)V9(8) COMP-3.
000440 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“ü‹à“ú PIC S9(002) COMP-3.
000450 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘æ‚P‰ñ“à“ü“ú PIC  X(008).
000460 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|˜’uŒŽ” PIC S9(002)V9(2) COMP-3.
000470 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“à“üƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000480 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“à“ü‰ñ” PIC S9(003) COMP-3.
000490 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘æ‚P‰ñ—˜•¥“ú PIC  X(008).
000500 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|—˜•¥ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000510 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|—˜•¥‰ñ” PIC S9(003) COMP-3.
000520 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|–ñ’è“úŒvŽZ‹æ•ª PIC  X(001).
000530 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‚í‚©‚¿ŒvŽZ‹æ•ª PIC  X(001).
000540 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‹à—˜•ÏXŠî€“úƒR[ƒh PIC  X(001).
000550 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|—˜—¦Šm’èŠúŒÀ PIC  X(008).
000560 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|—˜—¦ PIC S9(002)V9(8) COMP-3.
000570 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŽÐ“à‹à—˜ PIC S9(002)V9(8) COMP-3.
000580 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŒŽ—˜•¡—˜—¦|Šî–{ 
                                             PIC S9(002)V9(8) COMP-3.
000590 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŒŽ—˜•¡—˜—¦|ŽÀŽ¿ 
                                             PIC S9(002)V9(8) COMP-3.
000600 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘e—˜‰v PIC S9(013) COMP-3.
000610 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000620 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Žæˆøæ‹æ•ª PIC  X(001).
000630 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|âg‹c‚m‚n PIC  X(010).
000640 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|âg‹c‹æ•ª PIC  X(001).
000650 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ƒ[ƒ“ƒRƒ~•t‹c‚m‚n PIC  X(007).
000660 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŽæˆøŒ`‘ÔƒR[ƒh PIC  X(002).
000670 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŒˆÙ‹æ•ª PIC  X(001).
000680 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|’S•Û‹æ•ª PIC  X(001).
000690 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|’S•Ûî•ñÚ× PIC  X(100).
000700 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‰c‹Æ•”ˆÓŒ© PIC  X(200).
000710 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Ž––±˜A—Ž–€ PIC  X(200).
000720 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŽØ“ü•ûŽ® PIC  X(001).
000730 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Ž‘‹àŽg“r‹æ•ª PIC  X(001).
000740 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Ž‘‹àŽg“rÚ× PIC  X(100).
000750 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚P PIC  X(800).
000760 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚Q PIC  X(800).
000770 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚R PIC  X(800).
000780 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚S PIC  X(800).
000790 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚T PIC  X(800).
000800 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚U PIC  X(800).
000810 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚V PIC  X(800).
000820 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚W PIC  X(800).
000830 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚X PIC  X(800).
000840 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“Á–ñð€‚P‚O PIC  X(800).
000850 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|•¨Œ–¼ PIC  X(040).
000860 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Ý’uêŠ–¼ PIC  X(040).
000870 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000880 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Ý’uêŠZŠ PIC  X(100).
000890 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|¿‹æƒR[ƒh PIC  X(008).
000900 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‹âsƒR[ƒh PIC  X(007).
000910 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŒûÀ”Ô† PIC  X(007).
000920 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|—a‹àŽí—Þ PIC  X(001).
000930 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ_–ñ”Ô†‚P PIC  X(009).
000940 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ³–{Žc‚‚P PIC S9(013) COMP-3.
000950 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³—˜‘§Šz‚P PIC S9(013) COMP-3.
000960 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ_–ñ”Ô†‚Q PIC  X(009).
000970 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ³–{Žc‚‚Q PIC S9(013) COMP-3.
000980 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³—˜‘§Šz‚Q PIC S9(013) COMP-3.
000990 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ_–ñ”Ô†‚R PIC  X(009).
001000 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ³–{Žc‚‚R PIC S9(013) COMP-3.
001010 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³—˜‘§Šz‚R PIC S9(013) COMP-3.
001020 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ_–ñ”Ô†‚S PIC  X(009).
001030 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ³–{Žc‚‚S PIC S9(013) COMP-3.
001040 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³—˜‘§Šz‚S PIC S9(013) COMP-3.
001050 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ_–ñ”Ô†‚T PIC  X(009).
001060 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³Œ³–{Žc‚‚T PIC S9(013) COMP-3.
001070 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|‘‘ÖŒ³—˜‘§Šz‚T PIC S9(013) COMP-3.
001080 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŒˆÏ“ú PIC  X(008).
001090 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŒˆÏŽžŒ³–{Žc‚ PIC S9(013) COMP-3.
001100 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|ŒˆÏŽž—˜‘§Šz PIC S9(013) COMP-3.
001110 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|–ß‚µ—˜‘§Šz PIC S9(013) COMP-3.
001120 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|–ß‚µ—˜—¦ PIC S9(002)V9(8) COMP-3.
001130 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|–ß‚µ“ú” PIC S9(004) COMP-3.
001140 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|–ß‚µ—˜‘§‘ŠŽEƒR[ƒh PIC  X(001).
001150 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|•ÔÏŽè”—¿ PIC S9(013) COMP-3.
001160 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|•ÔÏŽè”—¿Á”ïÅ“™Šz PIC S9(013) COMP-3.
001170 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|âg‹c‘”­s‹æ•ª PIC  X(001).
001180 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|Œ_–ñ‘”­s‹æ•ª PIC  X(001).
001190 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“o˜^“ú PIC  X(008).
001200 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“o˜^Žž PIC  X(006).
001210 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
001220 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|XV“ú PIC  X(008).
001230 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|XVŽž PIC  X(006).
001240 01  ‚j‚s‚j|‚j‚h‚g‚n‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
