000010************************************************
000020* (LEA_WORK04)
000030************************************************
000040 01  LEA_WORK04-KEY PIC  X(001).
000050 01  LEA_WORK04-支払連番 PIC S9(003) COMP-3.
000060 01  LEA_WORK04-元本 PIC S9(013) COMP-3.
000070 01  LEA_WORK04-賦金 PIC S9(013) COMP-3.
000080 01  LEA_WORK04-諸費用 PIC S9(013) COMP-3.
000090 01  LEA_WORK04-利息 PIC S9(013) COMP-3.
000100 01  LEA_WORK04-元本内入 PIC S9(013) COMP-3.
000110 01  LEA_WORK04-一括弁済金 PIC S9(013) COMP-3.
000120 01  LEA_WORK04-固定資産税月額 PIC S9(013) COMP-3.
000130 01  LEA_WORK04-動総保険月額 PIC S9(013) COMP-3.
000140 01  LEA_WORK04-ﾘｰｽ期間 PIC S9(003) COMP-3.
000150 01  LEA_WORK04-据置月数 PIC S9(002)V9(2) COMP-3.
000160 01  LEA_WORK04-契約総額 PIC S9(013) COMP-3.
000170 01  LEA_WORK04-購入金額 PIC S9(013) COMP-3.
000180 01  LEA_WORK04-残価額 PIC S9(013) COMP-3.
000190 01  LEA_WORK04-登録日 PIC  X(008).
000200 01  LEA_WORK04-登録時刻 PIC  X(006).
000210 01  LEA_WORK04-登録担当者ｺｰﾄﾞ PIC  X(004).
000220 01  LEA_WORK04-更新日 PIC  X(008).
000230 01  LEA_WORK04-更新時刻 PIC  X(006).
000240 01  LEA_WORK04-更新担当者ｺｰﾄﾞ PIC  X(004).
