000010************************************************
000020* (LEA_KEKKA)
000030************************************************
000040 01  LEA_KEKKA-KEY PIC  X(001).
000050 01  LEA_KEKKA-結果NO PIC S9(005) COMP-3.
000060 01  LEA_KEKKA-ﾘｰｽ料 PIC S9(013) COMP-3.
000070 01  LEA_KEKKA-ﾘｰｽ料率 PIC S9(002)V9(8) COMP-3.
000080 01  LEA_KEKKA-実質利回り PIC S9(002)V9(8) COMP-3.
000090 01  LEA_KEKKA-粗利 PIC S9(013) COMP-3.
000100 01  LEA_KEKKA-FROM PIC S9(001) COMP-3.
000110 01  LEA_KEKKA-TO PIC S9(001) COMP-3.
000120 01  LEA_KEKKA-計算方式 PIC  X(001).
000130 01  LEA_KEKKA-登録日 PIC  X(008).
000140 01  LEA_KEKKA-登録時刻 PIC  X(006).
000150 01  LEA_KEKKA-登録担当者ｺｰﾄﾞ PIC  X(004).
000160 01  LEA_KEKKA-更新日 PIC  X(008).
000170 01  LEA_KEKKA-更新時刻 PIC  X(006).
000180 01  LEA_KEKKA-更新担当者ｺｰﾄﾞ PIC  X(004).
