000010************************************************
000020* (LEA_WORK05)
000030************************************************
000040 01  LEA_WORK05-KEY PIC  X(001).
000050 01  LEA_WORK05-支払連番1 PIC S9(003) COMP-3.
000060 01  LEA_WORK05-支払日1 PIC  X(008).
000070 01  LEA_WORK05-ﾘｰｽ料1 PIC S9(013) COMP-3.
000080 01  LEA_WORK05-残高1 PIC S9(013) COMP-3.
000090 01  LEA_WORK05-支払連番2 PIC S9(003) COMP-3.
000100 01  LEA_WORK05-支払日2 PIC  X(008).
000110 01  LEA_WORK05-ﾘｰｽ料2 PIC S9(013) COMP-3.
000120 01  LEA_WORK05-残高2 PIC S9(013) COMP-3.
000130 01  LEA_WORK05-支払連番3 PIC S9(003) COMP-3.
000140 01  LEA_WORK05-支払日3 PIC  X(008).
000150 01  LEA_WORK05-ﾘｰｽ料3 PIC S9(013) COMP-3.
000160 01  LEA_WORK05-残高3 PIC S9(013) COMP-3.
000170 01  LEA_WORK05-支払連番4 PIC S9(003) COMP-3.
000180 01  LEA_WORK05-支払日4 PIC  X(008).
000190 01  LEA_WORK05-ﾘｰｽ料4 PIC S9(013) COMP-3.
000200 01  LEA_WORK05-残高4 PIC S9(013) COMP-3.
000210 01  LEA_WORK05-支払連番5 PIC S9(003) COMP-3.
000220 01  LEA_WORK05-支払日5 PIC  X(008).
000230 01  LEA_WORK05-ﾘｰｽ料5 PIC S9(013) COMP-3.
000240 01  LEA_WORK05-残高5 PIC S9(013) COMP-3.
000250 01  LEA_WORK05-ﾘｰｽ期間 PIC S9(003) COMP-3.
000260 01  LEA_WORK05-前受月数 PIC S9(002) COMP-3.
000270 01  LEA_WORK05-契約総額 PIC S9(013) COMP-3.
000280 01  LEA_WORK05-残価額 PIC S9(013) COMP-3.
000290 01  LEA_WORK05-登録日 PIC  X(008).
000300 01  LEA_WORK05-登録時刻 PIC  X(006).
000310 01  LEA_WORK05-登録担当者ｺｰﾄﾞ PIC  X(004).
000320 01  LEA_WORK05-更新日 PIC  X(008).
000330 01  LEA_WORK05-更新時刻 PIC  X(006).
000340 01  LEA_WORK05-更新担当者ｺｰﾄﾞ PIC  X(004).
