000010************************************************
000020* (LEA_BUKKEN)
000030************************************************
000040 01  LEA_BUKKEN-KEY PIC  X(001).
000050 01  LEA_BUKKEN-物件NO PIC  X(003).
000060 01  LEA_BUKKEN-購入金額 PIC S9(013) COMP-3.
000070 01  LEA_BUKKEN-残価額 PIC S9(013) COMP-3.
000080 01  LEA_BUKKEN-耐用年数 PIC S9(002) COMP-3.
000090 01  LEA_BUKKEN-動総保険料率 PIC S9(002)V9(3) COMP-3.
000100 01  LEA_BUKKEN-固定資産税率 PIC S9(002)V9(2) COMP-3.
000110 01  LEA_BUKKEN-登録日 PIC  X(008).
000120 01  LEA_BUKKEN-登録時刻 PIC  X(006).
000130 01  LEA_BUKKEN-登録担当者ｺｰﾄﾞ PIC  X(004).
000140 01  LEA_BUKKEN-更新日 PIC  X(008).
000150 01  LEA_BUKKEN-更新時刻 PIC  X(006).
000160 01  LEA_BUKKEN-更新担当者ｺｰﾄﾞ PIC  X(004).
