000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(ÄƒŠ[ƒX—¿ŒvŽZ—¦)(LTRCDM1440)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚S‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚S‚O|¿‹æƒR[ƒh PIC  X(008).
000060 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚S‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(003).
000070 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚S‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(150).
000080 01  ‚k‚s‚q‚b‚c‚l‚P‚S‚S‚O|‹¤’Êî•ñ PIC  X(035).
