000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(Á”ïÅ—¦)(LTRCDM0320)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|‰ÛÅŽí—Þ PIC  X(007).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l‚P PIC  X(007).
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚lÅ—¦‚P 
                                             PIC S9(002)V9(3) COMP-3.
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|ƒ_ƒ~[‚P PIC  X(019).
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l‚Q PIC  X(007).
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚lÅ—¦‚Q 
                                             PIC S9(002)V9(3) COMP-3.
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|ƒ_ƒ~[‚Q PIC  X(019).
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l‚R PIC  X(007).
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚lÅ—¦‚R 
                                             PIC S9(002)V9(3) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|ƒ_ƒ~[‚R PIC  X(019).
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l‚S PIC  X(007).
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚lÅ—¦‚S 
                                             PIC S9(002)V9(3) COMP-3.
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|ƒ_ƒ~[‚S PIC  X(019).
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l‚T PIC  X(007).
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚lÅ—¦‚T 
                                             PIC S9(002)V9(3) COMP-3.
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|ƒ_ƒ~[‚T PIC  X(019).
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚Q‚O|‹¤’Êî•ñ PIC  X(035).
