000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(M—p•ÛŒ¯—¿—¦‹æ•ªEƒŠ[ƒX)(LTRCDM0220)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|•ÛŒ¯ŠúŠÔŒŽ” PIC S9(003) COMP-3.
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Šî–{•ÛŒ¯—¿—¦‚P 
                                             PIC S9(002)V9(4) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø‹æ•ª‚P PIC  X(001).
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø—¦‚P PIC S9(003) COMP-3.
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|ƒ_ƒ~[‚P PIC  X(016).
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Šî–{•ÛŒ¯—¿—¦‚Q 
                                             PIC S9(002)V9(4) COMP-3.
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø‹æ•ª‚Q PIC  X(001).
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø—¦‚Q PIC S9(003) COMP-3.
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|ƒ_ƒ~[‚Q PIC  X(016).
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Šî–{•ÛŒ¯—¿—¦‚R 
                                             PIC S9(002)V9(4) COMP-3.
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø‹æ•ª‚R PIC  X(001).
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø—¦‚R PIC S9(003) COMP-3.
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|ƒ_ƒ~[‚R PIC  X(016).
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Šî–{•ÛŒ¯—¿—¦‚S 
                                             PIC S9(002)V9(4) COMP-3.
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø‹æ•ª‚S PIC  X(001).
000290 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø—¦‚S PIC S9(003) COMP-3.
000300 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|ƒ_ƒ~[‚S PIC  X(016).
000310 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000330 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Šî–{•ÛŒ¯—¿—¦‚T 
                                             PIC S9(002)V9(4) COMP-3.
000340 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø‹æ•ª‚T PIC  X(001).
000350 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|Š„‘Š„ˆø—¦‚T PIC S9(003) COMP-3.
000360 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|ƒ_ƒ~[‚T PIC  X(016).
000370 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚Q‚O|‹¤’Êî•ñ PIC  X(035).
