000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(M—p•ÛŒ¯—¿—¦‹æ•ªEŠ„•Š)(LTRCDM0211)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|M—p•ÛŒ¯|‹@ŠB‹æ•ª PIC  X(002).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|Å’·•ÛŒ¯ŠúŠÔ‚P PIC S9(002) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|•ÛŒ¯—¿—¦‹æ•ª‚P PIC  X(001).
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|ƒ_ƒ~[‚P PIC  X(020).
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|Å’·•ÛŒ¯ŠúŠÔ‚Q PIC S9(002) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|•ÛŒ¯—¿—¦‹æ•ª‚Q PIC  X(001).
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|ƒ_ƒ~[‚Q PIC  X(020).
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|Å’·•ÛŒ¯ŠúŠÔ‚R PIC S9(002) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|•ÛŒ¯—¿—¦‹æ•ª‚R PIC  X(001).
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|ƒ_ƒ~[‚R PIC  X(020).
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|Å’·•ÛŒ¯ŠúŠÔ‚S PIC S9(002) COMP-3.
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|•ÛŒ¯—¿—¦‹æ•ª‚S PIC  X(001).
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|ƒ_ƒ~[‚S PIC  X(020).
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000290 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|Å’·•ÛŒ¯ŠúŠÔ‚T PIC S9(002) COMP-3.
000300 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|•ÛŒ¯—¿—¦‹æ•ª‚T PIC  X(001).
000310 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|ƒ_ƒ~[‚T PIC  X(020).
000320 01  ‚k‚s‚q‚b‚c‚l‚O‚Q‚P‚P|‹¤’Êî•ñ PIC  X(035).
