000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(ÄƒŠ[ƒX—¿ŒvŽZ—¦ƒƒ“ƒo[)(LTRCDT1440)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|¿‹æƒR[ƒh PIC  X(008).
000060 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(003).
000070 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|“K—p”NŒŽ“ú|¢‹I PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|“K—p”NŒŽ“ú|”NŒŽ“ú PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|“K—pŒp‘±‹æ•ª PIC S9(001) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ÄƒŠ[ƒXƒR[ƒh‚P PIC S9(002) COMP-3.
000110 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ’PˆÊ‚P PIC  X(001).
000120 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|’[”ˆ—‹æ•ª‚P PIC  X(001).
000130 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ªŽq‚P PIC S9(003) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ª•ê‚P PIC S9(004) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ÄƒŠ[ƒXƒR[ƒh‚Q PIC S9(002) COMP-3.
000160 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ’PˆÊ‚Q PIC  X(001).
000170 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|’[”ˆ—‹æ•ª‚Q PIC  X(001).
000180 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ªŽq‚Q PIC S9(003) COMP-3.
000190 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ª•ê‚Q PIC S9(004) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ÄƒŠ[ƒXƒR[ƒh‚R PIC S9(002) COMP-3.
000210 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ’PˆÊ‚R PIC  X(001).
000220 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|’[”ˆ—‹æ•ª‚R PIC  X(001).
000230 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ªŽq‚R PIC S9(003) COMP-3.
000240 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ª•ê‚R PIC S9(004) COMP-3.
000250 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ÄƒŠ[ƒXƒR[ƒh‚S PIC S9(002) COMP-3.
000260 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ’PˆÊ‚S PIC  X(001).
000270 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|’[”ˆ—‹æ•ª‚S PIC  X(001).
000280 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ªŽq‚S PIC S9(003) COMP-3.
000290 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ª•ê‚S PIC S9(004) COMP-3.
000300 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ÄƒŠ[ƒXƒR[ƒh‚T PIC S9(002) COMP-3.
000310 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ’PˆÊ‚T PIC  X(001).
000320 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|’[”ˆ—‹æ•ª‚T PIC  X(001).
000330 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ªŽq‚T PIC S9(003) COMP-3.
000340 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ŒvŽZ—¦|•ª•ê‚T PIC S9(004) COMP-3.
000350 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(002).
000360 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚S‚O|‹¤’Êî•ñ PIC  X(035).
