000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(ŽèŒ`ˆóŽ†Åƒƒ“ƒo[)(LTRCDT1430)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(011).
000060 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|ƒe[ƒuƒ‹‹æ•ª PIC  X(001).
000070 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|‚r‚d‚p‚m‚n PIC S9(007) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|”ÍˆÍ‹àŠzˆÈ‰º‚P PIC S9(011) COMP-3.
000090 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|ˆóŽ†Å‚P PIC S9(007) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|”ÍˆÍ‹àŠzˆÈ‰º‚Q PIC S9(011) COMP-3.
000110 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|ˆóŽ†Å‚Q PIC S9(007) COMP-3.
000120 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|”ÍˆÍ‹àŠzˆÈ‰º‚R PIC S9(011) COMP-3.
000130 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|ˆóŽ†Å‚R PIC S9(007) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|”ÍˆÍ‹àŠzˆÈ‰º‚S PIC S9(011) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|ˆóŽ†Å‚S PIC S9(007) COMP-3.
000160 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|”ÍˆÍ‹àŠzˆÈ‰º‚T PIC S9(011) COMP-3.
000170 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|ˆóŽ†Å‚T PIC S9(007) COMP-3.
000180 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(007).
000190 01  ‚k‚s‚q‚b‚c‚s‚P‚S‚R‚O|‹¤’Êî•ñ PIC  X(035).
