000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(ƒVƒƒ[ƒvŽx“XƒR[ƒh•ÏŠ·ƒe[ƒuƒ‹)(LTRCDM0021)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒVƒƒ[ƒvŽx“XƒR[ƒh PIC  X(002).
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|Ž–‹ÆŠƒR[ƒh‚P PIC S9(004) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ†[ƒU[ƒR[ƒh‚P PIC  X(008).
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ_ƒ~[‚P PIC  X(011).
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|Ž–‹ÆŠƒR[ƒh‚Q PIC S9(004) COMP-3.
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ†[ƒU[ƒR[ƒh‚Q PIC  X(008).
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ_ƒ~[‚Q PIC  X(011).
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|Ž–‹ÆŠƒR[ƒh‚R PIC S9(004) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ†[ƒU[ƒR[ƒh‚R PIC  X(008).
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ_ƒ~[‚R PIC  X(011).
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|Ž–‹ÆŠƒR[ƒh‚S PIC S9(004) COMP-3.
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ†[ƒU[ƒR[ƒh‚S PIC  X(008).
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ_ƒ~[‚S PIC  X(011).
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000290 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|Ž–‹ÆŠƒR[ƒh‚T PIC S9(004) COMP-3.
000300 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ†[ƒU[ƒR[ƒh‚T PIC  X(008).
000310 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|ƒ_ƒ~[‚T PIC  X(011).
000320 01  ‚k‚s‚q‚b‚c‚l‚O‚O‚Q‚P|‹¤’Êî•ñ PIC  X(035).
