000010************************************************
000020* ƒR[ƒhƒ}ƒXƒ^(–@’èŒ¸‰¿ž‹p—¦)(LTRCDM0310)
000030************************************************
000040 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|Ž¯•ÊƒR[ƒh PIC  X(004).
000050 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|‘Ï—p”N” PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000070 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚P 
                                             PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚P 
                                             PIC  X(006).
000090 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|–@’èŒ¸‰¿ž‹p—¦‚P 
                                             PIC S9(003)V9(7) COMP-3.
000100 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|ƒ_ƒ~[‚P PIC  X(018).
000110 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚Q 
                                             PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚Q 
                                             PIC  X(006).
000130 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|–@’èŒ¸‰¿ž‹p—¦‚Q 
                                             PIC S9(003)V9(7) COMP-3.
000140 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|ƒ_ƒ~[‚Q PIC  X(018).
000150 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚R 
                                             PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚R 
                                             PIC  X(006).
000170 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|–@’èŒ¸‰¿ž‹p—¦‚R 
                                             PIC S9(003)V9(7) COMP-3.
000180 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|ƒ_ƒ~[‚R PIC  X(018).
000190 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚S 
                                             PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚S 
                                             PIC  X(006).
000210 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|–@’èŒ¸‰¿ž‹p—¦‚S 
                                             PIC S9(003)V9(7) COMP-3.
000220 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|ƒ_ƒ~[‚S PIC  X(018).
000230 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|¢‹I‚T 
                                             PIC S9(001) COMP-3.
000240 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|“K—p”NŒŽ“ú‚e‚q‚n‚l|”NŒŽ“ú‚T 
                                             PIC  X(006).
000250 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|–@’èŒ¸‰¿ž‹p—¦‚T 
                                             PIC S9(003)V9(7) COMP-3.
000260 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|ƒ_ƒ~[‚T PIC  X(018).
000270 01  ‚k‚s‚q‚b‚c‚l‚O‚R‚P‚O|‹¤’Êî•ñ PIC  X(035).
