000010************************************************
000020* Ì§¸ÀØÝ¸Þi”„Š|ÂŒ j(LTRFCU)
000030************************************************
000040 01  ‚k‚s‚q‚e‚b‚t|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚k‚s‚q‚e‚b‚t|—˜‘§Šú“ú PIC  X(007).
000060 01  ‚k‚s‚q‚e‚b‚t|‰ñŽû•û–@ PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚e‚b‚t|‘ã—‰ñŽû‹æ•ª PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚e‚b‚t|ŠúŠÔ“ú” PIC S9(004) COMP-3.
000090 01  ‚k‚s‚q‚e‚b‚t|”ƒŽæ‹àŠz PIC S9(013) COMP-3.
000100 01  ‚k‚s‚q‚e‚b‚t|Š„ˆø—¿ PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚e‚b‚t|Š„ˆø—¦ PIC S9(003)V9(8) COMP-3.
000120 01  ‚k‚s‚q‚e‚b‚t|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚e‚b‚t|ŽóŽæŽè”—¿Á”ïÅ“™Šz PIC S9(013) COMP-3.
000140 01  ‚k‚s‚q‚e‚b‚t|”ƒ–ß—\’è“ú PIC  X(007).
000150 01  ‚k‚s‚q‚e‚b‚t|”ƒŽæ‘ã‹àŽx•¥“ú PIC  X(007).
000160 01  ‚k‚s‚q‚e‚b‚t|ÂŒ •\Ž¦ PIC  X(060).
000170 01  ‚k‚s‚q‚e‚b‚t|ŠúŒÀ‘OŒˆÙ“ú PIC  X(007).
000180 01  ‚k‚s‚q‚e‚b‚t|–ß‚µ—˜‘§Šz PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚e‚b‚t|–ß‚µ—˜—¦ PIC S9(003)V9(8) COMP-3.
000200 01  ‚k‚s‚q‚e‚b‚t|–ß‚µ“ú” PIC S9(004) COMP-3.
000210 01  ‚k‚s‚q‚e‚b‚t|–ß‚µ—˜‘§‘ŠŽE‹æ•ª PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚e‚b‚t|•ÔÏŽè”—¿ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚e‚b‚t|•ÔÏŽè”—¿Á”ïÅ“™Šz PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚e‚b‚t|—\”õ PIC  X(040).
