000010************************************************
000020* ”Ä—p“ü‹àƒvƒ‹[ƒtFi”Ä—p“ü‹àŠî–{)(LTRHNP)
000030************************************************
000040 01  ‚k‚s‚q‚g‚m‚o|“ü‹à’Ê”Ô PIC S9(009) COMP-3.
000050 01  ‚k‚s‚q‚g‚m‚o|“ü‹à‹æ•ª PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚g‚m‚o|“ü‹àæƒR[ƒh PIC  X(008).
000070 01  ‚k‚s‚q‚g‚m‚o|“ü‹àŠz PIC S9(013) COMP-3.
000080 01  ‚k‚s‚q‚g‚m‚o|“ü‹àæ–¼Ì PIC  X(048).
000090 01  ‚k‚s‚q‚g‚m‚o|“ü‹à“ú PIC  X(007).
000100 01  ‚k‚s‚q‚g‚m‚o|‹âsƒR[ƒh PIC S9(007) COMP-3.
000110 01  ‚k‚s‚q‚g‚m‚o|ŒûÀ”Ô† PIC S9(007) COMP-3.
000120 01  ‚k‚s‚q‚g‚m‚o|Œ_–ñ”Ô† PIC  X(009).
000130 01  ‚k‚s‚q‚g‚m‚o|ÁžŽc‚ PIC S9(013) COMP-3.
000140 01  ‚k‚s‚q‚g‚m‚o|‹âs’ZkƒR[ƒh PIC S9(002) COMP-3.
000150 01  ‚k‚s‚q‚g‚m‚o|“ü‹àŽd–ó’ZkƒR[ƒh PIC S9(002) COMP-3.
000160 01  ‚k‚s‚q‚g‚m‚o|ˆ—‹æ•ª PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚g‚m‚o|‹¤’Êî•ñ PIC  X(035).
