000010************************************************
000020* Œo—iŠÇ”Ì”ï—\ŽZŠÇ—j(LTRKAY)
000030************************************************
000040 01  ‚k‚s‚q‚j‚`‚x|Ž–‹ÆŠ PIC  X(004).
000050 01  ‚k‚s‚q‚j‚`‚x|ŠÇ”Ì”ïƒR[ƒh PIC  X(003).
000060 01  ‚k‚s‚q‚j‚`‚x|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000070 01  ‚k‚s‚q‚j‚`‚x|“o˜^íœ PIC  X(001).
000080 01  ‚k‚s‚q‚j‚`‚x|ƒ_ƒ~[‚O‚O‚Q PIC  X(004).
000090 01  ‚k‚s‚q‚j‚`‚x|‘OŠú•ªŠúŽñ PIC S9(015) COMP-3.
000100 01  ‚k‚s‚q‚j‚`‚x|‘OŠú•ªC³ PIC S9(015) COMP-3.
000110 01  ‚k‚s‚q‚j‚`‚x|“–Šú—ÝŒv PIC S9(015) COMP-3.
000120 01  ‚k‚s‚q‚j‚`‚x|“–Šú•ªŠúŽñ PIC S9(015) COMP-3.
000130 01  ‚k‚s‚q‚j‚`‚x|“–Šú•ªC³ PIC S9(015) COMP-3.
000140 01  ‚k‚s‚q‚j‚`‚x|“–Šú•ª‘OŒŽ•ª PIC S9(015) COMP-3.
000150 01  ‚k‚s‚q‚j‚`‚x|“–Šú•ª“–ŒŽ•ª PIC S9(015) COMP-3.
000160 01  ‚k‚s‚q‚j‚`‚x|ƒ_ƒ~[‚O‚O‚R PIC  X(041).
000170 01  ‚k‚s‚q‚j‚`‚x|‹¤’Êî•ñ PIC  X(035).
