000010************************************************
000020* ƒVƒƒ[ƒv‰ð–ñiSFC–¾×Úº°ÄÞj(LTRKBM)
000030************************************************
000040 01  ‚k‚s‚q‚j‚a‚l|‚a‚n‚s‚kŒ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚j‚a‚l|‚r‚e‚bŒ_–ñ‚m‚n PIC  X(012).
000060 01  ‚k‚s‚q‚j‚a‚l|Œ_–ñ‚m‚n PIC  X(009).
000070 01  ‚k‚s‚q‚j‚a‚l|•¨Œ‚m‚n PIC S9(003) COMP-3.
000080 01  ‚k‚s‚q‚j‚a‚l|ˆê•”•”•ª‹æ•ª PIC  X(001).
000090 01  ‚k‚s‚q‚j‚a‚l|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000100 01  ‚k‚s‚q‚j‚a‚l|w“ü‹àŠz PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚j‚a‚l|”—Ê PIC S9(004) COMP-3.
000120 01  ‚k‚s‚q‚j‚a‚l|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚j‚a‚l|Ý’uêŠ–¼ PIC  X(020).
000140 01  ‚k‚s‚q‚j‚a‚l|•¨Œ–¼ PIC  X(030).
000150 01  ‚k‚s‚q‚j‚a‚l|Å‹æ•ª PIC  X(001).
000160 01  ‚k‚s‚q‚j‚a‚l|“®‘•t•Û‹æ•ª PIC  X(001).
000170 01  ‚k‚s‚q‚j‚a‚l|‘Ï—p”N” PIC S9(002) COMP-3.
000180 01  ‚k‚s‚q‚j‚a‚l|ƒ_ƒ~[‚O‚O‚Q PIC  X(008).
000190 01  ‚k‚s‚q‚j‚a‚l|‰ð–ñw“ü‹àŠz PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚j‚a‚l|‰ð–ñ”—Ê PIC S9(004) COMP-3.
000210 01  ‚k‚s‚q‚j‚a‚l|‰ð–ñŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚j‚a‚l|‰ð–ñ‘O“n‹à—˜‘§Šz PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚j‚a‚l|‰ð–ñŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚j‚a‚l|‰ð–ñ•ÛŒ¯—¿ PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚j‚a‚l|ƒ_ƒ~[‚O‚O‚R PIC  X(007).
000260 01  ‚k‚s‚q‚j‚a‚l|ƒ_ƒ~[‚O‚O‚S PIC  X(024).
000270 01  ‚k‚s‚q‚j‚a‚l|Žx•¥Ï‘O•¥ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000280 01  ‚k‚s‚q‚j‚a‚l|Žx•¥Ï‘O•¥ƒŠ[ƒX—¿Á”ïÅ PIC S9(013) COMP-3.
000290 01  ‚k‚s‚q‚j‚a‚l|‰ßèƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000300 01  ‚k‚s‚q‚j‚a‚l|‰ßèƒŠ[ƒX—¿Á”ïÅ PIC S9(013) COMP-3.
000310 01  ‚k‚s‚q‚j‚a‚l|–¢•¥ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000320 01  ‚k‚s‚q‚j‚a‚l|–¢•¥ƒŠ[ƒX—¿Á”ïÅ PIC S9(013) COMP-3.
000330 01  ‚k‚s‚q‚j‚a‚l|ƒ_ƒ~[‚O‚O‚T PIC  X(053).
000340 01  ‚k‚s‚q‚j‚a‚l|‹¤’Êî•ñ PIC  X(035).
