000010************************************************
000020* ŽØ“ü‹àŠÇ—iŽØ“ü‹à“WŠJƒŒƒR[ƒhj(LTRKRT)
000030************************************************
000040 01  ‚k‚s‚q‚j‚q‚s|ŠÇ—‚m‚n PIC  X(007).
000050 01  ‚k‚s‚q‚j‚q‚s|Ž}”Ô PIC S9(002) COMP-3.
000060 01  ‚k‚s‚q‚j‚q‚s|“WŠJ‚m‚n PIC S9(003) COMP-3.
000070 01  ‚k‚s‚q‚j‚q‚s|“o˜^íœ PIC  X(001).
000080 01  ‚k‚s‚q‚j‚q‚s|Œ³–{•ÔÏ PIC  X(001).
000090 01  ‚k‚s‚q‚j‚q‚s|—˜‘§•ÔÏ PIC  X(001).
000100 01  ‚k‚s‚q‚j‚q‚s|ƒ_ƒ~[‚O‚O‚P PIC  X(002).
000110 01  ‚k‚s‚q‚j‚q‚s|•ÔÏ‹æ•ª PIC  X(001).
000120 01  ‚k‚s‚q‚j‚q‚s|•ÔÏ“ú|¢‹I PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚j‚q‚s|•ÔÏ“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000140 01  ‚k‚s‚q‚j‚q‚s|‹x“ú‹æ•ª PIC  X(001).
000150 01  ‚k‚s‚q‚j‚q‚s|—˜‘§Šî€“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚j‚q‚s|—˜‘§Šî€“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000170 01  ‚k‚s‚q‚j‚q‚s|“ú” PIC S9(004) COMP-3.
000180 01  ‚k‚s‚q‚j‚q‚s|—˜—¦ PIC S9(003)V9(7) COMP-3.
000190 01  ‚k‚s‚q‚j‚q‚s|ŠúŠÔ PIC S9(003) COMP-3.
000200 01  ‚k‚s‚q‚j‚q‚s|ŒvŽZ‹æ•ª PIC  X(001).
000210 01  ‚k‚s‚q‚j‚q‚s|Œ³–{Žc‚ PIC S9(014)V9(2) COMP-3.
000220 01  ‚k‚s‚q‚j‚q‚s|‰~‰ÝŽc‚I’l PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚j‚q‚s|ƒ_ƒ~[‚O‚O‚Q PIC  X(015).
000240 01  ‚k‚s‚q‚j‚q‚s|Œ³–{•ÔÏî•ñ|Œ³–{•ÔÏŠz 
                                             PIC S9(014)V9(2) COMP-3.
000250 01  ‚k‚s‚q‚j‚q‚s|Œ³–{•ÔÏî•ñ|‚d‚w‹æ•ª PIC  X(004).
000260 01  ‚k‚s‚q‚j‚q‚s|Œ³–{•ÔÏî•ñ|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(6) COMP-3.
000270 01  ‚k‚s‚q‚j‚q‚s|Œ³–{•ÔÏî•ñ|‰~‰Ý•ÔÏŠz PIC S9(013) COMP-3.
000280 01  ‚k‚s‚q‚j‚q‚s|Œ³–{•ÔÏî•ñ|‘Î‰¿‚e‚h‚w PIC  X(001).
000290 01  ‚k‚s‚q‚j‚q‚s|Œ³–{•ÔÏî•ñ|—\–ñIŒ‹“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚j‚q‚s|Œ³–{•ÔÏî•ñ|—\–ñIŒ‹“ú”NŒŽ“ú 
                                             PIC S9(006) COMP-3.
000310 01  ‚k‚s‚q‚j‚q‚s|ƒ_ƒ~[‚O‚O‚R PIC  X(015).
000320 01  ‚k‚s‚q‚j‚q‚s|‚d‚w‹æ•ª PIC  X(004).
000330 01  ‚k‚s‚q‚j‚q‚s|Š·ŽZ‘Šê PIC S9(004)V9(6) COMP-3.
000340 01  ‚k‚s‚q‚j‚q‚s|‰~‰ÝŽ’lŠz PIC S9(013) COMP-3.
000350 01  ‚k‚s‚q‚j‚q‚s|‘Î‰¿‚e‚h‚w PIC  X(001).
000360 01  ‚k‚s‚q‚j‚q‚s|ˆ×‘Ö·‘¹‰v PIC S9(013) COMP-3.
000370 01  ‚k‚s‚q‚j‚q‚s|ƒ_ƒ~[‚O‚O‚S PIC  X(015).
000380 01  ‚k‚s‚q‚j‚q‚s|—˜‘§•ÔÏî•ñ|—˜‘§Šz PIC S9(014)V9(2) COMP-3.
000390 01  ‚k‚s‚q‚j‚q‚s|—˜‘§•ÔÏî•ñ|‚d‚w‹æ•ª PIC  X(004).
000400 01  ‚k‚s‚q‚j‚q‚s|—˜‘§•ÔÏî•ñ|Š·ŽZ‘Šê 
                                             PIC S9(004)V9(6) COMP-3.
000410 01  ‚k‚s‚q‚j‚q‚s|—˜‘§•ÔÏî•ñ|‰~‰Ý—˜‘§Šz PIC S9(013) COMP-3.
000420 01  ‚k‚s‚q‚j‚q‚s|—˜‘§•ÔÏî•ñ|‘Î‰¿‚e‚h‚w PIC  X(001).
000430 01  ‚k‚s‚q‚j‚q‚s|—˜‘§•ÔÏî•ñ|—\–ñIŒ‹“ú|¢‹I 
                                             PIC S9(001) COMP-3.
000440 01  ‚k‚s‚q‚j‚q‚s|—˜‘§•ÔÏî•ñ|—\–ñIŒ‹“ú”NŒŽ“ú 
                                             PIC S9(006) COMP-3.
000450 01  ‚k‚s‚q‚j‚q‚s|ƒ_ƒ~[‚O‚O‚T PIC  X(080).
000460 01  ‚k‚s‚q‚j‚q‚s|‹¤’Êî•ñ PIC  X(035).
