000010************************************************
000020* –¼Ìƒ}ƒXƒ^iŽ‘ŽY–¼)(LTRMEI023)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|Ž‘ŽYƒR[ƒh PIC S9(007) COMP-3.
000070 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000080 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|–¼Ì PIC  X(020).
000090 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|—ªÌ PIC  X(010).
000100 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|–¼ÌƒJƒi PIC  X(025).
000110 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|—ªÌƒJƒi PIC  X(012).
000120 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|ƒ_ƒ~[‚O‚O‚Q PIC  X(083).
000130 01  ‚k‚s‚q‚l‚d‚h‚O‚Q‚R|‹¤’Êî•ñ PIC  X(035).
