000010************************************************
000020* –¼Ìƒ}ƒXƒ^i‹@ŠB—Þ–¼FƒŠ[ƒXj(LTRMEI210)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚O|‹@ŠB‹æ•ª PIC  X(002).
000070 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(009).
000080 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚O|‹@ŠB—Þ‚Ì‹æ•ª–¼ÌƒŠ[ƒX PIC  X(070).
000090 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(080).
000100 01  ‚k‚s‚q‚l‚d‚h‚Q‚P‚O|‹¤’Êî•ñ PIC  X(035).
