000010************************************************
000020* –¼Ìƒ}ƒXƒ^iŠ¨’è‰È–Ú–¼j(LTRMEI310)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|Š¨’è‰È–ÚƒR[ƒh PIC  X(005).
000070 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000080 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|“o˜^íœ PIC  X(001).
000090 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(004).
000100 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|Š¨’è‰È–Ú–¼Ì PIC  X(032).
000110 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|WŒv‰È–Ú PIC  X(005).
000120 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|‰È–Úƒ^ƒCƒv PIC  X(001).
000130 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|Ž‘•‰‹æ•ª PIC  X(001).
000140 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|‚`‚k‚l‹æ•ª PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|“K—p“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|“K—p“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000170 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|ƒ_ƒ~[‚O‚O‚R PIC  X(098).
000180 01  ‚k‚s‚q‚l‚d‚h‚R‚P‚O|‹¤’Êî•ñ PIC  X(035).
