000010************************************************
000020* –¼Ìƒ}ƒXƒ^iŠÇ”Ì”ï–¼j(LTRMEI320)
000030************************************************
000040 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|“–ŒŽ—‚ŒŽ‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|ŠÇ”Ì”ïƒR[ƒh PIC  X(003).
000070 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000080 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|“o˜^íœ PIC  X(001).
000090 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(004).
000100 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|ŠÇ”Ì”ï–¼Ì PIC  X(016).
000110 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|WŒvƒR[ƒh PIC  X(003).
000120 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|ŠÇ”Ì”ïƒ^ƒCƒv PIC  X(001).
000130 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|“K—p“ú|¢‹I PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|“K—p“ú|”NŒŽ“ú PIC S9(006) COMP-3.
000150 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|ƒ_ƒ~[‚O‚O‚R PIC  X(118).
000160 01  ‚k‚s‚q‚l‚d‚h‚R‚Q‚O|‹¤’Êî•ñ PIC  X(035).
