000010************************************************
000020* “ü‹àÁžŠÇ—‚c‚ai¿‹æî•ñ)(LTRNKS)
000030************************************************
000040 01  ‚k‚s‚q‚m‚j‚r|Áž’Ê”Ô PIC S9(009) COMP-3.
000050 01  ‚k‚s‚q‚m‚j‚r|¿‹æƒR[ƒh PIC  X(008).
000060 01  ‚k‚s‚q‚m‚j‚r|¿‹‹àŠz PIC S9(013) COMP-3.
000070 01  ‚k‚s‚q‚m‚j‚r|Œ_–ñ‚m‚n PIC  X(009).
000080 01  ‚k‚s‚q‚m‚j‚r|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000090 01  ‚k‚s‚q‚m‚j‚r|“ü‹à—\’è“ú PIC  X(007).
000100 01  ‚k‚s‚q‚m‚j‚r|¿‹“à–óƒR[ƒh PIC  X(003).
000110 01  ‚k‚s‚q‚m‚j‚r|‰ñŽû‹æ•ª PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚m‚j‚r|[“–‰ñ”‰ñ” PIC S9(003) COMP-3.
000130 01  ‚k‚s‚q‚m‚j‚r|ÅV“ü‹à“ú|¢‹I PIC S9(001) COMP-3.
000140 01  ‚k‚s‚q‚m‚j‚r|ÅV“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000150 01  ‚k‚s‚q‚m‚j‚r|ƒ_ƒ~[‚O‚O‚P PIC  X(019).
000160 01  ‚k‚s‚q‚m‚j‚r|‹¤’Êî•ñ PIC  X(035).
