000010************************************************
000020* Ž‘ŽYi•ÛŒ¯î•ñj(LTRSIH)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚g|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚r‚h‚g|•¨Œ‚m‚n PIC S9(003) COMP-3.
000060 01  ‚k‚s‚q‚r‚h‚g|‰ð–ñ‹æ•ª PIC  X(001).
000070 01  ‚k‚s‚q‚r‚h‚g|Ä¶‹æ•ª PIC  X(001).
000080 01  ‚k‚s‚q‚r‚h‚g|•ÛŒ¯‰ïŽÐƒR[ƒh PIC  X(001).
000090 01  ‚k‚s‚q‚r‚h‚g|•ÛŒ¯—¿Ží•Ê PIC  X(003).
000100 01  ‚k‚s‚q‚r‚h‚g|•ÛŒ¯V‹KŒp‘±‹æ•ª PIC  X(001).
000110 01  ‚k‚s‚q‚r‚h‚g|Ž–ŒÌ—L–³‹æ•ª PIC  X(001).
000120 01  ‚k‚s‚q‚r‚h‚g|•t•Û“ú|¢‹I PIC S9(001) COMP-3.
000130 01  ‚k‚s‚q‚r‚h‚g|•t•Û“ú|”NŒŽ“ú PIC  X(006).
000140 01  ‚k‚s‚q‚r‚h‚g|Ž–ŒÌ“ú|¢‹I PIC S9(001) COMP-3.
000150 01  ‚k‚s‚q‚r‚h‚g|Ž–ŒÌ“ú|”NŒŽ“ú PIC  X(006).
000160 01  ‚k‚s‚q‚r‚h‚g|–³Ž–ŒÌ–ß‚µ“ú|¢‹I PIC S9(001) COMP-3.
000170 01  ‚k‚s‚q‚r‚h‚g|–³Ž–ŒÌ–ß‚µ“ú|”NŒŽ“ú PIC  X(006).
000180 01  ‚k‚s‚q‚r‚h‚g|‹K’è‘¹ŠQ‹à‚t‚o—¦ PIC S9(003)V9(7) COMP-3.
000190 01  ‚k‚s‚q‚r‚h‚g|“®‘•ÛŒ¯‰¿Ši PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚r‚h‚g|“®‘•ÛŒ¯—¿ PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚r‚h‚g|“®‘•¥–ß‚µ•ÛŒ¯—¿ PIC S9(013) COMP-3.
000220 01  ‚k‚s‚q‚r‚h‚g|“®‘–³Ž–ŒÌ–ß‚µ—¿ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚r‚h‚g|“–”N“xƒy[ƒW PIC S9(005) COMP-3.
000240 01  ‚k‚s‚q‚r‚h‚g|“–”N“xŒ…” PIC S9(002) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚g|‘O”N“xƒy[ƒW PIC S9(005) COMP-3.
000260 01  ‚k‚s‚q‚r‚h‚g|‘O”N“xŒ…” PIC S9(002) COMP-3.
000270 01  ‚k‚s‚q‚r‚h‚g|ƒ_ƒ~[‚O‚O‚P PIC  X(008).
000280 01  ‚k‚s‚q‚r‚h‚g|ÄƒŠ[ƒX•t•Û—¦ PIC S9(002) COMP-3.
000290 01  ‚k‚s‚q‚r‚h‚g|“®‘•ÛŒ¯—¿—¦ PIC S9(004)V9(6) COMP-3.
000300 01  ‚k‚s‚q‚r‚h‚g|ƒ_ƒ~[‚O‚O‚Q PIC  X(010).
000310 01  ‚k‚s‚q‚r‚h‚g|ƒŠ[ƒXŠ„•Š‹æ•ª PIC  X(001).
000320 01  ‚k‚s‚q‚r‚h‚g|‹@ŠB‹æ•ª PIC  X(002).
000330 01  ‚k‚s‚q‚r‚h‚g|‹@Ží–¼”Ô† PIC  X(002).
000340 01  ‚k‚s‚q‚r‚h‚g|Œ^Ž®”Ô† PIC  X(015).
000350 01  ‚k‚s‚q‚r‚h‚g|’Ê’m‘‘—•t“ú|¢‹I PIC S9(001) COMP-3.
000360 01  ‚k‚s‚q‚r‚h‚g|’Ê’m‘‘—•t“ú|”NŒŽ“ú PIC  X(006).
000370 01  ‚k‚s‚q‚r‚h‚g|•„†ˆê˜A”Ô† PIC  X(005).
000380 01  ‚k‚s‚q‚r‚h‚g|M—p•ÛŒ¯—¿ PIC S9(013) COMP-3.
000390 01  ‚k‚s‚q‚r‚h‚g|“®‘•ÛŒ¯ØŒ””Ô† PIC  X(011).
000400 01  ‚k‚s‚q‚r‚h‚g|ƒ_ƒ~[‚O‚O‚R PIC  X(015).
000410 01  ‚k‚s‚q‚r‚h‚g|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000420 01  ‚k‚s‚q‚r‚h‚g|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000430 01  ‚k‚s‚q‚r‚h‚g|‹¤’Êî•ñ PIC  X(035).
