000010************************************************
000020* Žx•¥î•ñiŽx•¥î•ñj(LTRSHT)
000030************************************************
000040 01  ‚k‚s‚q‚r‚g‚s|Œo— PIC  X(009).
000050 01  ‚k‚s‚q‚r‚g‚s|Ž}”Ô PIC S9(001) COMP-3.
000060 01  ‚k‚s‚q‚r‚g‚s|ƒtƒ‰ƒO|“o˜^íœ PIC  X(001).
000070 01  ‚k‚s‚q‚r‚g‚s|ƒtƒ‰ƒO|Žx•¥Ï PIC  X(001).
000080 01  ‚k‚s‚q‚r‚g‚s|ƒ_ƒ~[‚O‚O‚P PIC  X(002).
000090 01  ‚k‚s‚q‚r‚g‚s|‹Æ–±ƒR[ƒh PIC  X(003).
000100 01  ‚k‚s‚q‚r‚g‚s|“ü—Í”ñ“ü—Í PIC  X(001).
000110 01  ‚k‚s‚q‚r‚g‚s|Žx•¥’Ê”Ô PIC  X(010).
000120 01  ‚k‚s‚q‚r‚g‚s|“ü—ÍŽžŠÔ PIC S9(006) COMP-3.
000130 01  ‚k‚s‚q‚r‚g‚s|’[––”Ô† PIC  X(008).
000140 01  ‚k‚s‚q‚r‚g‚s|‰æ–Ê”Ô† PIC  X(004).
000150 01  ‚k‚s‚q‚r‚g‚s|’S“–ŽÒƒR[ƒh PIC  X(004).
000160 01  ‚k‚s‚q‚r‚g‚s|Š‘®Ž–‹ÆŠ PIC S9(004) COMP-3.
000170 01  ‚k‚s‚q‚r‚g‚s|©ƒJƒi PIC  X(010).
000180 01  ‚k‚s‚q‚r‚g‚s|“ü—Í“ú¢‹I PIC  X(001).
000190 01  ‚k‚s‚q‚r‚g‚s|“ü—Í“ú”NŒŽ“ú PIC S9(006) COMP-3.
000200 01  ‚k‚s‚q‚r‚g‚s|“o˜^“ú¢‹I PIC  X(001).
000210 01  ‚k‚s‚q‚r‚g‚s|“o˜^“ú”NŒŽ“ú PIC S9(006) COMP-3.
000220 01  ‚k‚s‚q‚r‚g‚s|ŽæÁ“ú¢‹I PIC  X(001).
000230 01  ‚k‚s‚q‚r‚g‚s|ŽæÁ“ú”NŒŽ“ú PIC S9(006) COMP-3.
000240 01  ‚k‚s‚q‚r‚g‚s|Žæˆø“ú¢‹I PIC  X(001).
000250 01  ‚k‚s‚q‚r‚g‚s|Žæˆø“ú”NŒŽ“ú PIC S9(006) COMP-3.
000260 01  ‚k‚s‚q‚r‚g‚s|ˆ—‹æ•ª PIC  X(001).
000270 01  ‚k‚s‚q‚r‚g‚s|ŽæÁ’Ê”Ô PIC  X(009).
000280 01  ‚k‚s‚q‚r‚g‚s|ƒ_ƒ~[‚O‚O‚Q PIC  X(003).
000290 01  ‚k‚s‚q‚r‚g‚s|Ž–‹ÆŠ PIC  X(004).
000300 01  ‚k‚s‚q‚r‚g‚s|Žx•¥•û–@ PIC  X(001).
000310 01  ‚k‚s‚q‚r‚g‚s|×‹æ•ªƒR[ƒh PIC  X(001).
000320 01  ‚k‚s‚q‚r‚g‚s|Žx•¥“ú|¢‹I PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚r‚g‚s|Žx•¥“ú|”NŒŽ“ú PIC  X(006).
000340 01  ‚k‚s‚q‚r‚g‚s|Žx•¥‹àŠz PIC S9(013) COMP-3.
000350 01  ‚k‚s‚q‚r‚g‚s|ŽdŒü‹âsƒR[ƒh PIC S9(004) COMP-3.
000360 01  ‚k‚s‚q‚r‚g‚s|ŽdŒüŽx“XƒR[ƒh PIC S9(003) COMP-3.
000370 01  ‚k‚s‚q‚r‚g‚s|ŽdŒü—a‹àŽí–Ú PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚r‚g‚s|ŽdŒüŒûÀ”Ô† PIC S9(007) COMP-3.
000390 01  ‚k‚s‚q‚r‚g‚s|‹âsƒR[ƒh PIC S9(004) COMP-3.
000400 01  ‚k‚s‚q‚r‚g‚s|Žx“XƒR[ƒh PIC S9(003) COMP-3.
000410 01  ‚k‚s‚q‚r‚g‚s|—a‹àŽí–Ú PIC S9(001) COMP-3.
000420 01  ‚k‚s‚q‚r‚g‚s|ŒûÀ”Ô† PIC S9(007) COMP-3.
000430 01  ‚k‚s‚q‚r‚g‚s|ŒûÀ–¼‹`l PIC  X(030).
000440 01  ‚k‚s‚q‚r‚g‚s|ŽèŒ`Šú“ú|¢‹I PIC S9(001) COMP-3.
000450 01  ‚k‚s‚q‚r‚g‚s|ŽèŒ`Šú“ú|”NŒŽ“ú PIC  X(006).
000460 01  ‚k‚s‚q‚r‚g‚s|Žó“nƒR[ƒh PIC  X(001).
000470 01  ‚k‚s‚q‚r‚g‚s|•ªŠ„ƒR[ƒh PIC  X(001).
000480 01  ‚k‚s‚q‚r‚g‚s|‘‡ƒR[ƒh PIC  X(001).
000490 01  ‚k‚s‚q‚r‚g‚s|—X•Ö”Ô†|e PIC S9(003) COMP-3.
000500 01  ‚k‚s‚q‚r‚g‚s|—X•Ö”Ô†|Žq PIC S9(004) COMP-3.
000510 01  ‚k‚s‚q‚r‚g‚s|—X‘—æZŠ‚P PIC  X(034).
000520 01  ‚k‚s‚q‚r‚g‚s|—X‘—æZŠ‚Q PIC  X(032).
000530 01  ‚k‚s‚q‚r‚g‚s|—X‘—æZŠ‚R PIC  X(032).
000540 01  ‚k‚s‚q‚r‚g‚s|—X‘—æ–¼‚P PIC  X(028).
000550 01  ‚k‚s‚q‚r‚g‚s|—X‘—ô–¼‚Q PIC  X(028).
000560 01  ‚k‚s‚q‚r‚g‚s|Žg“r–¾× PIC  X(046).
000570 01  ‚k‚s‚q‚r‚g‚s|‘ŠŽèæ–¼ PIC  X(056).
000580 01  ‚k‚s‚q‚r‚g‚s|“o˜^”Ô† PIC  X(004).
000590 01  ‚k‚s‚q‚r‚g‚s|Žè”—¿•‰’S PIC  X(001).
000600 01  ‚k‚s‚q‚r‚g‚s|Žx•¥æƒR[ƒh PIC  X(004).
000610 01  ‚k‚s‚q‚r‚g‚s|ƒ_ƒ~[‚O‚O‚R PIC  X(083).
000620 01  ‚k‚s‚q‚r‚g‚s|‹¤’Êî•ñ PIC  X(035).
