000010************************************************
000020* —š—ðƒAƒ“ƒ}ƒbƒ`Ž‘ŽYŠî–{(LTRSIK_U)
000030************************************************
000040 01  ‚k‚s‚q‚r‚h‚j|‚t|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚h‚j|‚t|Œ_–ñ‚m‚n PIC  X(009).
000060 01  ‚k‚s‚q‚r‚h‚j|‚t|Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000070 01  ‚k‚s‚q‚r‚h‚j|‚t|ƒ†[ƒUƒR[ƒh PIC  X(008).
000080 01  ‚k‚s‚q‚r‚h‚j|‚t|’S“–ŽÒƒR[ƒh PIC S9(004) COMP-3.
000090 01  ‚k‚s‚q‚r‚h‚j|‚t|Œ´Œ_–ñ PIC  X(001).
000100 01  ‚k‚s‚q‚r‚h‚j|‚t|Œp‘± PIC  X(001).
000110 01  ‚k‚s‚q‚r‚h‚j|‚t|ÄƒŠ[ƒX PIC  X(001).
000120 01  ‚k‚s‚q‚r‚h‚j|‚t|Š„•Š PIC  X(001).
000130 01  ‚k‚s‚q‚r‚h‚j|‚t|Žè”—¿ PIC  X(001).
000140 01  ‚k‚s‚q‚r‚h‚j|‚t|ƒtƒ@ƒNƒ^ƒŠƒ“ƒO PIC  X(001).
000150 01  ‚k‚s‚q‚r‚h‚j|‚t|‹àÁ PIC  X(001).
000160 01  ‚k‚s‚q‚r‚h‚j|‚t|Žx•¥•ÛØ PIC  X(001).
000170 01  ‚k‚s‚q‚r‚h‚j|‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(005).
000180 01  ‚k‚s‚q‚r‚h‚j|‚t|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000190 01  ‚k‚s‚q‚r‚h‚j|‚t|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000200 01  ‚k‚s‚q‚r‚h‚j|‚t|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000210 01  ‚k‚s‚q‚r‚h‚j|‚t|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000220 01  ‚k‚s‚q‚r‚h‚j|‚t|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000230 01  ‚k‚s‚q‚r‚h‚j|‚t|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000240 01  ‚k‚s‚q‚r‚h‚j|‚t|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000250 01  ‚k‚s‚q‚r‚h‚j|‚t|Žc‰¿‡ŒvŠz PIC S9(013) COMP-3.
000260 01  ‚k‚s‚q‚r‚h‚j|‚t|•¨ŒŽ}”Ô† PIC S9(003) COMP-3.
000270 01  ‚k‚s‚q‚r‚h‚j|‚t|”—Ê‡Œv PIC S9(005) COMP-3.
000280 01  ‚k‚s‚q‚r‚h‚j|‚t|’P”N“xŒ_–ñ PIC  X(002).
000290 01  ‚k‚s‚q‚r‚h‚j|‚t|“]ƒŠ[ƒX’ñŒgæƒR[ƒh PIC  X(002).
000300 01  ‚k‚s‚q‚r‚h‚j|‚t|ÂŒ ‹¦’²ƒR[ƒh PIC  X(002).
000310 01  ‚k‚s‚q‚r‚h‚j|‚t|Žd“üÁ”ïÅŠz‡Œv PIC S9(013) COMP-3.
000320 01  ‚k‚s‚q‚r‚h‚j|‚t|ˆÄŒ”­¶‹æ•ª PIC  X(001).
000330 01  ‚k‚s‚q‚r‚h‚j|‚t|âg‹c‹æ•ª PIC  X(001).
000340 01  ‚k‚s‚q‚r‚h‚j|‚t|ÅI•¨Œ‚m‚n PIC S9(003) COMP-3.
000350 01  ‚k‚s‚q‚r‚h‚j|‚t|Š²Ž–”ñŠ²Ž–‹æ•ª PIC  X(001).
000360 01  ‚k‚s‚q‚r‚h‚j|‚t|‚n‚o‚d‚m‚b‚k‚n‚r‚d‹æ•ª PIC  X(001).
000370 01  ‚k‚s‚q‚r‚h‚j|‚t|‰ñŽûŽè‡ PIC  X(001).
000380 01  ‚k‚s‚q‚r‚h‚j|‚t|”Û”F‹æ•ª PIC  X(001).
000390 01  ‚k‚s‚q‚r‚h‚j|‚t|ƒ_ƒ~[‚O‚O‚Q PIC  X(033).
000400 01  ‚k‚s‚q‚r‚h‚j|‚t|Œ³Œ_–ñ‚m‚n PIC  X(009).
000410 01  ‚k‚s‚q‚r‚h‚j|‚t|Œ³ÅI•¨Œ‚m‚n PIC S9(003) COMP-3.
000420 01  ‚k‚s‚q‚r‚h‚j|‚t|Œ³Ž–‹ÆŠƒR[ƒh PIC S9(004) COMP-3.
000430 01  ‚k‚s‚q‚r‚h‚j|‚t|Œ³ƒ†[ƒUƒR[ƒh PIC  X(008).
000440 01  ‚k‚s‚q‚r‚h‚j|‚t|ˆ—”NŒŽ“x|¢‹I PIC S9(001) COMP-3.
000450 01  ‚k‚s‚q‚r‚h‚j|‚t|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
000460 01  ‚k‚s‚q‚r‚h‚j|‚t|‹¤’Êî•ñ PIC  X(035).
