000010************************************************
000020* —š—ðƒAƒ“ƒ}ƒbƒ`ÂŒ –¾×(LTRSAM_U)
000030************************************************
000040 01  ‚k‚s‚q‚r‚`‚l|‚t|‚j‚d‚x|‰ð–ñ“ú PIC  X(007).
000050 01  ‚k‚s‚q‚r‚`‚l|‚t|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚k‚s‚q‚r‚`‚l|‚t|ÄƒŠ[ƒXƒR[ƒh PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚r‚`‚l|‚t|•¨Œ‚m‚n PIC S9(003) COMP-3.
000080 01  ‚k‚s‚q‚r‚`‚l|‚t|¿‹ƒR[ƒh PIC S9(002) COMP-3.
000090 01  ‚k‚s‚q‚r‚`‚l|‚t|Š¨’èˆ—ƒR[ƒh PIC S9(002) COMP-3.
000100 01  ‚k‚s‚q‚r‚`‚l|‚t|‰ð–ñ‹æ•ª PIC  X(001).
000110 01  ‚k‚s‚q‚r‚`‚l|‚t|‰ð–ñ“ú|¢‹I PIC S9(001) COMP-3.
000120 01  ‚k‚s‚q‚r‚`‚l|‚t|‰ð–ñ“ú|”NŒŽ“ú PIC  X(006).
000130 01  ‚k‚s‚q‚r‚`‚l|‚t|‰ð–ñ‘ÎÛƒR[ƒh PIC  X(001).
000140 01  ‚k‚s‚q‚r‚`‚l|‚t|‰ð–ñˆ—ƒR[ƒh PIC  X(001).
000150 01  ‚k‚s‚q‚r‚`‚l|‚t|Œ_–ñ“ú|¢‹I PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚r‚`‚l|‚t|Œ_–ñ“ú|”NŒŽ“ú PIC  X(006).
000170 01  ‚k‚s‚q‚r‚`‚l|‚t|ŒŸŽû“ú|¢‹I PIC S9(001) COMP-3.
000180 01  ‚k‚s‚q‚r‚`‚l|‚t|ŒŸŽû“ú|”NŒŽ“ú PIC  X(006).
000190 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒŠ[ƒXŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000200 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒŠ[ƒXŠJŽn“ú|”NŒŽ“ú PIC  X(006).
000210 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒŠ[ƒXI—¹“ú|¢‹I PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒŠ[ƒXI—¹“ú|”NŒŽ“ú PIC  X(006).
000230 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000240 01  ‚k‚s‚q‚r‚`‚l|‚t|¿‹æƒR[ƒh PIC  X(008).
000250 01  ‚k‚s‚q‚r‚`‚l|‚t|Žx•¥‰ñ” PIC S9(003) COMP-3.
000260 01  ‚k‚s‚q‚r‚`‚l|‚t|ŒvŽZ•ûŽ® PIC S9(001) COMP-3.
000270 01  ‚k‚s‚q‚r‚`‚l|‚t|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000280 01  ‚k‚s‚q‚r‚`‚l|‚t|˜’uŠúŠÔ PIC S9(003) COMP-3.
000290 01  ‚k‚s‚q‚r‚`‚l|‚t|‚a‚d‚f‚h‚m‰ñ” PIC S9(001) COMP-3.
000300 01  ‚k‚s‚q‚r‚`‚l|‚t|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|¢‹I 
000301                                      PIC S9(001) COMP-3.
000310 01  ‚k‚s‚q‚r‚`‚l|‚t|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000320 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|¢‹I 
000321                                      PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽóƒŠ[ƒX—¿“ü‹à“ú|”NŒŽ“ú PIC  X(006).
000340 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽóƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000350 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽó[“–ŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000360 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽó[“–ŠJŽn“ú|”NŒŽ PIC  X(004).
000370 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽó[“–I—¹“ú|¢‹I PIC S9(001) COMP-3.
000380 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽó[“–I—¹“ú|”NŒŽ PIC  X(004).
000390 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽó[“–ŒŽ” PIC S9(003) COMP-3.
000400 01  ‚k‚s‚q‚r‚`‚l|‚t|ˆê•”[“–Šz PIC S9(013) COMP-3.
000410 01  ‚k‚s‚q‚r‚`‚l|‚t|‹âsƒR[ƒh PIC  X(007).
000420 01  ‚k‚s‚q‚r‚`‚l|‚t|ŒûÀ”Ô† PIC  X(007).
000430 01  ‚k‚s‚q‚r‚`‚l|‚t|—a‹àŽí—Þ PIC  X(001).
000440 01  ‚k‚s‚q‚r‚`‚l|‚t|“ü‹à“ú PIC S9(002) COMP-3.
000450 01  ‚k‚s‚q‚r‚`‚l|‚t|¿‹‘”­sÏ‰ñ” PIC S9(003) COMP-3.
000460 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒ_ƒ~[‚O‚O‚P PIC  X(014).
000470 01  ‚k‚s‚q‚r‚`‚l|‚t|’S•Û‹âsƒR[ƒh PIC  X(007).
000480 01  ‚k‚s‚q‚r‚`‚l|‚t|’S•Û·“ü“ú|¢‹I PIC S9(001) COMP-3.
000490 01  ‚k‚s‚q‚r‚`‚l|‚t|’S•Û·“ü“ú|”NŒŽ“ú PIC  X(006).
000500 01  ‚k‚s‚q‚r‚`‚l|‚t|’S•Ûˆ—ŒŽ“x|¢‹I PIC S9(001) COMP-3.
000510 01  ‚k‚s‚q‚r‚`‚l|‚t|’S•Ûˆ—ŒŽ“x|”NŒŽ PIC  X(004).
000520 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒ_ƒ~[‚O‚O‚Q PIC  X(002).
000530 01  ‚k‚s‚q‚r‚`‚l|‚t|’P”N“xŒ_–ñ PIC  X(002).
000540 01  ‚k‚s‚q‚r‚`‚l|‚t|Â‹¦ƒR[ƒh PIC  X(002).
000550 01  ‚k‚s‚q‚r‚`‚l|‚t|Žx•¥ŒJ‰„ŒŽ” PIC S9(002)V9(2) COMP-3.
000560 01  ‚k‚s‚q‚r‚`‚l|‚t|‰Šú”ï—p PIC S9(013) COMP-3.
000570 01  ‚k‚s‚q‚r‚`‚l|‚t|‘O“n‹à—˜‘§Šz PIC S9(013) COMP-3.
000580 01  ‚k‚s‚q‚r‚`‚l|‚t|Šî€‹à—˜ PIC S9(002)V9(8) COMP-3.
000590 01  ‚k‚s‚q‚r‚`‚l|‚t|Šî–{—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000600 01  ‚k‚s‚q‚r‚`‚l|‚t|ŽÀŽ¿—˜‰ñ‚è PIC S9(002)V9(8) COMP-3.
000610 01  ‚k‚s‚q‚r‚`‚l|‚t|’¥Žû‹æ•ª PIC S9(001) COMP-3.
000620 01  ‚k‚s‚q‚r‚`‚l|‚t|Å—¦ PIC S9(002)V9(1) COMP-3.
000630 01  ‚k‚s‚q‚r‚`‚l|‚t|Á”ïÅƒR[ƒh PIC S9(002) COMP-3.
000640 01  ‚k‚s‚q‚r‚`‚l|‚t|ŠJŽn“ú|¢‹I PIC S9(001) COMP-3.
000650 01  ‚k‚s‚q‚r‚`‚l|‚t|ŠJŽn“ú|”NŒŽ PIC  X(004).
000660 01  ‚k‚s‚q‚r‚`‚l|‚t|I—¹“ú|¢‹I PIC S9(001) COMP-3.
000670 01  ‚k‚s‚q‚r‚`‚l|‚t|I—¹“ú|”NŒŽ PIC  X(004).
000680 01  ‚k‚s‚q‚r‚`‚l|‚t|ŠúŠÔ PIC S9(003) COMP-3.
000690 01  ‚k‚s‚q‚r‚`‚l|‚t|‘e—˜ PIC S9(013) COMP-3.
000700 01  ‚k‚s‚q‚r‚`‚l|‚t|Œ_–ñ‹àŠzŠî–{ PIC S9(013) COMP-3.
000710 01  ‚k‚s‚q‚r‚`‚l|‚t|Œ_–ñ‹àŠzŽÀŽ¿ PIC S9(013) COMP-3.
000720 01  ‚k‚s‚q‚r‚`‚l|‚t|—˜‘§‡ŒvŠî–{ PIC S9(013) COMP-3.
000730 01  ‚k‚s‚q‚r‚`‚l|‚t|—˜‘§‡ŒvŽÀŽ¿ PIC S9(013) COMP-3.
000740 01  ‚k‚s‚q‚r‚`‚l|‚t|ŒÅ’èŽ‘ŽYÅ PIC S9(013) COMP-3.
000750 01  ‚k‚s‚q‚r‚`‚l|‚t|•ÛŒ¯—¿ PIC S9(013) COMP-3.
000760 01  ‚k‚s‚q‚r‚`‚l|‚t|•ÛŽç—¿ PIC S9(013) COMP-3.
000770 01  ‚k‚s‚q‚r‚`‚l|‚t|‚»‚Ì‘¼‚P PIC S9(013) COMP-3.
000780 01  ‚k‚s‚q‚r‚`‚l|‚t|‚»‚Ì‘¼‚Q PIC S9(013) COMP-3.
000790 01  ‚k‚s‚q‚r‚`‚l|‚t|”Œo”ï‡Œv PIC S9(013) COMP-3.
000800 01  ‚k‚s‚q‚r‚`‚l|‚t|w“ü‹àŠz‡Œv PIC S9(013) COMP-3.
000810 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒ_ƒ~[‚O‚O‚R PIC  X(007).
000820 01  ‚k‚s‚q‚r‚`‚l|‚t|Žc‰¿•ÛØ‹æ•ª PIC S9(001) COMP-3.
000830 01  ‚k‚s‚q‚r‚`‚l|‚t|Žc‰¿‰ñŽû“ú|¢‹I PIC S9(001) COMP-3.
000840 01  ‚k‚s‚q‚r‚`‚l|‚t|Žc‰¿‰ñŽû“ú|”NŒŽ“ú PIC  X(006).
000850 01  ‚k‚s‚q‚r‚`‚l|‚t|Žc‰¿Šz‡Œv PIC S9(011) COMP-3.
000860 01  ‚k‚s‚q‚r‚`‚l|‚t|•¨ŒŽ}”Ô” PIC S9(003) COMP-3.
000870 01  ‚k‚s‚q‚r‚`‚l|‚t|ÂŒ Žc‚‘OŒŽ–– PIC S9(013) COMP-3.
000880 01  ‚k‚s‚q‚r‚`‚l|‚t|‰‰ñ”NŒŽ|¢‹I PIC S9(001) COMP-3.
000890 01  ‚k‚s‚q‚r‚`‚l|‚t|‰‰ñ”NŒŽ|”NŒŽ PIC  X(004).
000900 01  ‚k‚s‚q‚r‚`‚l|‚t|Žx•¥‰ñ””Ô† PIC S9(004) COMP-3.
000910 01  ‚k‚s‚q‚r‚`‚l|‚t|ŽÀƒŠ[ƒX—¿|Šî–{ PIC S9(013) COMP-3.
000920 01  ‚k‚s‚q‚r‚`‚l|‚t|ŽÀƒŠ[ƒX—¿|ŽÀŽ¿ PIC S9(013) COMP-3.
000930 01  ‚k‚s‚q‚r‚`‚l|‚t|‚m‚d‚s|ƒŠ[ƒX—¿|Šî–{ PIC S9(013) COMP-3.
000940 01  ‚k‚s‚q‚r‚`‚l|‚t|‚m‚d‚s|ƒŠ[ƒX—¿|ŽÀŽ¿ PIC S9(013) COMP-3.
000950 01  ‚k‚s‚q‚r‚`‚l|‚t|—˜‘§|Šî–{ PIC S9(013) COMP-3.
000960 01  ‚k‚s‚q‚r‚`‚l|‚t|—˜‘§|ŽÀŽ¿ PIC S9(013) COMP-3.
000970 01  ‚k‚s‚q‚r‚`‚l|‚t|Œ³–{“à“ü PIC S9(013) COMP-3.
000980 01  ‚k‚s‚q‚r‚`‚l|‚t|Œ³–{Žc‚ PIC S9(013) COMP-3.
000990 01  ‚k‚s‚q‚r‚`‚l|‚t|ÂŒ Žc‚|Šî–{ PIC S9(013) COMP-3.
001000 01  ‚k‚s‚q‚r‚`‚l|‚t|ÂŒ Žc‚|ŽÀŽ¿ PIC S9(013) COMP-3.
001010 01  ‚k‚s‚q‚r‚`‚l|‚t|Á”ïÅŠz PIC S9(011) COMP-3.
001020 01  ‚k‚s‚q‚r‚`‚l|‚t|Á”ïÅ|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
001030 01  ‚k‚s‚q‚r‚`‚l|‚t|””ï—p PIC S9(013) COMP-3.
001040 01  ‚k‚s‚q‚r‚`‚l|‚t|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
001050 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒ_ƒ~[‚O‚O‚S PIC  X(004).
001060 01  ‚k‚s‚q‚r‚`‚l|‚t|‰ñŽû•ûŽ®ƒR[ƒh PIC S9(001) COMP-3.
001070 01  ‚k‚s‚q‚r‚`‚l|‚t|‰ñŽûÏ•\Ž¦ PIC S9(001) COMP-3.
001080 01  ‚k‚s‚q‚r‚`‚l|‚t|‘OŽó[“–•\Ž¦ PIC S9(001) COMP-3.
001090 01  ‚k‚s‚q‚r‚`‚l|‚t|Žc‰¿‰ñŽû•\Ž¦ PIC S9(001) COMP-3.
001100 01  ‚k‚s‚q‚r‚`‚l|‚t|Žè”—¿¿‹–¼ÌƒJƒi PIC  X(030).
001110 01  ‚k‚s‚q‚r‚`‚l|‚t|[“–‘ŠŽE‹æ•ª PIC  X(001).
001120 01  ‚k‚s‚q‚r‚`‚l|‚t|ƒ_ƒ~[‚O‚O‚T PIC  X(028).
001130 01  ‚k‚s‚q‚r‚`‚l|‚t|³Œp“ú PIC  X(007).
001140 01  ‚k‚s‚q‚r‚`‚l|‚t|ÅV“ü—ÍÁ”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
001150 01  ‚k‚s‚q‚r‚`‚l|‚t|ˆ—”NŒŽ“x|¢‹I PIC  X(001).
001160 01  ‚k‚s‚q‚r‚`‚l|‚t|ˆ—”NŒŽ“x|”NŒŽ PIC  X(004).
001170 01  ‚k‚s‚q‚r‚`‚l|‚t|‹¤’Êî•ñ PIC  X(035).
