000010************************************************
000020* “–“úŽæˆø(Œo—)i“–“úŽæˆø(‰ïŒv))(LTRTTK)
000030************************************************
000040 01  ‚k‚s‚q‚s‚s‚j|Ž–‹ÆŠ‚P PIC  X(004).
000050 01  ‚k‚s‚q‚s‚s‚j|ˆê˜A”Ô†‚P PIC S9(005) COMP-3.
000060 01  ‚k‚s‚q‚s‚s‚j|Ž}”Ô‚P PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚s‚s‚j|“o˜^íœ PIC  X(001).
000080 01  ‚k‚s‚q‚s‚s‚j|’ •[o—Í PIC  X(001).
000090 01  ‚k‚s‚q‚s‚s‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(002).
000100 01  ‚k‚s‚q‚s‚s‚j|ƒŒƒR[ƒhŽí•Ê PIC S9(002) COMP-3.
000110 01  ‚k‚s‚q‚s‚s‚j|‹Æ–±”Ô† PIC  X(003).
000120 01  ‚k‚s‚q‚s‚s‚j|“ü—Í”ñ“ü—Í PIC  X(001).
000130 01  ‚k‚s‚q‚s‚s‚j|Ž–‹ÆŠ‚Q PIC  X(004).
000140 01  ‚k‚s‚q‚s‚s‚j|ˆê˜A”Ô†‚Q PIC S9(005) COMP-3.
000150 01  ‚k‚s‚q‚s‚s‚j|Ž}”Ô‚Q PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚s‚s‚j|“ü—ÍŽžŠÔ PIC S9(006) COMP-3.
000170 01  ‚k‚s‚q‚s‚s‚j|’[––”Ô† PIC  X(008).
000180 01  ‚k‚s‚q‚s‚s‚j|‰æ–Ê”Ô† PIC  X(004).
000190 01  ‚k‚s‚q‚s‚s‚j|’S“–ŽÒƒR[ƒh PIC  X(004).
000200 01  ‚k‚s‚q‚s‚s‚j|Š‘®Ž–‹ÆŠ PIC S9(004) COMP-3.
000210 01  ‚k‚s‚q‚s‚s‚j|©ƒJƒi PIC  X(010).
000220 01  ‚k‚s‚q‚s‚s‚j|“ü—Í“ú PIC  X(008).
000230 01  ‚k‚s‚q‚s‚s‚j|Žæˆø“ú PIC  X(008).
000240 01  ‚k‚s‚q‚s‚s‚j|ƒoƒŠƒ…[“ú PIC  X(008).
000250 01  ‚k‚s‚q‚s‚s‚j|“–‰Žæˆø“ú PIC  X(008).
000260 01  ‚k‚s‚q‚s‚s‚j|ˆ—‹æ•ª PIC  X(001).
000270 01  ‚k‚s‚q‚s‚s‚j|Ž–‹ÆŠ‚R PIC  X(004).
000280 01  ‚k‚s‚q‚s‚s‚j|ˆê˜A”Ô†‚R PIC S9(005) COMP-3.
000290 01  ‚k‚s‚q‚s‚s‚j|Ž©“®Žd–ó PIC  X(001).
000300 01  ‚k‚s‚q‚s‚s‚j|ƒ_ƒ~[‚O‚O‚Q PIC  X(002).
000310 01  ‚k‚s‚q‚s‚s‚j|Ž–‹ÆŠ PIC  X(004).
000320 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒÂ” PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒÂ” PIC S9(001) COMP-3.
000340 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û•¼Ží‚P PIC  X(003).
000350 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰È–ÚƒR[ƒh‚P PIC S9(003) COMP-3.
000360 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŽæˆøƒR[ƒh‚P PIC S9(002) COMP-3.
000370 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûƒƒOƒ^ƒCƒv‚P PIC  X(001).
000380 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰È–Úƒ^ƒCƒv‚P PIC  X(001).
000390 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŠO‰Ý‹àŠz‚P PIC S9(012)V9(2) COMP-3.
000400 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‚d‚w‹æ•ª‚P PIC  X(004).
000410 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŠ·ŽZƒŒ[ƒg‚P PIC S9(004)V9(2) COMP-3.
000420 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰~‰Ý‹àŠz‚P PIC S9(013) COMP-3.
000430 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‘Î‰¿‚e‚h‚w‚P PIC  X(001).
000440 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒûÀ”Ô†‚P PIC  X(008).
000450 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰ÛÅƒR[ƒh‚P PIC S9(003) COMP-3.
000460 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‚q‚d‚e‚m‚n‚P PIC  X(016).
000470 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒûÀŽåŠÇŽ–‹ÆŠ‚P PIC S9(004) COMP-3.
000480 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûÁ”ïÅ—¦‚P PIC S9(003) COMP-3.
000490 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûƒ_ƒ~[‚P PIC  X(001).
000500 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û•¼Ží‚Q PIC  X(003).
000510 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰È–ÚƒR[ƒh‚Q PIC S9(003) COMP-3.
000520 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŽæˆøƒR[ƒh‚Q PIC S9(002) COMP-3.
000530 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûƒƒOƒ^ƒCƒv‚Q PIC  X(001).
000540 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰È–Úƒ^ƒCƒv‚Q PIC  X(001).
000550 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŠO‰Ý‹àŠz‚Q PIC S9(012)V9(2) COMP-3.
000560 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‚d‚w‹æ•ª‚Q PIC  X(004).
000570 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŠ·ŽZƒŒ[ƒg‚Q PIC S9(004)V9(2) COMP-3.
000580 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰~‰Ý‹àŠz‚Q PIC S9(013) COMP-3.
000590 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‘Î‰¿‚e‚h‚w‚Q PIC  X(001).
000600 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒûÀ”Ô†‚Q PIC  X(008).
000610 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰ÛÅƒR[ƒh‚Q PIC S9(003) COMP-3.
000620 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‚q‚d‚e‚m‚n‚Q PIC  X(016).
000630 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒûÀŽåŠÇŽ–‹ÆŠ‚Q PIC S9(004) COMP-3.
000640 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûÁ”ïÅ—¦‚Q PIC S9(003) COMP-3.
000650 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûƒ_ƒ~[‚Q PIC  X(001).
000660 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û•¼Ží‚R PIC  X(003).
000670 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰È–ÚƒR[ƒh‚R PIC S9(003) COMP-3.
000680 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŽæˆøƒR[ƒh‚R PIC S9(002) COMP-3.
000690 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûƒƒOƒ^ƒCƒv‚R PIC  X(001).
000700 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰È–Úƒ^ƒCƒv‚R PIC  X(001).
000710 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŠO‰Ý‹àŠz‚R PIC S9(012)V9(2) COMP-3.
000720 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‚d‚w‹æ•ª‚R PIC  X(004).
000730 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŠ·ŽZƒŒ[ƒg‚R PIC S9(004)V9(2) COMP-3.
000740 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰~‰Ý‹àŠz‚R PIC S9(013) COMP-3.
000750 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‘Î‰¿‚e‚h‚w‚R PIC  X(001).
000760 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒûÀ”Ô†‚R PIC  X(008).
000770 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰ÛÅƒR[ƒh‚R PIC S9(003) COMP-3.
000780 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‚q‚d‚e‚m‚n‚R PIC  X(016).
000790 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒûÀŽåŠÇŽ–‹ÆŠ‚R PIC S9(004) COMP-3.
000800 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûÁ”ïÅ—¦‚R PIC S9(003) COMP-3.
000810 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûƒ_ƒ~[‚R PIC  X(001).
000820 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û•¼Ží‚S PIC  X(003).
000830 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰È–ÚƒR[ƒh‚S PIC S9(003) COMP-3.
000840 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŽæˆøƒR[ƒh‚S PIC S9(002) COMP-3.
000850 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûƒƒOƒ^ƒCƒv‚S PIC  X(001).
000860 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰È–Úƒ^ƒCƒv‚S PIC  X(001).
000870 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŠO‰Ý‹àŠz‚S PIC S9(012)V9(2) COMP-3.
000880 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‚d‚w‹æ•ª‚S PIC  X(004).
000890 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŠ·ŽZƒŒ[ƒg‚S PIC S9(004)V9(2) COMP-3.
000900 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰~‰Ý‹àŠz‚S PIC S9(013) COMP-3.
000910 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‘Î‰¿‚e‚h‚w‚S PIC  X(001).
000920 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒûÀ”Ô†‚S PIC  X(008).
000930 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‰ÛÅƒR[ƒh‚S PIC S9(003) COMP-3.
000940 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û‚q‚d‚e‚m‚n‚S PIC  X(016).
000950 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûŒûÀŽåŠÇŽ–‹ÆŠ‚S PIC S9(004) COMP-3.
000960 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûÁ”ïÅ—¦‚S PIC S9(003) COMP-3.
000970 01  ‚k‚s‚q‚s‚s‚j|ŽØ•ûƒ_ƒ~[‚S PIC  X(001).
000980 01  ‚k‚s‚q‚s‚s‚j|ŽØ•û“E—v PIC  X(035).
000990 01  ‚k‚s‚q‚s‚s‚j|ƒ_ƒ~[‚O‚O‚R PIC  X(015).
001000 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û•¼Ží‚P PIC  X(003).
001010 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰È–ÚƒR[ƒh‚P PIC S9(003) COMP-3.
001020 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŽæˆøƒR[ƒh‚P PIC S9(002) COMP-3.
001030 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûƒƒOƒ^ƒCƒv‚P PIC  X(001).
001040 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰È–Úƒ^ƒCƒv‚P PIC  X(001).
001050 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŠO‰Ý‹àŠz‚P PIC S9(012)V9(2) COMP-3.
001060 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‚d‚w‹æ•ª‚P PIC  X(004).
001070 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŠ·ŽZƒŒ[ƒg‚P PIC S9(004)V9(2) COMP-3.
001080 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰~‰Ý‹àŠz‚P PIC S9(013) COMP-3.
001090 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‘Î‰¿‚e‚h‚w‚P PIC  X(001).
001100 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒûÀ”Ô†‚P PIC  X(008).
001110 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰ÛÅƒR[ƒh‚P PIC S9(003) COMP-3.
001120 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‚q‚d‚e‚m‚n‚P PIC  X(016).
001130 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒûÀŽåŠÇŽ–‹ÆŠ‚P PIC S9(004) COMP-3.
001140 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûÁ”ïÅ—¦‚P PIC S9(003) COMP-3.
001150 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûƒ_ƒ~[‚P PIC  X(001).
001160 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û•¼Ží‚Q PIC  X(003).
001170 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰È–ÚƒR[ƒh‚Q PIC S9(003) COMP-3.
001180 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŽæˆøƒR[ƒh‚Q PIC S9(002) COMP-3.
001190 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûƒƒOƒ^ƒCƒv‚Q PIC  X(001).
001200 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰È–Úƒ^ƒCƒv‚Q PIC  X(001).
001210 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŠO‰Ý‹àŠz‚Q PIC S9(012)V9(2) COMP-3.
001220 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‚d‚w‹æ•ª‚Q PIC  X(004).
001230 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŠ·ŽZƒŒ[ƒg‚Q PIC S9(004)V9(2) COMP-3.
001240 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰~‰Ý‹àŠz‚Q PIC S9(013) COMP-3.
001250 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‘Î‰¿‚e‚h‚w‚Q PIC  X(001).
001260 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒûÀ”Ô†‚Q PIC  X(008).
001270 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰ÛÅƒR[ƒh‚Q PIC S9(003) COMP-3.
001280 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‚q‚d‚e‚m‚n‚Q PIC  X(016).
001290 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒûÀŽåŠÇŽ–‹ÆŠ‚Q PIC S9(004) COMP-3.
001300 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûÁ”ïÅ—¦‚Q PIC S9(003) COMP-3.
001310 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûƒ_ƒ~[‚Q PIC  X(001).
001320 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û•¼Ží‚R PIC  X(003).
001330 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰È–ÚƒR[ƒh‚R PIC S9(003) COMP-3.
001340 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŽæˆøƒR[ƒh‚R PIC S9(002) COMP-3.
001350 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûƒƒOƒ^ƒCƒv‚R PIC  X(001).
001360 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰È–Úƒ^ƒCƒv‚R PIC  X(001).
001370 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŠO‰Ý‹àŠz‚R PIC S9(012)V9(2) COMP-3.
001380 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‚d‚w‹æ•ª‚R PIC  X(004).
001390 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŠ·ŽZƒŒ[ƒg‚R PIC S9(004)V9(2) COMP-3.
001400 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰~‰Ý‹àŠz‚R PIC S9(013) COMP-3.
001410 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‘Î‰¿‚e‚h‚w‚R PIC  X(001).
001420 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒûÀ”Ô†‚R PIC  X(008).
001430 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰ÛÅƒR[ƒh‚R PIC S9(003) COMP-3.
001440 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‚q‚d‚e‚m‚n‚R PIC  X(016).
001450 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒûÀŽåŠÇŽ–‹ÆŠ‚R PIC S9(004) COMP-3.
001460 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûÁ”ïÅ—¦‚R PIC S9(003) COMP-3.
001470 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûƒ_ƒ~[‚R PIC  X(001).
001480 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û•¼Ží‚S PIC  X(003).
001490 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰È–ÚƒR[ƒh‚S PIC S9(003) COMP-3.
001500 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŽæˆøƒR[ƒh‚S PIC S9(002) COMP-3.
001510 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûƒƒOƒ^ƒCƒv‚S PIC  X(001).
001520 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰È–Úƒ^ƒCƒv‚S PIC  X(001).
001530 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŠO‰Ý‹àŠz‚S PIC S9(012)V9(2) COMP-3.
001540 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‚d‚w‹æ•ª‚S PIC  X(004).
001550 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŠ·ŽZƒŒ[ƒg‚S PIC S9(004)V9(2) COMP-3.
001560 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰~‰Ý‹àŠz‚S PIC S9(013) COMP-3.
001570 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‘Î‰¿‚e‚h‚w‚S PIC  X(001).
001580 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒûÀ”Ô†‚S PIC  X(008).
001590 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‰ÛÅƒR[ƒh‚S PIC S9(003) COMP-3.
001600 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û‚q‚d‚e‚m‚n‚S PIC  X(016).
001610 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûŒûÀŽåŠÇŽ–‹ÆŠ‚S PIC S9(004) COMP-3.
001620 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûÁ”ïÅ—¦‚S PIC S9(003) COMP-3.
001630 01  ‚k‚s‚q‚s‚s‚j|‘Ý•ûƒ_ƒ~[‚S PIC  X(001).
001640 01  ‚k‚s‚q‚s‚s‚j|‘Ý•û“E—v PIC  X(034).
001650 01  ‚k‚s‚q‚s‚s‚j|ƒ_ƒ~[‚O‚O‚S PIC  X(015).
001660 01  ‚k‚s‚q‚s‚s‚j|•¼Ží PIC  X(003).
001670 01  ‚k‚s‚q‚s‚s‚j|‰È–ÚƒR[ƒh PIC S9(003) COMP-3.
001680 01  ‚k‚s‚q‚s‚s‚j|ŽæˆøƒR[ƒh PIC S9(002) COMP-3.
001690 01  ‚k‚s‚q‚s‚s‚j|ƒƒOƒ^ƒCƒv PIC  X(001).
001700 01  ‚k‚s‚q‚s‚s‚j|‰È–Úƒ^ƒCƒv PIC  X(001).
001710 01  ‚k‚s‚q‚s‚s‚j|ŠO‰Ý‹àŠz PIC S9(012)V9(2) COMP-3.
001720 01  ‚k‚s‚q‚s‚s‚j|‚d‚w‹æ•ª PIC  X(004).
001730 01  ‚k‚s‚q‚s‚s‚j|Š·ŽZƒŒ[ƒg PIC S9(004)V9(2) COMP-3.
001740 01  ‚k‚s‚q‚s‚s‚j|‰~‰Ý‹àŠz PIC S9(013) COMP-3.
001750 01  ‚k‚s‚q‚s‚s‚j|‘Î‰¿‚e‚h‚w PIC  X(001).
001760 01  ‚k‚s‚q‚s‚s‚j|ŒûÀ”Ô† PIC  X(008).
001770 01  ‚k‚s‚q‚s‚s‚j|‰ÛÅƒR[ƒh PIC S9(003) COMP-3.
001780 01  ‚k‚s‚q‚s‚s‚j|‚q‚d‚e‚m‚n PIC  X(016).
001790 01  ‚k‚s‚q‚s‚s‚j|ŒûÀŽåŠÇŽ–‹ÆŠ PIC S9(004) COMP-3.
001800 01  ‚k‚s‚q‚s‚s‚j|Á”ïÅ—¦ PIC S9(003) COMP-3.
001810 01  ‚k‚s‚q‚s‚s‚j|ƒ_ƒ~[‚O‚O‚T PIC  X(001).
001820 01  ‚k‚s‚q‚s‚s‚j|“E—v PIC  X(034).
001830 01  ‚k‚s‚q‚s‚s‚j|ŽnŠú|¢‹I PIC S9(001) COMP-3.
001840 01  ‚k‚s‚q‚s‚s‚j|ŽnŠú|”NŒŽ“ú PIC S9(006) COMP-3.
001850 01  ‚k‚s‚q‚s‚s‚j|IŠú|¢‹I PIC S9(001) COMP-3.
001860 01  ‚k‚s‚q‚s‚s‚j|IŠú|”NŒŽ“ú PIC S9(006) COMP-3.
001870 01  ‚k‚s‚q‚s‚s‚j|—˜—¦ PIC S9(003)V9(7) COMP-3.
001880 01  ‚k‚s‚q‚s‚s‚j|•Ð’[—¼’[‹æ•ª PIC  X(001).
001890 01  ‚k‚s‚q‚s‚s‚j|‘OŽæŒãŽæ‹æ•ª PIC  X(001).
001900 01  ‚k‚s‚q‚s‚s‚j|—˜—¦Šî” PIC  X(001).
001910 01  ‚k‚s‚q‚s‚s‚j|ƒ_ƒ~[‚O‚O‚U PIC  X(015).
001920 01  ‚k‚s‚q‚s‚s‚j|‹¤’Êî•ñ PIC  X(035).
