000010************************************************
000020* ˆ—’Ê”Ô(ƒ|ƒbƒJ¬–ñ)(LTRTUUX)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚w|‚j‚d‚x‚P PIC  X(004).
000050 01  ‚k‚s‚q‚s‚t‚t‚w|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000060 01  ‚k‚s‚q‚s‚t‚t‚w|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚k‚s‚q‚s‚t‚t‚w|‘OŒŽ“x|¢‹I PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚s‚t‚t‚w|‘OŒŽ“x|”NŒŽ“ú PIC  X(006).
000090 01  ‚k‚s‚q‚s‚t‚t‚w|ƒ_ƒ~[‚O‚O‚Q PIC  X(039).
000100 01  ‚k‚s‚q‚s‚t‚t‚w|‹¤’Êî•ñ PIC  X(035).
