000010************************************************
000020* ˆ—’Ê”Ô(“ŒŽÅ¬–ñ)(LTRTUU001)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚P|‚j‚d‚x‚P PIC  X(004).
000050 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000060 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚P|Œ_–ñ”Ô† PIC  X(009).
000070 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚P|‘OŒŽ“x|¢‹I PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚P|‘OŒŽ“x|”NŒŽ“ú PIC  X(006).
000090 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(039).
000100 01  ‚k‚s‚q‚s‚t‚t‚O‚O‚P|‹¤’Êî•ñ PIC  X(035).
