000010************************************************
000020* ˆ—’Ê”Ô(Žx•¥³”F‡‚)(LTRTUUK1)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚j‚P|‚j‚d‚x‚P PIC  X(002).
000050 01  ‚k‚s‚q‚s‚t‚t‚j‚P|ƒTƒuƒVƒXƒeƒ€‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚s‚t‚t‚j‚P|ƒ_ƒ~[‚O‚O‚P PIC  X(007).
000070 01  ‚k‚s‚q‚s‚t‚t‚j‚P|ˆê˜A”Ô†Ì”Ô—p PIC S9(005) COMP-3.
000080 01  ‚k‚s‚q‚s‚t‚t‚j‚P|ƒ_ƒ~[‚O‚O‚Q PIC  X(050).
000090 01  ‚k‚s‚q‚s‚t‚t‚j‚P|‹¤’Êî•ñ PIC  X(035).
