000010************************************************
000020* ŽèŒ`ŠÇ—iŽèŒ`Šî–{j(LTRTEK)
000030************************************************
000040 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n PIC  X(009).
000050 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚P PIC  X(009).
000060 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚Q PIC  X(009).
000070 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚R PIC  X(009).
000080 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚S PIC  X(009).
000090 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚T PIC  X(009).
000100 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚U PIC  X(009).
000110 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚V PIC  X(009).
000120 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚W PIC  X(009).
000130 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚X PIC  X(009).
000140 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñ‚m‚n‚P‚O PIC  X(009).
000150 01  ‚k‚s‚q‚s‚d‚j|ŽæˆøæƒR[ƒh PIC  X(008).
000160 01  ‚k‚s‚q‚s‚d‚j|–¼ÌŠ¿Žš PIC  X(040).
000170 01  ‚k‚s‚q‚s‚d‚j|–¼ÌƒJƒi PIC  X(040).
000180 01  ‚k‚s‚q‚s‚d‚j|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000190 01  ‚k‚s‚q‚s‚d‚j|Œ_–ñŠz PIC S9(013) COMP-3.
000200 01  ‚k‚s‚q‚s‚d‚j|‘‡Œv‹àŠz PIC S9(013) COMP-3.
000210 01  ‚k‚s‚q‚s‚d‚j|ƒ_ƒ~[‚O‚O‚P PIC  X(060).
000220 01  ‚k‚s‚q‚s‚d‚j|‹¤’Êî•ñ PIC  X(035).
