000010************************************************
000020* “–“úŽæˆø(Œo—)iŠÇ”Ì”ï/Žx•¥ƒf[ƒ^)(LTRTTK9)
000030************************************************
000040 01  ‚k‚s‚q‚s‚s‚j‚X|Ž–‹ÆŠ‚P PIC  X(004).
000050 01  ‚k‚s‚q‚s‚s‚j‚X|ˆê˜A”Ô†‚P PIC S9(005) COMP-3.
000060 01  ‚k‚s‚q‚s‚s‚j‚X|Ž}”Ô‚P PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚s‚s‚j‚X|“o˜^íœ PIC  X(001).
000080 01  ‚k‚s‚q‚s‚s‚j‚X|’ •[o—Í PIC  X(001).
000090 01  ‚k‚s‚q‚s‚s‚j‚X|ƒ_ƒ~[‚O‚O‚P PIC  X(002).
000100 01  ‚k‚s‚q‚s‚s‚j‚X|ƒŒƒR[ƒhŽí•Ê PIC S9(002) COMP-3.
000110 01  ‚k‚s‚q‚s‚s‚j‚X|‹Æ–±ƒR[ƒh PIC  X(003).
000120 01  ‚k‚s‚q‚s‚s‚j‚X|“ü—Í”ñ“ü—Í PIC  X(001).
000130 01  ‚k‚s‚q‚s‚s‚j‚X|Ž–‹ÆŠ‚Q PIC  X(004).
000140 01  ‚k‚s‚q‚s‚s‚j‚X|ˆê˜A”Ô†‚Q PIC S9(005) COMP-3.
000150 01  ‚k‚s‚q‚s‚s‚j‚X|Ž}”Ô‚Q PIC S9(001) COMP-3.
000160 01  ‚k‚s‚q‚s‚s‚j‚X|“ü—ÍŽžŠÔ PIC S9(006) COMP-3.
000170 01  ‚k‚s‚q‚s‚s‚j‚X|’[––”Ô† PIC  X(008).
000180 01  ‚k‚s‚q‚s‚s‚j‚X|‰æ–Ê”Ô† PIC  X(004).
000190 01  ‚k‚s‚q‚s‚s‚j‚X|’S“–ŽÒƒR[ƒh PIC  X(004).
000200 01  ‚k‚s‚q‚s‚s‚j‚X|Š‘®Ž–‹ÆŠ PIC S9(004) COMP-3.
000210 01  ‚k‚s‚q‚s‚s‚j‚X|©ƒJƒi PIC  X(010).
000220 01  ‚k‚s‚q‚s‚s‚j‚X|“ü—Í“ú PIC  X(008).
000230 01  ‚k‚s‚q‚s‚s‚j‚X|Žæˆø“ú PIC  X(008).
000240 01  ‚k‚s‚q‚s‚s‚j‚X|ƒoƒŠƒ…[“ú PIC  X(008).
000250 01  ‚k‚s‚q‚s‚s‚j‚X|“–‰Žæˆø“ú PIC  X(008).
000260 01  ‚k‚s‚q‚s‚s‚j‚X|ˆ—‹æ•ª PIC  X(001).
000270 01  ‚k‚s‚q‚s‚s‚j‚X|Ž–‹ÆŠ‚R PIC  X(004).
000280 01  ‚k‚s‚q‚s‚s‚j‚X|ˆê˜A”Ô†‚R PIC S9(005) COMP-3.
000290 01  ‚k‚s‚q‚s‚s‚j‚X|ƒ_ƒ~[‚O‚O‚Q PIC  X(003).
000300 01  ‚k‚s‚q‚s‚s‚j‚X|Ž–‹ÆŠ PIC  X(004).
000310 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒÂ” PIC S9(001) COMP-3.
000320 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒÂ” PIC S9(001) COMP-3.
000330 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û•¼Ží‚P PIC  X(003).
000340 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰È–ÚƒR[ƒh‚P PIC S9(003) COMP-3.
000350 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŽæˆøƒR[ƒh‚P PIC S9(002) COMP-3.
000360 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûƒƒOƒ^ƒCƒv‚P PIC  X(001).
000370 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰È–Úƒ^ƒCƒv‚P PIC  X(001).
000380 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŠÇ”Ì”ïƒR[ƒh‚P PIC S9(003) COMP-3.
000390 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰~‰Ý‹àŠz‚P PIC S9(013) COMP-3.
000400 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒûÀ”Ô†‚P PIC  X(008).
000410 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰ÛÅƒR[ƒh‚P PIC S9(003) COMP-3.
000420 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‚q‚d‚e‚m‚n‚P PIC  X(016).
000430 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û®—”Ô†‚P PIC  X(006).
000440 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒûÀŽåŠÇŽ–‹ÆŠ‚P PIC S9(004) COMP-3.
000450 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûÁ”ïÅ—¦‚P PIC S9(003) COMP-3.
000460 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûƒ_ƒ~[‚P PIC  X(001).
000470 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û•¼Ží‚Q PIC  X(003).
000480 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰È–ÚƒR[ƒh‚Q PIC S9(003) COMP-3.
000490 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŽæˆøƒR[ƒh‚Q PIC S9(002) COMP-3.
000500 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûƒƒOƒ^ƒCƒv‚Q PIC  X(001).
000510 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰È–Úƒ^ƒCƒv‚Q PIC  X(001).
000520 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŠÇ”Ì”ïƒR[ƒh‚Q PIC S9(003) COMP-3.
000530 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰~‰Ý‹àŠz‚Q PIC S9(013) COMP-3.
000540 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒûÀ”Ô†‚Q PIC  X(008).
000550 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰ÛÅƒR[ƒh‚Q PIC S9(003) COMP-3.
000560 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‚q‚d‚e‚m‚n‚Q PIC  X(016).
000570 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û®—”Ô†‚Q PIC  X(006).
000580 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒûÀŽåŠÇŽ–‹ÆŠ‚Q PIC S9(004) COMP-3.
000590 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûÁ”ïÅ—¦‚Q PIC S9(003) COMP-3.
000600 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûƒ_ƒ~[‚Q PIC  X(001).
000610 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û•¼Ží‚R PIC  X(003).
000620 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰È–ÚƒR[ƒh‚R PIC S9(003) COMP-3.
000630 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŽæˆøƒR[ƒh‚R PIC S9(002) COMP-3.
000640 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûƒƒOƒ^ƒCƒv‚R PIC  X(001).
000650 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰È–Úƒ^ƒCƒv‚R PIC  X(001).
000660 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŠÇ”Ì”ïƒR[ƒh‚R PIC S9(003) COMP-3.
000670 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰~‰Ý‹àŠz‚R PIC S9(013) COMP-3.
000680 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒûÀ”Ô†‚R PIC  X(008).
000690 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰ÛÅƒR[ƒh‚R PIC S9(003) COMP-3.
000700 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‚q‚d‚e‚m‚n‚R PIC  X(016).
000710 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û®—”Ô†‚R PIC  X(006).
000720 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒûÀŽåŠÇŽ–‹ÆŠ‚R PIC S9(004) COMP-3.
000730 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûÁ”ïÅ—¦‚R PIC S9(003) COMP-3.
000740 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûƒ_ƒ~[‚R PIC  X(001).
000750 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û•¼Ží‚S PIC  X(003).
000760 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰È–ÚƒR[ƒh‚S PIC S9(003) COMP-3.
000770 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŽæˆøƒR[ƒh‚S PIC S9(002) COMP-3.
000780 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûƒƒOƒ^ƒCƒv‚S PIC  X(001).
000790 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰È–Úƒ^ƒCƒv‚S PIC  X(001).
000800 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŠÇ”Ì”ïƒR[ƒh‚S PIC S9(003) COMP-3.
000810 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰~‰Ý‹àŠz‚S PIC S9(013) COMP-3.
000820 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒûÀ”Ô†‚S PIC  X(008).
000830 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‰ÛÅƒR[ƒh‚S PIC S9(003) COMP-3.
000840 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û‚q‚d‚e‚m‚n‚S PIC  X(016).
000850 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•û®—”Ô†‚S PIC  X(006).
000860 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûŒûÀŽåŠÇŽ–‹ÆŠ‚S PIC S9(004) COMP-3.
000870 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûÁ”ïÅ—¦‚S PIC S9(003) COMP-3.
000880 01  ‚k‚s‚q‚s‚s‚j‚X|ŽØ•ûƒ_ƒ~[‚S PIC  X(001).
000890 01  ‚k‚s‚q‚s‚s‚j‚X|‘ŠŽèæƒR[ƒh PIC S9(004) COMP-3.
000900 01  ‚k‚s‚q‚s‚s‚j‚X|‘ŠŽèæ–¼Ì PIC  X(056).
000910 01  ‚k‚s‚q‚s‚s‚j‚X|Žg“r–¾× PIC  X(056).
000920 01  ‚k‚s‚q‚s‚s‚j‚X|ƒ_ƒ~[‚O‚O‚R PIC  X(017).
000930 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û•¼Ží‚P PIC  X(003).
000940 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰È–ÚƒR[ƒh‚P PIC S9(003) COMP-3.
000950 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŽæˆøƒR[ƒh‚P PIC S9(002) COMP-3.
000960 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûƒƒOƒ^ƒCƒv‚P PIC  X(001).
000970 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰È–Úƒ^ƒCƒv‚P PIC  X(001).
000980 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŠÇ”Ì”ïƒR[ƒh‚P PIC S9(003) COMP-3.
000990 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰~‰Ý‹àŠz‚P PIC S9(013) COMP-3.
001000 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒûÀ”Ô†‚P PIC  X(008).
001010 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰ÛÅƒR[ƒh‚P PIC S9(003) COMP-3.
001020 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‚q‚d‚e‚m‚n‚P PIC  X(016).
001030 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û®—”Ô†‚P PIC  X(006).
001040 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒûÀŽåŠÇŽ–‹ÆŠ‚P PIC S9(004) COMP-3.
001050 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûÁ”ïÅ—¦‚P PIC S9(003) COMP-3.
001060 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûƒ_ƒ~[‚P PIC  X(001).
001070 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û•¼Ží‚Q PIC  X(003).
001080 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰È–ÚƒR[ƒh‚Q PIC S9(003) COMP-3.
001090 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŽæˆøƒR[ƒh‚Q PIC S9(002) COMP-3.
001100 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûƒƒOƒ^ƒCƒv‚Q PIC  X(001).
001110 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰È–Úƒ^ƒCƒv‚Q PIC  X(001).
001120 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŠÇ”Ì”ïƒR[ƒh‚Q PIC S9(003) COMP-3.
001130 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰~‰Ý‹àŠz‚Q PIC S9(013) COMP-3.
001140 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒûÀ”Ô†‚Q PIC  X(008).
001150 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰ÛÅƒR[ƒh‚Q PIC S9(003) COMP-3.
001160 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‚q‚d‚e‚m‚n‚Q PIC  X(016).
001170 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û®—”Ô†‚Q PIC  X(006).
001180 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒûÀŽåŠÇŽ–‹ÆŠ‚Q PIC S9(004) COMP-3.
001190 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûÁ”ïÅ—¦‚Q PIC S9(003) COMP-3.
001200 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûƒ_ƒ~[‚Q PIC  X(001).
001210 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û•¼Ží‚R PIC  X(003).
001220 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰È–ÚƒR[ƒh‚R PIC S9(003) COMP-3.
001230 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŽæˆøƒR[ƒh‚R PIC S9(002) COMP-3.
001240 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûƒƒOƒ^ƒCƒv‚R PIC  X(001).
001250 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰È–Úƒ^ƒCƒv‚R PIC  X(001).
001260 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŠÇ”Ì”ïƒR[ƒh‚R PIC S9(003) COMP-3.
001270 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰~‰Ý‹àŠz‚R PIC S9(013) COMP-3.
001280 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒûÀ”Ô†‚R PIC  X(008).
001290 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰ÛÅƒR[ƒh‚R PIC S9(003) COMP-3.
001300 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‚q‚d‚e‚m‚n‚R PIC  X(016).
001310 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û®—”Ô†‚R PIC  X(006).
001320 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒûÀŽåŠÇŽ–‹ÆŠ‚R PIC S9(004) COMP-3.
001330 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûÁ”ïÅ—¦‚R PIC S9(003) COMP-3.
001340 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûƒ_ƒ~[‚R PIC  X(001).
001350 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û•¼Ží‚S PIC  X(003).
001360 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰È–ÚƒR[ƒh‚S PIC S9(003) COMP-3.
001370 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŽæˆøƒR[ƒh‚S PIC S9(002) COMP-3.
001380 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûƒƒOƒ^ƒCƒv‚S PIC  X(001).
001390 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰È–Úƒ^ƒCƒv‚S PIC  X(001).
001400 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŠÇ”Ì”ïƒR[ƒh‚S PIC S9(003) COMP-3.
001410 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰~‰Ý‹àŠz‚S PIC S9(013) COMP-3.
001420 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒûÀ”Ô†‚S PIC  X(008).
001430 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‰ÛÅƒR[ƒh‚S PIC S9(003) COMP-3.
001440 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û‚q‚d‚e‚m‚n‚S PIC  X(016).
001450 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•û®—”Ô†‚S PIC  X(006).
001460 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûŒûÀŽåŠÇŽ–‹ÆŠ‚S PIC S9(004) COMP-3.
001470 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûÁ”ïÅ—¦‚S PIC S9(003) COMP-3.
001480 01  ‚k‚s‚q‚s‚s‚j‚X|‘Ý•ûƒ_ƒ~[‚S PIC  X(001).
001490 01  ‚k‚s‚q‚s‚s‚j‚X|ƒ_ƒ~[‚O‚O‚S PIC  X(020).
001500 01  ‚k‚s‚q‚s‚s‚j‚X|•û–@ƒR[ƒh PIC  X(001).
001510 01  ‚k‚s‚q‚s‚s‚j‚X|×•ªƒR[ƒh PIC  X(001).
001520 01  ‚k‚s‚q‚s‚s‚j‚X|Žx•¥“ú|¢‹I PIC S9(001) COMP-3.
001530 01  ‚k‚s‚q‚s‚s‚j‚X|Žx•¥“ú|”NŒŽ“ú PIC S9(006) COMP-3.
001540 01  ‚k‚s‚q‚s‚s‚j‚X|Žx•¥‹àŠz PIC S9(013) COMP-3.
001550 01  ‚k‚s‚q‚s‚s‚j‚X|Žx•¥‹âsŽx“XƒR[ƒh PIC  X(007).
001560 01  ‚k‚s‚q‚s‚s‚j‚X|Žx•¥—a‹àŽí–ÚƒR[ƒh PIC S9(001) COMP-3.
001570 01  ‚k‚s‚q‚s‚s‚j‚X|Žx•¥ŒûÀ”Ô† PIC S9(007) COMP-3.
001580 01  ‚k‚s‚q‚s‚s‚j‚X|ŽóŽææƒR[ƒh PIC S9(004) COMP-3.
001590 01  ‚k‚s‚q‚s‚s‚j‚X|ŽóŽææ–¼Ì PIC  X(056).
001600 01  ‚k‚s‚q‚s‚s‚j‚X|‹âsŽx“XƒR[ƒh PIC  X(007).
001610 01  ‚k‚s‚q‚s‚s‚j‚X|—a‹àŽí–ÚƒR[ƒh PIC S9(001) COMP-3.
001620 01  ‚k‚s‚q‚s‚s‚j‚X|ŒûÀ”Ô† PIC S9(007) COMP-3.
001630 01  ‚k‚s‚q‚s‚s‚j‚X|ƒ_ƒ~[‚O‚O‚T PIC  X(030).
001640 01  ‚k‚s‚q‚s‚s‚j‚X|‹¤’Êî•ñ PIC  X(035).
