000010************************************************
000020* ˆ—’Ê”Ô(Žx•¥ŽèŒ`ŠÇ—‡‚)(LTRTUUE0)
000030************************************************
000040 01  ‚k‚s‚q‚s‚t‚t‚d‚O|‚j‚d‚x‚P PIC  X(002).
000050 01  ‚k‚s‚q‚s‚t‚t‚d‚O|”­s‹æ•ª PIC  X(001).
000060 01  ‚k‚s‚q‚s‚t‚t‚d‚O|Šúƒtƒ‰ƒO PIC  X(001).
000070 01  ‚k‚s‚q‚s‚t‚t‚d‚O|ƒ_ƒ~[‚O‚O‚P PIC  X(006).
000080 01  ‚k‚s‚q‚s‚t‚t‚d‚O|UoŠú PIC S9(002) COMP-3.
000090 01  ‚k‚s‚q‚s‚t‚t‚d‚O|ŠÇ—”Ô† PIC S9(005) COMP-3.
000100 01  ‚k‚s‚q‚s‚t‚t‚d‚O|ƒ_ƒ~[‚O‚O‚Q PIC  X(048).
000110 01  ‚k‚s‚q‚s‚t‚t‚d‚O|‹¤’Êî•ñ PIC  X(035).
