000010************************************************
000020* (MAN_DUMMY)
000030************************************************
000040 01  ‚l‚`‚m|‚c‚t‚l‚l‚x|ƒiƒ“ƒo[ PIC S9(002) COMP-3.
