000010************************************************
000020* (MAN_WK_SEIKYU)
000030************************************************
000040 01  ‚l‚`‚m|‚v‚j|‚r‚d‚h‚j‚x‚t|’[––”Ô† PIC  X(016).
000050 01  ‚l‚`‚m|‚v‚j|‚r‚d‚h‚j‚x‚t|¿‹æƒR[ƒh PIC  X(008).
000060 01  ‚l‚`‚m|‚v‚j|‚r‚d‚h‚j‚x‚t|Žæˆøæ–¼Š¿Žš PIC  X(060).
000070 01  ‚l‚`‚m|‚v‚j|‚r‚d‚h‚j‚x‚t|Žæˆøæ–¼ƒJƒi PIC  X(030).
000080 01  ‚l‚`‚m|‚v‚j|‚r‚d‚h‚j‚x‚t|¿‹æ•”–å–¼ PIC  X(040).
