000010************************************************
000020* (MAN_WK_APL_SEIKYU)
000030************************************************
000040 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|ƒL[ PIC  X(016).
000050 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|¿‹“ú PIC  X(008).
000080 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|ÄƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000090 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|ÄƒŠ[ƒX—¿|Á”ïÅŠz 
                                             PIC S9(013) COMP-3.
000100 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|”„‹p‹àŠz 
                                             PIC S9(013) COMP-3.
000110 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|”„‹p‹àŠz|Á”ïÅŠz 
                                             PIC S9(013) COMP-3.
000120 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|XV“ú PIC  X(008).
000130 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|XVŽž PIC  X(006).
000140 01  ‚l‚`‚m|‚v‚j|‚`‚o‚k|‚r‚d‚h‚j‚x‚t|XV’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
