000010************************************************
000020* (MAN_MEISAI)
000030************************************************
000040 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒXƒR[ƒh PIC  X(001).
000070 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒXŽü‰ñƒR[ƒh PIC  X(001).
000080 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ƒŠ[ƒXŠJŽn“ú PIC  X(008).
000090 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ƒŠ[ƒXI—¹“ú PIC  X(008).
000100 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000110 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000120 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Ž‘ŽYƒR[ƒh PIC  X(007).
000130 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Žc‰¿•ÛØæƒR[ƒh PIC  X(008).
000140 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Žc‰¿Šz PIC S9(013) COMP-3.
000150 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|•¨Œ–¼|Š¿Žš PIC  X(040).
000160 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|•¨Œ–¼|ƒJƒi PIC  X(020).
000170 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”—Ê PIC S9(004) COMP-3.
000180 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000190 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|w“ü‹àŠz PIC S9(013) COMP-3.
000200 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚P 
                                             PIC  X(012).
000210 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚Q 
                                             PIC  X(012).
000220 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚R 
                                             PIC  X(012).
000230 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ƒ†[ƒU[ƒŠƒtƒ@ƒŒƒ“ƒX‚m‚n‚S 
                                             PIC  X(012).
000240 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|“®‘•t•Û‹æ•ª PIC  X(001).
000250 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000260 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒX•t•Û—¦ PIC  X(002).
000270 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”[•tæƒR[ƒh PIC  X(006).
000280 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Å‹æ•ª PIC  X(001).
000290 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼|Š¿Žš PIC  X(040).
000300 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Ý’uêŠ–¼|ƒJƒi PIC  X(020).
000310 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Ý’uêŠ—X•Ö”Ô† PIC  X(007).
000320 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Ý’uêŠZŠ PIC  X(100).
000330 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Ž‘ŽYˆ•ªƒR[ƒh PIC  X(001).
000340 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|–ž—¹ˆ—“ú PIC  X(008).
000350 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹p•¨Œ‹àŠz PIC S9(013) COMP-3.
000360 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹p”—Ê PIC S9(004) COMP-3.
000370 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹pˆø“næ‹æ•ª PIC  X(001).
000380 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹pˆø“næ–¼|Š¿Žš PIC  X(060).
000390 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹pˆø“næ–¼|ƒJƒi PIC  X(030).
000400 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹p‹àŠz“ü‹àæƒR[ƒh PIC  X(008).
000410 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹p‹àŠz PIC S9(013) COMP-3.
000420 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹pÅ—¦ PIC S9(002)V9(1) COMP-3.
000430 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹pˆÏ‘õŽè”—¿ PIC S9(013) COMP-3.
000440 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”„‹p‹àŠz“ü‹à—\’è“ú PIC  X(008).
000450 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Žó“nŠúŒÀ PIC  X(060).
000460 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Žx•¥ðŒ PIC  X(060).
000470 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”pŠü•¨Œ‹àŠz PIC S9(013) COMP-3.
000480 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”pŠü”—Ê PIC S9(004) COMP-3.
000490 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”pŠüˆø“næ‹æ•ª PIC  X(001).
000500 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”pŠüˆø“næ–¼|Š¿Žš PIC  X(060).
000510 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|”pŠüˆø“næ–¼|ƒJƒi PIC  X(030).
000520 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ˆøŽæ”ï—p PIC S9(013) COMP-3.
000530 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒXˆ—“ú PIC  X(008).
000540 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒX•¨Œ‹àŠz PIC S9(013) COMP-3.
000550 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒX”—Ê PIC S9(004) COMP-3.
000560 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒXŠJŽn“ú PIC  X(008).
000570 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000580 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒX—¿|¿‹‹àŠz 
                                             PIC S9(013) COMP-3.
000590 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒXŽæˆµŽè”—¿ 
                                             PIC S9(013) COMP-3.
000600 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|¿‹æƒR[ƒh PIC  X(008).
000610 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|‰ñŽû•ûŽ®‚P PIC  X(001).
000620 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|‰ñŽû•ûŽ®‚Q PIC  X(001).
000630 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|¿‹ƒTƒCƒNƒ‹ PIC S9(002) COMP-3.
000640 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Žx•¥‰ñ” PIC S9(003) COMP-3.
000650 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|‚a‚d‚f‚h‚m‰ñ” PIC  X(001).
000660 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ŒvŽZ•ûŽ® PIC  X(001).
000670 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|‹âsƒR[ƒh PIC  X(007).
000680 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ŒûÀ”Ô† PIC  X(007).
000690 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|—a‹àŽí—Þ PIC  X(001).
000700 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|“ü‹à“ú PIC S9(002) COMP-3.
000710 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú PIC  X(008).
000720 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒXƒR[ƒh|V PIC  X(001).
000730 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Á”ïÅ—¦ PIC S9(002)V9(1) COMP-3.
000740 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ÄƒŠ[ƒX•t•Û—¦|V 
                                             PIC S9(002) COMP-3.
000750 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|•ÛŽçŒ_–ñ‹æ•ª PIC  X(001).
000760 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Žc‰¿Šz|V PIC S9(013) COMP-3.
000770 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|“o˜^“ú PIC  X(008).
000780 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|“o˜^Žž PIC  X(006).
000790 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000800 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|XV“ú PIC  X(008).
000810 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|XVŽž PIC  X(006).
000820 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000830 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊŒ_–ñ‹àŠz|Œ³ PIC S9(013) COMP-3.
000840 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|Œp‘±ƒŠ[ƒXž‹p‘ÎÛŠz 
                                             PIC S9(013) COMP-3.
000850 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊÄƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000860 01  ‚l‚`‚m|‚l‚d‚h‚r‚`‚h|ŒÂ•ÊÁ”ïÅ PIC S9(013) COMP-3.
