000010************************************************
000020* (MAN_JUSIN_CHK)
000030************************************************
000040 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|ƒf[ƒ^‹æ•ª PIC  X(001).
000050 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|•¨Œ‚m‚n PIC  X(003).
000070 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|ÄƒŠ[ƒXƒR[ƒh PIC  X(001).
000080 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|ÄƒŠ[ƒXŽü‰ñƒR[ƒh PIC  X(001).
000090 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|ƒŠ[ƒXŠJŽn“ú PIC  X(008).
000100 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|ƒŠ[ƒXI—¹“ú PIC  X(008).
000110 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000120 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|Š¨’èˆ—ƒR[ƒh PIC  X(002).
000130 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|Ž‘ŽYƒR[ƒh PIC  X(007).
000140 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|Žc‰¿Šz PIC S9(013) COMP-3.
000150 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|•¨Œ–¼|Š¿Žš PIC  X(040).
000160 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|•¨Œ–¼|ƒJƒi PIC  X(020).
000170 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|”—Ê PIC S9(004) COMP-3.
000180 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|ŒÂ•ÊƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000190 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|w“ü‹àŠz PIC S9(013) COMP-3.
000200 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|ŽóMw“ü‹àŠz PIC S9(013) COMP-3.
000210 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|Ž‘ŽYˆ•ªƒR[ƒh PIC  X(001).
000220 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|“WŠJíœ‹æ•ª PIC  X(001).
000230 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|•ÛŽçíœ‹æ•ª PIC  X(001).
000240 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|“o˜^“ú PIC  X(008).
000250 01  ‚l‚`‚m|‚i‚t‚r‚h‚m|‚b‚g‚j|“o˜^Žž PIC  X(006).
