000010************************************************
000020* (MAN_JIGYO_MISYORI)
000030************************************************
000040 01  ‚l‚`‚m|‚i‚h‚f‚x‚n|‚l‚h‚r‚x‚n‚q‚h|’[––”Ô† PIC  X(016).
000050 01  ‚l‚`‚m|‚i‚h‚f‚x‚n|‚l‚h‚r‚x‚n‚q‚h|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000060 01  ‚l‚`‚m|‚i‚h‚f‚x‚n|‚l‚h‚r‚x‚n‚q‚h|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000070 01  ‚l‚`‚m|‚i‚h‚f‚x‚n|‚l‚h‚r‚x‚n‚q‚h|“–ŒŽˆÈ‘O‹æ•ª 
                                             PIC  X(008).
000080 01  ‚l‚`‚m|‚i‚h‚f‚x‚n|‚l‚h‚r‚x‚n‚q‚h|–¢ˆ—Œ” 
                                             PIC S9(013) COMP-3.
