000010************************************************
000020* (MAN_MISYORI)
000030************************************************
000040 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|’[––”Ô† PIC  X(016).
000050 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|Œ_–ñ”Ô† PIC  X(009).
000060 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|Ž}”Ô PIC  X(003).
000070 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000080 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|Ž–‹ÆŠ–¼ PIC  X(020).
000090 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|ƒ†[ƒU[ƒR[ƒh PIC  X(008).
000100 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|Œ_–ñæ–¼ PIC  X(060).
000110 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000120 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|–ž—¹“ú PIC  X(008).
000130 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|ÄƒŠ[ƒXŠJŽn“ú PIC  X(008).
000140 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|•¨Œ‹àŠz PIC S9(013) COMP-3.
000150 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|Žc‰¿Šz PIC S9(013) COMP-3.
000160 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000170 01  ‚l‚`‚m|‚l‚h‚r‚x‚n‚q‚h|•¨Œ–¼ PIC  X(040).
