000010************************************************
000020* (MAN_SAILEA)
000030************************************************
000040 01  ‚l‚`‚m|‚r‚`‚h‚k‚d‚`|ŠÇ—‚m‚n PIC  X(006).
000050 01  ‚l‚`‚m|‚r‚`‚h‚k‚d‚`|—\”õ‚P PIC  X(002).
000060 01  ‚l‚`‚m|‚r‚`‚h‚k‚d‚`|‹@Ží PIC  X(017).
000070 01  ‚l‚`‚m|‚r‚`‚h‚k‚d‚`|‹@”Ô PIC  X(010).
000080 01  ‚l‚`‚m|‚r‚`‚h‚k‚d‚`|—\”õ‚Q PIC  X(036).
