000010************************************************
000020* (MAN_JIKO_JUSIN)
000030************************************************
000040 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|•¨Œ‚m‚n PIC  X(003).
000060 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|‹àŒ^”Ô† PIC  X(013).
000070 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|ÄƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000080 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|ÄŽc‰¿Šz PIC S9(013) COMP-3.
000090 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|“o˜^“ú PIC  X(008).
000100 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|“o˜^Žž PIC  X(006).
000110 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000120 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|XV“ú PIC  X(008).
000130 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|XVŽž PIC  X(006).
000140 01  ‚l‚`‚m|‚i‚h‚j‚n|‚i‚t‚r‚h‚m|XV’S“–ŽÒƒR[ƒh PIC  X(004).
