000010************************************************
000020* (MAN_DOSO_RITU)
000030************************************************
000040 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|‘ÎÛŽ‘ŽYƒR[ƒh PIC  X(007).
000060 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚P PIC S9(002) COMP-3.
000070 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚Q PIC S9(002) COMP-3.
000080 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚R PIC S9(002) COMP-3.
000090 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚S PIC S9(002) COMP-3.
000100 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚T PIC S9(002) COMP-3.
000110 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚U PIC S9(002) COMP-3.
000120 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚V PIC S9(002) COMP-3.
000130 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚W PIC S9(002) COMP-3.
000140 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|•t•Û—¦‚X PIC S9(002) COMP-3.
000150 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|“o˜^“ú PIC  X(008).
000160 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|“o˜^Žž PIC  X(006).
000170 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000180 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|XV“ú PIC  X(008).
000190 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|XVŽž PIC  X(006).
000200 01  ‚l‚`‚m|‚c‚n‚r‚n|‚q‚h‚s‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
