000010************************************************
000020* (MFS_KOBMOD)
000030************************************************
000040 01  MFS_KOBMOD-JOBTYP PIC  X(004).
000050 01  MFS_KOBMOD-REGTIM PIC  X(006).
000060 01  MFS_KOBMOD-PAYNUM PIC  X(008).
000070 01  MFS_KOBMOD-CSTNUM PIC  X(012).
000080 01  MFS_KOBMOD-PAYDAY PIC  X(002).
000090 01  MFS_KOBMOD-BNKCOD PIC  X(004).
000100 01  MFS_KOBMOD-BRCCOD PIC  X(003).
000110 01  MFS_KOBMOD-CSTNAM PIC  X(030).
000120 01  MFS_KOBMOD-DEPKND PIC  X(001).
000130 01  MFS_KOBMOD-DEPNUM PIC  X(007).
000140 01  MFS_KOBMOD-TRNAMT PIC S9(010) COMP-3.
000150 01  MFS_KOBMOD-PAYDAY_O PIC  X(002).
000160 01  MFS_KOBMOD-BNKCOD_O PIC  X(004).
000170 01  MFS_KOBMOD-BRCCOD_O PIC  X(003).
000180 01  MFS_KOBMOD-CSTNAM_O PIC  X(030).
000190 01  MFS_KOBMOD-DEPKND_O PIC  X(001).
000200 01  MFS_KOBMOD-DEPNUM_O PIC  X(007).
000210 01  MFS_KOBMOD-TRNAMT_O PIC S9(010) COMP-3.
000220 01  MFS_KOBMOD-PAYDAY_M PIC  X(001).
000230 01  MFS_KOBMOD-BNKCOD_M PIC  X(001).
000240 01  MFS_KOBMOD-BRCCOD_M PIC  X(001).
000250 01  MFS_KOBMOD-CSTNAM_M PIC  X(001).
000260 01  MFS_KOBMOD-DEPKND_M PIC  X(001).
000270 01  MFS_KOBMOD-DEPNUM_M PIC  X(001).
000280 01  MFS_KOBMOD-TRNAMT_M PIC  X(001).
