000010************************************************
000020* (MFS_LIST)
000030************************************************
000040 01  ‚l‚e‚r|‚k‚h‚r‚s|¿‹æƒR[ƒh PIC  X(008).
000050 01  ‚l‚e‚r|‚k‚h‚r‚s|ƒf[ƒ^‹æ•ª PIC  X(001).
000060 01  ‚l‚e‚r|‚k‚h‚r‚s|‹âsƒR[ƒh PIC  X(004).
000070 01  ‚l‚e‚r|‚k‚h‚r‚s|‹âs–¼ PIC  X(015).
000080 01  ‚l‚e‚r|‚k‚h‚r‚s|Žx“XƒR[ƒh PIC  X(003).
000090 01  ‚l‚e‚r|‚k‚h‚r‚s|Žx“X–¼ PIC  X(015).
000100 01  ‚l‚e‚r|‚k‚h‚r‚s|ƒ_ƒ~[‚O‚O‚P PIC  X(004).
000110 01  ‚l‚e‚r|‚k‚h‚r‚s|—a‹àŽí—Þ PIC  X(001).
000120 01  ‚l‚e‚r|‚k‚h‚r‚s|ŒûÀ”Ô† PIC  X(007).
000130 01  ‚l‚e‚r|‚k‚h‚r‚s|—a‹àŽÒ–¼ PIC  X(030).
000140 01  ‚l‚e‚r|‚k‚h‚r‚s|¿‹‹àŠz PIC S9(010) COMP-3.
000150 01  ‚l‚e‚r|‚k‚h‚r‚s|V‹KƒR[ƒh PIC  X(001).
000160 01  ‚l‚e‚r|‚k‚h‚r‚s|‚l‚e‚r—“ PIC  X(008).
000170 01  ‚l‚e‚r|‚k‚h‚r‚s|ŒÚ‹q”Ô† PIC  X(012).
000180 01  ‚l‚e‚r|‚k‚h‚r‚s|U‘ÖŒ‹‰Ê PIC  X(001).
000190 01  ‚l‚e‚r|‚k‚h‚r‚s|ƒ_ƒ~[‚Q PIC  X(008).
000200 01  ‚l‚e‚r|‚k‚h‚r‚s|“o˜^“ú PIC  X(008).
000210 01  ‚l‚e‚r|‚k‚h‚r‚s|“o˜^Žž PIC  X(006).
000220 01  ‚l‚e‚r|‚k‚h‚r‚s|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000230 01  ‚l‚e‚r|‚k‚h‚r‚s|XV“ú PIC  X(008).
000240 01  ‚l‚e‚r|‚k‚h‚r‚s|XVŽž PIC  X(006).
000250 01  ‚l‚e‚r|‚k‚h‚r‚s|XV’S“–ŽÒƒR[ƒh PIC  X(004).
