000010************************************************
000020* (MFS_GENREC)
000030************************************************
000040 01  MFS_GENREC-GENREC PIC  X(120).
