000010************************************************
000020* (MFS_MEIMOD)
000030************************************************
000040 01  MFS_MEIMOD-JOBTYP PIC  X(004).
000050 01  MFS_MEIMOD-REGTIM PIC  X(006).
000060 01  MFS_MEIMOD-PAYNUM PIC  X(008).
000070 01  MFS_MEIMOD-CSTNAM PIC  X(030).
000080 01  MFS_MEIMOD-CSTNAM_O PIC  X(030).
000090 01  MFS_MEIMOD-CSTNAM_M PIC  X(001).
