000010************************************************
000020* (MFS_FUJITU)
000030************************************************
000040 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|ˆ—’Ê”Ô PIC  X(004).
000050 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|¿‹æƒR[ƒh PIC  X(008).
000060 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|‹âs–¼ PIC  X(015).
000070 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|Žx“X–¼ PIC  X(015).
000080 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|‹âsƒR[ƒh PIC  X(004).
000090 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|Žx“XƒR[ƒh PIC  X(003).
000100 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|—a‹àŽí—Þ PIC  X(001).
000110 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|ŒûÀ”Ô† PIC  X(007).
000120 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|ŒûÀ–¼‹`l–¼ PIC  X(030).
000130 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|¿‹‹àŠz PIC S9(010) COMP-3.
000140 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|Œ_–ñ”Ô† PIC  X(009).
000150 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|‘ä” PIC S9(004) COMP-3.
000160 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|ƒ_ƒ~[‚P PIC  X(004).
000170 01  ‚l‚e‚r|‚e‚t‚i‚h‚s‚t|ƒ_ƒ~[‚Q PIC  X(004).
