000010************************************************
000020* (MST_DOSO_TANKI)
000030************************************************
000040 01  MST_DOSO_TANKI-既経過期間_月数 PIC  X(002).
000050 01  MST_DOSO_TANKI-既経過期間_日数 PIC  X(003).
000060 01  MST_DOSO_TANKI-動総保険短期料率_1 PIC S9(002)V9(8) COMP-3.
000070 01  MST_DOSO_TANKI-適用日_1 PIC  X(008).
000080 01  MST_DOSO_TANKI-動総保険短期料率_2 PIC S9(002)V9(8) COMP-3.
000090 01  MST_DOSO_TANKI-適用日_2 PIC  X(008).
000100 01  MST_DOSO_TANKI-登録日 PIC  X(008).
000110 01  MST_DOSO_TANKI-登録時刻 PIC  X(006).
000120 01  MST_DOSO_TANKI-登録担当者ｺｰﾄﾞ PIC  X(004).
000130 01  MST_DOSO_TANKI-更新日 PIC  X(008).
000140 01  MST_DOSO_TANKI-更新時刻 PIC  X(006).
000150 01  MST_DOSO_TANKI-更新担当者ｺｰﾄﾞ PIC  X(004).
