000010************************************************
000020* (MST_DOSO)
000030************************************************
000040 01  ‚l‚r‚s|‚c‚n‚r‚n|“®‘•ÛŒ¯ƒR[ƒh PIC  X(004).
000050 01  ‚l‚r‚s|‚c‚n‚r‚n|“K—p“ú|‚P PIC  X(008).
000060 01  ‚l‚r‚s|‚c‚n‚r‚n|“®‘•ÛŒ¯—¿—¦|‚P PIC S9(002)V9(8) COMP-3.
000070 01  ‚l‚r‚s|‚c‚n‚r‚n|“K—p“ú|‚Q PIC  X(008).
000080 01  ‚l‚r‚s|‚c‚n‚r‚n|“®‘•ÛŒ¯—¿—¦|‚Q PIC S9(002)V9(8) COMP-3.
000090 01  ‚l‚r‚s|‚c‚n‚r‚n|“K—p“ú|‚R PIC  X(008).
000100 01  ‚l‚r‚s|‚c‚n‚r‚n|“®‘•ÛŒ¯—¿—¦|‚R PIC S9(002)V9(8) COMP-3.
000110 01  ‚l‚r‚s|‚c‚n‚r‚n|“K—p“ú|‚S PIC  X(008).
000120 01  ‚l‚r‚s|‚c‚n‚r‚n|“®‘•ÛŒ¯—¿—¦|‚S PIC S9(002)V9(8) COMP-3.
000130 01  ‚l‚r‚s|‚c‚n‚r‚n|“K—p“ú|‚T PIC  X(008).
000140 01  ‚l‚r‚s|‚c‚n‚r‚n|“®‘•ÛŒ¯—¿—¦|‚T PIC S9(002)V9(8) COMP-3.
000150 01  ‚l‚r‚s|‚c‚n‚r‚n|“o˜^“ú PIC  X(008).
000160 01  ‚l‚r‚s|‚c‚n‚r‚n|“o˜^Žž PIC  X(006).
000170 01  ‚l‚r‚s|‚c‚n‚r‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000180 01  ‚l‚r‚s|‚c‚n‚r‚n|XV“ú PIC  X(008).
000190 01  ‚l‚r‚s|‚c‚n‚r‚n|XVŽž PIC  X(006).
000200 01  ‚l‚r‚s|‚c‚n‚r‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000210 01  ‚l‚r‚s|‚c‚n‚r‚n|Žæˆøæ‹æ•ª PIC  X(001).
000220 01  ‚l‚r‚s|‚c‚n‚r‚n|•ÛŒ¯‰ïŽÐ–¼ PIC  X(040).
000230 01  ‚l‚r‚s|‚c‚n‚r‚n|•¨Œ–¼ PIC  X(060).
