000010************************************************
000020* (MST_SINYO_LEASE)
000030************************************************
000040 01  MST_SINYO_LEASE-ﾘｰｽ_割賦区分 PIC  X(001).
000050 01  MST_SINYO_LEASE-保険期間月数 PIC  X(003).
000060 01  MST_SINYO_LEASE-適用日 PIC  X(008).
000070 01  MST_SINYO_LEASE-信用保険料率 PIC S9(002)V9(8) COMP-3.
000080 01  MST_SINYO_LEASE-登録日 PIC  X(008).
000090 01  MST_SINYO_LEASE-登録時刻 PIC  X(006).
000100 01  MST_SINYO_LEASE-登録担当者ｺｰﾄﾞ PIC  X(004).
000110 01  MST_SINYO_LEASE-更新日 PIC  X(008).
000120 01  MST_SINYO_LEASE-更新時刻 PIC  X(006).
000130 01  MST_SINYO_LEASE-更新担当者ｺｰﾄﾞ PIC  X(004).
