000010************************************************
000020* (MST_SINYO_KIKAI)
000030************************************************
000040 01  MST_SINYO_KIKAI-ﾘｰｽ_割賦区分 PIC  X(001).
000050 01  MST_SINYO_KIKAI-信用保険ｺｰﾄﾞ_機械区分 PIC  X(002).
000060 01  MST_SINYO_KIKAI-信用保険機械類名 PIC  X(070).
000070 01  MST_SINYO_KIKAI-金額ﾌｧｲﾙ下限 PIC S9(013) COMP-3.
000080 01  MST_SINYO_KIKAI-金額ﾌｧｲﾙ上限 PIC S9(013) COMP-3.
000090 01  MST_SINYO_KIKAI-最長期間 PIC  X(002).
000100 01  MST_SINYO_KIKAI-登録日 PIC  X(008).
000110 01  MST_SINYO_KIKAI-登録時刻 PIC  X(006).
000120 01  MST_SINYO_KIKAI-登録担当者ｺｰﾄﾞ PIC  X(004).
000130 01  MST_SINYO_KIKAI-更新日 PIC  X(008).
000140 01  MST_SINYO_KIKAI-更新時刻 PIC  X(006).
000150 01  MST_SINYO_KIKAI-更新担当者ｺｰﾄﾞ PIC  X(004).
