000010************************************************
000020* (MST_KINRI)
000030************************************************
000040 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|ƒŠ[ƒXŠúŠÔ PIC  X(003).
000050 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|ƒŠ[ƒXŠúŠÔ•ÊŽÐ“à‹à—˜|‚P 
                                             PIC S9(002)V9(8) COMP-3.
000060 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|“K—p“ú|‚P PIC  X(008).
000070 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|ƒŠ[ƒXŠúŠÔ•ÊŽÐ“à‹à—˜|‚Q 
                                             PIC S9(002)V9(8) COMP-3.
000080 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|“K—p“ú|‚Q PIC  X(008).
000090 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|ƒŠ[ƒXŠúŠÔ•ÊŽÐ“à‹à—˜|‚R 
                                             PIC S9(002)V9(8) COMP-3.
000100 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|“K—p“ú|‚R PIC  X(008).
000110 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|ƒŠ[ƒXŠúŠÔ•ÊŽÐ“à‹à—˜|‚S 
                                             PIC S9(002)V9(8) COMP-3.
000120 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|“K—p“ú|‚S PIC  X(008).
000130 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|ƒŠ[ƒXŠúŠÔ•ÊŽÐ“à‹à—˜|‚T 
                                             PIC S9(002)V9(8) COMP-3.
000140 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|“K—p“ú|‚T PIC  X(008).
000150 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|“o˜^“ú PIC  X(008).
000160 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|“o˜^Žž PIC  X(006).
000170 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000180 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|XV“ú PIC  X(008).
000190 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|XVŽž PIC  X(006).
000200 01  ‚l‚r‚s|‚j‚h‚m‚q‚h|XV’S“–ŽÒƒR[ƒh PIC  X(004).
