000010************************************************
000020* (MST_WK_002)
000030************************************************
000040 01  ‚l‚r‚s|‚v‚j|‚O‚O‚Q|Žæˆøæ‹æ•ª PIC  X(001).
000050 01  ‚l‚r‚s|‚v‚j|‚O‚O‚Q|Žæˆøæ‹æ•ª–¼ PIC  X(030).
000060 01  ‚l‚r‚s|‚v‚j|‚O‚O‚Q|ƒ[ƒN PIC  X(001).
