000010************************************************
000020* (MST_SINYOREI)
000030************************************************
000040 01  MST_SINYOREI-ﾘｰｽ_割賦区分 PIC  X(001).
000050 01  MST_SINYOREI-信用保険ｺｰﾄﾞ_機種区分 PIC  X(002).
000060 01  MST_SINYOREI-具体例_1 PIC  X(050).
000070 01  MST_SINYOREI-具体例_2 PIC  X(050).
000080 01  MST_SINYOREI-具体例_3 PIC  X(050).
000090 01  MST_SINYOREI-具体例_4 PIC  X(050).
000100 01  MST_SINYOREI-具体例_5 PIC  X(050).
000110 01  MST_SINYOREI-具体例_6 PIC  X(050).
000120 01  MST_SINYOREI-具体例_7 PIC  X(050).
000130 01  MST_SINYOREI-具体例_8 PIC  X(050).
000140 01  MST_SINYOREI-具体例_9 PIC  X(050).
000150 01  MST_SINYOREI-具体例_10 PIC  X(050).
000160 01  MST_SINYOREI-具体例_11 PIC  X(050).
000170 01  MST_SINYOREI-具体例_12 PIC  X(050).
000180 01  MST_SINYOREI-具体例_13 PIC  X(050).
000190 01  MST_SINYOREI-具体例_14 PIC  X(050).
000200 01  MST_SINYOREI-具体例_15 PIC  X(050).
000210 01  MST_SINYOREI-具体例_16 PIC  X(050).
000220 01  MST_SINYOREI-具体例_17 PIC  X(050).
000230 01  MST_SINYOREI-具体例_18 PIC  X(050).
000240 01  MST_SINYOREI-具体例_19 PIC  X(050).
000250 01  MST_SINYOREI-具体例_20 PIC  X(050).
000260 01  MST_SINYOREI-具体例_21 PIC  X(050).
000270 01  MST_SINYOREI-具体例_22 PIC  X(050).
000280 01  MST_SINYOREI-具体例_23 PIC  X(050).
000290 01  MST_SINYOREI-具体例_24 PIC  X(050).
000300 01  MST_SINYOREI-具体例_25 PIC  X(050).
000310 01  MST_SINYOREI-具体例_26 PIC  X(050).
000320 01  MST_SINYOREI-具体例_27 PIC  X(050).
000330 01  MST_SINYOREI-具体例_28 PIC  X(050).
000340 01  MST_SINYOREI-具体例_29 PIC  X(050).
000350 01  MST_SINYOREI-具体例_30 PIC  X(050).
000360 01  MST_SINYOREI-具体例_31 PIC  X(050).
000370 01  MST_SINYOREI-具体例_32 PIC  X(050).
000380 01  MST_SINYOREI-具体例_33 PIC  X(050).
000390 01  MST_SINYOREI-具体例_34 PIC  X(050).
000400 01  MST_SINYOREI-具体例_35 PIC  X(050).
000410 01  MST_SINYOREI-具体例_36 PIC  X(050).
000420 01  MST_SINYOREI-具体例_37 PIC  X(050).
000430 01  MST_SINYOREI-具体例_38 PIC  X(050).
000440 01  MST_SINYOREI-具体例_39 PIC  X(050).
000450 01  MST_SINYOREI-具体例_40 PIC  X(050).
000460 01  MST_SINYOREI-具体例_41 PIC  X(050).
000470 01  MST_SINYOREI-具体例_42 PIC  X(050).
000480 01  MST_SINYOREI-具体例_43 PIC  X(050).
000490 01  MST_SINYOREI-具体例_44 PIC  X(050).
000500 01  MST_SINYOREI-具体例_45 PIC  X(050).
000510 01  MST_SINYOREI-具体例_46 PIC  X(050).
000520 01  MST_SINYOREI-具体例_47 PIC  X(050).
000530 01  MST_SINYOREI-具体例_48 PIC  X(050).
000540 01  MST_SINYOREI-具体例_49 PIC  X(050).
000550 01  MST_SINYOREI-具体例_50 PIC  X(050).
000560 01  MST_SINYOREI-具体例_51 PIC  X(050).
000570 01  MST_SINYOREI-具体例_52 PIC  X(050).
000580 01  MST_SINYOREI-具体例_53 PIC  X(050).
000590 01  MST_SINYOREI-具体例_54 PIC  X(050).
000600 01  MST_SINYOREI-具体例_55 PIC  X(050).
000610 01  MST_SINYOREI-具体例_56 PIC  X(050).
000620 01  MST_SINYOREI-具体例_57 PIC  X(050).
000630 01  MST_SINYOREI-具体例_58 PIC  X(050).
000640 01  MST_SINYOREI-具体例_59 PIC  X(050).
000650 01  MST_SINYOREI-具体例_60 PIC  X(050).
000660 01  MST_SINYOREI-具体例_61 PIC  X(050).
000670 01  MST_SINYOREI-具体例_62 PIC  X(050).
000680 01  MST_SINYOREI-具体例_63 PIC  X(050).
000690 01  MST_SINYOREI-具体例_64 PIC  X(050).
000700 01  MST_SINYOREI-具体例_65 PIC  X(050).
000710 01  MST_SINYOREI-具体例_66 PIC  X(050).
000720 01  MST_SINYOREI-具体例_67 PIC  X(050).
000730 01  MST_SINYOREI-具体例_68 PIC  X(050).
000740 01  MST_SINYOREI-具体例_69 PIC  X(050).
000750 01  MST_SINYOREI-具体例_70 PIC  X(050).
000760 01  MST_SINYOREI-具体例_71 PIC  X(050).
000770 01  MST_SINYOREI-具体例_72 PIC  X(050).
000780 01  MST_SINYOREI-具体例_73 PIC  X(050).
000790 01  MST_SINYOREI-具体例_74 PIC  X(050).
000800 01  MST_SINYOREI-具体例_75 PIC  X(050).
000810 01  MST_SINYOREI-具体例_76 PIC  X(050).
000820 01  MST_SINYOREI-具体例_77 PIC  X(050).
000830 01  MST_SINYOREI-具体例_78 PIC  X(050).
000840 01  MST_SINYOREI-具体例_79 PIC  X(050).
000850 01  MST_SINYOREI-具体例_80 PIC  X(050).
000860 01  MST_SINYOREI-具体例_81 PIC  X(050).
000870 01  MST_SINYOREI-具体例_82 PIC  X(050).
000880 01  MST_SINYOREI-具体例_83 PIC  X(050).
000890 01  MST_SINYOREI-具体例_84 PIC  X(050).
000900 01  MST_SINYOREI-具体例_85 PIC  X(050).
000910 01  MST_SINYOREI-具体例_86 PIC  X(050).
000920 01  MST_SINYOREI-具体例_87 PIC  X(050).
000930 01  MST_SINYOREI-具体例_88 PIC  X(050).
000940 01  MST_SINYOREI-具体例_89 PIC  X(050).
000950 01  MST_SINYOREI-具体例_90 PIC  X(050).
000960 01  MST_SINYOREI-具体例_91 PIC  X(050).
000970 01  MST_SINYOREI-具体例_92 PIC  X(050).
000980 01  MST_SINYOREI-具体例_93 PIC  X(050).
000990 01  MST_SINYOREI-具体例_94 PIC  X(050).
001000 01  MST_SINYOREI-具体例_95 PIC  X(050).
001010 01  MST_SINYOREI-具体例_96 PIC  X(050).
001020 01  MST_SINYOREI-具体例_97 PIC  X(050).
001030 01  MST_SINYOREI-具体例_98 PIC  X(050).
001040 01  MST_SINYOREI-具体例_99 PIC  X(050).
001050 01  MST_SINYOREI-具体例_100 PIC  X(050).
001060 01  MST_SINYOREI-具体例_101 PIC  X(050).
001070 01  MST_SINYOREI-具体例_102 PIC  X(050).
001080 01  MST_SINYOREI-具体例_103 PIC  X(050).
001090 01  MST_SINYOREI-具体例_104 PIC  X(050).
001100 01  MST_SINYOREI-具体例_105 PIC  X(050).
001110 01  MST_SINYOREI-具体例_106 PIC  X(050).
001120 01  MST_SINYOREI-具体例_107 PIC  X(050).
001130 01  MST_SINYOREI-具体例_108 PIC  X(050).
001140 01  MST_SINYOREI-具体例_109 PIC  X(050).
001150 01  MST_SINYOREI-具体例_110 PIC  X(050).
001160 01  MST_SINYOREI-具体例_111 PIC  X(050).
001170 01  MST_SINYOREI-具体例_112 PIC  X(050).
001180 01  MST_SINYOREI-具体例_113 PIC  X(050).
001190 01  MST_SINYOREI-具体例_114 PIC  X(050).
001200 01  MST_SINYOREI-具体例_115 PIC  X(050).
001210 01  MST_SINYOREI-具体例_116 PIC  X(050).
001220 01  MST_SINYOREI-具体例_117 PIC  X(050).
001230 01  MST_SINYOREI-具体例_118 PIC  X(050).
001240 01  MST_SINYOREI-具体例_119 PIC  X(050).
001250 01  MST_SINYOREI-具体例_120 PIC  X(050).
001260 01  MST_SINYOREI-具体例_121 PIC  X(050).
001270 01  MST_SINYOREI-具体例_122 PIC  X(050).
001280 01  MST_SINYOREI-具体例_123 PIC  X(050).
001290 01  MST_SINYOREI-具体例_124 PIC  X(050).
001300 01  MST_SINYOREI-具体例_125 PIC  X(050).
001310 01  MST_SINYOREI-具体例_126 PIC  X(050).
001320 01  MST_SINYOREI-具体例_127 PIC  X(050).
001330 01  MST_SINYOREI-具体例_128 PIC  X(050).
001340 01  MST_SINYOREI-具体例_129 PIC  X(050).
001350 01  MST_SINYOREI-具体例_130 PIC  X(050).
001360 01  MST_SINYOREI-具体例_131 PIC  X(050).
001370 01  MST_SINYOREI-具体例_132 PIC  X(050).
001380 01  MST_SINYOREI-具体例_133 PIC  X(050).
001390 01  MST_SINYOREI-具体例_134 PIC  X(050).
001400 01  MST_SINYOREI-具体例_135 PIC  X(050).
001410 01  MST_SINYOREI-具体例_136 PIC  X(050).
001420 01  MST_SINYOREI-具体例_137 PIC  X(050).
001430 01  MST_SINYOREI-具体例_138 PIC  X(050).
001440 01  MST_SINYOREI-具体例_139 PIC  X(050).
001450 01  MST_SINYOREI-具体例_140 PIC  X(050).
001460 01  MST_SINYOREI-具体例_141 PIC  X(050).
001470 01  MST_SINYOREI-具体例_142 PIC  X(050).
001480 01  MST_SINYOREI-具体例_143 PIC  X(050).
001490 01  MST_SINYOREI-具体例_144 PIC  X(050).
001500 01  MST_SINYOREI-具体例_145 PIC  X(050).
001510 01  MST_SINYOREI-具体例_146 PIC  X(050).
001520 01  MST_SINYOREI-具体例_147 PIC  X(050).
001530 01  MST_SINYOREI-具体例_148 PIC  X(050).
001540 01  MST_SINYOREI-具体例_149 PIC  X(050).
001550 01  MST_SINYOREI-具体例_150 PIC  X(050).
001560 01  MST_SINYOREI-対象外_1 PIC  X(050).
001570 01  MST_SINYOREI-対象外_2 PIC  X(050).
001580 01  MST_SINYOREI-対象外_3 PIC  X(050).
001590 01  MST_SINYOREI-対象外_4 PIC  X(050).
001600 01  MST_SINYOREI-対象外_5 PIC  X(050).
001610 01  MST_SINYOREI-対象外_6 PIC  X(050).
001620 01  MST_SINYOREI-対象外_7 PIC  X(050).
001630 01  MST_SINYOREI-対象外_8 PIC  X(050).
001640 01  MST_SINYOREI-対象外_9 PIC  X(050).
001650 01  MST_SINYOREI-対象外_10 PIC  X(050).
001660 01  MST_SINYOREI-対象外_11 PIC  X(050).
001670 01  MST_SINYOREI-対象外_12 PIC  X(050).
001680 01  MST_SINYOREI-対象外_13 PIC  X(050).
001690 01  MST_SINYOREI-対象外_14 PIC  X(050).
001700 01  MST_SINYOREI-対象外_15 PIC  X(050).
001710 01  MST_SINYOREI-対象外_16 PIC  X(050).
001720 01  MST_SINYOREI-対象外_17 PIC  X(050).
001730 01  MST_SINYOREI-対象外_18 PIC  X(050).
001740 01  MST_SINYOREI-対象外_19 PIC  X(050).
001750 01  MST_SINYOREI-対象外_20 PIC  X(050).
001760 01  MST_SINYOREI-対象外_21 PIC  X(050).
001770 01  MST_SINYOREI-対象外_22 PIC  X(050).
001780 01  MST_SINYOREI-対象外_23 PIC  X(050).
001790 01  MST_SINYOREI-対象外_24 PIC  X(050).
001800 01  MST_SINYOREI-対象外_25 PIC  X(050).
001810 01  MST_SINYOREI-対象外_26 PIC  X(050).
001820 01  MST_SINYOREI-対象外_27 PIC  X(050).
001830 01  MST_SINYOREI-対象外_28 PIC  X(050).
001840 01  MST_SINYOREI-対象外_29 PIC  X(050).
001850 01  MST_SINYOREI-対象外_30 PIC  X(050).
001860 01  MST_SINYOREI-対象外_31 PIC  X(050).
001870 01  MST_SINYOREI-対象外_32 PIC  X(050).
001880 01  MST_SINYOREI-対象外_33 PIC  X(050).
001890 01  MST_SINYOREI-対象外_34 PIC  X(050).
001900 01  MST_SINYOREI-対象外_35 PIC  X(050).
001910 01  MST_SINYOREI-対象外_36 PIC  X(050).
001920 01  MST_SINYOREI-対象外_37 PIC  X(050).
001930 01  MST_SINYOREI-対象外_38 PIC  X(050).
001940 01  MST_SINYOREI-対象外_39 PIC  X(050).
001950 01  MST_SINYOREI-対象外_40 PIC  X(050).
001960 01  MST_SINYOREI-対象外_41 PIC  X(050).
001970 01  MST_SINYOREI-対象外_42 PIC  X(050).
001980 01  MST_SINYOREI-対象外_43 PIC  X(050).
001990 01  MST_SINYOREI-対象外_44 PIC  X(050).
002000 01  MST_SINYOREI-対象外_45 PIC  X(050).
002010 01  MST_SINYOREI-対象外_46 PIC  X(050).
002020 01  MST_SINYOREI-対象外_47 PIC  X(050).
002030 01  MST_SINYOREI-対象外_48 PIC  X(050).
002040 01  MST_SINYOREI-対象外_49 PIC  X(050).
002050 01  MST_SINYOREI-対象外_50 PIC  X(050).
002060 01  MST_SINYOREI-登録日 PIC  X(008).
002070 01  MST_SINYOREI-登録時刻 PIC  X(006).
002080 01  MST_SINYOREI-登録担当者ｺｰﾄﾞ PIC  X(004).
002090 01  MST_SINYOREI-更新日 PIC  X(008).
002100 01  MST_SINYOREI-更新時刻 PIC  X(006).
002110 01  MST_SINYOREI-更新担当者ｺｰﾄﾞ PIC  X(004).
