000010************************************************
000020* (MST_JUSHO)
000030************************************************
000040 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|—X•Ö”Ô† PIC  X(007).
000050 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|ZŠ|‚P PIC  X(010).
000060 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|ZŠ|‚Q PIC  X(040).
000070 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|ZŠ|‚R PIC  X(040).
000080 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|ZŠ|‚S PIC  X(010).
000090 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|ZŠ|‚T PIC  X(040).
000100 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|ZŠ|‚U PIC  X(040).
000110 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|”[•tæƒR[ƒh PIC  X(006).
000120 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|“o˜^“ú PIC  X(008).
000130 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|“o˜^Žž PIC  X(006).
000140 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000150 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|XV“ú PIC  X(008).
000160 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|XVŽž PIC  X(006).
000170 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000180 01  ‚l‚r‚s|‚i‚t‚r‚g‚n|ŒŸõƒL[ PIC  X(002).
