000010************************************************
000020* (MST_GINKO)
000030************************************************
000040 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|‹âs’ZkƒR[ƒh PIC  X(002).
000050 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|‹âsƒR[ƒh PIC  X(004).
000060 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|‹âs–¼ PIC  X(030).
000070 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|Žx“XƒR[ƒh PIC  X(003).
000080 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|Žx“X–¼ PIC  X(030).
000090 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|‹âsŽx“X–¼ PIC  X(030).
000100 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|—a‹àŽí—Þ PIC  X(001).
000110 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|ŒûÀ”Ô† PIC  X(007).
000120 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“ü‹à“ú PIC  X(002).
000130 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|‰ñŽû•ûŽ® PIC  X(001).
000140 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“K—p“ú PIC  X(008).
000150 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“o˜^“ú PIC  X(008).
000160 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“o˜^Žž PIC  X(006).
000170 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000180 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|XV“ú PIC  X(008).
000190 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|XVŽž PIC  X(006).
000200 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|XV’S“–ŽÒƒR[ƒh PIC  X(004).
000210 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“ü‹à“ú|‚Q PIC  X(002).
000220 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“ü‹à“ú|‚R PIC  X(002).
000230 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“ü‹à“ú|‚S PIC  X(002).
000240 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“ü‹à“ú|‚T PIC  X(002).
000250 01  ‚l‚r‚s|‚f‚h‚m‚j‚n|“ü‹à“ú|‚U PIC  X(002).
