000010************************************************
000020* (MST_KYUJITU)
000030************************************************
000040 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|”N PIC  X(004).
000050 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|ŒŽ PIC  X(002).
000060 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|ŒŽ––“ú PIC  X(002).
000070 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|“ú PIC  X(002).
000080 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|ƒŠ[ƒX‰c‹Æ“ú‹æ•ª PIC  X(001).
000090 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|‹âs‰c‹Æ“ú‹æ•ª PIC  X(001).
000100 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|“o˜^“ú PIC  X(008).
000110 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|“o˜^Žž PIC  X(006).
000120 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000130 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|XV“ú PIC  X(008).
000140 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|XVŽž PIC  X(006).
000150 01  ‚l‚r‚s|‚j‚x‚t‚i‚h‚s‚t|XV’S“–ŽÒƒR[ƒh PIC  X(004).
