000010************************************************
000020* (NTL_MANTSU_CSV)
000030************************************************
000040 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ƒŒƒR[ƒhŽí•Ê PIC  X(003).
000050 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(008).
000060 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ŒÚ‹q‚h‚c PIC  X(014).
000070 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|Œ_–ñ‚h‚c PIC  X(024).
000080 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|–ž—¹”NŒŽ PIC  X(008).
000090 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘—•tæƒR[ƒh PIC  X(022).
000100 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ÄƒŠ[ƒXŠúŠÔ|Ž© PIC  X(012).
000110 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ÄƒŠ[ƒXŠúŠÔ|ŽŠ PIC  X(012).
000120 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ÄƒŠ[ƒX—¿ PIC  X(015).
000130 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ÄƒŠ[ƒX—¿Á”ïÅ PIC  X(016).
000140 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘—•tæ‰ïŽÐ–¼ PIC  X(066).
000150 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘—•tæ•”–¼ PIC  X(036).
000160 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘—•tæ’S“–ŽÒ–¼ PIC  X(036).
000170 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘—•tæZŠ PIC  X(122).
000180 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘ã—‰ñŽû•ÛŽç—¿ PIC  X(015).
000190 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘ã—‰ñŽû•ÛŽç—¿Á”ïÅ 
                                             PIC  X(016).
000200 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘ã•\•¨Œ–¼ PIC  X(066).
000210 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ƒn[ƒhƒ\ƒtƒg‹æ•ª PIC  X(003).
000220 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ÄƒŠ[ƒX—¿‹æ•ª PIC  X(006).
000230 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|‘ã—‰ñŽû•ÛŽç—¿‹æ•ª 
                                             PIC  X(006).
000240 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ƒ\[ƒgê—p€–Ú PIC  X(032).
000250 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|”õ–Yî•ñ PIC  X(062).
000260 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ì¬‚h‚c PIC  X(012).
000270 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|ì¬“ú PIC  X(012).
000280 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|XV‚h‚c PIC  X(012).
000290 01  ‚m‚s‚k|‚l‚`‚m‚s‚r‚t|‚b‚r‚u|XV“ú PIC  X(012).
