000010************************************************
000020* (NTL_SISAN)
000030************************************************
000040 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|ƒŒƒR[ƒhŽí•Ê PIC  X(001).
000050 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(006).
000060 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|Œ_–ñ‚h‚c PIC  X(022).
000070 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|Ž‘ŽY”Ô† PIC  X(006).
000080 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|•¨ŒŒÂ” PIC S9(006) COMP-3.
000090 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|•¨ŒŒÂ”’PˆÊ PIC  X(004).
000100 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|•¨Œ–¼ PIC  X(080).
000110 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|•¨ŒÝ’uêŠ–¼ PIC  X(090).
000120 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|‚r‚oŒÚ‹q‚h‚c PIC  X(012).
000130 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|•½‹ÏŒŽŠzƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000140 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|ŽŸ‰ñ–ñ’è‰ñŽûŠz PIC S9(012) COMP-3.
000150 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|•¨Œ”õ–Yî•ñ PIC  X(060).
000160 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|‰æ–Ê—p”õ–Yî•ñ PIC  X(060).
000170 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|ƒ\[ƒgê—p€–Ú PIC  X(030).
000180 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|ì¬‚h‚c PIC  X(010).
000190 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|ì¬“ú PIC  X(010).
000200 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|XV‚h‚c PIC  X(010).
000210 01  ‚m‚s‚k|‚r‚h‚r‚`‚m|XV“ú PIC  X(010).
