000010************************************************
000020* (NTL_CONTRACT)
000030************************************************
000040 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ƒŒƒR[ƒhŽí•Ê PIC  X(001).
000050 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ƒŠ[ƒX‰ïŽÐ‚h‚c PIC  X(006).
000060 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ŒÚ‹q‚h‚c PIC  X(012).
000070 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñ‚h‚c PIC  X(022).
000080 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‘ã•\‚r‚oŒÚ‹q‚h‚c PIC  X(012).
000090 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ŽæˆøŽí—Þ‚b‚c PIC  X(002).
000100 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|•½‹ÏŒŽŠzƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000110 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ŽŸ‰ñ–ñ’è‰ñŽûŠz 
                                             PIC S9(012) COMP-3.
000120 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|¬–ñ“ú PIC  X(010).
000130 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ŒŸŽû“ú PIC  X(010).
000140 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ƒŠ[ƒXŠúŠÔ PIC S9(004) COMP-3.
000150 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ÄƒŠ[ƒX‰ñ” PIC S9(004) COMP-3.
000160 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‘ã•\•¨Œ–¼ PIC  X(080).
000170 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|–ž—¹“ú PIC  X(010).
000180 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|Žc‰ñ”|–ñ’èƒx[ƒX 
                                             PIC S9(004) COMP-3.
000190 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ÂŒ Žc‚|–ñ’èƒx[ƒX 
                                             PIC S9(014) COMP-3.
000200 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|¿‹æ•”–¼ PIC  X(064).
000210 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ŒŸõ—pŒ_–ñ”Ô† PIC  X(022).
000220 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñ‚h‚c“X”Ô PIC  X(003).
000230 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñ‚h‚cŽ}”Ô PIC  X(002).
000240 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‹Ï“™|•s‹Ï“™‹æ•ª PIC  X(012).
000250 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‘OŽó‹æ•ª PIC  X(012).
000260 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|Žc‰¿—L–³‹æ•ª PIC  X(012).
000270 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‘ã—‰ñŽû•ÛŽç—¿‹æ•ª PIC  X(004).
000280 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|‘ã—‰ñŽû•ÛŽç—¿ PIC S9(012) COMP-3.
000290 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñ’S“–•”–¼ PIC  X(064).
000300 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñ”õ–Yî•ñ PIC  X(060).
000310 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ŽÐˆõ‚h‚c PIC  X(008).
000320 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ƒ\[ƒgê—p€–Ú PIC  X(030).
000330 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|Œ_–ñŽí—Þ PIC  X(010).
000340 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ì¬‚h‚c PIC  X(010).
000350 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|ì¬“ú PIC  X(010).
000360 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|XV‚h‚c PIC  X(010).
000370 01  ‚m‚s‚k|‚b‚n‚m‚s‚q‚`‚b‚s|XV“ú PIC  X(010).
