000010************************************************
000020* (NTT_WK_BUMON)
000030************************************************
000040 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|“o˜^”Ô† PIC  X(004).
000050 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|æ•ûŽQÆ”Ô† PIC  X(010).
000060 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|¿‹æƒR[ƒh PIC  X(008).
000070 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|•”–å–¼Ì‚P PIC  X(040).
000080 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|•”–å–¼Ì‚Q PIC  X(040).
000090 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|ˆ—‹æ•ª PIC  X(001).
000100 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|ƒ`ƒFƒbƒN‚P PIC  X(001).
000110 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|ƒ`ƒFƒbƒN‚Q PIC  X(001).
000120 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|ƒ`ƒFƒbƒN‚R PIC  X(001).
000130 01  ‚m‚s‚s|‚v‚j|‚a‚t‚l‚n‚m|ƒ`ƒFƒbƒN‚S PIC  X(001).
