000010************************************************
000020* (NYU_NAMEMODL)
000030************************************************
000040 01  NYU_NAMEMODL-JOBTYP PIC  X(004).
000050 01  NYU_NAMEMODL-BNKCOD PIC  X(004).
000060 01  NYU_NAMEMODL-PAYNUM PIC  X(008).
000070 01  NYU_NAMEMODL-CSTNAM PIC  X(030).
000080 01  NYU_NAMEMODL-BNKCOD_O PIC  X(004).
000090 01  NYU_NAMEMODL-PAYNUM_O PIC  X(008).
000100 01  NYU_NAMEMODL-CSTNAM_O PIC  X(030).
000110 01  NYU_NAMEMODL-REGTIM PIC  X(006).
000120 01  NYU_NAMEMODL-BNKCOD_M PIC  X(001).
000130 01  NYU_NAMEMODL-PAYNUM_M PIC  X(001).
000140 01  NYU_NAMEMODL-CSTNAM_M PIC  X(001).
