000010************************************************
000020* (NYU_AUTOCHEK)
000030************************************************
000040 01  NYU_AUTOCHEK-BNKCOD PIC  X(004).
000050 01  NYU_AUTOCHEK-BNKNAM PIC  X(015).
000060 01  NYU_AUTOCHEK-BRCCOD PIC  X(003).
000070 01  NYU_AUTOCHEK-BRCNAM PIC  X(015).
000080 01  NYU_AUTOCHEK-DEPKND PIC  X(001).
000090 01  NYU_AUTOCHEK-DEPNUM PIC  X(007).
000100 01  NYU_AUTOCHEK-PAYNUM PIC  X(008).
000110 01  NYU_AUTOCHEK-CSTNAM PIC  X(030).
000120 01  NYU_AUTOCHEK-TRNAMT PIC S9(010) COMP-3.
000130 01  NYU_AUTOCHEK-CONTAX PIC S9(008) COMP-3.
000140 01  NYU_AUTOCHEK-PAYDAY PIC  X(004).
000150 01  NYU_AUTOCHEK-ERRFLG PIC  X(005).
000160 01  NYU_AUTOCHEK-DBLFLG PIC  X(001).
