000010************************************************
000020* (NYU_AUTOLIST)
000030************************************************
000040 01  NYU_AUTOLIST-BNKCOD PIC  X(004).
000050 01  NYU_AUTOLIST-BNKNAM PIC  X(015).
000060 01  NYU_AUTOLIST-BRCCOD PIC  X(003).
000070 01  NYU_AUTOLIST-BRCNAM PIC  X(015).
000080 01  NYU_AUTOLIST-DEPKND PIC  X(001).
000090 01  NYU_AUTOLIST-DEPNUM PIC  X(007).
000100 01  NYU_AUTOLIST-PAYNUM PIC  X(008).
000110 01  NYU_AUTOLIST-CSTNAM PIC  X(030).
000120 01  NYU_AUTOLIST-TRNAMT PIC S9(010) COMP-3.
000130 01  NYU_AUTOLIST-CONTAX PIC S9(008) COMP-3.
000140 01  NYU_AUTOLIST-PAYDAY PIC  X(004).
000150 01  NYU_AUTOLIST-ERRFLG PIC  X(005).
000160 01  NYU_AUTOLIST-DBLFLG PIC  X(001).
