000010************************************************
000020* (NYU_AUTOEDIT)
000030************************************************
000040 01  NYU_AUTOEDIT-BNKCOD PIC  X(004).
000050 01  NYU_AUTOEDIT-BNKNAM PIC  X(015).
000060 01  NYU_AUTOEDIT-BRCCOD PIC  X(003).
000070 01  NYU_AUTOEDIT-BRCNAM PIC  X(015).
000080 01  NYU_AUTOEDIT-DEPKND PIC  X(001).
000090 01  NYU_AUTOEDIT-DEPNUM PIC  X(007).
000100 01  NYU_AUTOEDIT-PAYNUM PIC  X(008).
000110 01  NYU_AUTOEDIT-CSTNAM PIC  X(030).
000120 01  NYU_AUTOEDIT-TRNAMT PIC S9(010) COMP-3.
000130 01  NYU_AUTOEDIT-CONTAX PIC S9(008) COMP-3.
000140 01  NYU_AUTOEDIT-PAYDAY PIC  X(004).
000150 01  NYU_AUTOEDIT-ERRFLG PIC  X(005).
000160 01  NYU_AUTOEDIT-DBLFLG PIC  X(001).
