000010************************************************
000020* (NYU_AUTOBACK)
000030************************************************
000040 01  NYU_AUTOBACK-DATTYP PIC  X(001).
000050 01  NYU_AUTOBACK-BNKCOD PIC  X(004).
000060 01  NYU_AUTOBACK-BNKNAM PIC  X(015).
000070 01  NYU_AUTOBACK-BRCCOD PIC  X(003).
000080 01  NYU_AUTOBACK-BRCNAM PIC  X(015).
000090 01  NYU_AUTOBACK-PAYDAY PIC  X(004).
000100 01  NYU_AUTOBACK-DEPKND PIC  X(001).
000110 01  NYU_AUTOBACK-DEPNUM PIC  X(007).
000120 01  NYU_AUTOBACK-CSTNAM PIC  X(030).
000130 01  NYU_AUTOBACK-TRNAMT PIC S9(010) COMP-3.
000140 01  NYU_AUTOBACK-TRNTYP PIC  X(001).
000150 01  NYU_AUTOBACK-PAYNUM PIC  X(008).
000160 01  NYU_AUTOBACK-OPEDAY PIC  X(003).
000170 01  NYU_AUTOBACK-DUMMY1 PIC  X(009).
000180 01  NYU_AUTOBACK-RESULT PIC  X(001).
000190 01  NYU_AUTOBACK-CONTAX PIC S9(008) COMP-3.
000200 01  NYU_AUTOBACK-REGDAY PIC  X(008).
000210 01  NYU_AUTOBACK-REGTIM PIC  X(006).
000220 01  NYU_AUTOBACK-REGPSN PIC  X(004).
000230 01  NYU_AUTOBACK-MODDAY PIC  X(008).
000240 01  NYU_AUTOBACK-MODTIM PIC  X(006).
000250 01  NYU_AUTOBACK-MODPSN PIC  X(004).
000260 01  NYU_AUTOBACK-ERRFLG PIC  X(005).
000270 01  NYU_AUTOBACK-PRTFLG PIC  X(001).
000280 01  NYU_AUTOBACK-DELFLG PIC  X(001).
000290 01  NYU_AUTOBACK-DBLFLG PIC  X(001).
