000010************************************************
000020* (OBA_MODLST)
000030************************************************
000040 01  OBA_MODLST-JOBTYP PIC  X(001).
000050 01  OBA_MODLST-REGTIM PIC  X(006).
000060 01  OBA_MODLST-CNTNUM PIC  X(009).
000070 01  OBA_MODLST-TRNTYP PIC  X(001).
000080 01  OBA_MODLST-DIVCOD PIC  X(004).
000090 01  OBA_MODLST-DIVNAM PIC  X(020).
000100 01  OBA_MODLST-USRCOD PIC  X(008).
000110 01  OBA_MODLST-USRNAM PIC  X(060).
000120 01  OBA_MODLST-OBJNAM PIC  X(040).
000130 01  OBA_MODLST-TRNDAY PIC  X(008).
000140 01  OBA_MODLST-BGNDAY PIC  X(008).
000150 01  OBA_MODLST-BASDAY PIC  X(008).
000160 01  OBA_MODLST-CRERNK PIC  X(004).
000170 01  OBA_MODLST-CNTAMT PIC S9(013) COMP-3.
000180 01  OBA_MODLST-RCVAMT PIC S9(013) COMP-3.
000190 01  OBA_MODLST-BALAMT PIC S9(013) COMP-3.
000200 01  OBA_MODLST-DIVCOD_O PIC  X(004).
000210 01  OBA_MODLST-DIVNAM_O PIC  X(020).
000220 01  OBA_MODLST-USRCOD_O PIC  X(008).
000230 01  OBA_MODLST-USRNAM_O PIC  X(060).
000240 01  OBA_MODLST-OBJNAM_O PIC  X(040).
000250 01  OBA_MODLST-TRNDAY_O PIC  X(008).
000260 01  OBA_MODLST-CRERNK_O PIC  X(004).
000270 01  OBA_MODLST-CNTAMT_O PIC S9(013) COMP-3.
000280 01  OBA_MODLST-BALAMT_O PIC S9(013) COMP-3.
000290 01  OBA_MODLST-DIVCOD_M PIC  X(001).
000300 01  OBA_MODLST-DIVNAM_M PIC  X(001).
000310 01  OBA_MODLST-USRCOD_M PIC  X(001).
000320 01  OBA_MODLST-USRNAM_M PIC  X(001).
000330 01  OBA_MODLST-OBJNAM_M PIC  X(001).
000340 01  OBA_MODLST-TRNDAY_M PIC  X(001).
000350 01  OBA_MODLST-CRERNK_M PIC  X(001).
000360 01  OBA_MODLST-CNTAMT_M PIC  X(001).
000370 01  OBA_MODLST-BALAMT_M PIC  X(001).
