000010************************************************
000020* (PAY_JOBCHK)
000030************************************************
000040 01  PAY_JOBCHK-OPEDAY PIC  X(004).
000050 01  PAY_JOBCHK-PAYDAY PIC  X(004).
000060 01  PAY_JOBCHK-GETTXT PIC  X(001).
000070 01  PAY_JOBCHK-DATMAK PIC  X(001).
000080 01  PAY_JOBCHK-LSTPRT PIC  X(001).
000090 01  PAY_JOBCHK-PUTFDD PIC  X(001).
000100 01  PAY_JOBCHK-SNDDAT PIC  X(001).
