000010************************************************
000020* (PAY_GAFMOD)
000030************************************************
000040 01  PAY_GAFMOD-JOBTYP PIC  X(004).
000050 01  PAY_GAFMOD-REGTIM PIC  X(006).
000060 01  PAY_GAFMOD-CNTNUM PIC  X(009).
000070 01  PAY_GAFMOD-RELEAS PIC  X(001).
000080 01  PAY_GAFMOD-CNTDAY PIC  X(008).
000090 01  PAY_GAFMOD-DIVCOD PIC  X(004).
000100 01  PAY_GAFMOD-PAYCLT PIC  X(008).
000110 01  PAY_GAFMOD-PAYNAM PIC  X(060).
000120 01  PAY_GAFMOD-PAYTYP PIC  X(001).
000130 01  PAY_GAFMOD-PAYBGN PIC  X(008).
000140 01  PAY_GAFMOD-PAYCYC PIC  X(002).
000150 01  PAY_GAFMOD-PAYCNT PIC S9(003) COMP-3.
000160 01  PAY_GAFMOD-PAYEND PIC  X(008).
000170 01  PAY_GAFMOD-HOLSFT PIC  X(001).
000180 01  PAY_GAFMOD-EXPCOD PIC  X(003).
000190 01  PAY_GAFMOD-REMARK PIC  X(046).
000200 01  PAY_GAFMOD-TRNAMT PIC S9(013) COMP-3.
000210 01  PAY_GAFMOD-TRNTAX PIC S9(013) COMP-3.
000220 01  PAY_GAFMOD-CHGAMT PIC S9(013) COMP-3.
000230 01  PAY_GAFMOD-LEAAMT PIC S9(013) COMP-3.
000240 01  PAY_GAFMOD-TAXRAT PIC S9(002)V9(1) COMP-3.
000250 01  PAY_GAFMOD-CHCKYN PIC  X(001).
000260 01  PAY_GAFMOD-CNTDAY_O PIC  X(008).
000270 01  PAY_GAFMOD-DIVCOD_O PIC  X(004).
000280 01  PAY_GAFMOD-PAYCLT_O PIC  X(008).
000290 01  PAY_GAFMOD-PAYNAM_O PIC  X(060).
000300 01  PAY_GAFMOD-PAYTYP_O PIC  X(001).
000310 01  PAY_GAFMOD-PAYBGN_O PIC  X(008).
000320 01  PAY_GAFMOD-PAYCYC_O PIC  X(002).
000330 01  PAY_GAFMOD-PAYCNT_O PIC S9(003) COMP-3.
000340 01  PAY_GAFMOD-PAYEND_O PIC  X(008).
000350 01  PAY_GAFMOD-EXPCOD_O PIC  X(003).
000360 01  PAY_GAFMOD-REMARK_O PIC  X(046).
000370 01  PAY_GAFMOD-TRNAMT_O PIC S9(013) COMP-3.
000380 01  PAY_GAFMOD-TRNTAX_O PIC S9(013) COMP-3.
000390 01  PAY_GAFMOD-CHGAMT_O PIC S9(013) COMP-3.
000400 01  PAY_GAFMOD-LEAAMT_O PIC S9(013) COMP-3.
000410 01  PAY_GAFMOD-CHCKYN_O PIC  X(001).
000420 01  PAY_GAFMOD-CNTDAY_M PIC  X(001).
000430 01  PAY_GAFMOD-DIVCOD_M PIC  X(001).
000440 01  PAY_GAFMOD-PAYCLT_M PIC  X(001).
000450 01  PAY_GAFMOD-PAYNAM_M PIC  X(001).
000460 01  PAY_GAFMOD-PAYTYP_M PIC  X(001).
000470 01  PAY_GAFMOD-PAYBGN_M PIC  X(001).
000480 01  PAY_GAFMOD-PAYCYC_M PIC  X(001).
000490 01  PAY_GAFMOD-PAYCNT_M PIC  X(001).
000500 01  PAY_GAFMOD-PAYEND_M PIC  X(001).
000510 01  PAY_GAFMOD-EXPCOD_M PIC  X(001).
000520 01  PAY_GAFMOD-REMARK_M PIC  X(001).
000530 01  PAY_GAFMOD-TRNAMT_M PIC  X(001).
000540 01  PAY_GAFMOD-TRNTAX_M PIC  X(001).
000550 01  PAY_GAFMOD-CHGAMT_M PIC  X(001).
000560 01  PAY_GAFMOD-LEAAMT_M PIC  X(001).
000570 01  PAY_GAFMOD-CHCKYN_M PIC  X(001).
