000010************************************************
000020* (PAY_PRTWR2)
000030************************************************
000040 01  PAY_PRTWR2-OFCCOD PIC  X(004).
000050 01  PAY_PRTWR2-OPEDAY PIC  X(004).
000060 01  PAY_PRTWR2-PAYDAY PIC  X(004).
000070 01  PAY_PRTWR2-OFCNAM PIC  X(030).
000080 01  PAY_PRTWR2-DEPKND PIC  X(001).
000090 01  PAY_PRTWR2-DEPNUM PIC  X(007).
000100 01  PAY_PRTWR2-PAYCNT PIC S9(005) COMP-3.
000110 01  PAY_PRTWR2-PAYAMT PIC S9(011) COMP-3.
000120 01  PAY_PRTWR2-CHGAMT PIC S9(005) COMP-3.
000130 01  PAY_PRTWR2-TAXAMT PIC S9(005) COMP-3.
000140 01  PAY_PRTWR2-CHGTOT PIC S9(005) COMP-3.
000150 01  PAY_PRTWR2-SNDCNT PIC S9(005) COMP-3.
