000010************************************************
000020* (PAY_HEADER)
000030************************************************
000040 01  PAY_HEADER-DATTYP PIC  X(001).
000050 01  PAY_HEADER-TRNCOD PIC  X(002).
000060 01  PAY_HEADER-CODTYP PIC  X(001).
000070 01  PAY_HEADER-CONSIG PIC  X(010).
000080 01  PAY_HEADER-CONNAM PIC  X(040).
000090 01  PAY_HEADER-TRNDAY PIC  X(004).
000100 01  PAY_HEADER-BNKCOD PIC  X(004).
000110 01  PAY_HEADER-BNKNAM PIC  X(015).
000120 01  PAY_HEADER-BRCCOD PIC  X(003).
000130 01  PAY_HEADER-BRCNAM PIC  X(015).
000140 01  PAY_HEADER-DEPKND PIC  X(001).
000150 01  PAY_HEADER-DEPNUM PIC  X(007).
000160 01  PAY_HEADER-OPEDAY PIC  X(004).
000170 01  PAY_HEADER-DUMMY1 PIC  X(013).
