000010************************************************
000020* (PAY_BNSPRT)
000030************************************************
000040 01  PAY_BNSPRT-CNTNUM PIC  X(009).
000050 01  PAY_BNSPRT-RELEAS PIC  X(001).
000060 01  PAY_BNSPRT-CNTDAY PIC  X(008).
000070 01  PAY_BNSPRT-DIVCOD PIC  X(004).
000080 01  PAY_BNSPRT-CLTCOD PIC  X(008).
000090 01  PAY_BNSPRT-CLTNAM PIC  X(060).
000100 01  PAY_BNSPRT-PAYCLT PIC  X(008).
000110 01  PAY_BNSPRT-PAYNAM PIC  X(060).
000120 01  PAY_BNSPRT-RCVBGN PIC  X(008).
000130 01  PAY_BNSPRT-RCVCYC PIC  X(002).
000140 01  PAY_BNSPRT-RCVCNT PIC S9(003) COMP-3.
000150 01  PAY_BNSPRT-RCVDAY PIC  X(002).
000160 01  PAY_BNSPRT-PAYBGN PIC  X(008).
000170 01  PAY_BNSPRT-PAYCYC PIC  X(002).
000180 01  PAY_BNSPRT-PAYCNT PIC S9(003) COMP-3.
000190 01  PAY_BNSPRT-HOLSFT PIC  X(001).
000200 01  PAY_BNSPRT-CLTCNT PIC S9(002) COMP-3.
000210 01  PAY_BNSPRT-CHCKYN PIC  X(001).
000220 01  PAY_BNSPRT-REMARK PIC  X(046).
000230 01  PAY_BNSPRT-CHGTYP PIC  X(001).
000240 01  PAY_BNSPRT-TRNTYP PIC  X(001).
000250 01  PAY_BNSPRT-PLNDAY PIC  X(008).
000260 01  PAY_BNSPRT-PAYDAY PIC  X(008).
000270 01  PAY_BNSPRT-BNKCOD PIC  X(004).
000280 01  PAY_BNSPRT-BRCCOD PIC  X(003).
000290 01  PAY_BNSPRT-DEPKND PIC  X(001).
000300 01  PAY_BNSPRT-DEPNUM PIC  X(007).
000310 01  PAY_BNSPRT-UPDFLG PIC  X(001).
000320 01  PAY_BNSPRT-TRNAMT PIC S9(013) COMP-3.
000330 01  PAY_BNSPRT-TRNTAX PIC S9(013) COMP-3.
000340 01  PAY_BNSPRT-CHGAMT PIC S9(013) COMP-3.
000350 01  PAY_BNSPRT-CHGTAX PIC S9(013) COMP-3.
000360 01  PAY_BNSPRT-TAXRAT PIC S9(002)V9(1) COMP-3.
000370 01  PAY_BNSPRT-CNTAMT PIC S9(013) COMP-3.
000380 01  PAY_BNSPRT-RCVBAL PIC S9(013) COMP-3.
000390 01  PAY_BNSPRT-UNPBAL PIC S9(013) COMP-3.
000400 01  PAY_BNSPRT-REGDAY PIC  X(008).
000410 01  PAY_BNSPRT-REGTIM PIC  X(006).
000420 01  PAY_BNSPRT-REGPSN PIC  X(004).
000430 01  PAY_BNSPRT-MODDAY PIC  X(008).
000440 01  PAY_BNSPRT-MODTIM PIC  X(006).
000450 01  PAY_BNSPRT-MODPSN PIC  X(004).
