000010************************************************
000020* (PLP_PLNMST)
000030************************************************
000040 01  PLP_PLNMST-FISYER PIC  X(002).
000050 01  PLP_PLNMST-PRTSEQ PIC  X(002).
000060 01  PLP_PLNMST-BASMON PIC  X(006).
000070 01  PLP_PLNMST-DIVCOD PIC  X(004).
000080 01  PLP_PLNMST-ACCTYP PIC  X(002).
000090 01  PLP_PLNMST-APPAMT PIC S9(013) COMP-3.
000100 01  PLP_PLNMST-APPART PIC S9(013) COMP-3.
000110 01  PLP_PLNMST-APPINT PIC S9(013) COMP-3.
000120 01  PLP_PLNMST-APPCST PIC S9(013) COMP-3.
000130 01  PLP_PLNMST-APPBAL PIC S9(013) COMP-3.
000140 01  PLP_PLNMST-APPPRE PIC S9(013) COMP-3.
000150 01  PLP_PLNMST-COLLEA PIC S9(013) COMP-3.
000160 01  PLP_PLNMST-COLCAP PIC S9(013) COMP-3.
000170 01  PLP_PLNMST-COLCST PIC S9(013) COMP-3.
000180 01  PLP_PLNMST-COLBAL PIC S9(013) COMP-3.
000190 01  PLP_PLNMST-CHGTAX PIC S9(013) COMP-3.
000200 01  PLP_PLNMST-CHGINS PIC S9(013) COMP-3.
000210 01  PLP_PLNMST-CHGMNT PIC S9(013) COMP-3.
000220 01  PLP_PLNMST-CHGOT1 PIC S9(013) COMP-3.
000230 01  PLP_PLNMST-CHGOT2 PIC S9(013) COMP-3.
000240 01  PLP_PLNMST-BALDEB PIC S9(013) COMP-3.
000250 01  PLP_PLNMST-BALCST PIC S9(013) COMP-3.
000260 01  PLP_PLNMST-BALGRT PIC S9(013) COMP-3.
000270 01  PLP_PLNMST-BALEST PIC S9(013) COMP-3.
000280 01  PLP_PLNMST-BALPRE PIC S9(013) COMP-3.
000290 01  PLP_PLNMST-FNCCAP PIC S9(013) COMP-3.
000300 01  PLP_PLNMST-FNCCOL PIC S9(013) COMP-3.
000310 01  PLP_PLNMST-FNCBAL PIC S9(013) COMP-3.
000320 01  PLP_PLNMST-FNCAVE PIC S9(013) COMP-3.
000330 01  PLP_PLNMST-FNCINT PIC S9(013) COMP-3.
000340 01  PLP_PLNMST-FNCUNP PIC S9(013) COMP-3.
000350 01  PLP_PLNMST-DEFCST PIC S9(013) COMP-3.
000360 01  PLP_PLNMST-DEFPRF PIC S9(013) COMP-3.
000370 01  PLP_PLNMST-DEFBAL PIC S9(013) COMP-3.
000380 01  PLP_PLNMST-RDMLEA PIC S9(013) COMP-3.
000390 01  PLP_PLNMST-RDMAMT PIC S9(013) COMP-3.
000400 01  PLP_PLNMST-RDMPRF PIC S9(013) COMP-3.
000410 01  PLP_PLNMST-RDMUNP PIC S9(013) COMP-3.
000420 01  PLP_PLNMST-RDMCRE PIC S9(013) COMP-3.
000430 01  PLP_PLNMST-RATAPP PIC S9(013) COMP-3.
000440 01  PLP_PLNMST-RATLEA PIC S9(013) COMP-3.
000450 01  PLP_PLNMST-RATCAP PIC S9(013) COMP-3.
000460 01  PLP_PLNMST-RATINT PIC S9(013) COMP-3.
000470 01  PLP_PLNMST-RATDEB PIC S9(013) COMP-3.
000480 01  PLP_PLNMST-RATBAL PIC S9(013) COMP-3.
000490 01  PLP_PLNMST-BIGAVE PIC S9(013) COMP-3.
000500 01  PLP_PLNMST-BIGINT PIC S9(013) COMP-3.
000510 01  PLP_PLNMST-SMLAST PIC S9(013) COMP-3.
000520 01  PLP_PLNMST-SMLBAL PIC S9(013) COMP-3.
000530 01  PLP_PLNMST-MONRDM PIC S9(013) COMP-3.
000540 01  PLP_PLNMST-PAYINT PIC S9(013) COMP-3.
000550 01  PLP_PLNMST-INTRAT PIC S9(002)V9(4) COMP-3.
