000010************************************************
000020* (POK_SOSIN)
000030************************************************
000040 01  ‚o‚n‚j|‚r‚n‚r‚h‚m|ƒf[ƒ^ PIC  X(900).
