000010************************************************
000020* (POK_KEIYAKU_INPUT)
000030************************************************
000040 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Ž–‹ÆŠƒR[ƒh 
                                             PIC  X(004).
000060 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ƒ†[ƒU[ƒR[ƒh 
                                             PIC  X(008).
000070 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒÚ‹qƒR[ƒh PIC  X(006).
000080 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|’S“–ŽÒƒR[ƒh 
                                             PIC  X(004).
000100 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Š¨’èˆ—ƒR[ƒh 
                                             PIC  X(002).
000110 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Â–±‹¦’²ƒR[ƒh 
                                             PIC  X(002).
000120 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŽæˆøŒ`‘ÔƒR[ƒh 
                                             PIC  X(002).
000130 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ˆÄŒ”­¶‹æ•ª 
                                             PIC  X(001).
000140 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|•¨ŒŠm”FŠî€ 
                                             PIC  X(001).
000150 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Œ_–ñ“ú PIC  X(008).
000160 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒŸŽû—\’è“ú PIC  X(008).
000170 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒŸŽû“ú PIC  X(008).
000180 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒvŽZ•ûŽ® PIC  X(001).
000190 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ƒŠ[ƒXŠúŠÔ 
                                             PIC S9(003) COMP-3.
000200 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|¿‹ƒTƒCƒNƒ‹ 
                                             PIC S9(002) COMP-3.
000210 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Žx•¥‰ñ” 
                                             PIC S9(003) COMP-3.
000220 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|˜’uŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000230 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‘OŽóŒŽ” 
                                             PIC S9(002) COMP-3.
000240 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(2) COMP-3.
000250 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒŽŠz•½‹Ï•ÛŽç—¿ 
                                             PIC S9(013) COMP-3.
000260 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‚»‚Ì‘¼””ï—p‘Šz 
                                             PIC S9(013) COMP-3.
000270 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‘O“n‹à—˜‘§ 
                                             PIC S9(013) COMP-3.
000280 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Á”ïÅ—¦ 
                                             PIC S9(002)V9(1) COMP-3.
000290 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Á”ïÅ’¥Žû‹æ•ª 
                                             PIC  X(001).
000300 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000310 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000320 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|“]ƒŠ[ƒX’ñŒgæƒR[ƒh 
                                             PIC  X(002).
000330 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|’P”N“xŒ_–ñ PIC  X(002).
000340 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|[“–|‘ŠŽE‹æ•ª 
                                             PIC  X(001).
000350 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‘O“n‹à‹æ•ª PIC  X(001).
000360 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ÄƒŠ[ƒX—¿•\Ž¦‹æ•ª 
                                             PIC  X(001).
000370 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ÄƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000380 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|•ÛŽçŒ_–ñæ–¼ 
                                             PIC  X(060).
000390 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|“Á–ñ PIC  X(800).
000400 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|w“ü‹àŠz‡Œv 
                                             PIC S9(013) COMP-3.
000410 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Žc‰¿Šz‡Œv 
                                             PIC S9(013) COMP-3.
000420 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000430 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Šî–{—˜‰ñ‚è 
                                             PIC S9(002)V9(8) COMP-3.
000440 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‘e—˜‰v 
                                             PIC S9(013) COMP-3.
000450 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Œ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000460 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000470 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Šî–{ƒŠ[ƒX—¿—¦ 
                                             PIC S9(002)V9(8) COMP-3.
000480 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒÅ’èŽ‘ŽYÅ‘Šz 
                                             PIC S9(013) COMP-3.
000490 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|“®‘•ÛŒ¯—¿‘Šz 
                                             PIC S9(013) COMP-3.
000500 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‹K’è‘¹Ž¸‹à•¨Œ‹àŠz 
                                             PIC S9(013) COMP-3.
000510 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒvŽZ•û–@|‹K’è‘¹Ž¸‹à 
                                             PIC  X(002).
000520 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ƒƒ“ƒRƒ~•t‹c‚m‚n 
                                             PIC  X(001).
000530 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒˆÏ‹æ•ª PIC  X(001).
000540 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000550 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|I‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000560 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‘ã•\•¨Œ–¼ PIC  X(040).
000570 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|¿‹‹æ•ª‚P PIC  X(001).
000580 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|¿‹‹æ•ª‚Q PIC  X(001).
000590 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‘æ‚P‰ñƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000600 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‘æ‚Q‰ñ–ÚˆÈ~ƒŠ[ƒX—¿ŽóŽæ‚èðŒ 
                                             PIC  X(020).
000610 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŽèŒ`–‡” 
                                             PIC S9(003) COMP-3.
000620 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|“ü‹àŠî€“ú PIC  X(002).
000630 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|—a‹àŽí—Þ PIC  X(001).
000640 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‹âsƒR[ƒh PIC  X(007).
000650 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|ŒûÀ”Ô† PIC  X(007).
000660 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|‹âsŽx“X–¼ PIC  X(030).
000670 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|“®‘•t•Û‹æ•ª 
                                             PIC  X(001).
000680 01  ‚o‚n‚j|‚j‚d‚h‚x‚`‚j‚t|‚h‚m‚o‚t‚s|Žx•¥•û–@•¶Œ¾ 
                                             PIC  X(200).
