000010************************************************
000020* (SEC_STATUS)
000030************************************************
000040 01  ‚r‚d‚b|‚r‚s‚`‚s‚t‚r|ƒXƒe[ƒ^ƒX‚m‚n PIC  X(002).
000050 01  ‚r‚d‚b|‚r‚s‚`‚s‚t‚r|ƒXƒe[ƒ^ƒX–¼Ì PIC  X(020).
000060 01  ‚r‚d‚b|‚r‚s‚`‚s‚t‚r|“o˜^“ú PIC  X(008).
000070 01  ‚r‚d‚b|‚r‚s‚`‚s‚t‚r|“o˜^Žž PIC  X(006).
000080 01  ‚r‚d‚b|‚r‚s‚`‚s‚t‚r|“o˜^’S“–ŽÒƒR[ƒh PIC  X(004).
000090 01  ‚r‚d‚b|‚r‚s‚`‚s‚t‚r|XV“ú PIC  X(008).
000100 01  ‚r‚d‚b|‚r‚s‚`‚s‚t‚r|XVŽž PIC  X(006).
000110 01  ‚r‚d‚b|‚r‚s‚`‚s‚t‚r|XV’S“–ŽÒƒR[ƒh PIC  X(004).
