000010************************************************
000020* (SFC_WK_SAISAN)
000030************************************************
000040 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|’[––”Ô† PIC  X(016).
000050 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|Ž–‹ÆŠƒR[ƒh PIC  X(004).
000060 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|’S“–ŽÒƒR[ƒh PIC  X(004).
000070 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ŽæˆøæƒR[ƒh PIC  X(008).
000080 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ŒÚ‹q–¼ PIC  X(060).
000090 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ŽÐ“à‹à—˜ 
                                             PIC S9(002)V9(2) COMP-3.
000100 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|Œ_–ñ“ú PIC  X(008).
000110 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ŒŸŽû“ú PIC  X(008).
000120 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|‘æ‚P‰ñ“ü‹à“ú PIC  X(008).
000130 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|“ü‹àŠî€“ú PIC  X(002).
000140 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ƒVƒƒ[ƒvŒ_–ñ”Ô† PIC  X(012).
000150 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|Œ_–ñ”Ô† PIC  X(009).
000160 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000170 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|‘OŽóŒŽ” PIC S9(002) COMP-3.
000180 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|w“ü‹àŠz PIC S9(013) COMP-3.
000190 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000200 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ƒŠ[ƒX—¿ PIC S9(013) COMP-3.
000210 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|Œ_–ñ‹àŠz PIC S9(013) COMP-3.
000220 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000230 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|‘Ï—p”N” 
                                             PIC S9(003)V9(3) COMP-3.
000240 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ŒŽŠzŒÅ’èŽ‘ŽYÅ 
                                             PIC S9(013) COMP-3.
000250 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|•ÛŒ¯—¿—¦ 
                                             PIC S9(003)V9(3) COMP-3.
000260 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ŒŽŠz•ÛŒ¯—¿ PIC S9(013) COMP-3.
000270 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|Šî–{ƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000280 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|ŽÀŽ¿—˜‰ñ‚è 
                                             PIC S9(004)V9(6) COMP-3.
000290 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|Šî–{—˜‰ñ‚è 
                                             PIC S9(004)V9(6) COMP-3.
000300 01  ‚r‚e‚b|‚v‚j|‚r‚`‚h‚r‚`‚m|‘e—˜‰v PIC S9(013) COMP-3.
