000010************************************************
000020* (SIN_CHOHYO_WK)
000030************************************************
000040 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|Т[ЦЦВhВc PIC  X(008).
000050 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВP PIC  X(001).
000060 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВQ PIC  X(001).
000070 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВR PIC  X(001).
000080 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВS PIC  X(001).
000090 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВT PIC  X(001).
000100 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВU PIC  X(001).
000110 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВV PIC  X(001).
000120 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВW PIC  X(001).
000130 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВX PIC  X(001).
000140 01  ВrВhВmБ|ВbВgВnВgВxВnБ|ВvВjБ|ТаХ[ВPВO PIC  X(001).
