000010************************************************
000020* (SKY_PRTTYP)
000030************************************************
000040 01  SKY_PRTTYP-PRTPTN PIC  X(002).
000050 01  SKY_PRTTYP-PRTNAM PIC  X(100).
