000010************************************************
000020* (SSF_WK_ITIRAN)
000030************************************************
000040 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|‘æ‚P‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000060 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|‘æ‚Q‰ñƒŠ[ƒX—¿“ü‹à“ú 
                                             PIC  X(008).
000070 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|ŒŸŽû“ú PIC  X(008).
000080 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|Žæˆøæ–¼ PIC  X(060).
000090 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|‹àŒÉŽx“XƒR[ƒh PIC  X(005).
000100 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|ƒŠ[ƒXŠúŠÔ PIC S9(003) COMP-3.
000110 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|ŒJ‰„ŒŽ” 
                                             PIC S9(002)V9(2) COMP-3.
000120 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|’S“–ŽÒ PIC  X(004).
000130 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|ŽÐ“à‹à—˜ 
                                             PIC S9(-001)V9(3) COMP-3.
000140 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|Š¨’èƒR[ƒh PIC  X(002).
000150 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|•¨Œ‹àŠz PIC S9(013) COMP-3.
000160 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|Žd“ü‚êÁ”ïÅ 
                                             PIC S9(013) COMP-3.
000170 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|‚»‚¤‚µ‚ñ‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000180 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|“–ŽÐ‰‰ñƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000190 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|“–ŽÐ‰‰ñÁ”ïÅ“™ 
                                             PIC S9(013) COMP-3.
000200 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|‚»‚¤‚µ‚ñ’èŠzƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000210 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|“–ŽÐ’èŠzƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000220 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|“–ŽÐ’èŠzÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000230 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|‚»‚¤‚µ‚ñŒ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000240 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|“–ŽÐŒ_–ñ‹àŠz 
                                             PIC S9(013) COMP-3.
000250 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|ˆêŠ‡Á”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000260 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|‚»‚¤‚µ‚ñ‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000270 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|“–ŽÐ‘OŽóƒŠ[ƒX—¿ 
                                             PIC S9(013) COMP-3.
000280 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|“–ŽÐ‘OŽóÁ”ïÅ“™Šz 
                                             PIC S9(013) COMP-3.
000290 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|‘e—˜‰v PIC S9(013) COMP-3.
000300 01  ‚r‚r‚e|‚v‚j|‚h‚s‚h‚q‚`‚m|ŽÀŽ¿—˜‰ñ 
                                             PIC S9(002)V9(8) COMP-3.
