000010************************************************
000020* (TSL_PRTTMP)
000030************************************************
000040 01  TSL_PRTTMP-CNTNUM PIC  X(009).
000050 01  TSL_PRTTMP-PRFCOD PIC  X(002).
000060 01  TSL_PRTTMP-PRFNAM PIC  X(006).
000070 01  TSL_PRTTMP-BNKCOD PIC  X(004).
000080 01  TSL_PRTTMP-BNKNAM PIC  X(020).
000090 01  TSL_PRTTMP-BRCNAM PIC  X(020).
000100 01  TSL_PRTTMP-PROGRE PIC  X(001).
000110 01  TSL_PRTTMP-USRCOD PIC  X(008).
000120 01  TSL_PRTTMP-USRNAM PIC  X(030).
000130 01  TSL_PRTTMP-BUYNAM PIC  X(030).
000140 01  TSL_PRTTMP-OBJNAM PIC  X(040).
000150 01  TSL_PRTTMP-CNTDAY PIC  X(008).
000160 01  TSL_PRTTMP-APRDAY PIC  X(008).
000170 01  TSL_PRTTMP-DUEDAY PIC  X(008).
000180 01  TSL_PRTTMP-BASDAY PIC  X(008).
000190 01  TSL_PRTTMP-INDCOD PIC  X(002).
000200 01  TSL_PRTTMP-INTTYP PIC  X(001).
000210 01  TSL_PRTTMP-RELEAS PIC  X(001).
000220 01  TSL_PRTTMP-DELFLG PIC  X(001).
000230 01  TSL_PRTTMP-MONCNT PIC S9(004) COMP-3.
000240 01  TSL_PRTTMP-OBJAMT PIC S9(013) COMP-3.
000250 01  TSL_PRTTMP-CNTAMT PIC S9(013) COMP-3.
000260 01  TSL_PRTTMP-LEAAMT PIC S9(013) COMP-3.
000270 01  TSL_PRTTMP-DEPAMT PIC S9(013) COMP-3.
000280 01  TSL_PRTTMP-INTRAT PIC S9(002)V9(6) COMP-3.
000290 01  TSL_PRTTMP-ITMCNT PIC S9(004) COMP-3.
000300 01  TSL_PRTTMP-BRCCNT PIC S9(004) COMP-3.
000310 01  TSL_PRTTMP-BRCAGT PIC S9(004) COMP-3.
000320 01  TSL_PRTTMP-AGTCNT PIC S9(004) COMP-3.
000330 01  TSL_PRTTMP-SATPCT PIC S9(003)V9(5) COMP-3.
000340 01  TSL_PRTTMP-ITMTOT PIC S9(004) COMP-3.
000350 01  TSL_PRTTMP-OBJTOT PIC S9(013) COMP-3.
000360 01  TSL_PRTTMP-CNTTOT PIC S9(013) COMP-3.
000370 01  TSL_PRTTMP-ITMPRP PIC S9(004) COMP-3.
000380 01  TSL_PRTTMP-OBJPRP PIC S9(013) COMP-3.
000390 01  TSL_PRTTMP-CNTPRP PIC S9(013) COMP-3.
000400 01  TSL_PRTTMP-ITMDEP PIC S9(004) COMP-3.
000410 01  TSL_PRTTMP-OBJDEP PIC S9(013) COMP-3.
000420 01  TSL_PRTTMP-CNTDEP PIC S9(013) COMP-3.
