000010************************************************
000020* (TSL_FRM012)
000030************************************************
000040 01  TSL_FRM012-FISYER PIC  X(004).
000050 01  TSL_FRM012-JAPYER PIC  X(006).
000060 01  TSL_FRM012-BASDAY PIC  X(008).
000070 01  TSL_FRM012-ITEM04 PIC S9(004) COMP-3.
000080 01  TSL_FRM012-ITEM05 PIC S9(004) COMP-3.
000090 01  TSL_FRM012-ITEM06 PIC S9(004) COMP-3.
000100 01  TSL_FRM012-ITEM07 PIC S9(004) COMP-3.
000110 01  TSL_FRM012-ITEM08 PIC S9(004) COMP-3.
000120 01  TSL_FRM012-ITEM09 PIC S9(004) COMP-3.
000130 01  TSL_FRM012-ITEM10 PIC S9(004) COMP-3.
000140 01  TSL_FRM012-ITEM11 PIC S9(004) COMP-3.
000150 01  TSL_FRM012-ITEM12 PIC S9(004) COMP-3.
000160 01  TSL_FRM012-ITEM01 PIC S9(004) COMP-3.
000170 01  TSL_FRM012-ITEM02 PIC S9(004) COMP-3.
000180 01  TSL_FRM012-ITEM03 PIC S9(004) COMP-3.
000190 01  TSL_FRM012-ITMTOT PIC S9(004) COMP-3.
000200 01  TSL_FRM012-ITMACM PIC S9(004) COMP-3.
000210 01  TSL_FRM012-ITMINC PIC S9(004) COMP-3.
000220 01  TSL_FRM012-AMNT04 PIC S9(013) COMP-3.
000230 01  TSL_FRM012-AMNT05 PIC S9(013) COMP-3.
000240 01  TSL_FRM012-AMNT06 PIC S9(013) COMP-3.
000250 01  TSL_FRM012-AMNT07 PIC S9(013) COMP-3.
000260 01  TSL_FRM012-AMNT08 PIC S9(013) COMP-3.
000270 01  TSL_FRM012-AMNT09 PIC S9(013) COMP-3.
000280 01  TSL_FRM012-AMNT10 PIC S9(013) COMP-3.
000290 01  TSL_FRM012-AMNT11 PIC S9(013) COMP-3.
000300 01  TSL_FRM012-AMNT12 PIC S9(013) COMP-3.
000310 01  TSL_FRM012-AMNT01 PIC S9(013) COMP-3.
000320 01  TSL_FRM012-AMNT02 PIC S9(013) COMP-3.
000330 01  TSL_FRM012-AMNT03 PIC S9(013) COMP-3.
000340 01  TSL_FRM012-AMTTOT PIC S9(013) COMP-3.
000350 01  TSL_FRM012-AMTACM PIC S9(013) COMP-3.
000360 01  TSL_FRM012-AMTINC PIC S9(013) COMP-3.
