000010************************************************
000020* (TSL_PRTTM2)
000030************************************************
000040 01  TSL_PRTTM2-CNTNUM PIC  X(009).
000050 01  TSL_PRTTM2-PRFCOD PIC  X(002).
000060 01  TSL_PRTTM2-PRFNAM PIC  X(006).
000070 01  TSL_PRTTM2-BNKCOD PIC  X(004).
000080 01  TSL_PRTTM2-BNKNAM PIC  X(020).
000090 01  TSL_PRTTM2-BRCNAM PIC  X(020).
000100 01  TSL_PRTTM2-PROGRE PIC  X(001).
000110 01  TSL_PRTTM2-USRCOD PIC  X(008).
000120 01  TSL_PRTTM2-USRNAM PIC  X(030).
000130 01  TSL_PRTTM2-BUYNAM PIC  X(030).
000140 01  TSL_PRTTM2-OBJNAM PIC  X(040).
000150 01  TSL_PRTTM2-CNTDAY PIC  X(008).
000160 01  TSL_PRTTM2-APRDAY PIC  X(008).
000170 01  TSL_PRTTM2-DUEDAY PIC  X(008).
000180 01  TSL_PRTTM2-BASDAY PIC  X(008).
000190 01  TSL_PRTTM2-INDCOD PIC  X(002).
000200 01  TSL_PRTTM2-INTTYP PIC  X(001).
000210 01  TSL_PRTTM2-RELEAS PIC  X(001).
000220 01  TSL_PRTTM2-DELFLG PIC  X(001).
000230 01  TSL_PRTTM2-MONCNT PIC S9(004) COMP-3.
000240 01  TSL_PRTTM2-OBJAMT PIC S9(013) COMP-3.
000250 01  TSL_PRTTM2-CNTAMT PIC S9(013) COMP-3.
000260 01  TSL_PRTTM2-LEAAMT PIC S9(013) COMP-3.
000270 01  TSL_PRTTM2-DEPAMT PIC S9(013) COMP-3.
000280 01  TSL_PRTTM2-INTRAT PIC S9(002)V9(6) COMP-3.
000290 01  TSL_PRTTM2-ITMCNT PIC S9(004) COMP-3.
000300 01  TSL_PRTTM2-BRCCNT PIC S9(004) COMP-3.
000310 01  TSL_PRTTM2-BRCAGT PIC S9(004) COMP-3.
000320 01  TSL_PRTTM2-AGTCNT PIC S9(004) COMP-3.
000330 01  TSL_PRTTM2-SATPCT PIC S9(003)V9(5) COMP-3.
000340 01  TSL_PRTTM2-ITMTOT PIC S9(004) COMP-3.
000350 01  TSL_PRTTM2-OBJTOT PIC S9(013) COMP-3.
000360 01  TSL_PRTTM2-CNTTOT PIC S9(013) COMP-3.
000370 01  TSL_PRTTM2-ITMPRP PIC S9(004) COMP-3.
000380 01  TSL_PRTTM2-OBJPRP PIC S9(013) COMP-3.
000390 01  TSL_PRTTM2-CNTPRP PIC S9(013) COMP-3.
000400 01  TSL_PRTTM2-ITMDEP PIC S9(004) COMP-3.
000410 01  TSL_PRTTM2-OBJDEP PIC S9(013) COMP-3.
000420 01  TSL_PRTTM2-CNTDEP PIC S9(013) COMP-3.
