000010************************************************
000020* —^M(“WŠJ)(YOSHINTENKAI)
000030************************************************
000040 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|ŠÇ——^MæƒR[ƒh  PIC  X(008).
000050 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|ŠÇ——^M‹æ•ª  PIC  X(001).
000060 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|Ž©“®—^M‹æ•ª  PIC  X(001).
000070 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|Ž–ŒÌ“ú  PIC  X(008).
000080 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|Œ_–ñ‚m‚n  PIC  X(009).
000090 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|Š¨’èƒR[ƒh  PIC  X(002).
000100 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|“WŠJ”NŒŽ  PIC  X(006).
000110 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|“WŠJ“ú•t  PIC  X(002).
000120 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|“ü‹àƒtƒ‰ƒO  PIC  X(002).
000130 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|“WŠJŽx•¥‰ñ”  PIC  X(003).
000140 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|ŽÀƒŠ[ƒX—¿  PIC S9(013) COMP-3.
000150 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|—˜‘§Šz  PIC S9(013) COMP-3.
000160 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|Œ³–{“à“ü  PIC S9(013) COMP-3.
000170 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|Œ³–{Žc  PIC S9(013) COMP-3.
000180 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|ÂŒ Žc  PIC S9(013) COMP-3.
000190 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|””ï—p  PIC S9(013) COMP-3.
000200 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|–ñ’è—˜—¦  PIC S9(011) COMP-3.
000210 01  ‚x‚n‚r‚g‚h‚m‚s‚d‚m‚j‚`‚h|Ž–ŒÌŒã“ü‹à  PIC S9(013) COMP-3.
