000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. HELLO.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 PROCEDURE DIVISION.
000070 S.     
000080     DISPLAY  "HELLO WORLD" .
000090     STOP 1.
