 IDENTIFICATION DIVISION.
 PROGRAM-ID. HELLOWORLD.
 ENVIRONMENT DIVISION.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 PROCEDURE DIVISION.
 S.     
     DISPLAY  "HELLO WORLD" .
     STOP RUN.
