000010 IDENTIFICATION                               DIVISION.
000020 PROGRAM-ID.  School.
000030 ENVIRONMENT                                  DIVISION.
000040 DATA                                         DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 CallCount PIC 99 VALUE 0.
000070 01 MenuNO    PIC 99 VALUE 99.
000080 PROCEDURE                                    DIVISION.
