000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CH1O3.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060      SELECT PRINT-FILE ASSIGN TO PRINTER.
000070 DATA DIVISION.                               
000080 FILE SECTION.
000090 FD PRINT-FILE LABEL RECORD IS OMITTED.
000100 01 P-REC PIC X(80).
000110 WORKING-STORAGE SECTION.
000120 77 N      PIC 9.
000130 77 E-W    PIC X(3).
000140 01 SALE-OUT.              
000150   03 NUMBERS  PIC 9(3).
000160   03 AMOUNT   PIC 9(6)V99.
000170 01  P-W.                          
000180   03 P-NUMBER PIC 9(3).
000190   03 P-PRICE  PIC Z(6).99.
000200   03 P-AMOUNT PIC Z(8).99.
000210   03 P-SUM    PIC Z(8).99.
000220 01 STOCK-TABLE.
000230   03 FILLER PIC X(9) VALUE "OOIC00325".
000240   03 FILLER PIC X(9) VALUE "003000827".
000250   03 FILLER PIC X(9) VALUE "006000625".
000260   03 FILLER PIC X(9) VALUE "008001856".
000270   03 FILLER PIC X(9) VALUE "010004850".
000280   03 FILLER PIC X(9) VALUE "999080000".
000290 01 S-P-T REDEFINES STOCK-TABLE.
000300   02 S-P OCCURS 6.
000310     03 N-T PIC 9(3).
000320     03 P-T PIC 9(4)V99.
000330 PROCEDURE DIVISION.
000340 G.
000350     OPEN OUTPUT PRINT-FILE.
000360     DISPLAY "INPUT NUMBERS".
000370     ACCEPT NUMBERS.
000380     PERFORM A UNTIL NUMBERS = 999.
000390     CLOSE PRINT-FILE.
000400     STOP RUN.
000410 A.       
000420     DISPLAY "INPUT AMOUNT".
000430     ACCEPT AMOUNT.
000440     MOVE ZERO TO N.
000450     MOVE SPACE TO E-W.
000460     PERFORM S UNTIL E-W = "END" OR E-W = "NOT".
000470     IF E-W = "END" PERFORM P
000480     ELSE DISPLAY "NUMBHlS NOT IN TABLE".
000490     DISPLAY "INPUT NUMBERS".
000500     ACCEPT NUMBERS.
000510 S.    
000520     ADD   1   TO  N.
000530     IF NUMBERS = N-T(N) MOVE "END" TO E-W
000540     ELSE IF N-T(N) = 999 MOVE "NOT" TO E-W.
000550 P.       
000560     MOVE P-T(N) TO P-PRICE.
000570     MULTIPLY P-T(N) BY AMOUNT GIVING P-SUM.
000580     MOVE NUMBERS TO P-NUMBER
000590     MOVE AMOUNT  TO P-AMOUNT.
000600     MOVE P-W     TO P-REC.
000610     WRITE P-REC.