000010******************************************************************
000020*         ＜海輝軟件(大連)＞                                     *
000030*      1. プログラム名  : 債権・金融展開移行処理                 *
000040*                         ＜金融展開・協調持分反映＞             *
000050*      2. プログラムID  : COBIS47A                               *
000060*      3. 処理概要      : 検収後金融展開の協調持分以外と協調持分 *
000070*                         の抽出データのマッチングにより、金融展 *
000080*                         開抽出ファイル１を作成する             *
000090*                                                                *
000100*      4. 作成者        : 任大利                                 *
000110*      5. 作成日        : 2004.10.10                             *
000120******************************************************************
000130*                                                                 
000140******************************************************************
000150*    ＩＤＥＮＴＩＦＩＣＡＴＩＯＮ     ＤＩＶＩＳＩＯＮ           *
000160******************************************************************
000170 IDENTIFICATION                       DIVISION.                   
000180*                                                                 
000190 PROGRAM-ID.                          COBIS47A.                   
000200******************************************************************
000210*    ＥＮＶＩＲＯＮＭＥＮＴ           ＤＩＶＩＳＩＯＮ           *
000220******************************************************************
000230 ENVIRONMENT                          DIVISION.                   
000240******************************************************************
000250*    ＩＮＰＵＴ－ＯＵＴＰＵＴ      ＳＥＣＴＩＯＮ                *
000260******************************************************************
000270 INPUT-OUTPUT                         SECTION.                    
000280*                                                                 
000290 FILE-CONTROL.                                                    
000300     SELECT    入力ファイル１         ASSIGN    TO     U01        
000310     FILE      STATUS     IS          Ｗ－状態                    
000320     ORGANIZATION         IS          LINE      SEQUENTIAL.       
000330*                                                                 
000340     SELECT    入力ファイル２         ASSIGN    TO     U02        
000350     FILE      STATUS     IS          Ｗ－状態                    
000360     ORGANIZATION         IS          LINE      SEQUENTIAL.       
000370*                                                                 
000380     SELECT    出力ファイル           ASSIGN    TO     U11        
000390     FILE      STATUS     IS          Ｗ－状態                    
000400     ORGANIZATION         IS          LINE      SEQUENTIAL.       
000410*                                                                 
000420******************************************************************
000430*    ＤＡＴＡ                      ＤＩＶＩＳＩＯＮ              *
000440******************************************************************
000450 DATA                                 DIVISION.                   
000460******************************************************************
000470*    ＦＩＬＥ                      ＳＥＣＴＩＯＮ                *
000480******************************************************************
000490 FILE                                 SECTION.                    
000500*----------------------------------------------------------------*
000510*    入力ファイル                                                *
000520*----------------------------------------------------------------*
000530 FD  入力ファイル１                                               
000540     LABEL     RECORD     IS          STANDARD                    
000550     BLOCK     CONTAINS   0           RECORDS.                    
000560*                                                                 
000570 01  入力１－レコード.                                            
000580     COPY  CISUF470  REPLACING  ==()==  BY  ==入力１－==.         
000590*                                                                 
000600 FD  入力ファイル２                                               
000610     LABEL     RECORD     IS          STANDARD                    
000620     BLOCK     CONTAINS   0           RECORDS.                    
000630*                                                                 
000640 01  入力２－レコード.                                            
000650     COPY  CISUF470  REPLACING  ==()==  BY  ==入力２－==.         
000660*                                                                 
000670*----------------------------------------------------------------*
000680*    出力ファイル                                                *
000690*----------------------------------------------------------------*
000700 FD  出力ファイル                                                 
000710     LABEL     RECORD     IS          STANDARD                    
000720     BLOCK     CONTAINS   0           RECORDS.                    
000730*                                                                 
000740 01  出力－レコード.                                              
000750     COPY  CISUF470  REPLACING  ==()==  BY  ==出力－==.           
000760*                                                                 
000770******************************************************************
000780*    ＷＯＲＫＩＮＧ－ＳＴＯＲＡＧＥ   ＳＥＣＴＩＯＮ             *
000790******************************************************************
000800 WORKING-STORAGE                      SECTION.                    
000810*                                                                 
000820*----------------------------------------------------------------*
000830*   作業領域定義                                                 *
000840*----------------------------------------------------------------*
000850 01  ワークエリア.                                                
000860*                                                                 
000870*--< 件数エリア >                                                 
000880     03  Ｗ－件数エリア.                                          
000890         05  Ｗ－持分以外－件数       PIC  9(09).                 
000900         05  Ｗ－持分－件数           PIC  9(09).                 
000910         05  Ｗ－金融展開－件数       PIC  9(09).                 
000920*                                                                 
000930*--< ファイル状態 >                                               
000940     03  Ｗ－状態エリア.                                          
000950         05  Ｗ－状態                 PIC  X(02).                 
000960*                                                                 
000970*--< エラーコード >                                               
000980     03  Ｗ－エラーコード             PIC S9(04).                 
000990*                                                                 
001000*--< フラグエリア >                                               
001010     03  Ｗ－フラッグエリア.                                      
001020         05  Ｗ－終了－フラグ１       PIC  X(01).                 
001030         05  Ｗ－終了－フラグ２       PIC  X(01).                 
001040         05  Ｗ－異常終了－フラグ     PIC  X(01).                 
001050*                                                                 
001060*--< キーエリア >                                                 
001070     03  Ｗ－キーエリア.                                          
001080         05  Ｗ－ＫＥＹ－持分以外.                                
001090             07  Ｗ－契約番号１       PIC  X(07).                 
001100             07  Ｗ－再リース回数１   PIC  9(02).                 
001110             07  Ｗ－契約種類１       PIC  X(03).                 
001120             07  Ｗ－連番１           PIC  9(03).                 
001130             07  Ｗ－解約日１         PIC  X(07).                 
001140*                                                                 
001150         05  Ｗ－ＫＥＹ－持分.                                    
001160             07  Ｗ－契約番号２       PIC  X(07).                 
001170             07  Ｗ－再リース回数２   PIC  9(02).                 
001180             07  Ｗ－契約種類２       PIC  X(03).                 
001190             07  Ｗ－連番２           PIC  9(03).                 
001200             07  Ｗ－解約日２         PIC  X(07).                 
001210*                                                                 
001220*----------------------------------------------------------------*
001230*    サブルーチン名                                              *
001240*----------------------------------------------------------------*
001250 01  CALL-AREA.                                                   
001260*--< 共通ログサブルーチン >                                       
001270     03  CLOCO001                     PIC  X(08) VALUE "CLOCO001".
001280*                                                                 
001290*----------------------------------------------------------------*
001300*    ＣＯＰＹ領域                                                *
001310*----------------------------------------------------------------*
001320*--< 共通ログ用 >                                                 
001330 01  IF-CHOCO001.                                                 
001340     COPY  CHOCO001  REPLACING  ==()==  BY  ==共通－==.           
001350*                                                                 
001360*----------------------------------------------------------------*
001370*    レコード初期化領域                                          *
001380*----------------------------------------------------------------*
001390 01  初期化レコード.                                              
001400     COPY  CISUF470  REPLACING  ==()==  BY  ==初期化－==.         
001410*                                                                 
001420******************************************************************
001430*    定数用データ定義                                            *
001440******************************************************************
001450 CONSTANT                             SECTION.                    
001460*                                                                 
001470 01  定数領域.                                                    
001480     03  定数－プログラムＩＤ         PIC  X(08) VALUE "COBIS47A".
001490     03  定数－プログラム名           PIC  X(80)                  
001500             VALUE "債権・金融展開移行／金融展開・協調持分反映１".
001510     03  定数－正常状態               PIC  9(04) VALUE  ZERO.     
001520     03  定数－異常状態               PIC  9(04) VALUE  0009.     
001530*                                                                 
001540******************************************************************
001550*    ＰＲＯＣＥＤＵＲＥ               ＤＩＶＩＳＩＯＮ           *
001560******************************************************************
001570 PROCEDURE                            DIVISION.                   
001580*                                                                 
001590     PERFORM   初期処理.                                          
001600*                                                                 
001610     PERFORM   主処理     UNTIL  (Ｗ－終了－フラグ１ = "Y")       
001620                          AND    (Ｗ－終了－フラグ２ = "Y").      
001630*                                                                 
001640     PERFORM   終了処理.                                          
001650*                                                                 
001660     STOP RUN.                                                    
001670*                                                                 
001680******************************************************************
001690*    初期処理                                                    *
001700******************************************************************
001710 初期処理                             SECTION.                    
001720 初期処理－ＳＴＡＲＴ.                                            
001730*                                                                 
001740*----------------------------------------------------------------*
001750*    開始メッセージ出力                                          *
001760*----------------------------------------------------------------*
001770     INITIALIZE                       IF-CHOCO001.                
001780     MOVE  "3"                        TO  共通－イベント種別.     
001790     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
001800     MOVE  "0"                        TO  共通－復帰コード.       
001810     MOVE  "START"                    TO  共通－処理識別.         
001820     MOVE  定数－プログラム名         TO  共通－その他メッセージ. 
001830     CALL  CLOCO001                USING  IF-CHOCO001.            
001840*                                                                 
001850*----------------------------------------------------------------*
001860*    作業領域の初期値設定                                        *
001870*----------------------------------------------------------------*
001880     MOVE  SPACE                      TO  ワークエリア.           
001890     INITIALIZE                           ワークエリア.           
001900*                                                                 
001910     MOVE  SPACE                      TO  初期化レコード.         
001920     INITIALIZE                           初期化レコード.         
001930*                                                                 
001940     PERFORM  ファイルオープン.                                   
001950*                                                                 
001960*--< 持分以外ファイル読込処理（１件目） >                         
001970     PERFORM  持分以外ファイル読込処理.                           
001980*                                                                 
001990*--< 持分ファイル読込処理（１件目） >                             
002000     PERFORM  持分ファイル読込処理.                               
002010*                                                                 
002020 初期処理－ＥＸＩＴ.                                              
002030     EXIT.                                                        
002040******************************************************************
002050*    主処理                                                       
002060******************************************************************
002070 主処理                               SECTION.                    
002080 主処理－ＳＴＡＲＴ.                                              
002090*                                                                 
002100     EVALUATE  TRUE                                               
002110*--<    持分ファイルのみの場合 >                                  
002120        WHEN  Ｗ－ＫＥＹ－持分以外 > Ｗ－ＫＥＹ－持分             
002130           PERFORM  持分ファイル読込処理                          
002140*                                                                 
002150*--<    マッチングの場合 >                                        
002160        WHEN  Ｗ－ＫＥＹ－持分以外 = Ｗ－ＫＥＹ－持分             
002170           PERFORM  マッチング編集出力処理                        
002180*                                                                 
002190           PERFORM  持分以外ファイル読込処理                      
002200*                                                                 
002210           PERFORM  持分ファイル読込処理                          
002220*                                                                 
002230*--<    持分以外ファイルのみの場合 >                              
002240        WHEN  Ｗ－ＫＥＹ－持分以外 < Ｗ－ＫＥＹ－持分             
002250           PERFORM  持分以外のみ編集出力処理                      
002260*                                                                 
002270           PERFORM  持分以外ファイル読込処理                      
002280*                                                                 
002290     END-EVALUATE.                                                
002300*                                                                 
002310 主処理－ＥＸＩＴ.                                                
002320     EXIT.                                                        
002330******************************************************************
002340*    終了処理                                                    *
002350******************************************************************
002360 終了処理                             SECTION.                    
002370 終了処理－ＳＴＡＲＴ.                                            
002380*                                                                 
002390*----------------------------------------------------------------*
002400*    ファイルクローズ                                            *
002410*----------------------------------------------------------------*
002420     CLOSE  入力ファイル１.                                       
002430     CLOSE  入力ファイル２.                                       
002440     CLOSE  出力ファイル.                                         
002450*                                                                 
002460*--< 終了メッセージ出力処理                                       
002470     PERFORM  終了メッセージ出力.                                 
002480*                                                                 
002490*--< プログラム正常終了 >                                         
002500     MOVE  定数－正常状態             TO  PROGRAM-STATUS.         
002510*                                                                 
002520 終了処理－ＥＸＩＴ.                                              
002530     EXIT.                                                        
002540******************************************************************
002550*    ファイルオープン                                            *
002560******************************************************************
002570 ファイルオープン                     SECTION.                    
002580 ファイルオープン－ＳＴＡＲＴ.                                    
002590*                                                                 
002600*----------------------------------------------------------------*
002610*    持分以外ファイルのオープン                                  *
002620*----------------------------------------------------------------*
002630     OPEN  INPUT   入力ファイル１.                                
002640*                                                                 
002650*--< ファイルオープンの状態判定 >                                 
002660     EVALUATE  Ｗ－状態                                           
002670        WHEN  ZERO                                                
002680           CONTINUE                                               
002690        WHEN  OTHER                                               
002700*--<       ファイルオープンエラー >                               
002710           MOVE     -1                TO  Ｗ－エラーコード        
002720           PERFORM  エラー処理                                    
002730     END-EVALUATE.                                                
002740*                                                                 
002750*----------------------------------------------------------------*
002760*    持分ファイルのオープン                                      *
002770*----------------------------------------------------------------*
002780     OPEN  INPUT   入力ファイル２.                                
002790*                                                                 
002800*--< ファイルオープンの状態判定 >                                 
002810     EVALUATE  Ｗ－状態                                           
002820        WHEN  ZERO                                                
002830           CONTINUE                                               
002840        WHEN  OTHER                                               
002850*--<       ファイルオープンエラー >                               
002860           MOVE     -2                TO  Ｗ－エラーコード        
002870           PERFORM  エラー処理                                    
002880     END-EVALUATE.                                                
002890*                                                                 
002900*----------------------------------------------------------------*
002910*    金融展開ファイルのオープン                                  *
002920*----------------------------------------------------------------*
002930     OPEN  OUTPUT   出力ファイル.                                 
002940*                                                                 
002950*--< ファイルオープンの状態判定 >                                 
002960     EVALUATE  Ｗ－状態                                           
002970        WHEN  ZERO                                                
002980           CONTINUE                                               
002990        WHEN  OTHER                                               
003000*--<       ファイルオープンエラー >                               
003010           MOVE     -5                TO  Ｗ－エラーコード        
003020           PERFORM  エラー処理                                    
003030     END-EVALUATE.                                                
003040*                                                                 
003050 ファイルオープン－ＥＸＩＴ.                                      
003060     EXIT.                                                        
003070******************************************************************
003080*    持分以外ファイル読込処理                                    *
003090******************************************************************
003100 持分以外ファイル読込処理             SECTION.                    
003110 持分以外ファイル読込処理－ＳＴＡＲＴ.                            
003120*                                                                 
003130     READ  入力ファイル１                                         
003140        AT END                                                    
003150           MOVE  "Y"                  TO  Ｗ－終了－フラグ１      
003160           MOVE  HIGH-VALUE           TO  Ｗ－ＫＥＹ－持分以外    
003170           GO    TO   持分以外ファイル読込処理－ＥＸＩＴ          
003180     END-READ.                                                    
003190*                                                                 
003200*--< ファイル読込状態判定 >                                       
003210     EVALUATE  Ｗ－状態                                           
003220        WHEN  ZERO                                                
003230*--<       持分以外ファイルマッチングキーのセット >               
003240           MOVE  入力１－契約番号(1:7) TO  Ｗ－契約番号１         
003250           MOVE  入力１－再リース回数  TO  Ｗ－再リース回数１     
003260           MOVE  入力１－契約種類      TO  Ｗ－契約種類１         
003270           MOVE  入力１－連番          TO  Ｗ－連番１             
003280           MOVE  入力１－解約日        TO  Ｗ－解約日１           
003290*--<       持分以外ファイル入力件数のカウント >                   
003300           COMPUTE   Ｗ－持分以外－件数  =  Ｗ－持分以外－件数 + 1
003310        WHEN  OTHER                                               
003320*--<       持分以外ファイル読込エラー >                           
003330           MOVE     -3                TO  Ｗ－エラーコード        
003340           PERFORM  エラー処理                                    
003350     END-EVALUATE.                                                
003360*                                                                 
003370 持分以外ファイル読込処理－ＥＸＩＴ.                              
003380     EXIT.                                                        
003390******************************************************************
003400*    持分ファイル読込処理                                        *
003410******************************************************************
003420 持分ファイル読込処理                 SECTION.                    
003430 持分ファイル読込処理－ＳＴＡＲＴ.                                
003440*                                                                 
003450     READ  入力ファイル２                                         
003460        AT END                                                    
003470           MOVE  "Y"                  TO  Ｗ－終了－フラグ２      
003480           MOVE  HIGH-VALUE           TO  Ｗ－ＫＥＹ－持分        
003490           GO    TO   持分ファイル読込処理－ＥＸＩＴ              
003500     END-READ.                                                    
003510*                                                                 
003520*--< ファイル読込状態判定 >                                       
003530     EVALUATE  Ｗ－状態                                           
003540        WHEN  ZERO                                                
003550*--<       持分ファイルマッチングキーのセット >                   
003560           MOVE  入力２－契約番号(1:7) TO  Ｗ－契約番号２         
003570           MOVE  入力２－再リース回数  TO  Ｗ－再リース回数２     
003580           MOVE  入力２－契約種類      TO  Ｗ－契約種類２         
003590           MOVE  入力２－連番          TO  Ｗ－連番２             
003600           MOVE  入力２－解約日        TO  Ｗ－解約日２           
003610*--<       持分ファイル入力件数の加算 >                           
003620           COMPUTE   Ｗ－持分－件数    =  Ｗ－持分－件数 + 1      
003630        WHEN  OTHER                                               
003640*--<       持分ファイル読込エラー >                               
003650           MOVE     -4                TO  Ｗ－エラーコード        
003660           PERFORM  エラー処理                                    
003670     END-EVALUATE.                                                
003680*                                                                 
003690 持分ファイル読込処理－ＥＸＩＴ.                                  
003700     EXIT.                                                        
003710******************************************************************
003720*    持分以外のみ編集出力処理                                    *
003730******************************************************************
003740 持分以外のみ編集出力処理             SECTION.                    
003750 持分以外のみ編集出力処理－ＳＴＡＲＴ.                            
003760*                                                                 
003770*--< 出力レコードの初期化処理 >                                   
003780     MOVE  初期化レコード             TO  出力－レコード.         
003790*                                                                 
003800*--< 金融展開レコードの編集処理 >                                 
003810     MOVE  入力１－レコード           TO  出力－レコード.         
003820*                                                                 
003830*--< 金融展開ファイル出力処理 >                                   
003840     PERFORM  金融展開ファイル出力処理.                           
003850*                                                                 
003860 持分以外のみ編集出力処理－ＥＸＩＴ.                              
003870     EXIT.                                                        
003880******************************************************************
003890*    マッチング編集出力処理                                      *
003900******************************************************************
003910 マッチング編集出力処理               SECTION.                    
003920 マッチング編集出力処理－ＳＴＡＲＴ.                              
003930*                                                                 
003940*--< 出力レコードの初期化処理 >                                   
003950     MOVE  初期化レコード             TO  出力－レコード.         
003960*                                                                 
003970*--< 金融展開レコード基本項目の編集処理 >                         
003980     MOVE  入力１－レコード           TO  出力－レコード.         
003990*                                                                 
004000     IF  入力１－回収手順 = "1"                                   
004010*--<    No.8 >                                                    
004020        MOVE  入力２－請求額          TO  出力－請求額            
004030*--<    No.15 >                                                   
004040        MOVE  入力２－自社請求額      TO  出力－自社請求額        
004050     END-IF.                                                      
004060*--< No.16 >                                                      
004070     MOVE  入力２－自社元本           TO  出力－自社元本.         
004080*--< No.17 >                                                      
004090     MOVE  入力２－自社利息           TO  出力－自社利息.         
004100*--< No.18 >                                                      
004110     MOVE  入力２－自社諸費用         TO  出力－自社諸費用.       
004120*--< No.19 >                                                      
004130     MOVE  入力２－自社元本残高       TO  出力－自社元本残高.     
004140*--< No.20 >                                                      
004150     MOVE  入力２－自社社内金利利息適用                           
004160                                  TO  出力－自社社内金利利息適用. 
004170*--< No.21 >                                                      
004180     MOVE  入力２－自社社内金利利息一般                           
004190                                  TO  出力－自社社内金利利息一般. 
004200*--< No.23 >                                                      
004210     MOVE  入力２－自社利回り         TO  出力－自社利回り.       
004220*                                                                 
004230     PERFORM  金融展開ファイル出力処理.                           
004240*                                                                 
004250 金融展開ファイル編集処理２－ＥＸＩＴ.                            
004260     EXIT.                                                        
004270******************************************************************
004280*    金融展開ファイル出力処理                                    *
004290******************************************************************
004300 金融展開ファイル出力処理             SECTION.                    
004310 金融展開ファイル出力処理－ＳＴＡＲＴ.                            
004320*                                                                 
004330     WRITE  出力－レコード.                                       
004340*                                                                 
004350*--< 金融展開ファイル出力の状態判定 >                             
004360     EVALUATE  Ｗ－状態                                           
004370        WHEN  ZERO                                                
004380*--<       金融展開ファイル出力件数の加算 >                       
004390           COMPUTE  Ｗ－金融展開－件数 =  Ｗ－金融展開－件数 + 1  
004400        WHEN  OTHER                                               
004410*--<       ファイル出力エラー >                                   
004420           MOVE     -6                TO  Ｗ－エラーコード        
004430           PERFORM  エラー処理                                    
004440     END-EVALUATE.                                                
004450*                                                                 
004460 金融展開ファイル出力処理－ＥＸＩＴ.                              
004470     EXIT.                                                        
004480******************************************************************
004490*    終了メッセージ出力                                          *
004500******************************************************************
004510  終了メッセージ出力                  SECTION.                    
004520  終了メッセージ出力－ＳＴＡＲＴ.                                 
004530*----------------------------------------------------------------*
004540*    金融展開・持分以外ファイル入力件数                          *
004550*----------------------------------------------------------------*
004560     INITIALIZE                       IF-CHOCO001.                
004570     MOVE  "3"                        TO  共通－イベント種別.     
004580     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
004590     MOVE  "0"                        TO  共通－復帰コード.       
004600     MOVE  "FFUIS47Q"                 TO  共通－処理テーブルＩＤ. 
004610     MOVE  "COUNT"                    TO  共通－処理識別.         
004620     MOVE  Ｗ－持分以外－件数         TO  共通－データ内容.       
004630     MOVE  "検収後・金融展開・持分以外入力件数"                   
004640                                      TO  共通－その他メッセージ. 
004650     CALL  CLOCO001                USING  IF-CHOCO001.            
004660*                                                                 
004670*----------------------------------------------------------------*
004680*    金融展開・持分ファイル入力件数                              *
004690*----------------------------------------------------------------*
004700     INITIALIZE                       IF-CHOCO001.                
004710     MOVE  "3"                        TO  共通－イベント種別.     
004720     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
004730     MOVE  "0"                        TO  共通－復帰コード.       
004740     MOVE  "FFUIS47R"                 TO  共通－処理テーブルＩＤ. 
004750     MOVE  "COUNT"                    TO  共通－処理識別.         
004760     MOVE  Ｗ－持分－件数             TO  共通－データ内容.       
004770     MOVE  "検収後・金融展開・持分入力件数"                       
004780                                      TO  共通－その他メッセージ. 
004790     CALL  CLOCO001                USING  IF-CHOCO001.            
004800*                                                                 
004810*----------------------------------------------------------------*
004820*    金融展開抽出ファイル１出力件数                              *
004830*----------------------------------------------------------------*
004840     INITIALIZE                       IF-CHOCO001.                
004850     MOVE  "3"                        TO  共通－イベント種別.     
004860     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
004870     MOVE  "0"                        TO  共通－復帰コード.       
004880     MOVE  "FFUIS47T"                 TO  共通－処理テーブルＩＤ. 
004890     MOVE  "COUNT"                    TO  共通－処理識別.         
004900     MOVE  Ｗ－金融展開－件数         TO  共通－データ内容.       
004910     MOVE  "金融展開抽出ファイル１出力件数"                       
004920                                      TO  共通－その他メッセージ. 
004930     CALL  CLOCO001                USING  IF-CHOCO001.            
004940*                                                                 
004950*----------------------------------------------------------------*
004960*    終了メッセージ 出力                                         *
004970*----------------------------------------------------------------*
004980     INITIALIZE                       IF-CHOCO001.                
004990     MOVE  "3"                        TO  共通－イベント種別.     
005000     MOVE  定数－プログラムＩＤ       TO  共通－ソースＩＤ.       
005010     MOVE  "0"                        TO  共通－復帰コード.       
005020     MOVE  "END"                      TO  共通－処理識別.         
005030     MOVE  定数－プログラム名         TO  共通－その他メッセージ. 
005040     CALL  CLOCO001                USING  IF-CHOCO001.            
005050*                                                                 
005060 終了メッセージ出力－ＥＸＩＴ.                                    
005070     EXIT.                                                        
005080******************************************************************
005090*    エラー処理                                                  *
005100******************************************************************
005110 エラー処理                           SECTION.                    
005120 エラー処理－ＳＴＡＲＴ.                                          
005130*                                                                 
005140     MOVE  "Y"                        TO  Ｗ－異常終了－フラグ.   
005150     INITIALIZE                           IF-CHOCO001.            
005160*                                                                 
005170     EVALUATE  Ｗ－エラーコード                                   
005180        WHEN  -1                                                  
005190*--<       持分以外ファイルオープンエラー >                       
005200           MOVE  "1"                  TO  共通－イベント種別      
005210           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
005220           MOVE  "9"                  TO  共通－復帰コード        
005230           MOVE  "FFUIS47Q"           TO  共通－処理テーブルＩＤ  
005240           MOVE  "OPEN"               TO  共通－処理識別          
005250           MOVE  Ｗ－状態             TO  共通－データ内容        
005260           MOVE  "持分以外ファイルオープンエラー "                
005270                                      TO  共通－その他メッセージ  
005280           CALL  CLOCO001          USING  IF-CHOCO001             
005290*                                                                 
005300        WHEN  -2                                                  
005310*--<       持分ファイルオープンエラー >                           
005320           MOVE  "1"                  TO  共通－イベント種別      
005330           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
005340           MOVE  "9"                  TO  共通－復帰コード        
005350           MOVE  "FFUIS47R"           TO  共通－処理テーブルＩＤ  
005360           MOVE  "OPEN"               TO  共通－処理識別          
005370           MOVE  Ｗ－状態             TO  共通－データ内容        
005380           MOVE  "持分ファイルオープンエラー "                    
005390                                      TO  共通－その他メッセージ  
005400           CALL  CLOCO001          USING  IF-CHOCO001             
005410*                                                                 
005420        WHEN  -3                                                  
005430*--<       持分以外ファイル読込エラー >                           
005440           MOVE  "1"                  TO  共通－イベント種別      
005450           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
005460           MOVE  "9"                  TO  共通－復帰コード        
005470           MOVE  "FFUIS47Q"           TO  共通－処理テーブルＩＤ  
005480           MOVE  "READ"               TO  共通－処理識別          
005490           MOVE  Ｗ－状態             TO  共通－データ内容        
005500           MOVE  "持分以外ファイル読込エラー "                    
005510                                      TO  共通－その他メッセージ  
005520           CALL  CLOCO001          USING  IF-CHOCO001             
005530*                                                                 
005540        WHEN  -4                                                  
005550*--<       持分ファイル読込エラー >                               
005560           MOVE  "1"                  TO  共通－イベント種別      
005570           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
005580           MOVE  "9"                  TO  共通－復帰コード        
005590           MOVE  "FFUIS47R"           TO  共通－処理テーブルＩＤ  
005600           MOVE  "READ"               TO  共通－処理識別          
005610           MOVE  Ｗ－状態             TO  共通－データ内容        
005620           MOVE  "持分ファイル読込エラー "                        
005630                                      TO  共通－その他メッセージ  
005640           CALL  CLOCO001          USING  IF-CHOCO001             
005650*                                                                 
005660        WHEN  -5                                                  
005670*--<       金融展開ファイルオープンエラー >                       
005680           MOVE  "1"                  TO  共通－イベント種別      
005690           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
005700           MOVE  "9"                  TO  共通－復帰コード        
005710           MOVE  "FFUIS47T"           TO  共通－処理テーブルＩＤ  
005720           MOVE  "OPEN"               TO  共通－処理識別          
005730           MOVE  Ｗ－状態             TO  共通－データ内容        
005740           MOVE  "金融展開ファイルオープンエラー "                
005750                                      TO  共通－その他メッセージ  
005760           CALL  CLOCO001          USING  IF-CHOCO001             
005770*                                                                 
005780        WHEN  -6                                                  
005790*--<       金融展開ファイル出力エラー >                           
005800           MOVE  "1"                  TO  共通－イベント種別      
005810           MOVE  定数－プログラムＩＤ TO  共通－ソースＩＤ        
005820           MOVE  "9"                  TO  共通－復帰コード        
005830           MOVE  "FFUIS47T"           TO  共通－処理テーブルＩＤ  
005840           MOVE  "WRITE"              TO  共通－処理識別          
005850           MOVE  Ｗ－状態             TO  共通－データ内容        
005860           MOVE  "金融展開ファイル出力エラー "                    
005870                                      TO  共通－その他メッセージ  
005880           CALL  CLOCO001          USING  IF-CHOCO001             
005890*                                                                 
005900        WHEN  OTHER                                               
005910           MOVE  "N"                  TO  Ｗ－異常終了－フラグ    
005920*                                                                 
005930     END-EVALUATE.                                                
005940*                                                                 
005950     IF  Ｗ－異常終了－フラグ  =  "Y"                             
005960        PERFORM  終了メッセージ出力                               
005970*                                                                 
005980*--<    プログラム異常終了のリターンコード >                      
005990        MOVE  定数－異常状態          TO  PROGRAM-STATUS          
006000*                                                                 
006010        EXIT  PROGRAM                                             
006020     END-IF.                                                      
006030*                                                                 
006040 エラー処理－ＥＸＩＴ.                                            
006050      EXIT.                                                       
006060******************************************************************
006070*                  END OF PROGRAM                                *
006080******************************************************************
