000010******************************************************************
000020*         ＜海輝軟件(大連)＞                                     *
000030*      1. プログラム名  : 契約内容ファクタリング項目抽出         *
000040*      2. プログラムID  : COBIS321                               *
000050*      3. 処理概要      : ファクタリング基本のレコード１件より契 *
000060*                         約内容個別情報ファイルを１件出力する。 *
000070*                        ファクタリング基本とファクタリング手形  *
000080*                         売掛債権を契約番号でマッチングし、ファ *
000090*                         クタリング手形売掛債権より付加情報を編 *
000100*                         集する。（付加情報については項目対比参 *
000110*                         照のこと）                             *
000120*                         ﾌｧｸﾀﾘﾝｸﾞ基本があり、ﾌｧｸﾀﾘﾝｸﾞ手形債権が *
000130*                         ない場合マッチングエラーとして右記メッ *
000140*                         セージを出力する。                     *
000150*      4. 作成者        : 白陽                                   *
000160*      5. 作成日        : 2005.04.02                             *
000170******************************************************************
000180*                                                                 
000190******************************************************************
000200*    ＩＤＥＮＴＩＦＩＣＡＴＩＯＮ     ＤＩＶＩＳＩＯＮ           *
000210******************************************************************
000220 IDENTIFICATION                       DIVISION.                   
000230*                                                                 
000240 PROGRAM-ID.                          COBIS321.                   
000250******************************************************************
000260*    ＥＮＶＩＲＯＮＭＥＮＴ           ＤＩＶＩＳＩＯＮ           *
000270******************************************************************
000280 ENVIRONMENT                          DIVISION.                   
000290******************************************************************
000300*    ＩＮＰＵＴ－ＯＵＴＰＵＴ      ＳＥＣＴＩＯＮ                *
000310******************************************************************
000320 INPUT-OUTPUT                         SECTION.                    
000330*                                                                 
000340 FILE-CONTROL.                                                    
000350     SELECT    入力ファイル１         ASSIGN    TO     U01        
000360     FILE      STATUS     IS          Ｗ－状態                    
000370     ORGANIZATION         IS          LINE      SEQUENTIAL.       
000380*                                                                 
000390     SELECT    入力ファイル２         ASSIGN    TO     U02        
000400     FILE      STATUS     IS          Ｗ－状態                    
000410     ORGANIZATION         IS          LINE      SEQUENTIAL.       
000420*                                                                 
000430     SELECT    出力ファイル           ASSIGN    TO     U11        
000440     FILE      STATUS     IS          Ｗ－状態                    
000450     ORGANIZATION         IS          LINE      SEQUENTIAL.       
000460*                                                                 
000470******************************************************************
000480*    ＤＡＴＡ                      ＤＩＶＩＳＩＯＮ              *
000490******************************************************************
000500 DATA                                 DIVISION.                   
000510******************************************************************
000520*    ＦＩＬＥ                      ＳＥＣＴＩＯＮ                *
000530******************************************************************
000540 FILE                                 SECTION.                    
000550*----------------------------------------------------------------*
000560*    入力ファイル                                                *
000570*----------------------------------------------------------------*
000580 FD  入力ファイル１                                               
000590     LABEL     RECORD     IS          STANDARD                    
000600     BLOCK     CONTAINS   0           RECORDS.                    
000610*                                                                 
000620 01  入力１－レコード.                                            
000630     COPY  CPBIS027  REPLACING  ==()==  BY  ==入力１－==.         
000640*                                                                 
000650 FD  入力ファイル２                                               
000660     LABEL     RECORD     IS          STANDARD                    
000670     BLOCK     CONTAINS   0           RECORDS.                    
000680*                                                                 
000690 01  入力２－レコード.                                            
000700     COPY  CPBIS028  REPLACING  ==()==  BY  ==入力２－==.         
000710*                                                                 
000720*----------------------------------------------------------------*
000730*    出力ファイル                                                *
000740*----------------------------------------------------------------*
000750 FD  出力ファイル                                                 
000760     LABEL     RECORD     IS          STANDARD                    
000770     BLOCK     CONTAINS   0           RECORDS.                    
000780*                                                                 
000790 01  出力－レコード.                                              
000800     COPY  CISUF320  REPLACING  ==()==  BY  ==出力－==.           
000810*                                                                 
000820******************************************************************
000830*    ＷＯＲＫＩＮＧ－ＳＴＯＲＡＧＥ   ＳＥＣＴＩＯＮ             *
000840******************************************************************
000850 WORKING-STORAGE                      SECTION.                    
000860*                                                                 
000870*----------------------------------------------------------------*
000880*    作業領域定義                                                *
000890*----------------------------------------------------------------*
000900 01  ワークエリア.                                                
000910*                                                                 
000920*--<     件数エリア >                                             
000930     03  Ｗ－件数エリア.                                          
000940          05  Ｗ－入力－件数１        PIC  9(09).                 
000950          05  Ｗ－入力－件数２        PIC  9(09).                 
000960          05  Ｗ－出力－件数          PIC  9(09).                 
000970*                                                                 
000980*--<     ファイル状態 >                                           
000990     03  Ｗ－状態エリア.                                          
001000          05  Ｗ－状態                PIC  X(02).                 
001010*                                                                 
001020*--<     エラーコード >                                           
001030     03  Ｗ－エラーコード             PIC S9(04).                 
001040*                                                                 
001050*--<     フラグエリア >                                           
001060     03  Ｗ－フラッグエリア.                                      
001070         05  Ｗ－終了－フラグ１       PIC  X(01).                 
001080         05  Ｗ－終了－フラグ２       PIC  X(01).                 
001090         05  Ｗ－異常終了－フラグ     PIC  X(01).                 
001100*                                                                 
001110*--<     キーエリア >                                             
001120     03  Ｗ－キーエリア.                                          
001130         05  Ｗ－ＫＥＹ－基本         PIC  X(09).                 
001140         05  Ｗ－ＫＥＹ－手形売掛債権 PIC  X(09).                 
001150*                                                                 
001160*--< 共通情報 >                                                   
001170 01  Ｗ－共通情報.                                                
001180     03  Ｗ－システム日付.                                        
001190         05  Ｗ－世紀                 PIC  X(02) VALUE  "20".     
001200         05  Ｗ－年月日               PIC  X(06).                 
001210     03  Ｗ－システム時刻             PIC  X(08).                 
001220     03  Ｗ－担当者                   PIC  X(08) VALUE "IKOPG   ".
001230 01  Ｗ－利息期日                     PIC  X(07).                 
001240 01  Ｗ－利息日西暦                   PIC  X(08).                 
001250*                                                                 
001260*----------------------------------------------------------------*
001270*    サブルーチン名                                              *
001280*----------------------------------------------------------------*
001290 01  CALL-AREA.                                                   
001300*--< 共通ログサブルーチン >                                       
001310     03  CLOCO001                     PIC  X(08) VALUE "CLOCO001".
001320     03  COBCO001                     PIC  X(08) VALUE "COBCO001".
001330*                                                                 
001340*----------------------------------------------------------------*
001350*    ＣＯＰＹ領域                                                *
001360*----------------------------------------------------------------*
001370*--< 共通ログ用 >                                                 
001380 01  IF-CHOCO001.                                                 
001390     COPY  CHOCO001  REPLACING  ==()==  BY  ==共１－==.           
001400******************************************************************
001410*    定数用データ定義                                            *
001420******************************************************************
001430 CONSTANT                             SECTION.                    
001440*                                                                 
001450 01  定数領域.                                                    
001460     03  定数－プログラムＩＤ         PIC  X(08) VALUE "COBIS321".
001470     03  定数－プログラム名           PIC  X(80)                  
001480                           VALUE "契約内容ファクタリング項目抽出".
001490     03  定数－正常状態               PIC  9(04) VALUE  ZERO.     
001500     03  定数－異常状態               PIC  9(04) VALUE  0009.     
001510*                                                                 
001520******************************************************************
001530*    ＰＲＯＣＥＤＵＲＥ               ＤＩＶＩＳＩＯＮ           *
001540******************************************************************
001550 PROCEDURE                            DIVISION.                   
001560*                                                                 
001570     PERFORM   初期処理.                                          
001580*                                                                 
001590     PERFORM   主処理     UNTIL  (Ｗ－終了－フラグ１ = "Y")       
001600                          AND    (Ｗ－終了－フラグ２ = "Y").      
001610*                                                                 
001620     PERFORM   終了処理.                                          
001630*                                                                 
001640     STOP RUN.                                                    
001650*                                                                 
001660******************************************************************
001670*    初期処理                                                    *
001680******************************************************************
001690 初期処理                             SECTION.                    
001700 初期処理－ＳＴＡＲＴ.                                            
001710*                                                                 
001720*----------------------------------------------------------------*
001730*    開始メッセージ出力                                          *
001740*----------------------------------------------------------------*
001750     INITIALIZE                       IF-CHOCO001.                
001760     MOVE  "3"                        TO  共１－イベント種別.     
001770     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
001780     MOVE  "0"                        TO  共１－復帰コード.       
001790     MOVE  "START"                    TO  共１－処理識別.         
001800     MOVE  定数－プログラム名         TO  共１－その他メッセージ. 
001810     CALL  CLOCO001                USING  IF-CHOCO001.            
001820*----------------------------------------------------------------*
001830*    作業領域の初期値処理                                        *
001840*----------------------------------------------------------------*
001850     MOVE  SPACE                      TO  ワークエリア.           
001860     INITIALIZE                           ワークエリア.           
001870*                                                                 
001880*--< ＣＰＵ日付を取得 >                                           
001890     ACCEPT  Ｗ－年月日               FROM  DATE.                 
001900*                                                                 
001910*--< ＣＰＵ時刻を取得 >                                           
001920     ACCEPT  Ｗ－システム時刻         FROM  TIME.                 
001930*                                                                 
001940*--< ファイルオープン >                                           
001950     PERFORM  ファイルオープン.                                   
001960*                                                                 
001970*--< 基本ファイル読込処理（１件目） >                             
001980     PERFORM  基本ファイル読込処理.                               
001990*                                                                 
002000*--< 手形売掛債権ファイル読込処理（１件目） >                     
002010     PERFORM  手形売掛債権ファイル読込処理.                       
002020*                                                                 
002030 初期処理－ＥＸＩＴ.                                              
002040     EXIT.                                                        
002050******************************************************************
002060*    主処理                                                       
002070******************************************************************
002080 主処理                               SECTION.                    
002090 主処理－ＳＴＡＲＴ.                                              
002100*                                                                 
002110     EVALUATE  TRUE                                               
002120*--<    手形売掛債権ファイルの場合 >                              
002130        WHEN  Ｗ－ＫＥＹ－基本 > Ｗ－ＫＥＹ－手形売掛債権         
002140           PERFORM  手形売掛債権ファイル読込処理                  
002150*                                                                 
002160*--<    契約内容個別情報編集処理の場合 >                          
002170        WHEN  Ｗ－ＫＥＹ－基本 = Ｗ－ＫＥＹ－手形売掛債権         
002180           IF  入力１－業務区分 = 1                               
002190            OR  入力１－業務区分 = 2                              
002200              PERFORM  契約内容個別情報編集処理                   
002210           END-IF                                                 
002220*                                                                 
002230           PERFORM  基本ファイル読込処理                          
002240*                                                                 
002250           PERFORM  手形売掛債権ファイル読込処理                  
002260*                                                                 
002270*--<    基本ファイルの場合 >                                      
002280        WHEN  Ｗ－ＫＥＹ－基本 < Ｗ－ＫＥＹ－手形売掛債権         
002290           DISPLAY  " 契約Ｎ０ ＝ "  Ｗ－ＫＥＹ－基本             
002300*                                                                 
002310           PERFORM  基本ファイル読込処理                          
002320*                                                                 
002330     END-EVALUATE.                                                
002340*                                                                 
002350 主処理－ＥＸＩＴ.                                                
002360     EXIT.                                                        
002370******************************************************************
002380*    ファイルオープン                                            *
002390******************************************************************
002400 ファイルオープン                     SECTION.                    
002410 ファイルオープン－ＳＴＡＲＴ.                                    
002420*                                                                 
002430*----------------------------------------------------------------*
002440*    基本ファイルのオープン                                      *
002450*----------------------------------------------------------------*
002460     OPEN  INPUT   入力ファイル１.                                
002470*                                                                 
002480*--< ファイルオープンの状態判定 >                                 
002490     EVALUATE  Ｗ－状態                                           
002500        WHEN  ZERO                                                
002510           CONTINUE                                               
002520        WHEN  OTHER                                               
002530*--<       ファイルオープンエラー >                               
002540           MOVE     -10               TO  Ｗ－エラーコード        
002550           PERFORM  エラー処理                                    
002560     END-EVALUATE.                                                
002570*                                                                 
002580*----------------------------------------------------------------*
002590*    手形売掛債権ファイルのオープン                              *
002600*----------------------------------------------------------------*
002610     OPEN  INPUT   入力ファイル２.                                
002620*                                                                 
002630*--< ファイルオープンの状態判定 >                                 
002640     EVALUATE  Ｗ－状態                                           
002650        WHEN  ZERO                                                
002660           CONTINUE                                               
002670        WHEN  OTHER                                               
002680*--<       ファイルオープンエラー >                               
002690           MOVE     -20               TO  Ｗ－エラーコード        
002700           PERFORM  エラー処理                                    
002710     END-EVALUATE.                                                
002720*                                                                 
002730*----------------------------------------------------------------*
002740*    契約内容個別情報ファイルのオープン                          *
002750*----------------------------------------------------------------*
002760     OPEN  OUTPUT   出力ファイル.                                 
002770*                                                                 
002780*--< 契約内容個別情報ファイルの状態判定 >                         
002790     EVALUATE  Ｗ－状態                                           
002800        WHEN  ZERO                                                
002810           CONTINUE                                               
002820        WHEN  OTHER                                               
002830*--<       契約内容個別情報ファイルオープンエラー >               
002840           MOVE     -30               TO  Ｗ－エラーコード        
002850           PERFORM  エラー処理                                    
002860     END-EVALUATE.                                                
002870*                                                                 
002880 ファイルオープン－ＥＸＩＴ.                                      
002890     EXIT.                                                        
002900******************************************************************
002910*    ファクタリング基本読込処理                                  *
002920******************************************************************
002930 基本ファイル読込処理                 SECTION.                    
002940 基本ファイル読込処理－ＳＴＡＲＴ.                                
002950*                                                                 
002960     READ  入力ファイル１                                         
002970        AT END                                                    
002980           MOVE  "Y"                  TO  Ｗ－終了－フラグ１      
002990           MOVE  HIGH-VALUE           TO  Ｗ－ＫＥＹ－基本        
003000           GO    TO   基本ファイル読込処理－ＥＸＩＴ              
003010     END-READ.                                                    
003020*                                                                 
003030*--< ファイル読込状態判定 >                                       
003040     EVALUATE  Ｗ－状態                                           
003050        WHEN  ZERO                                                
003060*--<       基本ファイルキーのセット >                             
003070           MOVE   入力１－契約番号    TO  Ｗ－ＫＥＹ－基本        
003080*                                                                 
003090*--<       基本ファイル入力件数のカウント >                       
003100           COMPUTE   Ｗ－入力－件数１  =  Ｗ－入力－件数１ + 1    
003110        WHEN  OTHER                                               
003120*--<       基本ファイル読込エラー >                               
003130           MOVE     -40               TO  Ｗ－エラーコード        
003140           PERFORM  エラー処理                                    
003150     END-EVALUATE.                                                
003160*                                                                 
003170 基本ファイル読込処理－ＥＸＩＴ.                                  
003180     EXIT.                                                        
003190******************************************************************
003200*    ファクタリング手形売掛債権読込処理                          *
003210******************************************************************
003220 手形売掛債権ファイル読込処理         SECTION.                    
003230 手形売掛債権ファイル読込処理－ＳＴＡＲＴ.                        
003240*                                                                 
003250     READ  入力ファイル２                                         
003260        AT END                                                    
003270           MOVE  "Y"                  TO  Ｗ－終了－フラグ２      
003280           MOVE  HIGH-VALUE           TO  Ｗ－ＫＥＹ－手形売掛債権
003290           GO    TO   手形売掛債権ファイル読込処理－ＥＸＩＴ      
003300     END-READ.                                                    
003310*                                                                 
003320*--< ファイル読込状態判定 >                                       
003330     EVALUATE  Ｗ－状態                                           
003340        WHEN  ZERO                                                
003350*--<       手形売掛債権ファイルルキーのセット >                   
003360           MOVE   入力２－契約番号    TO  Ｗ－ＫＥＹ－手形売掛債権
003370*                                                                 
003380*--<       手形売掛債権ファイル入力件数の加算 >                   
003390           COMPUTE   Ｗ－入力－件数２                             
003400                                = Ｗ－入力－件数２ + 1            
003410        WHEN  OTHER                                               
003420*--<       手形売掛債権ファイル読込エラー >                       
003430           MOVE     -50               TO  Ｗ－エラーコード        
003440           PERFORM  エラー処理                                    
003450     END-EVALUATE.                                                
003460*                                                                 
003470 手形売掛債権ファイル読込処理－ＥＸＩＴ.                          
003480     EXIT.                                                        
003490*                                                                 
003500******************************************************************
003510*    契約内容個別情報編集処理                                    *
003520******************************************************************
003530 契約内容個別情報編集処理             SECTION.                    
003540 契約内容個別情報編集処理－ＳＴＡＲＴ.                            
003550*                                                                 
003560*--< 出力レコードの初期化処理 >                                   
003570     MOVE  SPACE                      TO  出力－レコード.         
003580     INITIALIZE                           出力－レコード.         
003590*                                                                 
003600*--< NO.1 >                                                       
003610     MOVE  入力１－契約番号           TO  出力－契約番号.         
003620*--< No.2 >                                                       
003630     MOVE  ZERO                       TO  出力－再リース回数.     
003640*--< No.3 >                                                       
003650     IF   入力１－業務区分 = 1                                    
003660          MOVE   "00"                 TO  出力－対抗要件          
003670     ELSE IF 入力１－業務区分 = 2                                 
003680          MOVE  "01"                  TO  出力－対抗要件          
003690     END-IF.                                                      
003700*--< NO.4 >                                                       
003710     MOVE  入力２－割引料             TO  出力－割引料.           
003720*--< NO.5 >                                                       
003730     MOVE  入力２－受取手数料         TO  出力－受取手数料.       
003740*--< NO.6 >                                                       
003750     MOVE  入力２－受取手数料消費税等額                           
003760                                      TO  出力－受取手数料消費税. 
003770*--< NO.7 >                                                       
003780     MOVE  ZERO                       TO  出力－取立手数料.       
003790*--< NO.8 >                                                       
003800     MOVE  ZERO                       TO  出力－取立手数料消費税. 
003810*--< NO.9 >                                                       
003820     MOVE  入力１－利率基数コード     TO  出力－利率基数区分.     
003830*--< NO.10 >                                                      
003840     MOVE  入力１－利息端数処理コード TO  出力－利息端数区分.     
003850*--< NO.11 >                                                      
003860     MOVE  入力１－片端両端区分       TO  出力－片端両端区分.     
003870*--< NO.12 >                                                      
003880     MOVE  入力１－休日対応区分       TO  出力－休日対応区分.     
003890*--< NO.13 >                                                      
003900     MOVE  入力１－前取後取区分       TO  出力－利息計算区分.     
003910*--< NO.14 >                                                      
003920     MOVE  ZERO                       TO  出力－初回利息区分.     
003930*--< NO.15 >                                                      
003940     MOVE  入力１－月利複利率         TO  出力－実質年率.         
003950*--< No.16 >                                                      
003960     MOVE  入力１－スプレッド         TO  出力－スプレッド.       
003970*--< No.17 >                                                      
003980     MOVE   入力２－利息期日          TO  Ｗ－利息期日.           
003990     PERFORM  利息日西暦変換.                                     
004000     MOVE  Ｗ－利息日西暦             TO  出力－初回元本回収日.   
004010*--< No.18 >                                                      
004020     MOVE  "1"                        TO  出力－元本サイクル.     
004030*--< No.19 >                                                      
004040     MOVE  "1"                        TO  出力－元本回数.         
004050*--< No.20 >                                                      
004060     MOVE   入力２－利息期日          TO  Ｗ－利息期日.           
004070     PERFORM  利息日西暦変換.                                     
004080     MOVE  Ｗ－利息日西暦             TO  出力－初回利息回収日.   
004090*--< No.21 >                                                      
004100     MOVE  "1"                        TO  出力－利息サイクル.     
004110*--< NO.22 >                                                      
004120     MOVE  "1"                        TO  出力－利息回数.         
004130*--< No.23 >                                                      
004140     MOVE  "0"                        TO  出力－見直しサイクル.   
004150*--< NO.24 >                                                      
004160     MOVE   入力２－利息期日          TO  Ｗ－利息期日.           
004170     PERFORM  利息日西暦変換.                                     
004180     MOVE  Ｗ－利息日西暦             TO  出力－利率確定期限.     
004190*--< NO.25 >                                                      
004200     MOVE  ZERO                       TO  出力－第１回返済日.     
004210*--< NO.26 >                                                      
004220     MOVE  ZERO                       TO  出力－第２回返済日.     
004230*--< NO.27 >                                                      
004240     MOVE  SPACE                      TO  出力－裏付取引.         
004250*--< NO.28 >                                                      
004260     MOVE  SPACE                      TO  出力－担保コメント.     
004270*--< NO.29 >                                                      
004280     MOVE  SPACE                      TO  出力－確認コメント.     
004290*--< NO.30 >                                                      
004300     IF   入力１－業務区分 = 1                                    
004310          MOVE   入力２－手形裏書方法 TO  出力－手形裏書方法      
004320     ELSE                                                         
004330          MOVE   ZERO                 TO  出力－手形裏書方法      
004340     END-IF.                                                      
004350*--< NO.31 >                                                      
004360     MOVE  Ｗ－システム日付           TO  出力－登録年月日.       
004370*--< NO.32 >                                                      
004380     MOVE  Ｗ－システム時刻           TO  出力－登録時間.         
004390*--< NO.33 >                                                      
004400     MOVE  Ｗ－担当者                 TO  出力－登録担当者.       
004410*--< NO.34 >                                                      
004420     MOVE  Ｗ－システム日付           TO  出力－更新年月日.       
004430*--< NO.35 >                                                      
004440     MOVE  Ｗ－システム時刻           TO  出力－更新時間.         
004450*--< NO.36 >                                                      
004460     MOVE  Ｗ－担当者                 TO  出力－更新者.           
004470*--< NO.37 >                                                      
004480     MOVE  Ｗ－担当者                 TO  出力－入力担当者コード. 
004490*--< NO.38 >                                                      
004500     MOVE  ZERO                       TO  出力－新規書替区分.     
004510*--< NO.39 >                                                      
004520     MOVE  ZERO                       TO  出力－書替先契約番号.   
004530*                                                                 
004540     PERFORM   契約内容個別情報ファイル出力処理.                  
004550*                                                                 
004560  契約内容個別情報編集処理－ＥＸＩＴ.                             
004570     EXIT.                                                        
004580******************************************************************
004590*    利息日を西暦変換                                            *
004600******************************************************************
004610 利息日西暦変換                       SECTION.                    
004620 利息日西暦変換－ＳＴＡＲＴ.                                      
004630*                                                                 
004640     EVALUATE  Ｗ－利息期日                                       
004650       WHEN  ZERO                                                 
004660         MOVE  ZERO                    TO  Ｗ－利息日西暦         
004670       WHEN  OTHER                                                
004680         EVALUATE  Ｗ－利息期日 (1:1)                             
004690            WHEN  "0"                                             
004700              MOVE  "19"               TO  Ｗ－利息日西暦(1:2)    
004710            WHEN  "1"                                             
004720              MOVE  "20"               TO  Ｗ－利息日西暦(1:2)    
004730         END-EVALUATE                                             
004740         MOVE  Ｗ－利息期日 (2:6)      TO  Ｗ－利息日西暦(3:6)    
004750     END-EVALUATE.                                                
004760*                                                                 
004770 利息日西暦変換－ＥＸＩＴ.                                        
004780     EXIT.                                                        
004790*                                                                 
004800******************************************************************
004810*    契約内容個別情報ファイル出力処理                            *
004820******************************************************************
004830 契約内容個別情報ファイル出力処理     SECTION.                    
004840 契約内容個別情報ファイル出力処理－ＳＴＡＲＴ.                    
004850*                                                                 
004860     WRITE  出力－レコード.                                       
004870*                                                                 
004880*--< 契約内容個別情報ファイル出力件数の状態判定 >                 
004890     EVALUATE  Ｗ－状態                                           
004900        WHEN  ZERO                                                
004910*--<       契約内容個別情報ファイル出力件数の加算 >               
004920           COMPUTE  Ｗ－出力－件数 =  Ｗ－出力－件数 + 1          
004930        WHEN  OTHER                                               
004940*--<       契約内容個別情報ファイル出力エラー >                   
004950           MOVE     -60               TO  Ｗ－エラーコード        
004960           PERFORM  エラー処理                                    
004970     END-EVALUATE.                                                
004980*                                                                 
004990 契約内容個別情報ファイル出力処理－ＥＸＩＴ.                      
005000     EXIT.                                                        
005010******************************************************************
005020*    終了処理                                                    *
005030******************************************************************
005040 終了処理                             SECTION.                    
005050 終了処理－ＳＴＡＲＴ.                                            
005060*                                                                 
005070*----------------------------------------------------------------*
005080*    ファイルクローズ                                            *
005090*----------------------------------------------------------------*
005100     CLOSE  入力ファイル１.                                       
005110     CLOSE  入力ファイル２.                                       
005120     CLOSE  出力ファイル.                                         
005130*                                                                 
005140*--< 終了メッセージ出力処理 >                                     
005150     PERFORM  終了メッセージ出力.                                 
005160*                                                                 
005170*--< プログラム正常終了 >                                         
005180     MOVE  定数－正常状態             TO  PROGRAM-STATUS.         
005190*                                                                 
005200 終了処理－ＥＸＩＴ.                                              
005210     EXIT.                                                        
005220*                                                                 
005230******************************************************************
005240*    終了メッセージ出力                                          *
005250******************************************************************
005260  終了メッセージ出力                  SECTION.                    
005270  終了メッセージ出力－ＳＴＡＲＴ.                                 
005280*----------------------------------------------------------------*
005290*    ファクタリング基本ファイル入力件数                          *
005300*----------------------------------------------------------------*
005310     INITIALIZE                       IF-CHOCO001.                
005320     MOVE  "3"                        TO  共１－イベント種別.     
005330     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
005340     MOVE  "0"                        TO  共１－復帰コード.       
005350     MOVE  "FFUIS326"                 TO  共１－処理テーブルＩＤ. 
005360     MOVE  "COUNT"                    TO  共１－処理識別.         
005370     MOVE  Ｗ－入力－件数１           TO  共１－データ内容.       
005380     MOVE  "ファクタリング基本読込件数"                           
005390                                      TO  共１－その他メッセージ. 
005400     CALL  CLOCO001                USING  IF-CHOCO001.            
005410*                                                                 
005420*----------------------------------------------------------------*
005430*    ファクタリング手形売掛債権入力件数                          *
005440*----------------------------------------------------------------*
005450     INITIALIZE                       IF-CHOCO001.                
005460     MOVE  "3"                        TO  共１－イベント種別.     
005470     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
005480     MOVE  "0"                        TO  共１－復帰コード.       
005490     MOVE  "FFUIS329"                 TO  共１－処理テーブルＩＤ. 
005500     MOVE  "COUNT"                    TO  共１－処理識別.         
005510     MOVE   Ｗ－入力－件数２          TO  共１－データ内容.       
005520     MOVE  "ファクタリング手形売掛債権読込件数"                   
005530                                      TO  共１－その他メッセージ. 
005540     CALL  CLOCO001                USING  IF-CHOCO001.            
005550*                                                                 
005560*----------------------------------------------------------------*
005570*    契約内容個別情報ファイル出力件数                            *
005580*----------------------------------------------------------------*
005590     INITIALIZE                       IF-CHOCO001.                
005600     MOVE  "3"                        TO  共１－イベント種別.     
005610     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
005620     MOVE  "0"                        TO  共１－復帰コード.       
005630     MOVE  "FFUIS32A"                 TO  共１－処理テーブルＩＤ. 
005640     MOVE  "COUNT"                    TO  共１－処理識別.         
005650     MOVE   Ｗ－出力－件数            TO  共１－データ内容.       
005660     MOVE  " 契約内容個別情報ファイル出力件数"                    
005670                                      TO  共１－その他メッセージ. 
005680     CALL  CLOCO001                USING  IF-CHOCO001.            
005690*                                                                 
005700*----------------------------------------------------------------*
005710*    終了メッセージ 出力                                         *
005720*----------------------------------------------------------------*
005730     INITIALIZE                       IF-CHOCO001.                
005740     MOVE  "3"                        TO  共１－イベント種別.     
005750     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
005760     MOVE  "0"                        TO  共１－復帰コード.       
005770     MOVE  "END"                      TO  共１－処理識別.         
005780     MOVE  定数－プログラム名         TO  共１－その他メッセージ. 
005790     CALL  CLOCO001                USING  IF-CHOCO001.            
005800*                                                                 
005810 終了メッセージ出力－ＥＸＩＴ.                                    
005820     EXIT.                                                        
005830*                                                                 
005840******************************************************************
005850*    エラー処理                                                  *
005860******************************************************************
005870 エラー処理                           SECTION.                    
005880 エラー処理－ＳＴＡＲＴ.                                          
005890*                                                                 
005900     MOVE  "Y"                        TO  Ｗ－異常終了－フラグ.   
005910     INITIALIZE                           IF-CHOCO001.            
005920*                                                                 
005930     EVALUATE  Ｗ－エラーコード                                   
005940        WHEN  -10                                                 
005950*--<       基本ファイループンエラー >                             
005960           MOVE  "1"                  TO  共１－イベント種別      
005970           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
005980           MOVE  "9"                  TO  共１－復帰コード        
005990           MOVE  "FFUIS326"           TO  共１－処理テーブルＩＤ  
006000           MOVE  "OPEN"               TO  共１－処理識別          
006010           MOVE  Ｗ－状態             TO  共１－データ内容        
006020           MOVE  "基本ファイループンエラー "                      
006030                                      TO  共１－その他メッセージ  
006040           CALL  CLOCO001          USING  IF-CHOCO001             
006050*                                                                 
006060        WHEN  -20                                                 
006070*--<       手形売掛債権ファイループンエラー >                     
006080           MOVE  "1"                  TO  共１－イベント種別      
006090           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
006100           MOVE  "9"                  TO  共１－復帰コード        
006110           MOVE  "FFUIS329"           TO  共１－処理テーブルＩＤ  
006120           MOVE  "OPEN"               TO  共１－処理識別          
006130           MOVE  Ｗ－状態             TO  共１－データ内容        
006140           MOVE  "手形売掛債権ファイループンエラー "              
006150                                      TO  共１－その他メッセージ  
006160           CALL  CLOCO001          USING  IF-CHOCO001             
006170*                                                                 
006180        WHEN  -30                                                 
006190*--<       契約内容個別情報ファイルオープンエラー >               
006200           MOVE  "1"                  TO  共１－イベント種別      
006210           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
006220           MOVE  "9"                  TO  共１－復帰コード        
006230           MOVE  "FFUIS32A"           TO  共１－処理テーブルＩＤ  
006240           MOVE  "OPEN"               TO  共１－処理識別          
006250           MOVE  Ｗ－状態             TO  共１－データ内容        
006260           MOVE  "契約内容個別情報ファイルオープンエラー "        
006270                                      TO  共１－その他メッセージ  
006280           CALL  CLOCO001          USING  IF-CHOCO001             
006290*                                                                 
006300        WHEN  -40                                                 
006310*--<       基本ファイル読込エラー  >                              
006320           MOVE  "1"                  TO  共１－イベント種別      
006330           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
006340           MOVE  "9"                  TO  共１－復帰コード        
006350           MOVE  "FFUIS326"           TO  共１－処理テーブルＩＤ  
006360           MOVE  "READ"               TO  共１－処理識別          
006370           MOVE  Ｗ－状態             TO  共１－データ内容        
006380           MOVE  "ファクタリング基本読込エラー "                  
006390                                      TO  共１－その他メッセージ  
006400           CALL  CLOCO001          USING  IF-CHOCO001             
006410*                                                                 
006420        WHEN  -50                                                 
006430*--<       手形売掛債権ファイル読込エラー >                       
006440           MOVE  "1"                  TO  共１－イベント種別      
006450           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
006460           MOVE  "9"                  TO  共１－復帰コード        
006470           MOVE  "FFUIS329"           TO  共１－処理テーブルＩＤ  
006480           MOVE  "READ"               TO  共１－処理識別          
006490           MOVE  Ｗ－状態             TO  共１－データ内容        
006500           MOVE  "ファクタリング手形売掛債権読込エラー "          
006510                                      TO  共１－その他メッセージ  
006520           CALL  CLOCO001          USING  IF-CHOCO001             
006530*                                                                 
006540        WHEN  -60                                                 
006550*--<       契約内容個別情報ファイル出力エラー >                   
006560           MOVE  "1"                  TO  共１－イベント種別      
006570           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
006580           MOVE  "9"                  TO  共１－復帰コード        
006590           MOVE  "FFUIS32A"           TO  共１－処理テーブルＩＤ  
006600           MOVE  "WRITE"              TO  共１－処理識別          
006610           MOVE  Ｗ－状態             TO  共１－データ内容        
006620           MOVE  " 契約内容個別情報ファイル出力エラー "           
006630                                      TO  共１－その他メッセージ  
006640           CALL  CLOCO001          USING  IF-CHOCO001             
006650*                                                                 
006660        WHEN  OTHER                                               
006670           MOVE  "N"                  TO  Ｗ－異常終了－フラグ    
006680*                                                                 
006690     END-EVALUATE.                                                
006700*                                                                 
006710     IF  Ｗ－異常終了－フラグ  =  "Y"                             
006720        PERFORM  終了メッセージ出力                               
006730*                                                                 
006740*--<    プログラム異常終了のリターンコード >                      
006750        MOVE  定数－異常状態          TO  PROGRAM-STATUS          
006760*                                                                 
006770        EXIT  PROGRAM                                             
006780     END-IF.                                                      
006790*                                                                 
006800 エラー処理－ＥＸＩＴ.                                            
006810      EXIT.                                                       
006820******************************************************************
006830*                  END OF PROGRAM                                *
006840******************************************************************
