000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CH96.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060        SELECT STUDENT-FILE ASSIGN TO DISK
000070                ORGANIZATION IS RELATIVE
000080                ACCESS MODE IS SEQUENTIAL
000090                RELATIVE KEY IS R-KEY.
000100 DATA DIVISION.
000110 FILE SECTION.
000120 FD STUDENT-FILE LABEL RECORD IS STANDARD
000130                VALUE OF FIlE-ID IS "ST.DAT".
000140 01 ST-REC.
000150  03 NAME PIC X(20).
000160  03 MARKS.
000170    05 MATH   PIC 9(3)V99.
000180    05 ENG    PIC 9(3)V99.
000190    05 POLI   PIC 9(3)V99.
000200 WORKING-STORAGE SECTION.
000210 77 R-KEY  PIC 9(4).
000220 PROCEDURE DIVISION.
000230 G.
000240        OPEN OUTPUT STUDENT-FILE.             
000250        DISPLAY "INPUT STUDENT NUMBERS".
000260        ACCEPT R-KEY.
000270        PERFORM A UNTIL R-KEY = 9999.
000280        CLOSE STUDENT-FILE.
000290        STOP RUN.
000300 A.
000310        DISPLAY "INPUT NAMES".
000320        ACCEPT NAME.
000330        DISPLAY "INPUT MARKS".
000340        DISPLAY "INPUT MATHMATICS MARK".
000350        ACCEPT MATH.
000360        DISPLAY "INPUT ENGLISH MARK".
000370        ACCEPT ENG.
000380        DISPLAY "INPUT POLIC MARK".
000390        ACCEPT POLI.
000400        WRITE ST-REC INVALID KEY DISPLAY "NUMBERS IS ERROR".
000410        DISPLAY "INPUT NUMBERS".
000420        ACCEPT R-KEY.
000430