       IDENTIFICATION             DIVISION.
       PROGRAM-ID.      EXAM29.
       ENVIRONMENT                DIVISION.
       DATA                       DIVISION.
       WORKING-STORAGE    SECTION.
       77   MON-HOURS   PIC  IS  9(2).
       77   TUES-HOURS  PIC  IS  9(2).
       77   WED-HOURS   PIC  IS  9(2).
       77   THUS-HOURS  PIC  IS  9(2).
       77   FRI-HOURS   PIC  IS   9(2).
       77   SAT-HOURS   PIC  IS   9(2).
       77   TOTAL-HOURS  PIC  IS  9(2) VALUE 00.
       77   OVERTIME-HOURS  PIC  IS  9(2) VALUE 00.
       77   GROSS-PAY  PIC  IS  9(4)V9.
       77   OVERTIME-PAY PIC  IS  9(4)V9.
       77   WITHHOLDING PIC IS  9(4)V9.
       77   NET-PAY PIC IS  9(4)V9.
       77   RATE PIC IS  9V9  VALUE 0.2.
       77   PAY-RATE PIC IS  9(3) VALUE 011.
       77   OVERTIME-RATE PIC IS  99V9 VALUE 0.0.
       PROCEDURE    DIVISION.
       S.  ACCEPT   MON-HOURS.
           ACCEPT   TUES-HOURS.
           ACCEPT   WED-HOURS.
           ACCEPT   THUS-HOURS.
           ACCEPT   FRI-HOURS.
           ACCEPT   SAT-HOURS.
           ADD  MON-HOURS, TUES-HOURS, WED-HOURS, THUS-HOURS
            FRI-HOURS, SAT-HOURS  GIVING  TOTAL-HOURS.
           MULTIPLY TOTAL-HOURS BY PAY-RATE GIVING GROSS-PAY.
           IF TOTAL-HOURS > 48
              MULTIPLY PAY-RATE BY 0.5  GIVING  OVERTIME-RATE.
              SUBTRACT 48 FROM TOTAL-HOURS  GIVING  OVERTIME-HOURS.
              MULTIPLY OVERTIME-HOURS BY OVERTIME-RATE  GIVING
                OVERTIME-PAY.
              ADD OVERTIME-PAY TO GROSS-PAY.
           MULTIPLY GROSS-PAY BY RATE GIVING WITHHOLDING.
           SUBTRACT WITHHOLDING FROM GROSS-PAY GIVING NET-PAY.
           DISPLAY  GROSS-PAY.
           DISPLAY  WITHHOLDING.
           DISPLAY  NET-PAY.
           STOP  RUN.
