 IDENTIFICATION DIVISION.
*
 PROGRAM-ID.   EXAM10-3.
*
 ENVIRONMENT   DIVISION.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
       SELECT  IN-FILE  ASSIGN TO IN-FILE.
       SELECT  DA-FILE  ASSIGN TO INDE.
               ORGANIZATION  IS  INDEXED
               ACCESS MODE IS SEQUENTIAL
               RECORD KEY IS DA-PRODUCT-CODE.
*
 DATA  DIVISION.
 FILE SECTION.
 FD  IN-FILE LABEL RECORD IS STANDARD
     DATA RECORD IS CORREC.
 01 INREC.
    02 IN-PRODUCT-CODE  PIC X(4).
    02 IN-PRODUCT-NAME  PIC X(10).
    02 IN-UNIT-PRICE    PIC 9(7).
 FD  DA-FILE LABEL RECORD IS STANDARD
        DATA  RECORD IS DAREC.
 01 DAREC.
    02 DA-PRODUCT-CODE  PIC X(4).
    02 DA-PRODUCT-NAME  PIC X(10).
    02 DA-UNIT-PRICE    PIC 9(7).
 WORKING-STORAGE SECTION.
 77 END-SWITCH  PIC X(4).
*
 PROCEDURE  DIVISION.
 START-RUN.
      OPEN  INPUT  IN-FILE
            OUTPUT  DA-FILE.
      MOVE SPACE TO END-SWITCH.
      READ IN-FILE
         AT END MOVE HIGH-VALUE TO END-SWITCH.
      PERFORM RECORD-PROCESSING THRU RECORD-EXIT
             UNTIL END-SWITCH = HIGH-VALUE.
      CLOSE IN-FILE DA-FILE.
      STOP  RUN.
*
 RECORD-PROCESSING.
      MOVE IN-PRODUCT-CODE TO DA-PRODUCT-CODE.
      MOVE IN-PRODUCT-NAME TO DA-PRODUCT-NAME.
      MOVE IN-UNIT-PRICE TO DA-UNIT-PRICE.
      WRITE DAREC  INVALID KEY
           DISPLAY'INVALID KEY INPUT=', DAREC.
      READ IN-FILE AT END
           MOVE HIGH-VALUE TO END-SWITCH.
      RECORD-EXIT. EXIT.
