000010 IDENTIFICATION                   DIVISION.
000020 PROGRAM-ID.                      99SUB1.
000030 ENVIRONMENT                      DIVISION.
000040 DATA                             DIVISION.
000050 WORKING-STORAGE                  SECTION.
000060 01 L-MARK                   PIC       9.
000070 01 R-MARK                   PIC       9.
000080 01 DATA-SET.
000091  02 MULTI-NUM          PIC       9.
000092  02 MULTI-MARK         PIC       X VALUE "*".
000093  02 MULTIED-NUM        PIC       9.
000094  02 EQUAL-MARK         PIC       X VALUE "=".
000095  02 RESULT             PIC       99.
000096  02 FILLER             PIC       X VALUE " ".
000098 LINKAGE                          SECTION.
000099 01 TABLE-99.
000100   02 L OCCURS 9 TIMES.
000101    03 R OCCURS 9 TIMES PIC 9(7).
000102 77 NUM                 PIC       X.
000103 PROCEDURE                        DIVISION USING TABLE-99 NUM.
000110 PRG-BEGIN.
000120     PERFORM L-PART THRU L-END UNTIL L-MARK = NUM.
000130 PRG-END.
000133     EXIT PROGRAM.
000140 L-PART.
000141     IF L-MARK NOT = NUM
000142     INITIALIZE R-MARK
000143     ADD 1 TO L-MARK
000150     PERFORM R-PART THRU R-END UNTIL R-MARK = L-MARK
000151     DISPLAY L(L-MARK).
000180 L-END.
000190     EXIT.
*
000200 R-PART.
000201     IF R-MARK NOT = L-MARK
000202     ADD 1 TO R-MARK
000203     MOVE L-MARK TO MULTI-NUM
000204     MOVE R-MARK TO MULTIED-NUM
000205     COMPUTE RESULT = MULTI-NUM * MULTIED-NUM
000206     MOVE DATA-SET TO R(L-MARK, R-MARK).
000210 R-END.
000220     EXIT.    
