//EXT31RUN JOB ,'RUNS COB PROGRAM',
//        CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP010  EXEC PGM=DSREWR
//STEPLIB  DD   DSN=EXT31.ALL.LOADLIB,DISP=SHR
//SYSIN    DD   *
//TESTIN   DD   DSN=EXT31.ALL.COBOLS(TESTPS),DISP=SHR
//SYSPRINT DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//
