000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. CH102.
000030 ENVIRONMENT DIVISION.
000040 INPUT-OUTPUT SECTION.
000050 FILE-CONTROL.
000060       SELECT PRINT-FILE ASSIGN TO PRINTER.
000070 DATA DIVISION.
000080 FILE SECTION.
000090 FD PRINT-FILE LABEL RECORD IS OMITTED.
000100 01 P-REC PIC X(80).
000110 WORKING-STORAGE SECTION.
000120 77 N PIC 99 VALUE 0.
000130 01 STAR.
000140   03 S1 PIC X(7) VALUE "   *   ".
000150   03 S2 PIC X(7) VALUE "  ***  ".
000160   03 S3 PIC X(7) VALUE " ***** ".
000170   03 S4 PIC X(7) VALUE "*******".
000180  01 STAR-TABLE REDEFINES STAR.
000190  03 STAR-T PIC X(7) OCCURS 4 TIMES.
000200 PROCEDURE DIVISION.
000210 G.    OPEN OUTPUT PRINT-FILE.
000220       PERFORM P 4 TIMES.
000230       CLOSE PRINT-FILE.
000240       STOP RUN.   ,
000250 P.      ADD 1 TO N.
000260       WRITE P-REC FROM STAR-T(N).    
000270