000010******************************************************************
000020*         ＜海輝軟件(大連)＞                                     *
000030*      1. プログラム名  : 経理締処理（帳票作成）                 *
000040*                         リース前受関連帳票抽出                 *
000050*      2. プログラムID  : AAASED25                               *
000060*      3. 処理概要      : 前受情報ＤＢをメインに、マスタと表     *
000061*                          結合して                              *
000070*                         読込 前受金受払残高中間ファイルを      *
000071*                          作成する*                             *
000080*                                                                *
000090*      4. 作成者        : 王宏傑                                 *
000100*      5. 作成日        : 2005.03.25                             *
000110******************************************************************
000120*                                                                 
000130******************************************************************
000140*    ＩＤＥＮＴＩＦＩＣＡＴＩＯＮ  ＤＩＶＩＳＩＯＮ              *
000150******************************************************************
000160 IDENTIFICATION                       DIVISION.                   
000170*                                                                 
000180 PROGRAM-ID.                          AAASED25.                   
000190******************************************************************
000200*    ＥＮＶＩＲＯＮＭＥＮＴ        ＤＩＶＩＳＩＯＮ              *
000210******************************************************************
000220 ENVIRONMENT                          DIVISION.                   
000230******************************************************************
000240*    ＩＮＰＵＴ－ＯＵＴＰＵＴ      ＳＥＣＴＩＯＮ                *
000250******************************************************************
000260 INPUT-OUTPUT                         SECTION.                    
000270*                                                                 
000280 FILE-CONTROL.                                                    
000290     SELECT    出力ファイル            ASSIGN    TO     U11       
000300     FILE      STATUS     IS          Ｗ－状態                    
000310     ORGANIZATION         IS          LINE      SEQUENTIAL. 
000320******************************************************************
000330*    ＤＡＴＡ                      ＤＩＶＩＳＩＯＮ              *
000340******************************************************************
000350 DATA                                 DIVISION.                   
000360******************************************************************
000370*    ＦＩＬＥ                      ＳＥＣＴＩＯＮ                *
000380******************************************************************
000390 FILE                                 SECTION.                    
000400*----------------------------------------------------------------*
000410*    出力ファイル  前受金受払残高中間ファイル                     
000420*----------------------------------------------------------------*
000430 FD  出力ファイル                                                 
000440     LABEL     RECORD     IS          STANDARD                    
000450     BLOCK     CONTAINS   0           RECORDS.                    
000460*                                                                 
000470 01  出力－レコード.                                              
000480     COPY  CPSCE50  REPLACING  ==()==  BY  ==出力－==.  
000490*  ＷＯＲＫＩＮＧ－ＳＴＯＲＡＧＥ  ＳＥＣＴＩＯＮ                *
000500******************************************************************
000510  WORKING-STORAGE                     SECTION.                    
000520*----------------------------------------------------------------*
000530*    ホスト変数定義エリア                                        *
000540*----------------------------------------------------------------*
000550     EXEC  SQL  BEGIN  DECLARE        SECTION  END-EXEC.          
000560*--< 項目名称マスタの名称 >                                       
000570     01 項目名称マスタの名称.                                     
000580        03 ＷＳ－名称１               PIC  X(60).                 
000590	      03 ＷＳ－名称２               PIC  X(60).                 
000600*--< ＯＲＡＣＬＥ共通変数 >                                       
000610     EXEC  SQL  INCLUDE  SQLCOM.CBL            END-EXEC.          
000620*                        M40MAB.CBL                               
000630*--< ＯＲＡＣＬＥ  ＳＱＬ実行情報 >                               
000640     EXEC  SQL  INCLUDE  SQLCA.COB             END-EXEC.          
000650*                                                                 
000660*--< 前受情報ＤＢ >                                               
000670     EXEC  SQL  INCLUDE  M40MAB.CBL            END-EXEC.          
000680*                                                                 
000690*--< 業務管理テーブル >                                           
000700     EXEC  SQL  INCLUDE  D70GYM.CBL            END-EXEC.          
000710*                                                                 
000720*--< 取引先マスタ>                                                
000730     EXEC  SQL  INCLUDE  D01TRS.CBL            END-EXEC.          
000740*                                                                 
000750*--< 請求先マスタ >                                               
000760     EXEC  SQL  INCLUDE  D02SQS.CBL            END-EXEC.          
000770*--< 項目名称マスタ >                                             
000780     EXEC  SQL  INCLUDE  D19MSY.CBL            END-EXEC.          
000790*--< 債権情報（一般）ＤＢ >                                       
000800     EXEC  SQL  INCLUDE  M01SAJ.CBL            END-EXEC.          
000810*                                                                 
000820     EXEC  SQL  END  DECLARE          SECTION  END-EXEC.          
000830*                                                                 
000840*----------------------------------------------------------------*
000850*    ＷＯＲＫエリア                                              *
000860*----------------------------------------------------------------*
000870 01  ＷＯＲＫ－エリア.                                            
000880*--< エラー判定用 >                                               
000890     03  Ｗ－エラーコード             PIC S9(04).                 
000900*                                                                 
000910*--< フラグアリア >                                               
000920     03  フラグアリア.                                            
000930         05  Ｗ－終了－フラグ         PIC  X(01).                 
000940         05  Ｗ－異常終了－フラグ     PIC  X(01).                 
000950*                                                                 
000960*--< 件数エリア >                                                 
000970     03  件数エリア.                                              
000980         05  Ｗ－入力－件数           PIC  9(09).                 
000990         05  Ｗ－出力－件数           PIC  9(09).                 
001000*----------------------------------------------------------------*
001010*    サブルーチン名                                              *
001020*----------------------------------------------------------------*
001030 01  CALL-AREA.                                                   
001040*--< 共通ログサブルーチン >                                       
001050     03  CLOCO001                     PIC  X(08) VALUE "CLOCO001".
001060     03  COBCO001                     PIC  X(08) VALUE "COBCO001".
001070*                                                                 
001080*----------------------------------------------------------------*
001090*    ＣＯＰＹ領域                                                *
001100*----------------------------------------------------------------*
001110*--< 共通ログ用パラメータ >                                       
001120 01  IF-CHOCO001.                                                 
001130     COPY  CHOCO001  REPLACING  ==()==  BY  ==共１－==.           
001140*                                                                 
001150*----------------------------------------------------------------*
001160*    ＩＮＩファイル読込サブルーチン用パラメタ領域                *
001170*----------------------------------------------------------------*
001180 01  PARA-AREA.                                                   
001190     COPY CPBCO001.                                               
001200******************************************************************
001210*    定数用データ定義エリア                                      *
001220******************************************************************
001230 CONSTANT                             SECTION.                    
001240 01  定数領域.                                                    
001250     03  定数－プログラムＩＤ         PIC  X(08) VALUE "AAASED25".
001260     03  定数－プログラム名           PIC  X(80)                  
001270                               VALUE "前受金受払残高ファイル作成" 
001280     03  定数－ＳＱＬＯＫ             PIC S9(04)  VALUE  ZERO.    
001290     03  定数－ＳＱＬＥＮＤ           PIC S9(04)  VALUE  0100.    
001300     03  定数－正常状態               PIC S9(04)  VALUE  ZERO.    
001310     03  定数－異常状態               PIC S9(04)  VALUE  0009.    
001320******************************************************************
001330*    ＰＲＯＣＥＤＵＲＥ            ＤＩＶＩＳＩＯＮ              *
001340******************************************************************
001350 PROCEDURE                            DIVISION.                   
001360*                                                                 
001370     PERFORM  初期処理.                                           
001380*                                                                 
001390     PERFORM  主処理  UNTIL  Ｗ－終了－フラグ  =  "Y".            
001400*                                                                 
001410     PERFORM  終了処理.                                           
001420*                                                                 
001430     STOP     RUN.                                                
001440*                                                                 
001450******************************************************************
001460*    初期処理                                                    *
001470******************************************************************
001480 初期処理                             SECTION.                    
001490 初期処理－ＳＴＡＲＴ.                                            
001500*                                                                 
001510*----------------------------------------------------------------*
001520*    開始メッセージ出力処理                                      *
001530*----------------------------------------------------------------*
001540     INITIALIZE                       IF-CHOCO001.                
001550     MOVE  "3"                        TO  共１－イベント種別.     
001560     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
001570     MOVE  "0"                        TO  共１－復帰コード.       
001580     MOVE  "START"                    TO  共１－処理識別.         
001590     MOVE  定数－プログラム名         TO  共１－その他メッセージ. 
001600     CALL  CLOCO001                USING  IF-CHOCO001.            
001610*                                                                 
001620*----------------------------------------------------------------*
001630*    作業領域の初期値処理                                        *
001640*----------------------------------------------------------------*
001650     MOVE  SPACE                      TO  ＷＯＲＫ－エリア.       
001660     INITIALIZE                           ＷＯＲＫ－エリア.       
001670*--< ＯＲＡＣＬＥ接続 >                                           
001680     PERFORM   ＯＲＡＣＬＥ接続.                                  
001690*                                                                 
001700*--< 業務管理テーブル読込  >                                      
001710     PERFORM  業務管理テーブル読込.                               
001720*--< 結合テーブルカーソル宣言 >                                   
001730     PERFORM  結合テーブルカーソル定義.                           
001740*                                                                 
001750*--< ファイルオープン >                                           
001760     PERFORM  ファイルオープン.                                   
001770*                                                                 
001780*--< 結合テーブルカーソル読込(１件目) >                           
001790     PERFORM  結合テーブルカーソル読込.                           
001800*                                                                 
001810 初期処理－ＥＸＩＴ.                                              
001820     EXIT.                                                        
001830******************************************************************
001840*    ＯＲＡＣＬＥ接続                                            *
001850******************************************************************
001860 ＯＲＡＣＬＥ接続                     SECTION.                    
001870 ＯＲＡＣＬＥ接続－ＳＴＡＲＴ.                                    
001880*                                                                 
001890*--< ＤＢ接続用情報を取得処理 >                                   
001900     CALL  COBCO001                USING  PARA-AREA.              
001910*                                                                 
001920     MOVE  PARA-DBSTRING              TO  DB-STRING.              
001930     MOVE  PARA-USERNAME              TO  USERNAME.               
001940     MOVE  PARA-PASSWORD              TO  PASSWD.                 
001950*                                                                 
001960*----------------------------------------------------------------*
001970*    開始接続                                                    *
001980*----------------------------------------------------------------*
001990     IF    DB-STRING  =  SPACE                                    
002000        EXEC SQL                                                  
002010           CONNECT  :USERNAME IDENTIFIED BY :PASSWD               
002020        END-EXEC                                                  
002030     ELSE                                                         
002040        EXEC SQL                                                  
002050           CONNECT  :USERNAME IDENTIFIED BY :PASSWD               
002060             USING  :DB-STRING                                    
002070        END-EXEC                                                  
002080     END-IF.                                                      
002090*                                                                 
002100*----------------------------------------------------------------*
002110*    接続確認                                                    *
002120*----------------------------------------------------------------*
002130     EVALUATE  SQLCODE                                            
002140        WHEN   定数－ＳＱＬＯＫ                                   
002150           CONTINUE                                               
002160        WHEN   OTHER                                              
002170*--<       接続エラー >                                           
002180           MOVE     -10               TO  Ｗ－エラーコード        
002190           PERFORM  エラー判定処理                                
002200     END-EVALUATE.                                                
002210*                                                                 
002220 ＯＲＡＣＬＥ接続－ＥＸＩＴ.                                      
002230     EXIT.                                                        
002240******************************************************************
002250*        業務管理テーブル読込                                    *
002260******************************************************************
002270 業務管理テーブル読込                     SECTION.                
002280 業務管理テーブル読込－ＳＴＡＲＴ.                                
002290*                                                                 
002300*----------------------------------------------------------------*
002310*    業務管理テーブル読込処理                                    *
002320*----------------------------------------------------------------*
002330     EXEC SQL                                                     
002340           SELECT  バッチ用業務年月                               
002350             INTO  Ｄ７０－バッチ用業務年月                       
002360             FROM  D70GYH_TBL                                     
002370            WHERE  業務管理ＩＤ = 'GYMKNRRC'                      
002380     END-EXEC.                                                    
002390                                                                  
002400*----------------------------------------------------------------*
002410*    業務管理テーブル読込処理ＯＰＥＮ確認                        *
002420*----------------------------------------------------------------*
002430     EVALUATE  SQLCODE                                            
002440        WHEN  定数－ＳＱＬＯＫ                                    
002450*--<       正常 >                                                 
002460           CONTINUE                                               
002470        WHEN  OTHER                                               
002480*--<       カーソルＯＰＥＮエラー >                               
002490           MOVE -20                   TO  Ｗ－エラーコード        
002500           PERFORM  エラー判定処理                                
002510     END-EVALUATE.                                                
002520*                                                                 
002530 業務管理テーブル読込－ＥＸＩＴ.                                  
002540     EXIT.                                                        
002550******************************************************************
002560*        結合テーブルカーソル定義                                *
002570******************************************************************
002580 結合テーブルカーソル定義             SECTION.                    
002590 結合テーブルカーソル定義－ＳＴＡＲＴ.                            
002600*                                                                 
002610*----------------------------------------------------------------*
002620*    カーソルＯＰＥＮ処理                                        *
002630*----------------------------------------------------------------*
002640     EXEC SQL                                                     
002650        DECLARE CUR1  CURSOR FOR                                  
002660           SELECT  M40MAB_TBL.レコード区分                        
002670                  ,M40MAB_TBL.経理用主契約区分                    
002680			,M40MAB_TBL.顧客区分                            
002690			,D01TRS_TBL.名寄せコード                        
002700			,M40MAB_TBL.請求先取引先コード                  
002710			,M40MAB_TBL.請求先コード                        
002720			,M40MAB_TBL.契約番号                            
002730			,M40MAB_TBL.契約種類                            
002740			,M40MAB_TBL.担当部課コード                      
002750			,M40MAB_TBL.再リース回数                        
002760			,M40MAB_TBL.充当開始年月                        
002770			,M40MAB_TBL.充当月数                            
002780			,M40MAB_TBL.前払回収方法                        
002790			,M40MAB_TBL.入金日                              
002800			,M40MAB_TBL.入金区分                            
002810			,M40MAB_TBL.取引先名称                          
002820			,M40MAB_TBL.請求先名称                          
002830			,M40MAB_TBL.前月末残高                          
002840			,M40MAB_TBL.当月回収額                          
002850			,M40MAB_TBL.当月消化額                          
002860			,M40MAB_TBL.当月末残高                          
002861                  ,M40MAB_TBL.当月消化額他社                      
002862                  ,M40MAB_TBL.当月他社解約分料金                  
002863                  ,M40MAB_TBL.当月他社解約分消費税                
002864                  ,M40MAB_TBL.当月末残高他社                      
002865                  ,M40MAB_TBL.協調区分                            
002870             FROM  M40MAB_TBL                                     
002880                  ,D01TRS_TBL                                     
002890                  ,D02SQS_TBL                                     
002900            WHERE  M40MAB_TBL.前受金受払残高表対象フラグ  =  '1'  
002910              AND  M40MAB_TBL.請求先取引先コード  =               
002920                              D01TRS_TBL.取引先コード (+)         
002930              AND  M40MAB_TBL.請求先取引先コード  =               
002940                              D02SQS_TBL.取引先コード (+)         
002950              AND  M40MAB_TBL.請求先コード        =               
002960                              D02SQS_TBL.請求先コード  (+)        
002970         ORDER BY  M40MAB_TBL.レコード区分                        
002980                  ,M40MAB_TBL.契約番号                            
002990                                                                  
003000     END-EXEC.                                                    
003010*----------------------------------------------------------------*
003020*    カーソルＯＰＥＮ処理                                        *
003030*----------------------------------------------------------------*
003040     EXEC  SQL                                                    
003050        OPEN  CUR1                                                
003060     END-EXEC.                                                    
003070*                                                                 
003080*----------------------------------------------------------------*
003090*    カーソルＯＰＥＮ確認                                        *
003100*----------------------------------------------------------------*
003110     EVALUATE  SQLCODE                                            
003120        WHEN  定数－ＳＱＬＯＫ                                    
003130*--<       正常 >                                                 
003140           CONTINUE                                               
003150        WHEN  OTHER                                               
003160*--<       カーソルＯＰＥＮエラー >                               
003170           MOVE -30                   TO  Ｗ－エラーコード        
003180           PERFORM  エラー判定処理                                
003190     END-EVALUATE.                                                
003200*                                                                 
003210 結合テーブルカーソル定義－ＥＸＩＴ.                              
003220     EXIT.                                                        
003230*                                                                 
003240******************************************************************
003250*    ファイルオープン                                            *
003260******************************************************************
003270 ファイルオープン                     SECTION.                    
003280 ファイルオープン－ＳＴＡＲＴ.                                    
003290*----------------------------------------------------------------*
003300*    ープン                                                      *
003310*----------------------------------------------------------------*
003320     OPEN  OUTPUT   出力ファイル.                                 
003330*                                                                 
003340*--< ファイルオープンの状態判定 >                                 
003350     EVALUATE  Ｗ－状態                                           
003360        WHEN  ZERO                                                
003370           CONTINUE                                               
003380        WHEN  OTHER                                               
003390*--<       ファイルオープンエラー >                               
003400           MOVE     -40                TO  Ｗ－エラーコード       
003410           PERFORM  エラー処理                                    
003420     END-EVALUATE.                                                
003430*                                                                 
003440 ファイルオープン－ＥＸＩＴ.                                      
003450     EXIT.                                                        
003460                                                                  
003470******************************************************************
003480*    結合テーブルカーソル読込                                    *
003490******************************************************************
003500 結合テーブルカーソル読込             SECTION.                    
003510 結合テーブルカーソル読込－ＳＴＡＲＴ.                            
003520*                                                                 
003530*--< 結合テーブルカーソル読込 >                                   
003540     EXEC SQL                                                     
003550         FETCH  CUR1                                              
003560          INTO  :Ｍ４０－契約番号                                 
003570               ,:Ｍ４０－再リース回数                             
003580               ,:Ｍ４０－レコード区分                             
003590               ,:Ｍ４０－経理用主契約区分                         
003600		     ,:Ｍ４０－顧客区分                                 
003610		     ,:Ｄ０１－名寄せコード                             
003620		     ,:Ｍ４０－請求先取引先コード                       
003630		     ,:Ｍ４０－請求先コード                             
003640		     ,:Ｍ４０－契約番号                                 
003650		     ,:Ｍ４０－契約種類                                 
003660		     ,:Ｍ４０－担当部課コード                           
003670		     ,:Ｍ４０－再リース回数                             
003680		     ,:Ｍ４０－充当開始年月                             
003690		     ,:Ｍ４０－充当月数                                 
003700		     ,:Ｍ４０－前払回収方法                             
003710		     ,:Ｍ４０－入金日                                   
003720		     ,:Ｍ４０－入金区分                                 
003730		     ,:Ｍ４０－取引先名称                               
003740		     ,:Ｍ４０－請求先名称                               
003750		     ,:Ｍ４０－前月末残高                               
003760		     ,:Ｍ４０－当月回収額                               
003770		     ,:Ｍ４０－当月消化額                               
003780		     ,:Ｍ４０－当月末残高                               
003781               ,:Ｍ４０－当月消化額他社                           
003782               ,:Ｍ４０－当月他社解約分料金                       
003783               ,:Ｍ４０－当月他社解約分消費税                     
003784               ,:Ｍ４０－当月末残高他社                           
003785               ,:Ｍ４０－協調区分                                 
003786                                                                  
003790     END-EXEC.                                                    
003800*                                                                 
003810*------------------------------------------------------------- --*
003820*    結合テーブルカーソル読込を確認                              *
003830*----------------------------------------------------------------*
003840     EVALUATE   SQLCODE                                           
003850        WHEN   定数－ＳＱＬＯＫ                                   
003860*--<       正常 >                                                 
003870*                                                                 
003880           COMPUTE  Ｗ－入力－件数  =  Ｗ－入力－件数  +  1       
003890        WHEN   定数－ＳＱＬＥＮＤ                                 
003900*--<       読込終了 >                                             
003910           MOVE  "Y"                  TO  Ｗ－終了－フラグ        
003920        WHEN   OTHER                                              
003930*--<       読込エラー >                                           
003940           MOVE     -50               TO  Ｗ－エラーコード        
003950           PERFORM  エラー判定処理                                
003960     END-EVALUATE.                                                
003970*                                                                 
003980 結合テーブルカーソル読込－ＥＸＩＴ.                              
003990     EXIT.                                                        
004010******************************************************************
004020*    主処理                                                      *
004030******************************************************************
004040 主処理                               SECTION.                    
004050 主処理－ＳＴＡＲＴ.                                              
004060*                                                                 
004070     PERFORM  項目名称抽出処理.                                   
004080*                                                                 
004090     PERFORM  債権情報抽出処理.                                   
004100                                                                  
004110	   PERFORM  出力判定処理処理.                                   
004120*--< 結合テーブルカーソル読込（２件目以降） >                     
004130     PERFORM  結合テーブルカーソル読込.                           
004140*                                                                 
004190*                                                                 
004200 主処理－ＥＸＩＴ.                                                
004210     EXIT.                                                        
004220******************************************************************
004230*     項目名称マスタより項目の抽出処理                           *
004240******************************************************************
004250 項目名称抽出処理                      SECTION.                   
004260 項目名称抽出処理－ＳＴＡＲＴ.                                    
004270*                                                                 
004280*----------------------------------------------------------------*
004290*    項目名称マスタより主契約区分名称の抽出処理                  *
004300*----------------------------------------------------------------*
004310     INITIALIZE                       項目名称マスタの名称.       
004320     EXEC SQL                                                     
004330           SELECT  名称                                           
004340             INTO  :ＷＳ－名称１                                  
004350             FROM  D19MSY_TBL                                     
004360                   ,M40MAB_TBL                                    
004370             WHERE D19MSY_TBL.コードＮＯ  =  '038'                
004380             AND  SUBSTR (D19MSY_TBL.コード,1,1)  =               
004390		        M40MAB_TBL.経理用主契約区分                     
004400     END-EXEC.                                                    
004410                                                                  
004420*----------------------------------------------------------------*
004430*     項目名称マスタより主契約区分名称の抽出確認                 *
004440*----------------------------------------------------------------*
004450     EVALUATE  SQLCODE                                            
004460        WHEN  定数－ＳＱＬＯＫ                                    
004470*--<       正常 >                                                 
004480           CONTINUE                                               
004490        WHEN  OTHER                                               
004500*--<       カーソルＯＰＥＮエラー >                               
004510           MOVE -60                   TO  Ｗ－エラーコード        
004520           PERFORM  エラー判定処理                                
004530     END-EVALUATE.                                                
004540*----------------------------------------------------------------*
004550*    項目名称マスタより顧客区分名称の抽出処理                                             *
004560*----------------------------------------------------------------*
004570     INITIALIZE                       項目名称マスタの名称.       
004580     EXEC SQL                                                     
004590           SELECT  名称                                           
004600             INTO  :ＷＳ－名称２                                  
004610             FROM  D19MSY_TBL                                     
004620                  ,M40MAB_TBL                                     
004630             WHERE D19MSY_TBL.コードＮＯ  =  '005'                
004640               AND  SUBSTR (D19MSY_TBL.コード,1,2) =              
004650		          M40MAB_TBL.顧客区分                           
004660     END-EXEC.                                                    
004670                                                                  
004680*----------------------------------------------------------------*
004690*     項目名称マスタより顧客区分名称の抽出確認                   *
004700*----------------------------------------------------------------*
004710     EVALUATE  SQLCODE                                            
004720        WHEN  定数－ＳＱＬＯＫ                                    
004730*--<       正常 >                                                 
004740           CONTINUE                                               
004750        WHEN  OTHER                                               
004760*--<       カーソルＯＰＥＮエラー >                               
004770           MOVE -70                   TO  Ｗ－エラーコード        
004780           PERFORM  エラー判定処理                                
004790     END-EVALUATE.                                                
004800*                                                                 
004810 項目名称抽出処理－ＥＸＩＴ.                                      
004820     EXIT.                                                        
004830******************************************************************
004840*     債権情報（一般）ＤＢより項目の抽出処理                     *
004850******************************************************************
004860 債権情報抽出処理                      SECTION.                   
004870 債権情報抽出処理－ＳＴＡＲＴ.                                    
004880*                                                                 
004890*----------------------------------------------------------------*
004900*    債権情報抽出処理の抽出処理                                  *
004910*----------------------------------------------------------------*
004920     INITIALIZE                       項目名称マスタの名称.       
004930     EXEC SQL                                                     
004940           SELECT  M01SAJ_TBL.状態フラグ                          
004950                  ,M01SAJ_TBL.債権契約件名                        
004960			,M01SAJ_TBL.担保区分                            
004970             INTO  :Ｍ０１－状態フラグ                            
004980		        ,:Ｍ０１－債権契約件名                          
004990			,:Ｍ０１－担保区分                              
005000             FROM  M01SAJ_TBL                                     
005010                  ,M40MAB_TBL                                     
005020            WHERE  M01SAJ_TBL.レコード区分  =  '1'                
005030              AND  M01SAJ_TBL.契約番号  =  M40MAB_TBL.契約番号    
005040	            AND  M01SAJ_TBL.再リース回数  =                     
005050			    M40MAB_TBL.再リース回数                     
005060	            AND  M01SAJ_TBL.契約種類  =  M40MAB_TBL.契約種類    
005070     END-EXEC.                                                    
005080                                                                  
005090*----------------------------------------------------------------*
005100*     債権情報抽出処理の抽出確認                                 *
005110*----------------------------------------------------------------*
005120     EVALUATE  SQLCODE                                            
005130        WHEN  定数－ＳＱＬＯＫ                                    
005140*--<       正常 >                                                 
005150           CONTINUE                                               
005160        WHEN  OTHER                                               
005170*--<       カーソルＯＰＥＮエラー >                               
005180           MOVE -80                   TO  Ｗ－エラーコード        
005190           PERFORM  エラー判定処理                                
005200     END-EVALUATE.                                                
005210 債権情報抽出処理－ＥＸＩＴ.                                      
005220     EXIT.                                                        
005230******************************************************************
005240*    前受金受払残高中間ファイル出力判定処理                      *
005250******************************************************************
005260 出力判定処理処理                      SECTION.                   
005270 出力判定処理処理－ＳＴＡＲＴ.                                    
005271     IF Ｍ０１－担保区分  = 1                                     
005272        CONTINUE                                                  
005280     ELSE                                                         
005281        PERFORM  自社分出力処理                                   
005282        IF  Ｍ４０－協調区分 =  "2"                               
005283           PERFORM  他社分出力処理                                
005284        END-IF.                                                   
005286     END-IF.                                                      
005330 出力判定処理処理－ＥＸＩＴ                                       
005340******************************************************************
005350*    自社分出力処理                                              *
005360******************************************************************
005370 自社分出力処理                         SECTION.                  
005380 自社分出力処理－ＳＴＡＲＴ.                                      
005390*                                                                 
005400      IF   Ｍ０１－状態フラグ  <  3                               
005410	       MOVE  "3"  TO   出力－自他社区分                         
005411      ELSE                                                        
005412         MOVE  "1"  TO   出力－自他社区分.                        
005413*--< 共通出力処理 >                                               
005416      PERFORM   共通出力処理.                                     
005417*                                                                 
005418      MOVE     Ｍ４０－前月末残高       TO   出力－前月末残高.    
005419      MOVE     Ｍ４０－当月回収額       TO   出力－当月入金額.    
005420      MOVE     Ｍ４０－当月消化額       TO   出力－当月消化額.    
005421      MOVE     Ｍ４０－当月末残高       TO   出力－当月末残高.    
005422*----------------------------------------------------------------*
005423*     共通前受金受払残高中間ファイル出力処理                     *
005424*----------------------------------------------------------------*
005425      PERFORM   共通受払残高出力処理.                             
005430 自社分出力処理－ＥＸＩＴ.                                        
005440     EXIT.                                                        
005450******************************************************************
005460*    他社分出力処理                                              *
005470******************************************************************
005480 他社分出力処理                         SECTION.                  
005490 他社分出力処理－ＳＴＡＲＴ.                                      
005500*                                                                 
005501    IF   Ｍ０１－状態フラグ  <  3                                 
005502       MOVE  "4"  TO   出力－自他社区分                           
005503    ELSE                                                          
005504       MOVE  "2"  TO   出力－自他社区分                           
005505    END-IF.                                                       
005506*--< 共通出力処理 >                                               
005507    PERFORM   共通出力処理.                                       
005508*                                                                 
005509    MOVE     Ｍ４０－前月末残高       TO   出力－前月末残高.      
005510    MOVE     Ｍ４０－当月回収額       TO   出力－当月入金額.      
005511    COMPUTE  出力－当月消化額   =   Ｍ４０－当月消化額他社        
005512                                  + Ｍ４０－当月他社解約分料金    
005513                                  + Ｍ４０－当月他社解約分消費税. 
005514*                                                                 
005515    COMPUTE  出力－当月末残高   =   Ｍ４０－当月末残高他社        
005516                                  - Ｍ４０－当月他社解約分料金    
005517                                  - Ｍ４０－当月他社解約分消費税. 
005518*----------------------------------------------------------------*
005519*     共通前受金受払残高中間ファイル出力処理                     *
005520*----------------------------------------------------------------*
005521      PERFORM   共通受払残高出力処理.                             
005522                                                                  
005523 他社分出力処理－ＥＸＩＴ.                                        
005530     EXIT.                                                        
005540******************************************************************
005550*    共通出力処理                                                *
005560******************************************************************
005570 共通出力処理                           SECTION.                  
005580 共通出力処理－ＳＴＡＲＴ.                                        
005590*                                                                 
005591     MOVE   Ｍ４０－レコード区分        TO   出力－前受区分.      
005593	   MOVE   Ｍ４０－経理用主契約区分    TO   出力－主契約区分.    
005594	   MOVE   Ｍ４０－顧客区分            TO   出力－連結区分.      
005595	   MOVE   Ｄ０１－名寄せコード        TO   出力－名寄せコード.  
005596	   MOVE   Ｍ４０－請求先取引先コード  TO   出力－取引先コード.  
005597	   MOVE   Ｍ４０－請求先コード        TO   出力－請求先コード.  
005598	   MOVE   Ｍ４０－契約番号            TO   出力－契約番号.      
005599     MOVE   Ｍ４０－契約種類            TO   出力－契約種類.      
005610     MOVE   Ｄ７０－バッチ用業務年月    TO   出力－業務年月.      
005611     MOVE   Ｍ４０－担当部課コード      TO   出力－担当部課コード.
005612     MOVE   Ｍ０１－債権契約件名        TO   出力－契約件名.      
005613     MOVE   Ｍ４０－再リース回数        TO   出力－再リース回数.  
005614     MOVE   Ｍ４０－充当開始年月        TO   出力－充当開始年月.  
005615     MOVE   Ｍ４０－充当月数            TO   出力－充当月数.      
005616     MOVE   Ｍ４０－前払回収方法        TO   出力－前払回収方法.  
005617     MOVE   Ｍ４０－入金日              TO   出力－入金日.        
005618     MOVE   Ｍ４０－入金区分            TO   出力－入金区分.      
005619     MOVE   Ｍ４０－取引先名称          TO   出力－取引先名称.    
005620     MOVE   Ｍ４０－請求先名称          TO   出力－請求先名称.    
005621     MOVE   ＷＳ－名称１                TO   出力－主契約区分名称.
005622     MOVE   ＷＳ－名称２                TO   出力－連結区分名称.  
005623*                                                                 
005628 共出力処理－ＥＸＩＴ.                                            
005629     EXIT.                                                        
005630******************************************************************
005631*   共通前受金受払残高中間ファイル出力処理                       *
005633******************************************************************
005634 共通受払残高出力処理                   SECTION.                  
005635 共通受払残高出力処理－ＳＴＡＲＴ.                                
005636*                                                                 
005637     IF  出力－前月末残高   =   0                                 
005638         AND  出力－当月入金額  =  0                              
005639         AND  出力－当月消化額  =  0                              
005640         AND  出力－当月末残高  =  0                              
005643         WRITE  出力－レコード.                                   
005644*                                                                 
005645*--< 共通出力の状態判定 >                                         
005646     EVALUATE  Ｗ－状態                                           
005647        WHEN  ZERO                                                
005648*--<      共通出力件数の加算 >                                    
005649           COMPUTE  Ｗ－出力－件数 =  Ｗ－出力－件数 + 1          
005650        WHEN  OTHER                                               
005651*--<       ファイル出力エラー >                                   
005652           MOVE     -90                TO  Ｗ－エラーコード       
005653           PERFORM  エラー処理                                    
005654     END-EVALUATE.                                                
005655*                                                                 
005656 共通受払残高出力処理－ＥＸＩＴ.                                  
005657     EXIT.                                                        
005658******************************************************************
005659*    終了処理                                                    *
005660******************************************************************
005661 終了処理                             SECTION.                    
005670 終了処理－ＳＴＡＲＴ.                                            
005680*                                                                 
005690     PERFORM  ＤＢクローズ処理.                                   
005700*                                                                 
005710     PERFORM  ＤＢコミット処理.                                   
005720*                                                                 
005730     PERFORM  終了メッセージ出力.                                 
005740*                                                                 
005750*--< プログラム正常終了 >                                         
005760     MOVE  定数－正常状態             TO  PROGRAM-STATUS.         
005770*                                                                 
005780 終了処理－ＥＸＩＴ.                                              
005790     EXIT.                                                        
005800******************************************************************
005810*    終了メッセージ出力                                          *
005820******************************************************************
005830 終了メッセージ出力                   SECTION.                    
005840 終了メッセージ出力－ＳＴＡＲＴ.                                  
005850*                                                                 
005860*----------------------------------------------------------------*
005870*    件数メッセージ出力処理                                      *
005880*----------------------------------------------------------------*
005890     INITIALIZE                       IF-CHOCO001.                
005900     MOVE  "3"                        TO  共１－イベント種別.     
005910     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
005920     MOVE  "0"                        TO  共１－復帰コード.       
005930     MOVE  "M40MAB_TBL"               TO  共１－処理テーブルＩＤ. 
005940     MOVE  "COUNT"                    TO  共１－処理識別.         
005950     MOVE  Ｗ－入力－件数             TO  共１－データ内容.       
005960     MOVE  " 前受情報テーブル（入力）"                            
005970                                      TO  共１－その他メッセージ. 
005980     CALL  CLOCO001                USING  IF-CHOCO001.            
005990*                                                                 
006000     INITIALIZE                       IF-CHOCO001.                
006010     MOVE  "3"                        TO  共１－イベント種別.     
006020     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
006030     MOVE  "0"                        TO  共１－復帰コード.       
006040     MOVE  "SFHSED25.U11"             TO  共１－処理テーブルＩＤ. 
006050     MOVE  "COUNT"                    TO  共１－処理識別.         
006060     MOVE  Ｗ－出力－件数             TO  共１－データ内容.       
006070     MOVE  "前受金受払残高ファイル"   TO  共１－その他メッセージ. 
006080     CALL  CLOCO001                USING  IF-CHOCO001.            
006090*                                                                 
006100*----------------------------------------------------------------*
006110*    終了メッセージ出力                                          *
006120*----------------------------------------------------------------*
006130     INITIALIZE                       IF-CHOCO001.                
006140     MOVE  "3"                        TO  共１－イベント種別.     
006150     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
006160     MOVE  "0"                        TO  共１－復帰コード.       
006170     MOVE  "END"                      TO  共１－処理識別.         
006180     MOVE  定数－プログラム名         TO  共１－その他メッセージ. 
006190     CALL  CLOCO001                USING  IF-CHOCO001.            
006200*                                                                 
006210 終了メッセージ出力－ＥＸＩＴ.                                    
006220     EXIT.                                                        
006230******************************************************************
006240*    ＤＢクローズ                                                *
006250******************************************************************
006260 ＤＢクローズ処理                     SECTION.                    
006270 ＤＢクローズ処理－ＳＴＡＲＴ.                                    
006280*                                                                 
006290*--< カーソル クローズ >                                          
006300     EXEC SQL                                                     
006310        CLOSE  CUR1                                               
006320     END-EXEC.                                                    
006330*                                                                 
006340 ＤＢクローズ処理－ＥＸＩＴ.                                      
006350     EXIT.                                                        
006360******************************************************************
006370*    ＤＢコミット処理                                            *
006380******************************************************************
006390 ＤＢコミット処理                     SECTION.                    
006400 ＤＢコミット処理－ＳＴＡＲＴ.                                    
006410*                                                                 
006420     EXEC  SQL                                                    
006430        COMMIT  WORK  RELEASE                                     
006440     END-EXEC.                                                    
006450*                                                                 
006460     INITIALIZE                       IF-CHOCO001.                
006470     MOVE  "3"                        TO  共１－イベント種別.     
006480     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
006490     MOVE  "0"                        TO  共１－復帰コード.       
006500     MOVE  "COMMIT"                   TO  共１－処理識別.         
006510     MOVE  "コミット実施"             TO  共１－その他メッセージ. 
006520     CALL  CLOCO001                USING  IF-CHOCO001.            
006530*                                                                 
006540 ＤＢコミット処理－ＥＸＩＴ.                                      
006550     EXIT.                                                        
006560******************************************************************
006570*    ＤＢロールバック処理                                        *
006580******************************************************************
006590 ＤＢロールバック処理                 SECTION.                    
006600 ＤＢロールバック処理－ＳＴＡＲＴ.                                
006610*                                                                 
006620     EXEC  SQL                                                    
006630        ROLLBACK WORK  RELEASE                                    
006640     END-EXEC.                                                    
006650*                                                                 
006660     INITIALIZE                       IF-CHOCO001.                
006670     MOVE  "1"                        TO  共１－イベント種別.     
006680     MOVE  定数－プログラムＩＤ       TO  共１－ソースＩＤ.       
006690     MOVE  "9"                        TO  共１－復帰コード.       
006700     MOVE  "ROLLBACK"                 TO  共１－処理識別.         
006710     MOVE  "ロールバック実施"         TO  共１－その他メッセージ. 
006720     CALL  CLOCO001                USING  IF-CHOCO001.            
006730*                                                                 
006740 ＤＢロールバック処理－ＥＸＩＴ.                                  
006750     EXIT.                                                        
006760******************************************************************
006770*    エラー処理                                                  *
006780******************************************************************
006790 エラー判定処理                       SECTION.                    
006800 エラー判定処理－ＳＴＡＲＴ.                                      
006810*                                                                 
006820     MOVE  "Y"                        TO Ｗ－異常終了－フラグ.    
006830     INITIALIZE                           IF-CHOCO001.            
006840*                                                                 
006850     EVALUATE  Ｗ－エラーコード                                   
006860        WHEN  -10                                                 
006870*--<       ＯＲＡＣＬＥ接続失敗 >                                 
006880           MOVE  "1"                  TO  共１－イベント種別      
006890           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
006900           MOVE  "9"                  TO  共１－復帰コード        
006910           MOVE  "CONNECT"            TO  共１－処理識別          
006920           MOVE  SQLCODE              TO  共１－データ内容        
006930           MOVE  SQLERRMC             TO  共１－その他メッセージ  
006940           CALL  CLOCO001          USING  IF-CHOCO001             
006950*                                                                 
006960        WHEN  -20                                                 
006970*--<       業務管理テーブル読込処理失敗 >                         
006980           MOVE  "1"                  TO  共１－イベント種別      
006990           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
007000           MOVE  "9"                  TO  共１－復帰コード        
007010           MOVE  "D70GYH_TBL"         TO  共１－処理テーブルＩＤ  
007020           MOVE  "SELECT"               TO  共１－処理識別        
007030           MOVE  SQLCODE              TO  共１－データ内容        
007040           MOVE  SQLERRMC             TO  共１－その他メッセージ  
007050           CALL  CLOCO001          USING  IF-CHOCO001             
007060*                                                                 
007070        WHEN  -30                                                 
007080*--<      結合テーブルカーソル定義処理失敗 >                      
007090           MOVE  "1"                  TO  共１－イベント種別      
007100           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
007110           MOVE  "9"                  TO  共１－復帰コード        
007120           MOVE  "M40MAB_TBL"         TO  共１－処理テーブルＩＤ  
007130           MOVE  "SELECT"             TO  共１－処理識別          
007140           MOVE  SQLCODE              TO  共１－データ内容        
007150           MOVE  SQLERRMC             TO  共１－その他メッセージ  
007160           CALL  CLOCO001          USING  IF-CHOCO001             
007170*                                                                 
007180        WHEN  -40                                                 
007190*--<       ファイルオープン失敗 >                                 
007200           MOVE  "1"                  TO  共１－イベント種別      
007210           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
007220           MOVE  "9"                  TO  共１－復帰コード        
007230           MOVE  "SFHSED25.U11"       TO  共１－処理テーブルＩＤ  
007240           MOVE  "OPEN"               TO  共１－処理識別          
007250           MOVE  SQLCODE              TO  共１－データ内容        
007260           MOVE  SQLERRMC             TO  共１－その他メッセージ  
007270           CALL  CLOCO001          USING  IF-CHOCO001             
007280*                                                                 
007281           WHEN  -50                                              
007282*--<       結合テーブルカーソル読込失敗 >                         
007283           MOVE  "1"                  TO  共１－イベント種別      
007284           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
007285           MOVE  "9"                  TO  共１－復帰コード        
007286           MOVE  "M40MAB_TBL"         TO  共１－処理テーブルＩＤ  
007287           MOVE  "FETCH"              TO  共１－処理識別          
007288           MOVE  SQLCODE              TO  共１－データ内容        
007289           MOVE  SQLERRMC             TO  共１－その他メッセージ  
007290           CALL  CLOCO001          USING  IF-CHOCO001             
007291*                                                                 
007292           WHEN  -60                                              
007293*--< 項目名称マスタより主契約区分名称の抽出確認失敗>              
007294           MOVE  "1"                  TO  共１－イベント種別      
007295           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
007296           MOVE  "9"                  TO  共１－復帰コード        
007297           MOVE  "D19MSY_TBL"         TO  共１－処理テーブルＩＤ  
007298           MOVE  "SELECT"             TO  共１－処理識別          
007299           MOVE  SQLCODE              TO  共１－データ内容        
007300           MOVE  SQLERRMC             TO  共１－その他メッセージ  
007301           CALL  CLOCO001          USING  IF-CHOCO001             
007302*                                                                 
007303           WHEN  -70                                              
007304*--<      項目名称マスタより顧客区分名称の抽出失敗 >              
007305           MOVE  "1"                  TO  共１－イベント種別      
007306           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
007307           MOVE  "9"                  TO  共１－復帰コード        
007308           MOVE  "D19MSY_TBL"         TO  共１－処理テーブルＩＤ  
007309           MOVE  "SELECT"             TO  共１－処理識別          
007310           MOVE  SQLCODE              TO  共１－データ内容        
007311           MOVE  SQLERRMC             TO  共１－その他メッセージ  
007312           CALL  CLOCO001          USING  IF-CHOCO001             
007313*                                                                 
007314           WHEN  -80                                              
007315*--<         債権情報抽出処理の抽出確認 失敗 >                    
007316           MOVE  "1"                  TO  共１－イベント種別      
007317           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
007318           MOVE  "9"                  TO  共１－復帰コード        
007319           MOVE  "M01SAJ_TBL"         TO  共１－処理テーブルＩＤ  
007320           MOVE  "SELECT"             TO  共１－処理識別          
007321           MOVE  SQLCODE              TO  共１－データ内容        
007322           MOVE  SQLERRMC             TO  共１－その他メッセージ  
007323           CALL  CLOCO001          USING  IF-CHOCO001             
007324*                                                                 
007325           WHEN  -90                                              
007326*--<         共通前受金受払残高中間ファイル出力処理失敗 >         
007327           MOVE  "1"                  TO  共１－イベント種別      
007328           MOVE  定数－プログラムＩＤ TO  共１－ソースＩＤ        
007329           MOVE  "9"                  TO  共１－復帰コード        
007330           MOVE  "SFHSED25.U11"       TO  共１－処理テーブルＩＤ  
007331           MOVE  "WRITE"              TO  共１－処理識別          
007332           MOVE  SQLCODE              TO  共１－データ内容        
007333           MOVE  SQLERRMC             TO  共１－その他メッセージ  
007334           CALL  CLOCO001          USING  IF-CHOCO001             
007338        WHEN  OTHER                                               
007339           MOVE  "N"                  TO Ｗ－異常終了－フラグ     
007340     END-EVALUATE.                                                
007341*                                                                 
007342     IF Ｗ－異常終了－フラグ  =  "Y"                              
007343*        PERFORM  ＤＢロールバック処理                            
007350*                                                                 
007360        PERFORM  終了メッセージ出力                               
007370*                                                                 
007380*--<    プログラム異常終了のリターンコード >                      
007390        MOVE  定数－異常状態          TO  PROGRAM-STATUS          
007400*                                                                 
007410        EXIT  PROGRAM                                             
007420     END-IF.                                                      
007430*                                                                 
007440 エラー処理－ＥＸＩＴ.                                            
007450     EXIT.                                                        
007460******************************************************************
007470*                  END OF PROGRAM                                *
007480******************************************************************
