000010************************************************
000020* Ì§¸ÀØÝ¸ÞiŽèŒ`ÂŒ j(LTRFCT)
000030************************************************
000040 01  ‚k‚s‚q‚e‚b‚s|Œ_–ñ”Ô† PIC  X(009).
000050 01  ‚k‚s‚q‚e‚b‚s|—˜‘§Šú“ú PIC  X(007).
000060 01  ‚k‚s‚q‚e‚b‚s|‰ñŽû•û–@ PIC S9(001) COMP-3.
000070 01  ‚k‚s‚q‚e‚b‚s|‘ã—‰ñŽû‹æ•ª PIC S9(001) COMP-3.
000080 01  ‚k‚s‚q‚e‚b‚s|ŠúŠÔ“ú” PIC S9(004) COMP-3.
000090 01  ‚k‚s‚q‚e‚b‚s|”ƒŽæ‹àŠz PIC S9(013) COMP-3.
000100 01  ‚k‚s‚q‚e‚b‚s|Š„ˆø—¿ PIC S9(013) COMP-3.
000110 01  ‚k‚s‚q‚e‚b‚s|Š„ˆø—¦ PIC S9(003)V9(8) COMP-3.
000120 01  ‚k‚s‚q‚e‚b‚s|ŽóŽæŽè”—¿ PIC S9(013) COMP-3.
000130 01  ‚k‚s‚q‚e‚b‚s|ŽóŽæŽè”—¿Á”ïÅ“™Šz PIC S9(013) COMP-3.
000140 01  ‚k‚s‚q‚e‚b‚s|”ƒ–ß—\’è“ú PIC  X(007).
000150 01  ‚k‚s‚q‚e‚b‚s|”ƒŽæ‘ã‹àŽx•¥“ú PIC  X(007).
000160 01  ‚k‚s‚q‚e‚b‚s|ÂŒ •\Ž¦ PIC  X(060).
000170 01  ‚k‚s‚q‚e‚b‚s|ŠúŒÀ‘OŒˆÙ“ú PIC  X(007).
000180 01  ‚k‚s‚q‚e‚b‚s|–ß‚µ—˜‘§Šz PIC S9(013) COMP-3.
000190 01  ‚k‚s‚q‚e‚b‚s|–ß‚µ—˜—¦ PIC S9(003)V9(8) COMP-3.
000200 01  ‚k‚s‚q‚e‚b‚s|–ß‚µ“ú” PIC S9(004) COMP-3.
000210 01  ‚k‚s‚q‚e‚b‚s|–ß‚µ—˜‘§‘ŠŽE‹æ•ª PIC S9(001) COMP-3.
000220 01  ‚k‚s‚q‚e‚b‚s|•ÔÏŽè”—¿ PIC S9(013) COMP-3.
000230 01  ‚k‚s‚q‚e‚b‚s|•ÔÏŽè”—¿Á”ïÅ“™Šz PIC S9(013) COMP-3.
000240 01  ‚k‚s‚q‚e‚b‚s|ƒ_ƒ~[‚O‚O‚P PIC  X(040).
000250 01  ‚k‚s‚q‚e‚b‚s|ŽèŒ`”Ô† PIC  X(010).
000260 01  ‚k‚s‚q‚e‚b‚s|ŽèŒ`Ží—Þ PIC S9(001) COMP-3.
000270 01  ‚k‚s‚q‚e‚b‚s|ŽèŒ`— ‘•û–@ PIC S9(001) COMP-3.
000280 01  ‚k‚s‚q‚e‚b‚s|Žæˆø‹âsƒR[ƒh PIC  X(007).
000290 01  ‚k‚s‚q‚e‚b‚s|Žx•¥l–¼ PIC  X(060).
000300 01  ‚k‚s‚q‚e‚b‚s|Žx•¥êŠ PIC  X(060).
000310 01  ‚k‚s‚q‚e‚b‚s|ƒ_ƒ~[‚O‚O‚Q PIC  X(061).
